Repository: dotnet/fsharp
Catalog: vsintegration/src/FSharp.ProjectSystem.PropertyPages/Resources/xlf/Microsoft.VisualStudio.Editors.Designer.*.xlf
Languages: cs, de, es, ja, ko, zh_hans, zh_hant

# PPG_Application_NoManifestText
source: Create application without a manifest
cs: Vytvořit aplikaci bez manifestu
de: Anwendung ohne Manifest erstellen
es: Crear la aplicación sin manifiesto
ja: マニフェストなしでアプリケーションを作成します
ko: 매니페스트 없이 애플리케이션 만들기
zh_hans: 创建不带清单的应用程序
zh_hant: 建立無資訊清單應用程式

# PPG_Application_BadManifest
source: Invalid manifest file.
cs: Soubor manifestu není platný.
de: Ungültige Manifestdatei.
es: Archivo de manifiesto no válido.
ja: マニフェスト ファイルが無効です。
ko: 매니페스트 파일이 잘못되었습니다.
zh_hans: 无效清单文件。
zh_hant: 資訊清單檔案無效。

# PPG_Services
source: Services
cs: Služby
de: Dienste
es: Servicios
ja: サービス
ko: 서비스
zh_hans: 服务
zh_hant: 服務

# PPG_Services_HelpLabelText
source: Client application services enable your Windows-based applications to use the ASP.NET login (authentication), roles, and profile (settings) services.
cs: Klientské aplikační služby umožňují vašim aplikacím pro Windows použít služby technologie ASP.NET pro přihlášení (ověřování), role a nastavení profilu.
de: Dank Clientanwendungsdiensten können Ihre Windows-basierten Anwendungen die ASP.NET-Dienste für Anmeldung (Authentifizierung), Rollen und Profile (Einstellungen) nutzen.
es: Los servicios de aplicación cliente permiten que las aplicaciones de Windows utilicen los servicios de inicio de sesión (autenticación), roles y perfil (configuración) de ASP.NET.
ja: クライアント アプリケーション サービスを使用すると、Windows ベースのアプリケーションから、ASP.NET ログイン (認証)、ロール、およびプロファイル (設定) サービスを使用できます。
ko: 클라이언트 애플리케이션 서비스를 사용하면 Windows 기반 애플리케이션에서 ASP.NET 로그인(인증), 역할 및 프로필(설정) 서비스를 사용할 수 있습니다.
zh_hans: 客户端应用程序服务使基于 Windows 的应用程序能够使用 ASP.NET 登录(身份验证)、角色和配置文件(设置)服务。
zh_hant: 用戶端應用程式服務可以讓您的 Windows 應用程式使用 ASP.NET 登入 (驗證)、角色和設定檔 (設定) 服務。

# PPG_Services_HelpLabelLink
source: Learn more about client application services...
cs: Další informace o klientských aplikačních službách...
de: Weitere Informationen zu Clientanwendungsdiensten...
es: Más información sobre los servicios de aplicación cliente...
ja: クライアント アプリケーション サービスに関する詳細の表示...
ko: 클라이언트 애플리케이션 서비스에 대한 자세한 정보...
zh_hans: 了解有关客户端应用程序服务的更多信息...
zh_hant: 進一步了解用戶端應用程式服務...

# PPG_ServicesAdvancedPage_Title
source: Advanced Settings for Services
cs: Upřesnit nastavení služeb
de: Erweiterte Einstellungen für Dienste
es: Configuración avanzada de servicios
ja: サービスの詳細設定
ko: 서비스의 고급 설정
zh_hans: 服务的高级设置
zh_hant: 服務的進階設定

# PPG_Services_ConfirmRemoveServices
source: Disabling application services will clear the default services for Authentication, Roles, and Settings. Click OK to disable application services.
cs: Zakázáním služeb aplikace se vymažou výchozí služby ověřování, rolí a nastavení. Pokud chcete služby aplikace zakázat, klikněte na OK.
de: Durch Deaktivieren von Anwendungsdiensten werden die Standarddienste für Authentifizierung, Rollen und Einstellungen gelöscht. Klicken Sie auf "OK", um Anwendungsdienste zu deaktivieren.
es: Si deshabilita los servicios de aplicación, se borrarán los servicios predeterminados de Autenticación, Roles y Configuración. Haga clic en Aceptar para deshabilitar los servicios de aplicación.
ja: アプリケーション サービスを無効にすると、認証、ロール、および設定の既定のサービスがクリアされます。アプリケーション サービスを無効にするには、[OK] をクリックしてください。
ko: 애플리케이션 서비스를 사용하지 않도록 설정하면 인증, 역할 및 설정에 대한 기본 서비스가 지워집니다. 애플리케이션 서비스를 사용하지 않도록 설정하려면 [확인]을 클릭하세요.
zh_hans: 禁用应用程序服务将清除“身份验证”、“角色”和“设置”的默认服务。单击“确定”可禁用应用程序服务。
zh_hant: 停用應用程式服務將會清除驗證、角色和設定的預設服務。按一下 [確定] 即可停用應用程式服務。

# PPG_Services_ConfirmRemoveServices_Caption
source: Disable Application Services
cs: Zakázat služby aplikace
de: Anwendungsdienste deaktivieren
es: Deshabilitar servicios de aplicación
ja: アプリケーション サービスを無効にする
ko: 애플리케이션 서비스 사용 안 함
zh_hans: 禁用应用程序服务
zh_hant: 停用應用程式服務

# PPG_Services_Seconds
source: seconds
cs: Sekundy
de: Sekunden
es: Segundos
ja: 秒
ko: 초
zh_hans: 秒
zh_hant: 秒

# PPG_Services_Minutes
source: minutes
cs: Minuty
de: Minuten
es: Minutos
ja: 分
ko: 분
zh_hans: 分钟
zh_hant: 分鐘

# PPG_Services_Hours
source: hours
cs: Hodiny
de: Stunden
es: Horas
ja: 時間
ko: 시간
zh_hans: 小时
zh_hant: 小時

# PPG_Services_Days
source: days
cs: Dny
de: Tage
es: Días
ja: 日数
ko: 일
zh_hans: 天
zh_hant: 日

# PPG_Services_VersionWarning
source: To enable client application services, you must set the Target Framework for your application to .NET Framework 3.5 or later. In C#, you can do this on the Application property page. In Visual Basic, you can do this one the Compile property page by clicking Advanced Compile Options.
cs: Abyste mohli povolit klientské aplikační služby, musíte jako cílovou architekturu vaší aplikace vybrat .NET Framework 3.5 nebo novější. V jazyce C# to můžete udělat na stránce Vlastnosti aplikace. Ve Visual Basicu zase kliknutím na Další možnosti kompilace na stránce Vlastnosti kompilace.
de: Um Clientanwendungsdienste zu aktivieren, müssen Sie als Zielframework für Ihre Anwendung .NET Framework 3.5 oder höher festlegen. Verwenden Sie dazu in C# die Anwendungseigenschaftenseite. In Visual Basic klicken Sie auf "Erweiterte Kompilierungsoptionen" und verwenden dann die Kompilierungseigenschaftenseite.
es: Para habilitar los servicios de aplicación cliente, debe establecer la versión de .NET Framework de destino de la aplicación en .NET Framework 3.5 o posterior. En C#, puede hacerlo en la página de propiedades de la aplicación. En Visual Basic, puede hacerlo en la página de propiedades de compilación haciendo clic en Opciones de compilación avanzadas.
ja: クライアント アプリケーション サービスを有効にするには、アプリケーションのターゲット フレームワークを .NET Framework 3.5 以降に設定する必要があります。C# では、これはアプリケーション プロパティ ページで行います。Visual Basic では、[詳細コンパイル オプション] をクリックしてコンパイル プロパティ ページで行います。
ko: 클라이언트 애플리케이션 서비스를 사용하려면 애플리케이션의 대상 프레임워크를 .NET Framework 3.5 이상으로 설정해야 합니다. C#에서는 [애플리케이션] 속성 페이지에서 이를 수행할 수 있습니다. Visual Basic에서는 [컴파일] 속성 페이지에서 [고급 컴파일 옵션]을 클릭하면 이를 수행할 수 있습니다.
zh_hans: 若要启用客户端应用程序服务，您必须将应用程序的目标框架设置为 .NET Framework 3.5 或更高版本。在 C# 中，您可以在“应用程序”属性页上进行此设置。在 Visual Basic 中，您可以通过单击“高级编译选项”，在“编译”属性页上进行此设置。
zh_hant: 若要啟用用戶端應用程式服務，必須將應用程式的目標 Framework 設定成 .NET Framework 3.5 (含) 以後版本。在 C#，您可以在 [應用程式] 屬性頁上進行此設定。在 Visual Basic，您可以按一下 [進階編譯選項]，在 [編譯] 屬性頁上進行此設定。

# PPG_Services_InvalidAppConfigXml
source: An error occurred while reading the Application configuration file. The file might be corrupted or contain invalid XML.
cs: Při čtení konfiguračního souboru aplikace došlo k chybě. Soubor může být poškozený, nebo obsahuje neplatný kód XML.
de: Fehler beim Lesen der Anwendungskonfigurationsdatei. Möglicherweise ist die Datei beschädigt oder enthält ungültige XML.
es: Error al leer el archivo de configuración de la aplicación. Puede que esté dañado o que contenga código XML no válido.
ja: アプリケーション構成ファイルの読み取り中にエラーが発生しました。ファイルが破損しているか、無効な XML を含んでいる可能性があります。
ko: 지정한 애플리케이션 구성 파일을 읽는 동안 오류가 발생했습니다. 파일이 손상되었거나 잘못된 XML이 포함되어 있습니다.
zh_hans: 读取应用程序配置文件时出错。 该文件可能已损坏或包含无效 XML。
zh_hant: 讀取應用程式組態檔時發生錯誤。此檔案可能已損毀或包含無效的 XML。

# PPG_Services_InvalidUrl
source: The URL is invalid. Please enter a valid URL like http://microsoft.com/services
cs: Adresa URL není platná. Zadejte prosím platnou adresu URL, třeba http://microsoft.com/services.
de: Die URL ist ungültig. Geben Sie eine gültige URL (beispielsweise "http://microsoft.com/services") ein.
es: La dirección URL no es válida. Escriba una dirección URL válida, como http://microsoft.com/services.
ja: URL が無効です。有効な URL を入力してください (例: http://microsoft.com/services)。
ko: URL이 잘못되었습니다. http://microsoft.com/services와 같은 올바른 URL을 입력하세요.
zh_hans: URL 无效。请输入有效的 URL，如 http://microsoft.com/services
zh_hant: URL 無效。請輸入有效的 URL，例如 http://microsoft.com/services

# PPG_Services_InvalidUrls
source: A service URL in the application configuration file is not in the expected format.
cs: Adresa URL služby v konfiguračním souboru aplikace není v očekávaném formátu.
de: Eine Dienst-URL in der Anwendungskonfigurationsdatei liegt nicht im erwarteten Format vor.
es: Una dirección URL de servicio en el archivo de configuración de la aplicación no tiene el formato esperado.
ja: アプリケーション構成ファイルに指定されているサービスの URL の形式が正しくありません。
ko: 애플리케이션 구성 파일의 서비스 URL 형식이 잘못되었습니다.
zh_hans: 应用程序配置文件中的服务 URL 未采用所需的格式。
zh_hant: 應用程式組態檔中某項服務的 URL 不是預期的格式。

# PPG_Services_ConnectionStringsDontMatch
source: Authentication, Roles and Web Settings providers have been configured via the Application configuration file such that they do not share a common connection string.
cs: Konfigurace poskytovatelů služeb pro ověřování, role a nastavení webu se provedla prostřednictvím konfiguračního souboru aplikace, který jim neumožňuje sdílet obecný připojovací řetězec.
de: Authentifizierungs-, Rollen- und Webeinstellungsanbieter wurden über die Anwendungskonfigurationsdatei so konfiguriert, dass sie keine gemeinsame Verbindungszeichenfolge aufweisen.
es: Los proveedores de Autenticación, Roles y Configuración web se han configurado a través del archivo de configuración de la aplicación de modo que no comparten una cadena de conexión común.
ja: 認証、ロール、および Web 設定プロバイダーは、共通の接続文字列を共有しないように、アプリケーション構成ファイルを介して構成されています。
ko: 애플리케이션 구성 파일을 통해 인증, 역할 및 웹 설정 공급자가 공용 연결 문자열을 공유하지 않도록 구성되었습니다.
zh_hans: “身份验证”、“角色”和“Web 设置”提供程序已通过应用程序配置文件配置为三者不共享共同的连接字符串。
zh_hant: 驗證、角色和 Web 設定提供者已透過應用程式組態檔設定成不共用通用的連接字串。

# PPG_Services_connectionStringValueDefaultDisplayValue
source: Specify a connection string to a SQL Server database, or use the special connection string "Data Source = |SQL/CE|", which causes SQL Server Compact to generate local database files for offline storage.
cs: Zadejte prosím připojovací řetězec pro databázi serveru SQL Server nebo zadejte speciální připojovací řetězec "Data Source = |SQL/CE|", který způsobí, že SQL Server Compact vygeneruje místní soubory databáze pro úložiště offline.
de: Geben Sie eine Verbindungszeichenfolge für eine SQL Server-Datenbank an, oder verwenden Sie die spezielle Verbindungszeichenfolge "Data Source = |SQL/CE|", mit der von SQL Server Compact lokale Datenbankdateien für die Offlinespeicherung generiert werden.
es: Especifique una cadena de conexión a una base de datos SQL Server o utilice la cadena de conexión especial "Data Source = |SQL/CE|", para que SQL Server Compact genere archivos de base de datos locales para el almacenamiento sin conexión.
ja: SQL Server データベースへの接続文字列を指定するか、特殊な接続文字列 "Data Source = |SQL/CE|" を指定します。後者の場合、オフライン ストレージ用のローカル データベース ファイルが SQL Server Compact によって生成されます。
ko: SQL Server 데이터베이스에 대한 연결 문자열을 지정하거나 "Data Source = |SQL/CE|"라는 특정 연결 문자열을 사용하세요. 이 특정 연결 문자열을 사용하면 SQL Server Compact에서 오프라인 스토리지에 로컬 데이터베이스 파일을 생성합니다.
zh_hans: 指定与 SQL Server 数据库的连接字符串，或者使用特殊的连接字符串“Data Source = |SQL/CE|”，此字符串可使 SQL Server Compact 生成用于脱机存储的本地数据库文件。
zh_hant: 指定 SQL Server 資料庫的連接字串，或者使用特殊連接字串 "Data Source = |SQL/CE|"，它會使 SQL Server Compact 產生離線存放區使用的本機資料庫檔案。

# SD_ERR_UnreferencedTypeNameList_1Arg
source: The following type names were not understood: '{0}'. Make sure you have references to these types.
cs: Následující názvy typů nejsou srozumitelné: {0}. Ověřte, že máte odkazy na tyto typy.
de: Die folgenden Typnamen konnten nicht interpretiert werden: {0}. Vergewissern Sie sich, dass Verweise auf diese Typen vorhanden sind.
es: No se pudieron interpretar los siguientes nombres de tipo: '{0}'. Asegúrese de que existen referencias a estos tipos.
ja: 次の型名が認識されませんでした: '{0}'。これらの型が正しく参照設定されていることを確認してください。
ko: 형식 이름 '{0}'을(를) 인식할 수 없습니다. 이들 형식에 대한 참조가 있는지 확인하세요.
zh_hans: 无法理解以下类型名称:“{0}”。请确保具有对这些类型的引用。
zh_hant: 不了解下列類型名稱: '{0}'。請確認您具備這些類型的參考。

# SD_ERR_DuplicateNameList_1Arg
source: There are already settings with the following names: {0}.
cs: Nastavení s následujícími názvy už existují: {0}.
de: Für die folgenden Namen sind bereits Einstellungen vorhanden: {0}.
es: Ya hay valores con los nombres siguientes: {0}.
ja: 次の名前の設定が既に存在します: {0}。
ko: 이름이 {0}인 설정이 이미 있습니다.
zh_hans: 已存在具有以下名称的设置: {0}。
zh_hant: 已經有使用下列名稱的設定: {0}。

# SD_ERR_CantAuthenticate
source: The username/password combination cannot be authenticated.
cs: Kombinace uživatelské jméno/heslo se nedá ověřit.
de: Diese Kombination aus Benutzername und Kennwort kann nicht authentifiziert werden.
es: La combinación de nombre de usuario y contraseña no se puede autenticar.
ja: ユーザー名とパスワードの組み合わせを認証できません。
ko: 사용자 이름/암호 조합을 인증할 수 없습니다.
zh_hans: 用户名/密码组合无法通过身份验证。
zh_hant: 無法驗證此使用者名稱/密碼組合。

# PPG_WindowsFormsApp
source: Windows Forms Application
cs: Formulářová aplikace Windows
de: Windows Forms-Anwendung
es: Aplicación de Windows Forms
ja: Windows フォーム アプリケーション
ko: Windows Forms 애플리케이션
zh_hans: Windows 窗体应用程序
zh_hant: Windows Forms 應用程式

# PPG_ServiceReferenceNamespaceDescription
source: Namespace of the service reference.
cs: Obor názvů odkazu na službu
de: Namespace des Dienstverweises.
es: Espacio de nombres de la referencia de servicio.
ja: サービス参照の名前空間。
ko: 서비스 참조의 네임스페이스입니다.
zh_hans: 服务引用的命名空间。
zh_hant: 服務參考的命名空間。

# PPG_ServiceReferenceTypeName
source: Service Reference Properties
cs: Vlastnosti odkazu na službu
de: Dienstverweiseigenschaften
es: Propiedades de referencia de servicio
ja: サービス参照プロパティ
ko: 서비스 참조 속성
zh_hans: 服务引用属性
zh_hant: 服務參考屬性

# PPG_ServiceReferenceUrlDescription
source: Metadata Location Url
cs: URL umístění metadat
de: URL des Metadatenspeicherorts
es: URL de ubicación de los metadatos
ja: メタデータ ロケーション URL
ko: 메타데이터 위치 URL
zh_hans: 元数据位置 URL
zh_hant: 中繼資料位置 URL

# PPG_ServiceReferenceUrlName
source: Metadata Location
cs: Umístění metadat
de: Metadatenspeicherort
es: Ubicación de los metadatos
ja: メタデータ ロケーション
ko: 메타데이터 위치
zh_hans: 元数据位置
zh_hant: 中繼資料位置

# PPG_ServiceReferenceProperty_MultipleUrlNotSupported
source: A service reference with multiple source urls is not supported.
cs: Odkaz na službu s více zdrojovými adresami není podporován.
de: Ein Dienstverweis mit mehreren Quell-URLs wird nicht unterstützt.
es: No se admiten referencias de servicio con varias direcciones URL de origen.
ja: 複数のソース URL を含むサービス参照はサポートされていません。
ko: 여러 소스 URL이 있는 서비스 참조는 지원되지 않습니다.
zh_hans: 不支持带有多个源 URL 的服务引用。
zh_hant: 不支援具有多個來源 URL 的服務參考。

# PPG_ServiceReferenceProperty_SetReferenceUrlEmpty
source: Cannot change reference Url to empty. The reference url must be a valid URL.
cs: Adresa URL odkazu se nedá změnit na prázdnou. Adresa URL odkazu musí být platnou adresou URL.
de: Leere Verweis-URLs sind nicht zulässig. Die Verweis-URL muss eine gültige URL sein.
es: No se puede cambiar la dirección URL de referencia para dejarla vacía. La URL de referencia debe ser una dirección URL válida.
ja: 参照 URL を空に変更できません。参照 URL は有効な URL である必要があります。
ko: 참조 URL이 비어 있도록 변경할 수 없습니다. 참조 URL은 올바른 URL이어야 합니다.
zh_hans: 不能将引用 URL 更改为空。此引用 URL 必须为有效的 URL。
zh_hant: 無法將參考 URL 變更為空白。參考 URL 必須是有效的 URL。

# DFX_OneOrMoreFilesReloaded
source: One or more files were reloaded during the checkout. Please retry your operation.
cs: Při rezervaci se znovu načetl jeden nebo více souborů. Zopakujte prosím operaci.
de: Mindestens eine Datei wurde beim Auschecken neu geladen. Wiederholen Sie den Vorgang.
es: Se recargaron uno o varios archivos durante la extracción del repositorio. Vuelva a intentar la operación.
ja: 1 つ以上のファイルがチェックアウト時に再読み込みされました。操作を再試行してください。
ko: 체크 아웃하는 동안 하나 이상의 파일이 다시 로드되었습니다. 작업을 다시 시도하세요.
zh_hans: 签出期间重新加载了一个或多个文件。请重试操作。
zh_hant: 在簽出期間重新載入了一或多個檔案。請重試作業。

# PPG_ProjectReloadedSomePropertiesMayNotHaveBeenSet
source: The project was reloaded, and some changes on this page may have been lost.
cs: Projekt se znovu načetl a některé změny na této stránce se mohly ztratit.
de: Das Projekt wurde neu geladen, und einige Änderungen auf dieser Seite sind möglicherweise verloren gegangen.
es: El proyecto se ha recargado y puede que se hayan perdido algunos de los cambios realizados en esta página.
ja: プロジェクトが再度読み込まれました。このページに加えられたいくつかの変更が失われた可能性があります。
ko: 프로젝트가 다시 로드되었습니다. 이 페이지의 일부 변경 내용이 손실되었을 수 있습니다.
zh_hans: 项目已重新加载，此页上的一些更改可能已经丢失。
zh_hant: 專案已重新載入，此頁面上的某些變更可能已遺失。

# PPG_SecurityPage_XBAPOutOfTrustZoneToolTip
source: The application will fail to run in the selected zone because of this requested elevated permission. Click the help link above for more info.
cs: Aplikace kvůli vyžadovaným oprávněním vyšší úrovně ve vybrané zóně selže. Další informace se dozvíte kliknutím na odkaz nápovědy nahoře.
de: Die Anwendung kann aufgrund dieser angeforderten erweiterten Berechtigung in der ausgewählten Zone nicht ausgeführt werden. Klicken Sie auf den Hilfelink oben, um weitere Informationen zu erhalten.
es: Error de la aplicación al ejecutarse en la zona seleccionada debido al permiso elevado solicitado. Haga clic en el vínculo de ayuda para obtener más información.
ja: 要求されたこの引き上げられたアクセス許可が原因で、選択されたゾーンでのアプリケーションの実行は失敗します。詳細については、ヘルプ リンクをクリックしてください。
ko: 고급 권한이 없으므로 애플리케이션을 선택한 영역에서 실행할 수 없습니다. 자세한 내용을 보려면 위에 있는 도움말 링크를 클릭하세요.
zh_hans: 应用程序将不能在选定区域中运行，因为此操作需要提升的权限。请单击上面的帮助链接获取详细信息。
zh_hant: 由於這項要求的更高權限，此應用程式將無法在選取的區域中執行。如需詳細資訊，請按一下上方的 [說明] 連結。

# PPG_VersionTitle
source: Version
es: Versión
ja: バージョン
ko: 버전
zh_hans: 版本
zh_hant: 版本

# PPG_SecurityPage_InternetZone
source: Internet
ja: インターネット
ko: 인터넷
zh_hant: 網際網路

# AttrEditor_CAT_Data
source: Data
de: Daten
es: Datos
ja: データ
ko: 데이터
zh_hans: 数据
zh_hant: 資料

# AttrEditor_CAT_DragDrop
source: DragDrop
es: Arrastrar y colocar
ja: ドラッグ アンド ドロップ
ko: 끌어서 놓기
zh_hans: 拖放
zh_hant: 拖放

# AttrEditor_CAT_WindowStyle
source: WindowStyle
de: Fensterstil
es: Estilo de ventana
ja: ウィンドウ スタイル
ko: 창 스타일

# AttrEditor_CategoryWeb
source: Web
ko: 웹
