Repository: dotnet/fsharp
Catalog: vsintegration/src/FSharp.ProjectSystem.PropertyPages/Resources/xlf/Microsoft.VisualStudio.Editors.Designer.*.xlf
Languages: cs, de, es, ja, ko, zh_hans, zh_hant

# PPG_Compile_42020
source: Implicit type; object assumed
cs: Implicitní typ; předpokládaný objekt
de: Impliziter Typ; Objekt wird angenommen.
es: Tipo implícito; se supone el objeto
ja: 暗黙的な型です。オブジェクトと見なされます
ko: 암시적 형식, 개체로 간주
zh_hans: 隐式类型；假定对象
zh_hant: 隱含類型，假設是 Object

# PPG_Compile_42104
source: Use of variable prior to assignment
cs: Použití proměnné závisí na předchozím přiřazení
de: Verwendung einer Variablen vor der Zuweisung.
es: Uso de variable anterior a la asignación
ja: 割り当て前の変数の使用
ko: 할당 전 변수 사용
zh_hans: 在赋值前使用变量
zh_hant: 在指派之前使用變數

# PPG_Compile_420XX
source: Function/Operator without return value
cs: Funkce nebo operátor bez návratové hodnoty
de: Funktion/Operator ohne Rückgabewert.
es: Función u operador sin valor devuelto.
ja: 戻り値なしの関数/演算子
ko: 반환 값이 없는 함수/연산자
zh_hans: 没有返回值的函数/运算符
zh_hant: 無傳回值的函式/運算子

# PPG_Compile_42024
source: Unused local variable
cs: Nepoužitá lokální proměnná
de: Nicht verwendete lokale Variable
es: Variable local no usada
ja: 未使用のローカル変数
ko: 사용되지 않은 지역 변수
zh_hans: 未使用的局部变量
zh_hant: 未使用的區域變數

# PPG_Compile_42025
source: Instance variable accesses shared member
cs: Proměnná instance přistupuje ke sdílenému členu.
de: Instanzvariable greift auf freigegebenen Member zu.
es: La variable de instancia obtiene acceso al miembro compartido
ja: 共有メンバーにアクセスするインスタンス変数
ko: 인스턴스 변수가 공유 멤버에 액세스함
zh_hans: 实例变量访问共享成员
zh_hant: 執行個體變數存取共用成員

# PPG_Compile_42004
source: Recursive operator or property access
cs: Rekurzivní operátor nebo přístup k vlastnosti
de: Rekursiver Operator- oder Eigenschaftenzugriff
es: Acceso a la propiedad u operador de forma recursiva
ja: 演算子またはプロパティの再帰的なアクセス
ko: 재귀 연산자 또는 속성 액세스
zh_hans: 递归运算符或属性访问
zh_hant: 遞迴運算子或屬性存取

# PPG_Compile_42029
source: Duplicate or overlapping catch blocks
cs: Duplicitní nebo překrývající se bloky catch
de: Doppelte oder überlappende Catch-Blöcke
es: Bloques catch duplicados o superpuestos
ja: 重複またはオーバーラップする catch ブロック
ko: 중복되거나 겹치는 catch 블록
zh_hans: 重复或重叠的 catch 块
zh_hant: 重複或重疊的 catch 區塊

# PPG_Compile_ResetIndeterminateWarningLevels
source: The warning settings for one or more configurations conflict. Changing this setting will reset the settings in all configurations.
cs: Nastavení upozornění pro jednu nebo více konfigurací koliduje. Změnou tohoto nastavení dojde k resetování nastavení ve všech konfiguracích.
de: Es liegt ein Konflikt bei den Warnungseinstellungen für mindestens eine Konfiguration vor. Wenn diese Einstellung geändert wird, werden die Einstellungen in allen Konfigurationen zurückgesetzt.
es: Los valores de advertencia de una o varias configuraciones están en conflicto. Si cambia este valor, se restablecerán los valores de todas las configuraciones.
ja: 1 つ以上の構成に対する警告の設定が競合します。 この設定を変更すると、すべての構成の設定がリセットされます。
ko: 하나 이상의 구성에 대한 경고 설정이 충돌합니다. 이 설정을 변경하면 모든 구성의 설정이 다시 설정됩니다.
zh_hans: 一个或多个配置的警告设置相冲突。 更改此设置将重置所有配置中的设置。
zh_hant: 一或多個組態衝突的警告設定。 變更此設定將重設所有組態中的設定。

# PPG_MyApplication_StartupMode_FormCloses
source: When startup form closes
cs: Když se zavře úvodní formulář
de: Beim Schließen des Startformulars
es: Al cerrar el formulario de inicio
ja: スタートアップ フォームが閉じるとき
ko: 시작 폼을 닫을 때
zh_hans: 当启动窗体关闭时
zh_hant: 啟動表單關閉時

# PPG_MyApplication_StartupMode_AppExits
source: When last form closes
cs: Když se zavře poslední formulář
de: Beim Schließen des letzten Formulars
es: Al cerrar el último formulario
ja: 最後のフォームが閉じるとき
ko: 마지막 폼을 닫을 때
zh_hans: 当最后一个窗体关闭时
zh_hant: 最後表單關閉時

# PPG_MyApplication_AuthenMode_ApplicationDefined
source: Application-defined
cs: Definované aplikací
de: Anwendungsdefiniert
es: Definido por la aplicación
ja: アプリケーション定義
ko: 애플리케이션 정의
zh_hans: 由应用程序定义
zh_hant: 由應用程式定義

# PPG_SecurityPage_Cancel
source: Cancel
cs: Zrušit
de: Abbrechen
es: Cancelar
ja: キャンセル
ko: 취소
zh_hans: 取消
zh_hant: 取消

# PPG_SecurityPage_Calculate
source: &Calculate Permissions
cs: &Vypočítat oprávnění
de: &Berechtigungen berechnen
es: &Calcular permisos
ja: アクセス許可の検出(&C)
ko: 권한 계산(&C)
zh_hans: 计算权限(&C)
zh_hant: 計算權限(&C)

# PPG_MgdStatus_Stopped
source: Stopped...
cs: Zastaveno...
de: Beendet...
es: Detenido...
ja: 停止しました...
ko: 중지되었습니다...
zh_hans: 已停止...
zh_hant: 已停止...

# PPG_MgdStatus_Starting
source: Starting...
cs: Spouštění...
de: Wird gestartet...
es: Iniciando...
ja: 開始しています...
ko: 시작하고 있습니다...
zh_hans: 正在启动...
zh_hant: 正在啟動...

# PPG_MgdStatus_Building
source: Building...
cs: Sestavování...
de: Buildvorgang wird ausgeführt...
es: Compilando...
ja: ビルドしています...
ko: 빌드하고 있습니다...
zh_hans: 正在生成...
zh_hant: 正在建置...

# PPG_MgdStatus_Analyzing
source: Analyzing...
cs: Analyzování...
de: Wird analysiert...
es: Analizando...
ja: 分析しています...
ko: 분석하고 있습니다...
zh_hans: 正在分析...
zh_hant: 正在分析...

# PPG_MgdStatus_AnalyzeFailed
source: Analyze Failed
cs: Analýza nebyla úspěšná
de: Fehler beim Analysieren.
es: No se pudo analizar
ja: 分析できませんでした
ko: 분석하지 못했습니다.
zh_hans: 分析失败
zh_hant: 分析失敗

# PPG_MgdStatus_Aborting
source: Aborting...
cs: Přerušování...
de: Vorgang wird abgebrochen...
es: Anulando...
ja: 中止しています...
ko: 중단하고 있습니다...
zh_hans: 正在中止...
zh_hant: 正在中止...

# PPG_MgdStatus_Cancelling
source: Canceling...
cs: Zrušení...
de: Wird abgebrochen...
es: Cancelando...
ja: 取り消しています...
ko: 취소하고 있습니다...
zh_hans: 正在取消...
zh_hant: 正在取消...

# PPG_SecurityPage_LocalIntranetZone
source: Local Intranet
cs: Místní intranet
de: Lokales Intranet
es: Intranet local
ja: ローカル イントラネット
ko: 로컬 인트라넷
zh_hans: 本地 Intranet
zh_hant: 近端內部網路

# PPG_SecurityPage_CustomZone
source: (Custom)
cs: (vlastní)
de: (Benutzerdefiniert)
es: (Personalizado)
ja: (カスタム)
ko: (사용자 지정)
zh_hans: (自定义)
zh_hant: (自訂)

# PPG_SecurityPage_ZoneDefault
source: (Zone Default)
cs: (výchozí zóna)
de: (Zonenstandard)
es: (Zona predeterminada)
ja: (ゾーン既定値)
ko: (영역 기본값)
zh_hans: (区域默认设置)
zh_hant: (區域預設)

# PPG_SecurityPage_Included
source: Include
cs: Zahrnout
de: Einschließen
es: Incluir
ja: 包含
ko: 포함
zh_hans: 包括
zh_hant: 包含

# PPG_SecurityPage_Excluded
source: Exclude
cs: Vyloučit
de: Ausschließen
es: Excluir
ja: 除外
ko: 제외
zh_hans: 排除
zh_hant: 排除

# PPG_SecurityPage_FullTrustToolTip
source: The application will require elevated permissions to run in the selected zone. Click the help link above for more info.
cs: Ke spuštění aplikace ve vybrané zóně je potřeba vyšší oprávnění. Další informace získáte, když kliknete na odkaz na nápovědu.
de: Für die Ausführung in der ausgewählten Zone benötigt die Anwendung erweiterte Berechtigungen. Klicken Sie auf den Hilfelink weiter oben, um weitere Informationen zu erhalten.
es: La aplicación necesitará permisos elevados para ejecutarse en la zona seleccionada. Haga clic en el vínculo de ayuda para obtener más información.
ja: 選択されたゾーンでアプリケーションを実行するには、アクセス許可を引き上げる必要があります。詳細については、上のヘルプ リンクをクリックしてください。
ko: 애플리케이션을 선택한 영역에서 실행하려면 고급 권한이 필요합니다. 자세한 내용을 보려면 위에 있는 도움말 링크를 클릭하세요.
zh_hans: 应用程序将需要提升的权限才能在所选区域中运行。请单击上面的帮助链接获取详细信息。
zh_hant: 應用程式必須有更高的使用權限，才能在選取的區域中執行。如需詳細資訊，請按一下上方的 [說明] 連結。

# PPG_SecurityPage_BadPermissionToolTip
source: This permission could not be loaded. Press the delete key to remove it from your project.
cs: Oprávnění se nepodařilo načíst. Stisknutím klávesy Odstranit ho odeberete z projektu.
de: Diese Berechtigung konnte nicht geladen werden. Drücken Sie ENTF, um sie aus Ihrem Projekt zu entfernen.
es: Este permiso no se puede cargar. Presione la tecla Supr para quitarlo del proyecto.
ja: このアクセス許可を読み込めませんでした。プロジェクトからこのアクセス許可を削除するには、Delete キーを押してください。
ko: 이 사용 권한을 로드할 수 없습니다. 프로젝트에서 해당 권한을 제거하려면 <Delete> 키를 누르세요.
zh_hans: 未能加载该权限。请按 Delete 键将其从项目中删除。
zh_hant: 無法載入此使用權限。請按 DELETE 鍵，將它從專案中移除。

# PPG_SecurityPage_HeaderIncluded
source: Included
cs: Zahrnuto
de: Eingeschlossen
es: Se incluye
ja: 含まれている
ko: 포함됨
zh_hans: 包括
zh_hant: 包含

# PPG_SecurityPage_HeaderPermission
source: Permission
cs: Oprávnění
de: Berechtigung
es: Permiso
ja: アクセス許可
ko: 사용 권한
zh_hans: 权限
zh_hant: 使用權限

# PPG_SecurityPage_HeaderSetting
source: Setting
cs: Nastavení
de: Einstellung
es: Valor
ja: 設定
ko: 설정
zh_hans: 设置
zh_hant: 設定

# PPG_SecurityPage_HelpLabelText
source: Specify the code access security permissions that your ClickOnce application requires in order to run. Learn more about code access security...
cs: Zadejte oprávnění zabezpečující přístup ke kódu, které aplikace ClickOnce vyžaduje ke spuštění. Další informace o zabezpečení přístupu ke kódu...
de: Geben Sie die Berechtigungen für die Codezugriffssicherheit an, die zum Ausführen der ClickOnce-Anwendung erforderlich sind. Weitere Informationen zur Codezugriffssicherheit...
es: Especifique los permisos de seguridad de acceso del código que requiere la aplicación ClickOnce para ejecutarse. Obtener más información sobre la seguridad de acceso del código...
ja: ClickOnce アプリケーションの実行に必要なコード アクセス セキュリティのアクセス許可を指定してください。コード アクセス セキュリティに関する詳細の表示...
ko: ClickOnce 애플리케이션 실행에 필요한 코드 액세스 보안 권한을 지정합니다. 코드 액세스 보안에 대한 자세한 정보...
zh_hans: 指定运行 ClickOnce 应用程序所需的代码访问安全权限。了解有关代码访问安全性的更多信息...
zh_hant: 指定執行 ClickOnce 應用程式所需的程式碼存取安全性權限。進一步了解程式碼存取安全性...

# PPG_SecurityPage_HelpLabelLink
source: Learn more about code access security...
cs: Další informace o zabezpečení přístupu ke kódu...
de: Weitere Informationen zur Codezugriffssicherheit...
es: Obtener más información sobre la seguridad de acceso del código...
ja: コード アクセス セキュリティに関する詳細の表示...
ko: 코드 액세스 보안에 대한 자세한 정보...
zh_hans: 了解有关代码访问安全性的更多信息...
zh_hant: 進一步了解程式碼存取安全性...

# PPG_SecurityPage_BadDropDownValue
source: Invalid value
cs: Neplatná hodnota
de: Ungültiger Wert.
es: Valor no válido
ja: 無効な値
ko: 잘못된 값
zh_hans: 无效值
zh_hant: 值無效

# PPG_SecurityPage_SecurityPermissionCannotBeExcluded
source: The SecurityPermission must be included in your application with the Execute flag set or your application will not run. Mark this permission as "Zone Default" or "Include."
cs: Aplikace musí zahrnovat oprávnění SecurityPermission s nastaveným příznakem Execute, jinak nepoběží. Označte toto oprávnění jako „Výchozí zóna“ nebo „Zahrnout“.
de: Die SecurityPermission-Berechtigung muss mit festgelegtem Execute-Flag in die Anwendung eingeschlossen werden, damit die Anwendung ausgeführt werden kann. Markieren Sie diese Berechtigung mit "Zonenstandard" oder "Einschließen".
es: Debe incluir SecurityPermission en la aplicación con la marca Ejecutar establecida; de lo contrario, no se ejecutará la aplicación. Marque este permiso como "Zona predeterminada" o "Incluir".
ja: SecurityPermission が実行フラグ セットと共にアプリケーションに含まれていなければ、アプリケーションは実行されません。このアクセス許可を "ゾーン既定値" または "包含" として設定してください。
ko: 애플리케이션에 Execute 플래그가 설정된 SecurityPermission이 포함되지 않으면 애플리케이션이 실행되지 않습니다. 이 사용 권한을 "영역 기본값" 또는 "포함"으로 표시하세요.
zh_hans: 应用程序中必须包含 SecurityPermission，且为其设置了 Execute 标志，否则应用程序将不会运行。将此权限标记为“区域默认设置”或“包括”。
zh_hant: 應用程式必須包含 SecurityPermission，而且必須設定執行旗標，否則應用程式將無法執行。請將此使用權限標記為 [區域預設] 或 [包含]。

# PPG_SecurityPage_ExecuteCannotBeExcluded
source: The SecurityPermission must be included in your application with the Execute flag set or your application will not run. The Execute flag has been added to the SecurityPermission in your manifest.
cs: Aplikace musí zahrnovat oprávnění SecurityPermission s nastaveným příznakem Execute, jinak nepoběží. K oprávnění SecurityPermission byl v manifestu přidán příznak Execute.
de: Die SecurityPermission-Berechtigung muss mit festgelegtem Execute-Flag in die Anwendung eingeschlossen werden, damit die Anwendung ausgeführt werden kann. Das Execute-Flag wurde der SecurityPermission-Berechtigung im Manifest hinzugefügt.
es: Debe incluir SecurityPermission en la aplicación con la marca Ejecutar establecida; de lo contrario, no se ejecutará la aplicación. Se ha agregado la marca Ejecutar a SecurityPermission en el manifiesto.
ja: SecurityPermission が実行フラグ セットと共にアプリケーションに含まれていなければ、アプリケーションは実行されません。実行フラグはマニフェスト内の SecurityPermission に追加されました。
ko: 애플리케이션에 Execute 플래그가 설정된 SecurityPermission이 포함되지 않으면 애플리케이션이 실행되지 않습니다. Execute 플래그는 사용자 매니페스트의 SecurityPermission에 추가되었습니다.
zh_hans: 应用程序中必须包含 SecurityPermission，且为其设置了 Execute 标志，否则应用程序将不会运行。已在清单中向 SecurityPermission 添加了 Execute 标志。
zh_hant: 應用程式必須包含 SecurityPermission，而且必須設定執行旗標，否則應用程式將無法執行。已將執行旗標新增至資訊清單中的 SecurityPermission。

# PPG_SecurityPage_SwitchToFullTrustDialog
source: This application requires full trust to run correctly. Would you like to set this as a full trust application?
cs: Aplikace vyžaduje pro správný běh plnou důvěru. Chcete ji nastavit jako důvěryhodnou aplikaci?
de: Für die ordnungsgemäße Ausführung dieser Anwendung ist volle Vertrauenswürdigkeit erforderlich. Möchten Sie sie als Anwendung mit voller Vertrauenswürdigkeit festlegen?
es: Esta aplicación requiere plena confianza para ejecutarse correctamente. ¿Quiere establecer esta aplicación como de plena confianza?
ja: このアプリケーションは、正しく実行されるために完全な信頼の設定を必要とします。完全信頼アプリケーションとして設定しますか?
ko: 애플리케이션을 올바르게 실행되려면 완전 신뢰가 필요합니다. 이 애플리케이션을 완전 신뢰 애플리케이션으로 설정하시겠습니까?
zh_hans: 此应用程序需要完全信任才能正确运行。是否将其设置为完全信任的应用程序?
zh_hant: 此應用程式需要完全信任才能正確執行。要將它設定為完全信任應用程式嗎?

# PPG_SecurityPage_SwitchToFullTrustDialogTitle
source: Full Trust Required
cs: Vyžaduje plnou důvěru
de: Volle Vertrauenswürdigkeit erforderlich
es: Se requiere plena confianza
ja: 完全信頼が必要です
ko: 완전 신뢰 필요
zh_hans: 需要完全信任
zh_hant: 需要完全信任

# PPG_SecurityPage_CouldNotSaveManifest
source: An error occurred and the app.manifest file could not be saved. Error:
cs: Došlo k chybě a soubor app.manifest se nepodařilo uložit. Chyba:
de: Die Datei "app.manifest" konnte aufgrund eines Fehlers nicht gespeichert werden. Fehler:
es: No se pudo guardar el archivo app.manifest debido a un error. Error:
ja: エラーが発生したため、app.manifest ファイルを保存できませんでした。 エラー:
ko: 오류가 발생하여 app.manifest 파일을 저장할 수 없습니다. 오류:
zh_hans: 出错，无法保存 app.manifest 文件。 错误:
zh_hant: 發生錯誤，無法儲存 app.manifest 檔案。 錯誤:

# PPG_SecurityPage_CouldNotLoadManifest
source: An error occurred and the app.manifest file could not be loaded. Please remove any changes you have made to the file and reload the Security property page again.
cs: Došlo k chybě a soubor app.manifest se nepodařilo načíst. Odeberte prosím změny, které jste provedli v souboru, a znovu načtěte stránku s vlastnostmi zabezpečení.
de: Die Datei "app.manifest" konnte aufgrund eines Fehlers nicht geladen werden. Machen Sie alle Änderungen an der Datei rückgängig, und laden Sie die Seite mit den Sicherheitseigenschaften neu.
es: No se pudo cargar el archivo app.manifest debido a un error. Quite los cambios que han hecho en el archivo y recargue la página de propiedades de seguridad.
ja: エラーが発生したため、app.manifest ファイルを読み込めませんでした。このファイルへの変更を削除して、セキュリティ プロパティ ページを再度読み込んでください。
ko: 오류가 발생하여 app.manifest 파일을 로드할 수 없습니다. 파일에서 변경한 내용을 제거하고 [보안] 속성 페이지를 다시 로드하세요.
zh_hans: 出错，无法加载 app.manifest 文件。请删除已对该文件进行的所有更改，然后重新加载“安全”属性页。
zh_hant: 發生錯誤且無法載入 app.manifest 檔案。請移除您對檔案進行的任何變更，並重新載入 [安全性] 屬性頁。

# PPG_SecurityPage_CheckAccessibilityName
source: Included
cs: Zahrnuto
de: Eingeschlossen
es: Se incluye
ja: 含まれている
ko: 포함됨
zh_hans: 包括
zh_hant: 包含

# PPG_SecurityPage_BlankAccessibilityName
source: Not Included
cs: Nezahrnuto
de: Nicht eingeschlossen
es: No se incluye
ja: 含まれていない
ko: 포함 안 됨
zh_hans: 不包括
zh_hant: 不包含

# PPG_SecurityPage_BangAccessibilityName
source: Included with warning
cs: Zahrnuto s upozorněním
de: Eingeschlossen mit Warnung
es: Se incluye con advertencia
ja: 含まれるアクセス許可 (警告あり)
ko: 경고와 함께 포함됨
zh_hans: 包括警告
zh_hant: 包含在警告中

# PPG_SecurityPage_PermCalcFailed
source: Calculating permissions failed.
cs: Výpočet oprávnění se nezdařil.
de: Fehler beim Berechnen der Berechtigungen.
es: No se pudieron calcular los permisos.
ja: アクセス許可の計算に失敗しました。
ko: 사용 권한을 계산하지 못했습니다.
zh_hans: 计算权限失败。
zh_hant: 計算使用權限失敗。

# PPG_SecurityPage_PermCalcFailedCaption
source: Error
cs: Chyba
de: Fehler
ja: エラー
ko: 오류
zh_hans: 错误
zh_hant: 錯誤

# PPG_SecurityAdvancedPage_Title
source: Advanced Security Settings
cs: Upřesnit nastavení zabezpečení
de: Erweiterte Sicherheitseinstellungen
es: Configuración avanzada de seguridad
ja: セキュリティの詳細設定
ko: 고급 보안 설정
zh_hans: 高级安全设置
zh_hant: 進階安全性設定

# PPG_MgdStatus_BuildFailed
source: Build Failed. Click CANCEL and correct the build failure before analyzing again.
cs: Sestavení se nezdařilo. Klikněte na ZRUŠIT a před další analýzou opravte chybu sestavení.
de: Fehler beim Buildvorgang. Klicken Sie auf "ABBRECHEN", und beheben Sie vor einer erneuten Analyse den Buildfehler.
es: No se pudo llevar a cabo la compilación. Haga clic en CANCELAR y corrija el error de compilación antes de volver a ejecutar el análisis.
ja: ビルドに失敗しました。[キャンセル] をクリックし、解析を再実行する前にビルドのエラーを修正してください。
ko: 빌드하지 못했습니다. [취소]를 클릭하여 빌드 실패를 수정한 다음 다시 분석하세요.
zh_hans: 生成失败。请单击“取消”并更正生成错误，然后重新分析。
zh_hant: 建置失敗。請按 [取消] 並更正建置失敗錯誤後，再分析一次。

# PPG_MgdStatus_BuildComplete
source: Build completed...
cs: Sestavení je hotové...
de: Buildvorgang abgeschlossen...
es: Compilación completada...
ja: ビルドの完了...
ko: 빌드가 완료되었습니다...
zh_hans: 生成完毕...
zh_hant: 建置完成...

# PPG_MgdStatus_BuildUnableToStart
source: Unable to start the build.
cs: Sestavení nelze spustit.
de: Buildvorgang kann nicht gestartet werden.
es: No se puede iniciar la compilación.
ja: ビルドを開始できません。
ko: 빌드를 시작할 수 없습니다.
zh_hans: 无法启动生成。
zh_hant: 無法啟動建置。

# PPG_MgdStatus_BuildFailedToStart
source: Serious error. The build must begin in order to analyze permissions. It has not started.
cs: Závažná chyba. Před analýzou oprávnění se musí provést sestavení, které ještě nezačalo.
de: Schwerwiegender Fehler. Der Build muss zum Analysieren von Berechtigungen gestartet werden. Dies ist jedoch nicht erfolgt.
es: Error grave. La compilación debe comenzar para analizar los permisos. No se ha iniciado.
ja: 重大なエラーが発生しました。アクセス許可を解析するために、ビルドを開始しなければなりません。ビルドが開始されていません。
ko: 심각한 오류가 발생했습니다. 사용 권한을 분석하려면 빌드가 시작되어야 하는데 시작되지 않았습니다.
zh_hans: 错误。必须先开始生成才可以分析权限。生成尚未启动。
zh_hant: 嚴重錯誤。必須開始建置才能分析使用權限，但建置尚未啟動。

# PPG_CustomPermissionSet
source: (Custom)
cs: (vlastní)
de: (Benutzerdefiniert)
es: (Personalizado)
ja: (カスタム)
ko: (사용자 지정)
zh_hans: (自定义)
zh_hant: (自訂)

# PPG_NonePermissionSet
source: (None)
cs: (žádné)
de: (Keine)
es: (Ninguno)
ja: (なし)
ko: (없음)
zh_hans: (无)
zh_hant: (無)

# PPG_Signing_KeyFileBrowse_Title
source: Selecting existing key file
cs: Výběr stávajícího souboru klíče
de: Auswählen einer vorhandenen Schlüsseldatei
es: Selección de archivo de clave existente
ja: 既存のキー ファイルを選択しています。
ko: 기존 키 파일 선택
zh_hans: 选择现有密钥文件
zh_hant: 選取現有的金鑰檔

# PPG_Signing_KeyFileBrowse_Filter
source: Key Files
cs: Soubory klíčů
de: Schlüsseldateien
es: Archivos de clave
ja: キー ファイル
ko: 키 파일
zh_hans: 密钥文件
zh_hant: 金鑰檔

# PPG_Signing_KeyFileNew_Title
source: Create key file
cs: Vytvořit soubor klíče
de: Schlüsseldatei erstellen
es: Crear archivo de clave
ja: キー ファイルの作成
ko: 키 파일 만들기
zh_hans: 创建密钥文件
zh_hant: 建立金鑰檔

# PPG_Signing_OldPassWrong
source: The old password is invalid.
cs: Původní heslo je neplatné.
de: Das alte Kennwort ist ungültig.
es: La contraseña anterior no es válida.
ja: 古いパスワードは無効です。
ko: 이전 암호가 잘못되었습니다.
zh_hans: 旧密码无效。
zh_hant: 舊密碼無效。

# PPG_Signing_OldPassEmpty
source: Enter the old password.
cs: Zadejte staré heslo.
de: Geben Sie das alte Kennwort ein.
es: Escriba la contraseña antigua.
ja: 古いパスワードを入力してください。
ko: 이전 암호를 입력하세요.
zh_hans: 请输入旧密码。
zh_hant: 請輸入舊密碼。

# PPG_Signing_NewPassEmpty
source: Enter a new password.
cs: Zadejte nové heslo.
de: Geben Sie ein neues Kennwort ein.
es: Escriba la contraseña nueva.
ja: 新しいパスワードを入力してください。
ko: 새 암호를 입력하십시오.
zh_hans: 请输入新密码。
zh_hant: 請輸入新密碼。

# PPG_Signing_NewPassMismatch
source: The new passwords do not match. Enter the password again.
cs: Nová hesla se neshodují. Zadejte heslo znovu.
de: Die neuen Kennwörter stimmen nicht überein. Wiederholen Sie die Kennworteingabe.
es: Las nuevas contraseñas no coinciden. Vuelva a escribir la contraseña.
ja: 新しいパスワードが一致しません。もう一度、パスワードを入力してください。
ko: 새 암호가 일치하지 않습니다. 암호를 다시 입력하세요.
zh_hans: 新密码不匹配。请重新输入密码。
zh_hant: 新密碼不相符。請重新輸入密碼。

# PPG_Signing_NewPassTooShort
source: The new password must be at least 6 characters in length. Enter the password again.
cs: Nové heslo musí mít aspoň 6 znaků. Zadejte heslo znovu.
de: Das neue Kennwort muss mindestens sechs Zeichen umfassen. Wiederholen Sie die Kennworteingabe.
es: La contraseña nueva debe tener al menos 6 caracteres. Vuelva a escribir la contraseña.
ja: 新しいパスワードには、6 文字以上を指定することが必要です。もう一度、パスワードを入力してください。
ko: 새 암호는 6자 이상이어야 합니다. 암호를 다시 입력하세요.
zh_hans: 新密码的长度必须至少为 6 个字符。请重新输入密码。
zh_hant: 新密碼長度必須至少為 6 個字元。請重新輸入密碼。

# PPG_Signing_BrowseCertTitle
source: Select a Certificate
cs: Vyberte certifikát
de: Zertifikat auswählen
es: Selección de certificado
ja: 証明書の選択
ko: 인증서 선택
zh_hans: 选择证书
zh_hant: 選取憑證

# PPG_Signing_BrowseCertStorePrompt
source: Select a certificate to sign your ClickOnce manifests
cs: Vyberte prosím certifikát, kterým budou podepsány manifesty ClickOnce
de: Zertifikat zum Signieren der ClickOnce-Manifeste auswählen
es: Seleccionar un certificado para firmar los manifiestos de ClickOnce
ja: ClickOnce マニフェストに署名する証明書を選択してください
ko: ClickOnce 매니페스트 서명에 사용할 인증서를 선택하세요.
zh_hans: 选择证书来为 ClickOnce 清单签名
zh_hant: 選取簽署 ClickOnce 資訊清單的憑證

# PPG_Signing_BrowseCertFileFilter
source: Certificate Files
cs: Soubory certifikátů
de: Zertifikatsdateien
es: Archivos de certificado
ja: 証明書ファイル
ko: 인증서 파일
zh_hans: 创建文件
zh_hant: 憑證檔

# PPG_Signing_IssuedTo
source: Issued To
cs: Vystaven pro
de: Ausgestellt für
es: Emitido para
ja: 発行先
ko: 발급 대상
zh_hans: 颁发对象
zh_hant: 核發對象

# PPG_Signing_IssuedBy
source: Issued By
cs: Vydal
de: Ausgestellt von
es: Emitido por
ja: 発行元
ko: 발급자
zh_hans: 发布者
zh_hant: 核發者

# PPG_Signing_Purpose
source: Intended Purpose
cs: Účel použití
de: Beabsichtigter Zweck
es: Propósito
ja: 使用目的
ko: 용도
zh_hans: 目的
zh_hant: 預期的用途

# PPG_Signing_ExpirationDate
source: Expiration Date
cs: Datum platnosti
de: Ablaufdatum
es: Fecha de expiración
ja: 有効期限
ko: 만료 날짜
zh_hans: 到期日期
zh_hant: 到期日

# PPG_Signing_InvalidPassword
source: The password is invalid.
cs: Heslo je neplatné.
de: Das Kennwort ist ungültig.
es: La contraseña no es válida.
ja: パスワードが無効です。
ko: 암호가 잘못되었습니다.
zh_hans: 密码无效。
zh_hant: 密碼無效。

# PPG_Signing_InvalidPasswordTitle
source: Invalid password
cs: Neplatné heslo
de: Ungültiges Kennwort
es: Contraseña no válida
ja: 無効なパスワード
ko: 잘못된 암호
zh_hans: 无效密码
zh_hant: 密碼無效

# PPG_Signing_NoPrivateKey
source: The selected file does not contain a private key. You must choose a certificate that contains a private key.
cs: Vybraný soubor neobsahuje privátní klíč. Musíte vybrat certifikát, který obsahuje privátní klíč.
de: Die ausgewählte Datei enthält keinen privaten Schlüssel. Wählen Sie ein Zertifikat mit einem privaten Schlüssel aus.
es: El archivo seleccionado no contiene una clave privada. Debe elegir un certificado que contenga una clave privada.
ja: 選択されたファイルには秘密キーが含まれていません。秘密キーを含む証明書を選択する必要があります。
ko: 선택한 파일에 개인 키가 없습니다. 개인 키를 포함하는 인증서를 선택해야 합니다.
zh_hans: 所选文件未包含私钥。必须选择包含私钥的证书。
zh_hant: 選取的檔案未包含私密金鑰。您必須選擇含有私密金鑰的憑證。

# PPG_Signing_NoPrivateKeyTitle
source: Invalid key
cs: Neplatný klíč
de: Ungültiger Schlüssel
es: Clave no válida
ja: 無効なキー
ko: 잘못된 키
zh_hans: 无效密钥
zh_hant: 金鑰無效

# PPG_Signing_CertCreationError
source: Certificate Creation Error
cs: Chyba při vytvoření certifikátu
de: Zertifikaterstellungsfehler
es: Error de creación del certificado
ja: 証明書の作成エラー
ko: 인증서 만들기 오류
zh_hans: 证书创建错误
zh_hant: 建立憑證發生錯誤

# PPG_Signing_AllPurposes
source: <All>
cs: <Vše>
de: <Alle>
es: <Todo>
ja: <すべて>
ko: <모두>
zh_hans: <全部>
zh_hant: <全部>

# PPG_Signing_PasswordMismatch
source: The passwords do not match.
cs: Hesla se neshodují.
de: Die Kennwörter stimmen nicht überein.
es: Las contraseñas no coinciden.
ja: パスワードが一致しません。
ko: 암호가 일치하지 않습니다.
zh_hans: 密码不匹配。
zh_hant: 密碼不相符。

# PPG_Signing_NoPassword
source: Enter a password.
cs: Zadejte heslo.
de: Geben Sie ein Kennwort ein.
es: Escriba una contraseña.
ja: パスワードを入力してください。
ko: 암호를 입력하세요.
zh_hans: 请输入密码。
zh_hant: 請輸入密碼。

# PPG_Signing_NoConfirm
source: Confirm the password.
cs: Potvrďte heslo.
de: Bestätigen Sie das Kennwort.
es: Confirme la contraseña.
ja: パスワードを確認入力してください。
ko: 암호를 확인하세요.
zh_hans: 确认密码。
zh_hant: 請確認密碼。
