Repository: dotnet/fsharp
Catalog: vsintegration/src/FSharp.ProjectSystem.PropertyPages/Resources/xlf/Microsoft.VisualStudio.Editors.Designer.*.xlf
Languages: cs, de, es, ja, ko, zh_hans, zh_hant

# SD_FullDescriptionText
source: Application settings allow you to store and retrieve property settings and other information for your application dynamically. For example, the application can save a user's color preferences, then retrieve them the next time it runs.
cs: Nastavení aplikace umožňují dynamicky uchovávat a načítat nastavení vlastností a jiné informace o aplikaci. Aplikace může třeba uložit předvolby barev uživatele a načíst je při dalším spuštění.
de: Mithilfe von Anwendungseinstellungen können Eigenschafteneinstellungen und andere Informationen für die Anwendung dynamisch gespeichert und abgerufen werden. So können beispielsweise die Farbeinstellungen eines Benutzers gespeichert und bei der nächsten Ausführung der Anwendung abgerufen werden.
es: La configuración de la aplicación permite almacenar y recuperar de forma dinámica la configuración de propiedades y otra información de la aplicación. Por ejemplo, la aplicación puede guardar las preferencias de color de un usuario y recuperarlas la próxima vez que se ejecute.
ja: アプリケーション設定によって、アプリケーションのプロパティ設定とその他の情報を、動的に格納、取得することができます。たとえば、アプリケーションでユーザーのカラー設定が保存された後、次回実行時にその設定を取得することができます。
ko: 애플리케이션 설정에서 애플리케이션에 대한 속성 설정 및 기타 정보를 동적으로 저장하고 가져올 수 있습니다. 예를 들어 사용자의 색 기본 설정을 저장하여 다음에 애플리케이션이 실행될 때 이 설정을 가져올 수 있습니다.
zh_hans: 应用程序设置允许动态存储和检索应用程序的属性设置和其他信息。例如，应用程序可以保存用户的颜色首选项，然后在下次运行时检索它们。
zh_hant: 應用程式設定可以讓您動態儲存及擷取應用程式的屬性設定和其他資訊。例如，應用程式可以儲存使用者的色彩偏好設定，然後下次執行應用程式時再擷取這些設定。

# SD_LinkPartOfDescriptionText
source: Learn more about application settings...
cs: Další informace o nastavení aplikace...
de: Weitere Informationen zu Anwendungseinstellungen...
es: Aprender más acerca de la configuración de la aplicación...
ja: アプリケーション設定に関する詳細の表示...
ko: 애플리케이션 설정에 대한 자세한 정보...
zh_hans: 了解有关应用程序设置的更多信息...
zh_hant: 進一步了解有關應用程式設定...

# SD_IncludeSensitiveInfoInConnectionStringWarning
source: This connection string appears to contain sensitive data (for example, a password), which is required to connect to the database. However, storing sensitive data in the connection string can be a security risk. Do you want to include sensitive data in the connection string?
cs: Připojovací řetězec pravděpodobně obsahuje citlivá data (například heslo), která jsou potřeba pro připojení k databázi. Uchovávání citlivých dat v připojovacím řetězci ale může představovat bezpečnostní riziko. Chcete do připojovacího řetězce zahrnout citlivá data?
de: Diese Verbindungszeichenfolge enthält offenbar vertrauliche Daten, die zum Herstellen der Verbindung mit der Datenbank erforderlich sind (beispielsweise ein Kennwort). Das Speichern vertraulicher Daten in der Verbindungszeichenfolge kann ein Sicherheitsrisiko darstellen. Sollen vertrauliche Daten in die Verbindungszeichenfolge einbezogen werden?
es: Esta cadena de conexión parece contener datos confidenciales (por ejemplo una contraseña), que son necesarios para conectarse a la base de datos. Sin embargo, almacenar información confidencial en la cadena de conexión puede suponer un riesgo para la seguridad. ¿Quiere incluir datos confidenciales en la cadena de conexión?
ja: この接続文字列にはデータベース接続に必要な重要情報 (例: パスワード) が含まれています。しかし、接続文字列内に重要な情報を保存すると、セキュリティ上のリスクが発生する可能性があります。接続文字列にこの重要情報を含めますか?
ko: 데이터베이스 연결에 필요한 중요한 데이터(예: 암호)가 연결 문자열에 들어 있는 것 같습니다. 중요한 데이터를 연결 문자열에 저장하면 보안에 문제가 발생할 수 있습니다. 중요한 데이터를 연결 문자열에 포함하시겠습니까?
zh_hans: 此连接字符串中似乎包含连接到数据库所需的敏感数据(例如密码)。而在连接字符串中存储敏感数据会带来安全风险。是否要在连接字符串中包含敏感数据?
zh_hant: 這個連接字串似乎含有連接資料庫所需的敏感性資料 (例如密碼)。但是，將敏感性資料儲存在連接字串中可能會有安全性的風險。要在連接字串中包含敏感性資料嗎?

# SD_SelectATypeTreeView_AccessibleName
source: Select a Type
cs: Vyberte typ
de: Typ auswählen
es: Seleccionar un tipo
ja: 種類の選択
ko: 형식 선택
zh_hans: 选择类型
zh_hant: 選取類型

# SD_CODEGENCMT_COMMON1
source: This class allows you to handle specific events on the settings class:
cs: Tato třída umožňuje zpracovávat specifické události v třídě nastavení:
de: Diese Klasse ermöglicht die Behandlung bestimmter Ereignisse der Einstellungsklasse:
es: Esta clase le permite controlar eventos específicos en la clase de configuración:
ja: このクラスでは設定クラスでの特定のイベントを処理することができます:
ko: 이 클래스를 사용하여 설정 클래스에 대한 특정 이벤트를 처리할 수 있습니다:
zh_hans: 通过此类可以处理设置类的特定事件:
zh_hant: 這個類別可以讓您處理設定類別上的特定事件:

# SD_CODEGENCMT_COMMON2
source: The SettingChanging event is raised before a setting's value is changed.
cs: Událost SettingChanging se vyvolá před změnou hodnoty nastavení.
de: Das SettingChanging-Ereignis wird ausgelöst, bevor der Wert einer Einstellung geändert wird.
es: El evento SettingChanging se desencadena antes de cambiar un valor de configuración.
ja: SettingChanging イベントは、設定値が変更される前に発生します。
ko: SettingChanging 이벤트는 설정 값이 변경되기 전에 발생합니다.
zh_hans: 在更改某个设置的值之前将引发 SettingChanging 事件。
zh_hant: 在設定值變更之前引發 SettingChanging 事件。

# SD_CODEGENCMT_COMMON3
source: The PropertyChanged event is raised after a setting's value is changed.
cs: Událost PropertyChanged se vyvolá po změně hodnoty nastavení.
de: Das PropertyChanged-Ereignis wird ausgelöst, nachdem der Wert einer Einstellung geändert wurde.
es: El evento PropertyChanged se desencadena después de cambiar el valor de configuración.
ja: PropertyChanged イベントは、設定値が変更された後に発生します。
ko: PropertyChanged 이벤트는 설정 값이 변경된 후에 발생합니다.
zh_hans: 在更改某个设置的值之后将引发 PropertyChanged 事件。
zh_hant: 在設定值變更之後引發 PropertyChanged 事件。

# SD_CODEGENCMT_COMMON4
source: The SettingsLoaded event is raised after the setting values are loaded.
cs: Událost SettingsLoaded se vyvolá po načtení hodnot nastavení.
de: Das SettingsLoaded-Ereignis wird ausgelöst, nachdem die Einstellungswerte geladen wurden.
es: El evento SettingsLoaded se desencadena después de cargar los valores de configuración.
ja: SettingsLoaded イベントは、設定値が読み込まれた後に発生します。
ko: SettingsLoaded 이벤트는 설정 값이 로드된 후에 발생합니다.
zh_hans: 在加载设置值之后将引发 SettingsLoaded 事件。
zh_hant: 在載入設定值之後引發 SettingsLoaded 事件。

# SD_CODEGENCMT_COMMON5
source: The SettingsSaving event is raised before the setting values are saved.
cs: Událost SettingsSaving se vyvolá před uložením hodnot nastavení.
de: Das SettingsSaving-Ereignis wird ausgelöst, bevor die Einstellungswerte gespeichert werden.
es: El evento SettingsSaving se desencadena antes de guardar los valores de configuración.
ja: SettingsSaving イベントは、設定値が保存される前に発生します。
ko: SettingsSaving 이벤트는 설정 값이 저장되기 전에 발생합니다.
zh_hans: 在保存设置值之前将引发 SettingsSaving 事件。
zh_hant: 在儲存設定值之前引發 SettingsSaving 事件。

# SD_CODEGENCMT_HOWTO_ATTACHEVTS
source: To add event handlers for saving and changing settings, uncomment the lines below:
cs: Pro přidávání obslužných rutin událostí určených pro ukládání a změnu nastavení odkomentujte prosím níže uvedené řádky:
de: Heben Sie die Auskommentierung der unten angezeigten Zeilen auf, um Ereignishandler zum Speichern und Ändern von Einstellungen hinzuzufügen:
es: Para agregar los controladores de eventos para guardar y cambiar la configuración, quite la marca de comentario de las líneas:
ja: 設定の保存と変更のイベント ハンドラーを追加するには、以下の行のコメントを解除します:
ko: 설정을 저장 및 변경하기 위한 이벤트 처리기를 추가하려면 아래 줄에서 주석 처리를 제거하세요:
zh_hans: 若要为保存和更改设置添加事件处理程序，请取消注释下列行:
zh_hant: 若要加入用於儲存與變更設定的事件處理常式，請取消註解下列程式行:

# SD_CODEGENCMT_HANDLE_CHANGING
source: Add code to handle the SettingChangingEvent event here.
cs: Kód pro zpracování události SettingChangingEvent přidejte sem.
de: Fügen Sie hier Code zum Behandeln des SettingChangingEvent-Ereignisses hinzu.
es: Agregar código para administrar aquí el evento SettingChangingEvent.
ja: SettingChangingEvent イベントを処理するコードをここに追加してください。
ko: SettingChangingEvent 이벤트를 처리하는 코드를 여기에 추가하세요.
zh_hans: 在此处添加用于处理 SettingChangingEvent 事件的代码。
zh_hant: 在此加入程式碼以處理 SettingChangingEvent 事件。

# SD_CODEGENCMT_HANDLE_SAVING
source: Add code to handle the SettingsSaving event here.
cs: Kód pro zpracování události SettingsSaving přidejte sem.
de: Fügen Sie hier Code zum Behandeln des SettingsSaving-Ereignisses hinzu.
es: Agregar código para administrar aquí el evento SettingsSaving.
ja: SettingsSaving イベントを処理するコードをここに追加してください。
ko: SettingsSaving 이벤트를 처리하는 코드를 여기에 추가하세요.
zh_hans: 在此处添加用于处理 SettingsSaving 事件的代码。
zh_hant: 在此加入程式碼以處理 SettingsSaving 事件。

# SD_CODEGEN_FAILEDOPENCREATEEXTENDINGFILE
source: Failed to create or open file.
cs: Otevření nebo vytvoření souboru selhalo.
de: Fehler beim Erstellen oder Öffnen einer Datei.
es: Error al crear o abrir el archivo.
ja: ファイルを作成、または開くことができませんでした。
ko: 파일을 만들거나 열지 못했습니다.
zh_hans: 未能创建或打开文件。
zh_hant: 無法建立或開啟檔案。

# SD_DESCR_Description
source: Description of the setting.
cs: Popis nastavení.
de: Die Beschreibung der Einstellung.
es: Descripción del valor de configuración.
ja: 設定の説明です。
ko: 설정에 대한 설명입니다.
zh_hans: 设置说明。
zh_hant: 設定的描述。

# SD_DESCR_GenerateDefaultValueInCode
source: Specifies whether or not the default setting value should be generated in the strongly-typed settings class.
cs: Určuje, jestli se má výchozí hodnota nastavení generovat ve třídě nastavení se silnými typy.
de: Gibt an, ob der Standardeinstellungswert in der stark typisierten Einstellungsklasse generiert werden soll.
es: Especifica si el valor de configuración predeterminado debe generarse o no en la clase de configuración fuertemente tipada.
ja: 既定値を、厳密に型指定された設定クラスで生成するかどうかを指定します。
ko: 강력한 형식의 설정 클래스에서 기본 설정 값을 생성할지 여부를 지정합니다.
zh_hans: 指定是否应在强类型设置类中生成默认设置值。
zh_hant: 指定是否應該在強類型設定類別中產生預設的設定值。

# SD_DESCR_Group
source: Specifies the group to which this Settings file belongs.
cs: Určuje skupinu, do které tento soubor nastavení patří.
de: Gibt die Gruppe an, zu der diese Einstellungsdatei gehört.
es: Especifica el grupo al que pertenece este archivo de configuración.
ja: この設定ファイルが属するグループを指定します。
ko: 이 설정 파일이 속하는 그룹을 지정합니다.
zh_hans: 指定此设置文件所属的组。
zh_hant: 指定此設定檔所屬的群組。

# SD_DESCR_GroupDescription
source: Description of the group to which this Settings file belongs.
cs: Popis skupiny, do které soubor nastavení patří
de: Beschreibung der Gruppe, zu der diese Einstellungsdatei gehört.
es: Descripción del grupo al que pertenece este archivo de configuración.
ja: この設定ファイルが属するグループの説明です。
ko: 이 설정 파일이 속하는 그룹에 대한 설명입니다.
zh_hans: 对此设置文件所属组的说明。
zh_hant: 此設定檔所屬群組的說明。

# SD_DESCR_Roaming
source: Indicates whether the setting should roam when Windows roaming profiles are enabled.
cs: Určuje, jestli může nastavení používat roaming, pokud jsou povolené cestovní profily systému Windows.
de: Gibt an, ob die Einstellung auf dem Server gespeichert werden soll, wenn servergespeicherte Profile in Windows aktiviert sind.
es: Indica si la configuración debe ser itinerante cuando están habilitados los perfiles itinerantes de Windows.
ja: Windows 移動プロファイルが有効になっているときに設定を移動するかどうかを示します。
ko: Windows 로밍 프로필이 사용되는 경우 설정을 로밍할지 여부를 나타냅니다.
zh_hans: 指示在启用 Windows 漫游配置文件时，设置是否应漫游。
zh_hant: 表示啟用 Windows 漫遊設定檔時是否要使用漫遊設定。

# SD_DESCR_Name
source: Name used to identify the setting.
cs: Název používaný k identifikaci nastavení
de: Name zur Identifizierung der Einstellung.
es: Nombre utilizado para identificar la configuración.
ja: 設定を識別するために使用する名前です。
ko: 설정을 식별하는 데 사용되는 이름입니다.
zh_hans: 用于标识设置的名称。
zh_hant: 用來識別設定的名稱。

# SD_DESCR_Provider
source: The provider (System.Configuration.Provider.ProviderBase) used to manage the setting.
cs: Poskytovatel (System.Configuration.Provider.ProviderBase) používaný pro správu nastavení.
de: Der Anbieter (System.Configuration.Provider.ProviderBase) zum Verwalten der Einstellung.
es: El proveedor System.Configuration.Provider.ProviderBase utilizado para administrar la configuración.
ja: 設定の管理に使用されるプロバイダー (System.Configuration.Provider.ProviderBase) です。
ko: 설정을 관리하는 데 사용되는 공급자(System.Configuration.Provider.ProviderBase)입니다.
zh_hans: 用于管理设置的提供程序(System.Configuration.Provider.ProviderBase)。
zh_hant: 用來管理設定的提供者 (System.Configuration.Provider.ProviderBase)。

# SD_DESCR_Scope
source: Specifies whether the setting is per-application (read-only) or per-user (read-write).
cs: Určuje, jestli je nastavení vázané na aplikaci (jen pro čtení) nebo na uživatele (čtení i zápis).
de: Gibt an, ob die Einstellung pro Anwendung (schreibgeschützt) oder pro Benutzer (Lesen/Schreiben) gilt.
es: Especifica si la configuración es por aplicación (solo lectura) o por usuario (lectura-escritura).
ja: 設定がアプリケーションごと (読み取り専用) であるか、ユーザーごと (編集可能) であるかを指定します
ko: 설정이 애플리케이션별로 적용되는지(읽기 전용) 사용자별로 적용되는지(읽기/쓰기) 여부를 지정합니다.
zh_hans: 指定这是一个逐应用程序的设置(只读)，还是一个逐用户的设置(读写)。
zh_hant: 指定設定是針對應用程式 (唯讀) 或是針對使用者 (讀寫)。

# SD_DESCR_SerializedSettingType
source: The setting will be generated as this type in the strongly-typed settings class. For example, the setting might be generated as a String or Integer object.
cs: Nastavení se vygeneruje do tučně napsané třídy nastavení jako tento typ. Nastavení může být vygenerované třeba jako objekt řetězce nebo celočíselné hodnoty.
de: Die Einstellung wird in der stark typisierten Einstellungsklasse als dieser Typ generiert. So kann die Einstellung etwa als Zeichenfolgen- oder Ganzzahlobjekt generiert werden.
es: El valor de configuración se generará con este tipo en la clase de configuración fuertemente tipada. Por ejemplo, el valor de configuración podría generarse como un objeto String o Integer.
ja: この設定は、この型として厳密に型指定された設定クラスで生成されます。たとえば、設定は String または Integer オブジェクトとして生成されます。
ko: 강력한 형식의 설정 클래스에 이 형식으로 설정이 생성됩니다. 예를 들어 설정이 String 또는 Integer 개체로 생성될 수 있습니다.
zh_hans: 在强类型设置类中，此设置将生成为此类型。例如，设置可能生成为 String 或 Integer 对象。
zh_hant: 將會在強型別設定類別中以此類型產生設定。例如，可能會將設定產生為 String 或 Integer 物件。

# SD_DESCR_Value
source: The current value for the setting.
cs: Aktuální hodnota pro nastavení
de: Der aktuelle Wert der Einstellung.
es: El valor actual de la configuración.
ja: 設定用の現在の値です。
ko: 설정의 현재 값입니다.
zh_hans: 设置的当前值。
zh_hant: 目前的設定值。

# SD_SyncFiles_1Arg
source: The following files will be deleted: {0}
cs: Následující soubory budou odstraněny: {0}
de: Folgende Dateien werden gelöscht: {0}
es: Los archivos siguientes se eliminarán: {0}
ja: 次のファイルは削除されます: {0}
ko: 다음 파일이 삭제됩니다. {0}
zh_hans: 将删除下列文件: {0}
zh_hant: 下列檔案將刪除: {0}

# SD_SyncFilesNoFilesFound_1Arg
source: No user.config files were found in any of the following locations: {0}
cs: Soubory user.config se nenašly v žádném z následujících umístění: {0}
de: An keinem der folgenden Speicherorte wurden Dateien vom Typ "user.config" gefunden: {0}
es: No se han encontrado archivos user.config en ninguna de las siguientes ubicaciones: {0}
ja: 次のいずれの場所でも user.config ファイルが見つかりませんでした: {0}
ko: 다음 위치에서 user.config 파일을 찾을 수 없습니다. {0}
zh_hans: 在下列任何一个位置中均未找到 user.config 文件: {0}
zh_hant: 在下列位置中找不到 user.config 檔案: {0}

# SD_SyncFilesOneOrMoreFailed
source: One or more user.config files was not removed.
cs: Jeden nebo víc souborů user.config se neodstranil.
de: Mindestens eine user.config-Datei wurde entfernt.
es: No se pudieron quitar uno o varios archivos user.config.
ja: 1 つ以上の user.config ファイルが削除されませんでした。
ko: 하나 이상의 user.config 파일을 제거하지 못했습니다.
zh_hans: 一个或多个 user.config 文件没有删除。
zh_hant: 一或多個 user.config 檔案尚未移除。

# SD_SFG_AutoSaveRegionText
source: My.Settings Auto-Save Functionality
cs: Funkce automatického ukládání objektu My.Settings
de: Automatische My.Settings-Speicherfunktion
es: Funcionalidad para autoguardar My.Settings
ja: My.Settings 自動保存機能
ko: My.Settings 자동 저장 기능
zh_hans: My.Settings 自动保存功能
zh_hant: My.Settings 自動儲存功能

# General_MissingService
source: Unable to find service '{0}'. Ensure that the application is installed correctly.
cs: Službu {0} se nepodařilo najít. Ověřte, jestli je aplikace správně nainstalovaná.
de: Der Dienst "{0}" wurde nicht gefunden. Vergewissern Sie sich, dass die Anwendung korrekt installiert ist.
es: No se encuentra el servicio '{0}'. Asegúrese de que la aplicación se ha instalado correctamente.
ja: サービス '{0}' が見つかりません。アプリケーションが正しくインストールされていることを確認してください。
ko: '{0}' 서비스를 찾을 수 없습니다. 애플리케이션이 제대로 설치되어 있는지 확인하세요.
zh_hans: 无法找到服务“{0}”。请确保已正确安装该应用程序。
zh_hant: 找不到服務 '{0}'。請確認此應用程式已正確安裝。

# PPG_Application_RootNamespaceJSharp
source: Default pac&kage:
cs: Výchozí balíče&k:
de: &Standardpaket:
es: Pa&quete predeterminado:
ja: 既定のパッケージ(&K):
ko: 기본 패키지(&K):
zh_hans: 默认包(&K):
zh_hant: 預設套件(&K):

# RSE_AccessModifier_Custom
source: (Custom)
cs: (vlastní)
de: (Benutzerdefiniert)
es: (Personalizado)
ja: (カスタム)
ko: (사용자 지정)
zh_hans: (自定义)
zh_hant: (自訂)

# RSE_NoCodeGeneration
source: No code generation
cs: Bez generování kódu
de: Keine Codegenerierung
es: Sin generación de código
ja: コード生成なし
ko: 코드 생성 안 됨
zh_hans: 无代码生成
zh_hant: 沒有程式碼產生

# PPG_WindowsApp_WPF
source: WPF Application
cs: Aplikace WPF
de: WPF-Anwendung
es: Aplicación WPF
ja: WPF アプリケーション
ko: WPF 애플리케이션
zh_hans: WPF 应用程序
zh_hant: WPF 應用程式

# PPG_WPFApp_InvalidShutdownMode
source: (Invalid value: "{0}")
cs: (neplatná hodnota: {0})
de: (Ungültiger Wert: {0})
es: (Valor no válido: "{0}")
ja: (無効な値: "{0}")
ko: (잘못된 값: "{0}")
zh_hans: (无效值:“{0}”)
zh_hant: (無效值: "{0}")

# PPG_WPFApp_ShutdownMode_OnExplicitShutdown
source: On explicit shutdown
cs: Při jednoznačném vypnutí
de: Beim expliziten Herunterfahren
es: Al apagar explícitamente
ja: 明示的にシャットダウンするとき
ko: 명시적으로 종료할 때
zh_hans: 在显式关闭时
zh_hant: 在明確關機時

# PPG_WPFApp_ShutdownMode_OnLastWindowClose
source: On last window close
cs: Při zavření posledního okna
de: Beim Schließen des letzten Fensters
es: Al cerrar la última ventana
ja: 最後のウィンドウを閉じるとき
ko: 마지막 창을 닫을 때
zh_hans: 在上一窗口关闭时
zh_hant: 在最後一個視窗關閉時

# PPG_WPFApp_ShutdownMode_OnMainWindowClose
source: On main window close
cs: Při zavření hlavního okna
de: Beim Schließen des Hauptfensters
es: Al cerrar la ventana principal
ja: メイン ウィンドウを閉じるとき
ko: 주 창을 닫을 때
zh_hans: 在主窗口关闭时
zh_hant: 在主視窗關閉時

# PPG_WPFApp_Xaml_CouldntFindRootElement
source: Could not find the expected root element "{0}" in the application definition file.
cs: V souboru definice aplikace se nepovedlo nají očekávaný kořenový element {0}.
de: Das erwartete Stammelement "{0}" konnte in der Anwendungsdefinitionsdatei nicht gefunden werden.
es: No se pudo encontrar el elemento raíz esperado "{0}" en el archivo de definición de aplicación.
ja: 必要なルート要素 "{0}" がアプリケーション定義ファイル内に見つかりません。
ko: 애플리케이션 정의 파일에서 필요한 루트 요소 "{0}"을(를) 찾을 수 없습니다.
zh_hans: 未能在应用程序定义文件中找到需要的根元素“{0}”。
zh_hant: 應用程式定義檔案中找不到預期的根項目 "{0}"。

# PPG_WPFApp_Xaml_UnexpectedFormat_2Args
source: The .xaml file was in an unexpected format, near line {0} column {1}.
cs: Soubor .xaml má blízko řádku {0} a sloupce {1} nečekaný formát.
de: Die XAML-Datei enthält ein unerwartetes Format in der Nähe von Zeile {0}, Spalte {1}.
es: El archivo .xaml tenía un formato no esperado cerca de la línea {0}, columna {1}.
ja: .xaml ファイルの行 {0} 列 {1} 付近が予期せぬ形式です。
ko: .xaml 파일의 줄 {0} 열 {1} 근처에 예기치 않은 형식이 있습니다.
zh_hans: .xaml 文件在行 {0} 列 {1} 附近出现格式错误。
zh_hant: 此 .xaml 檔在第 {0} 行第 {1} 欄不是預期的格式。

# PPG_Application_StartupObjectLabelText
source: Startup &object:
cs: Sp&ouštěcí objekt:
de: &Startobjekt:
es: Objeto de &inicio:
ja: スタートアップ オブジェクト(&O):
ko: 시작 개체(&O):
zh_hans: 启动对象(&O):
zh_hant: 啟動物件(&O):

# PPG_Application_StartupUriLabelText
source: Startup &URI:
cs: Spo&uštěcí URI:
de: &Start-URI:
es: URI de &inicio:
ja: スタートアップ URI(&U):
ko: 시작 URI(&U):
zh_hans: 启动 URI (&U):
zh_hant: 啟動 URI(&U):

# PPG_WPFApp_AppXamlOpenInUnsupportedEditor
source: The application definition file is already opened in an incompatible editor. Please close the other editor and reload the project properties page.
cs: Definiční soubor aplikace už je otevřený v nekompatibilním editoru. Zavřete prosím druhý editor a znovu načtěte stránku vlastností projektu.
de: Die Anwendungsdefinitionsdatei ist bereits in einem inkompatiblen Editor geöffnet. Schließen Sie den anderen Editor, und laden Sie die Projekteigenschaftenseite neu.
es: El archivo de definición de aplicación ya está abierto en un editor incompatible. Cierre el otro editor y recargue la página de propiedades del proyecto.
ja: アプリケーション定義ファイルが互換性のないエディターで既に開かれています。そのエディターを終了してから、プロジェクト プロパティ ページを再度読み込んでください。
ko: 호환되지 않는 편집기에 애플리케이션 정의 파일이 이미 열려 있습니다. 다른 편집기를 닫고 프로젝트 속성 페이지를 다시 로드하세요.
zh_hans: 应用程序定义文件已在不兼容的编辑器中打开。请关闭其他编辑器并重新加载项目属性页。
zh_hant: 此應用程式定義檔案已經在不相容的編輯器中開啟。請先關閉其他編輯器，然後重新載入此專案屬性頁。

# PPG_WPFApp_CantOpenOrCreateAppXaml_1Arg
source: There was an error trying to open or create the application definition file for this project. {0}
cs: Při pokusu o otevření nebo vytvoření souboru definice aplikace tohoto projektu došlo k chybě. {0}
de: Fehler beim Öffnen oder Erstellen der Anwendungsdefinitionsdatei für dieses Projekt. {0}
es: Error al intentar abrir o crear el archivo de definición de aplicación para este proyecto. {0}
ja: このプロジェクトのアプリケーション定義ファイルを開くときまたは作成するときにエラーが発生しました。{0}
ko: 이 프로젝트에 대한 애플리케이션 정의 파일을 열거나 만드는 동안 오류가 발생했습니다. {0}
zh_hans: 尝试为此项目打开或创建应用程序定义文件时出错。 {0}
zh_hant: 嘗試開啟或建立此專案的應用程式定義檔案時發生錯誤。{0}

# PPG_WPFApp_ErrorControlMessage_1Arg
source: An error occurred trying to load the application definition file for this project. The file '{0}' could not be parsed. Please edit the file in the XAML editor to fix the error.
cs: Při pokusu o načtení definičního souboru aplikace pro tento projekt došlo k chybě. Soubor {0} se nedá parsovat. Opravte prosím chybu úpravou souboru v editoru XAML.
de: Fehler beim Laden der Anwendungsdefinitionsdatei für dieses Projekt. Die Datei "{0}" konnte nicht analysiert werden. Bearbeiten Sie die Datei im XAML-Editor, um den Fehler zu beheben.
es: Error al intentar cargar el archivo de definición de aplicación para este proyecto. El archivo '{0}' no se puede analizar. Edite el archivo en el editor XAML para corregir el error.
ja: このプロジェクトのアプリケーション定義ファイルを読み込むときにエラーが発生しました。ファイル '{0}' を解析できませんでした。XAML エディターでファイルを編集してエラーを修正してください。
ko: 이 프로젝트에 대한 애플리케이션 정의 파일을 로드하는 동안 오류가 발생했습니다. '{0}' 파일을 구문 분석할 수 없습니다. 오류를 수정하려면 XAML 편집기에서 파일을 편집하세요.
zh_hans: 尝试加载此项目的应用程序定义文件时出错。未能分析文件“{0}”。请在 XAML 编辑器中编辑此文件以修复错误。
zh_hant: 嘗試載入此專案的應用程式定義檔案時發生錯誤。無法剖析檔案 '{0}'。請在 XAML 編輯器中編輯此檔案以修正錯誤。

# PPG_WPFApp_CantReadPropertyValue
source: (Error)
cs: (chyba)
de: (Fehler)
ja: (エラー)
ko: (오류)
zh_hans: (错误)
zh_hant: (錯誤)

# PPG_Unexpected
source: An unspecified error has occurred.
cs: Došlo k nespecifikované chybě.
de: Unbekannter Fehler.
es: Error no especificado.
ja: 不明なエラーが発生しました。
ko: 알 수 없는 오류가 발생했습니다.
zh_hans: 发生未指定的错误。
zh_hant: 發生未指定的錯誤。

# PPG_WPFApp_CantFindAppXaml
source: This project does not contain an application definition file.
cs: Tento projekt neobsahuje soubor definice aplikace.
de: Dieses Projekt enthält keine Anwendungsdefinitionsdatei.
es: Este proyecto no contiene un archivo de definición de aplicación.
ja: このプロジェクトには、アプリケーション定義ファイルが含まれていません。
ko: 이 프로젝트에 애플리케이션 정의 파일이 없습니다.
zh_hans: 此项目不包含应用程序定义文件。
zh_hant: 此專案未包含應用程式定義檔案。

# PPG_WPFApp_CouldntCreateApplicationEventsFile_1Arg
source: An error occurred trying to create the application events file. {0}
cs: Při pokusu o vytvoření souboru událostí aplikace došlo k chybě. {0}
de: Fehler beim Erstellen der Anwendungsereignisdatei. {0}
es: Error al intentar crear el archivo de eventos de la aplicación. {0}
ja: アプリケーション イベント ファイルを作成するときにエラーが発生しました。{0}
ko: 애플리케이션 이벤트 파일을 만드는 동안 오류가 발생했습니다. {0}
zh_hans: 尝试创建应用程序事件文件时出错。 {0}
zh_hant: 嘗試建立應用程式事件檔時發生錯誤。{0}

# General_InvalidArgument_1Arg
source: Invalid argument '{0}'
cs: Neplatný argument {0}
de: Ungültiges Argument: {0}
es: Argumento '{0}' no válido
ja: 無効な引数 '{0}'
ko: '{0}' 인수가 잘못되었습니다.
zh_hans: 参数“{0}”无效
zh_hant: 引數 '{0}' 無效

# PPG_CommandLineApp_WPF
source: WPF Console Application
cs: Konzolová aplikace WPF
de: WPF-Konsolenanwendung
es: Aplicación de consola WPF
ja: WPF コンソール アプリケーション
ko: WPF 콘솔 애플리케이션
zh_hans: WPF 控制台应用程序
zh_hant: WPF 主控台應用程式

# PPG_WindowsClassLib_WPF
source: WPF Class Library
cs: Knihovna tříd WPF
de: WPF-Klassenbibliothek
es: Biblioteca de clases WPF
ja: WPF クラス ライブラリ
ko: WPF 클래스 라이브러리
zh_hans: WPF 类库
zh_hant: WPF 類別庫

# PPG_Application_DefaultManifestText
source: Embed manifest with default settings
cs: Vložit manifest s výchozím nastavením
de: Manifest mit Standardeinstellungen einbetten
es: Incrustar manifiesto con configuración predeterminada
ja: マニフェストを既定の設定で埋め込みます
ko: 기본 설정으로 구성된 매니페스트 포함
zh_hans: 嵌入带默认设置的清单
zh_hant: 用預設設定嵌入資訊清單
