Repository: dotnet/fsharp
Catalog: vsintegration/src/FSharp.ProjectSystem.PropertyPages/Resources/xlf/Microsoft.VisualStudio.Editors.Designer.*.xlf
Languages: cs, de, es, ja, ko, zh_hans, zh_hant

# RSE_Err_CantSaveResource_1Arg
source: Resource '{0}' cannot be saved to a file.
cs: Prostředek {0} se do souboru nedá uložit.
de: Die Ressource "{0}" kann nicht in einer Datei gespeichert werden.
es: No se puede guardar en un archivo el recurso '{0}'.
ja: リソース '{0}' をファイルに保存できません。
ko: '{0}' 리소스를 파일에 저장할 수 없습니다.
zh_hans: 无法将资源“{0}”保存到文件中。
zh_hant: 無法將資源 '{0}' 儲存到檔案中。

# RSE_Err_UserCancel
source: The operation has been canceled by the user.
cs: Operace se přerušila na žádost uživatele.
de: Der Vorgang wurde benutzerseitig abgebrochen.
es: El usuario canceló la operación.
ja: 操作はユーザーによって取り消されました。
ko: 사용자가 작업을 취소했습니다.
zh_hans: 用户已取消该操作。
zh_hant: 使用者已取消作業。

# RSE_Err_BadData
source: The resource value contains invalid data or has an incorrect format.
cs: Hodnota prostředku obsahuje neplatná data, nebo má chybný formát.
de: Der Ressourcenwert enthält ungültige Daten oder hat ein falsches Format.
es: El valor del recurso contiene datos no válidos o no tiene el formato correcto.
ja: リソース値に無効なデータまたは適切ではない形式が含まれています。
ko: 리소스 값에 잘못된 데이터가 있거나 리소스 값의 형식이 잘못되었습니다.
zh_hans: 资源值包含无效数据或格式不正确。
zh_hant: 資源值含有無效資料，或者格式不正確。

# RSE_Err_BadIdentifier_2Arg
source: The name of the resource '{0}' cannot be used as a valid identifier, because it contains one or more invalid characters: '{1}'. Please remove or replace those characters and try again.
cs: Název prostředku {0} nejde použít jako platný identifikátor, protože obsahuje jeden nebo více neplatných znaků: {1}. Odeberte prosím tyto znaky nebo je nahraďte a zkuste to znovu.
de: Der Name der Ressource "{0}" kann nicht als gültiger Bezeichner verwendet werden, da er mindestens ein ungültiges Zeichen enthält: {1}. Entfernen oder ersetzen Sie die Zeichen, und versuchen Sie es noch einmal.
es: El nombre del recurso '{0}' no se puede usar como un identificador válido, porque contiene uno o varios caracteres no válidos: '{1}'. Quite o reemplace esos caracteres y vuelva a intentarlo.
ja: リソース '{0}' の名前には 1 つまたは複数の無効な文字 '{1}' が含まれているので、有効な識別子として使用できません。これらの文字を削除するか別の文字に置き換えてからもう一度やり直してください。
ko: '{0}' 리소스의 이름에 잘못된 문자({1})가 하나 이상 있으므로 이 이름을 올바른 식별자로 사용할 수 없습니다. 해당 문자를 제거하거나 바꾸고 다시 시도하세요.
zh_hans: 资源“{0}”的名称无法用作有效的标识符，因为其含有一个或多个无效字符:“{1}”。请删除或替换这些字符，然后重试。
zh_hant: 資源 '{0}' 的名稱無法作為有效的識別碼，因為它含有一或多個無效的字元: '{1}'。請移除或取代這些字元後再試一次。

# RSE_Err_MaxFilesLimitation
source: Too many files specified. Please select fewer files and try again.
cs: Vybrali jste příliš mnoho souborů. Vyberte prosím méně souborů a zkuste to znovu.
de: Es wurden zu viele Dateien angegeben. Wählen Sie weniger Dateien aus, und versuchen Sie es noch einmal.
es: Se han especificado demasiados archivos. Seleccione menos archivos y vuelva a intentarlo.
ja: 指定したファイルが多すぎます。選択するファイルを少なくして、もう一度やり直してください。
ko: 파일을 너무 많이 지정했습니다. 현재 지정한 파일에서 몇 개를 빼고 다시 시도하세요.
zh_hans: 指定的文件过多。请少选一些文件，然后重试。
zh_hant: 指定了太多檔案，請少選一些檔案後再試一次。

# RSE_Err_InternalException
source: Unexpected error.
cs: Nečekaná chyba.
de: Unerwarteter Fehler.
es: Error inesperado.
ja: 予期しないエラーです。
ko: 예기치 않은 오류가 발생했습니다.
zh_hans: 意外错误。
zh_hant: 未預期的錯誤。

# RSE_Err_Unexpected_NoResource_1Arg
source: Unable to load internal localized resource '{0}'.
cs: Nepodařilo se načíst vnitřně umístěný prostředek '{0}'.
de: Die interne lokalisierte Ressource "{0}" kann nicht geladen werden.
es: No se pudo cargar el recurso adaptado interno '{0}'.
ja: ローカライズされた内部リソース '{0}' を読み込めません。
ko: 지역화된 내부 리소스 '{0}'을(를) 로드할 수 없습니다.
zh_hans: 无法加载内部本地化资源“{0}”。
zh_hant: 無法載入內部的當地語系化資源 '{0}'。

# RSE_Err_CantConvertFromString_2Args
source: The value could not be converted into a resource of type {0}. {1}
cs: Hodnota nebyla převedena na prostředek typu {0}. {1}
de: Der Wert konnte nicht in eine Ressource vom Typ "{0}" konvertiert werden. {1}
es: El valor no se puede convertir en un recurso de tipo {0}. {1}
ja: 型 {0} のリソースに値を変換できませんでした。 {1}
ko: 값을 {0} 형식의 리소스로 변환할 수 없습니다. {1}
zh_hans: 未能将该值转换为 {0} 类型的资源。 {1}
zh_hant: 無法將值轉換成 {0} 類型的資源。 {1}

# RSE_Err_CantUseEmptyValue
source: The value cannot be empty in a resource of type {0}.
cs: Hodnota v prostředku typu {0} nemůže být prázdná.
de: Der Wert kann in einer Ressource vom Typ "{0}" nicht leer sein.
es: El valor no puede estar vacío en un recurso de tipo {0}.
ja: 型 {0} のリソースで値を空にすることはできません。
ko: {0} 형식의 리소스에서는 해당 값을 비워 둘 수 없습니다.
zh_hans: 该值在 {0} 类型的资源中不能是空的。
zh_hant: 在 {0} 類型的資源中值不可為空白。

# RSE_Err_CantBeEmpty
source: One or more of the selected resource values could not be cleared.
cs: Jednu nebo více hodnot prostředků nelze smazat.
de: Mindestens einer der ausgewählten Ressourcenwerte konnte nicht gelöscht werden.
es: Uno o más de los valores seleccionados de los recursos no se pudieron borrar.
ja: 選択されたリソース値の 1 つ以上をクリアできませんでした。
ko: 하나 이상의 선택한 리소스 값을 지울 수 없습니다.
zh_hans: 未能清除一个或多个选定资源值。
zh_hant: 有一或多個選取的資源值無法清除。

# RSE_Err_CantEditInDebugMode
source: The resource file cannot be modified at this time.
cs: Soubor prostředků se momentálně nedá změnit.
de: Die Ressourcendatei kann derzeit nicht geändert werden.
es: No se puede modificar en este momento el archivo de recursos.
ja: リソース ファイルは、現時点では変更できません。
ko: 지금은 리소스 파일을 수정할 수 없습니다.
zh_hans: 此时无法修改资源文件。
zh_hant: 此時無法修改資源檔。

# RSE_Err_UpdateADependentFile
source: You are trying to edit a resource file that is a part of another project item (such as a form or a control). Editing this item could corrupt the project item, and you will have to recover it by hand. In addition, changes made to this resource file may be lost if further changes are made to the project item. Do you really want to edit this file?
cs: Pokoušíte se upravovat soubor prostředku, který patří k jiné položce projektu (třeba k formuláři nebo ovládacímu prvku). Úprava této položky může vést k poškození položky projektu, kterou pak budete muset obnovit ručně. Pokud budete tuto položku projektu dál měnit, můžete přijít i o změny tohoto zdrojového souboru. Opravdu chcete tento soubor upravit?
de: Sie sind im Begriff, eine Ressourcendatei zu bearbeiten, die Teil eines anderen Projektelements ist (beispielsweise eines Formulars oder Steuerelements). Die Bearbeitung dieses Elements kann zu einer Beschädigung des Projektelements führen und eine manuelle Wiederherstellung erforderlich machen. Darüber hinaus gehen die Änderungen an dieser Ressourcendatei unter Umständen verloren, wenn später weitere Änderungen am Projektelement vorgenommen werden. Möchten Sie die Datei wirklich bearbeiten?
es: Está intentando editar un archivo de recursos que forma parte de otro elemento de proyecto (como un formulario o un control). Si edita este elemento, puede dañar el elemento de proyecto y tendrá que recuperarlo manualmente. Además, los cambios realizados en este archivo de recursos pueden perderse si se hacen más cambios en el elemento de proyecto. ¿Realmente quiere editar este archivo?
ja: 他のプロジェクト アイテム (フォーム、コントロールなど) の一部であるリソース ファイルを編集しようとしています。このアイテムを編集すると、プロジェクト アイテムが壊れる可能性があり、手動で修復する必要があります。さらに、プロジェクト アイテムに変更を続ける場合、このリソース ファイルへの変更が失われる可能性があります。 このファイルの編集を続行しますか?
ko: 폼 또는 컨트롤과 같은 다른 프로젝트 항목에 포함된 리소스 파일을 편집하려고 합니다. 이 파일을 편집하면 해당 프로젝트 항목이 손상될 수 있으며, 이 경우 수동으로 해당 항목을 복구해야 합니다. 또한 이후에 프로젝트 항목이 변경되면 이 리소스 파일에 대한 변경 내용이 손실될 수 있습니다. 이 파일을 편집하시겠습니까?
zh_hans: 尝试编辑的某个资源文件是另一个项目项(如窗体或控件)的一部分。编辑此项可能会损坏该项目项，之后将不得不手动将其恢复。此外，如果对该项目项做进一步更改，则对此资源文件所做的更改可能会丢失。 确实要编辑此文件吗?
zh_hant: 您嘗試編輯的資源檔是另一個專案項目 (例如表單或控制項) 的一部分。編輯此項目可能導致專案項目損毀，而必須手動復原。此外，如果進一步對專案項目進行變更，可能會遺失此資源檔的變更。 確定要編輯此檔案嗎?

# RSE_Err_CantAddUnsupportedResource_1Arg
source: The resource '{0}' cannot be added.
cs: Prostředek {0} se nedá přidat.
de: Die Ressource "{0}" kann nicht hinzugefügt werden.
es: No se puede agregar el recurso '{0}'.
ja: リソース '{0}' を追加できません。
ko: '{0}' 리소스를 추가할 수 없습니다.
zh_hans: 无法添加资源“{0}”。
zh_hant: 無法新增資源 '{0}'。

# RSE_Err_CantAddFileToDeviceProject_1Arg
source: The device does not support '{0}' files.
cs: Zařízení nepodporuje soubory {0}.
de: Das Gerät unterstützt keine {0}-Dateien.
es: El dispositivo no admite archivos '{0}'.
ja: デバイスは '{0}' ファイルをサポートしていません。
ko: 장치가 '{0}' 파일을 지원하지 않습니다.
zh_hans: 设备不支持“{0}”文件。
zh_hant: 裝置不支援 '{0}' 檔案。

# RSE_Err_TypeIsNotSupported_1Arg
source: The resource item uses the type '{0}', which is not supported in this project.
cs: Položka prostředku používá typ {0}, který se v tomto projektu nepodporuje.
de: Das Ressourcenelement verwendet den Typ "{0}", der in diesem Projekt nicht unterstützt wird.
es: El elemento de recurso utiliza el tipo '{0}'; que no se admite en este proyecto.
ja: リソース アイテムは '{0}' 型を使用していますが、このプロジェクトではサポートされていません。
ko: 리소스 항목이 이 프로젝트에서 지원하지 않는 '{0}' 형식을 사용합니다.
zh_hans: 资源项使用“{0}”类型，但该类型在此项目中不受支持。
zh_hant: 資源項目使用 '{0}' 類型，但此專案不支援該類型。

# RSE_Err_CantSaveResouce_1Arg
source: The resource item(s) {0} cannot be saved correctly. The item(s) will be discarded.
cs: Jedna nebo více položek prostředků {0} nejdou správně uložit. Tyto položky budou zahozeny.
de: Die Ressourcenelemente "{0}" konnten nicht ordnungsgemäß gespeichert werden. Die Elemente werden verworfen.

# RSE_NothingValue
source: (Nothing/null)
cs: (nic/null)
de: (Nichts/NULL)
es: (Nada/nulo)
ja: (なし/null)
ko: (없음/null)

# RSE_UnknownType
source: (Unknown type)
cs: (neznámý typ)
de: (Unbekannter Typ)
es: (Tipo desconocido)
ja: (不明な種類)
ko: (알 수 없는 형식)
zh_hans: (未知类型)
zh_hant: (未知的類型)

# RSE_NonEditableValue
source: (Value cannot be displayed)
cs: (hodnota se nedá zobrazit)
de: (Der Wert kann nicht angezeigt werden.)
es: (El valor no se puede mostrar)
ja: (値を表示できません)
ko: (값을 표시할 수 없음)
zh_hans: (无法显示值)
zh_hant: (無法顯示值)

# RSE_DetailsCol_Name
source: Name
cs: Název
es: Nombre
ja: 名前
ko: 이름
zh_hans: 名称
zh_hant: 名稱

# RSE_DetailsCol_Filename
source: Filename
cs: Název souboru
de: Dateiname
es: Nombre de archivo
ja: ファイル名
ko: 파일 이름
zh_hans: 文件名
zh_hant: 檔名

# RSE_DetailsCol_ImageType
source: Type
cs: Typ
de: Typ
es: Tipo
ja: 種類
zh_hans: 类型
zh_hant: 型別

# RSE_DetailsCol_Size
source: Size
cs: Velikost
de: Größe
es: Tamaño
ja: サイズ
ko: 크기
zh_hans: 大小
zh_hant: 大小

# RSE_DetailsCol_Comment
source: Comment
cs: Komentář
de: Kommentar
es: Comentario
ja: コメント
ko: 주석
zh_hans: 注释
zh_hant: 註解

# RSE_DetailsCol_Encoding
source: Text Encoding
cs: Kódování textu
de: Textcodierung
es: Codificación de texto
ja: テキストのエンコード
ko: 텍스트 인코딩
zh_hans: 文本编码
zh_hant: 文字編碼方式

# RSE_FileSizeFormatBytes_1Arg
source: {0} byte(s)
cs: {0} bajtů
ja: {0} バイト
ko: {0}바이트
zh_hans: {0} 字节
zh_hant: {0} 位元組

# RSE_Cat_Strings
source: Strings
cs: Řetězce
de: Zeichenfolgen
es: Cadenas
ja: 文字列
ko: 문자열
zh_hans: 字符串
zh_hant: 字串

# RSE_Cat_Images
source: Images
cs: Obrázky
de: Bilder
es: Imágenes
ja: イメージ
ko: 이미지
zh_hans: 图像
zh_hant: 影像

# RSE_Cat_Icons
source: Icons
cs: Ikony
de: Symbole
es: Iconos
ja: アイコン
ko: 아이콘
zh_hans: 图标
zh_hant: 圖示

# RSE_Cat_Audio
source: Audio
cs: Zvuk
ja: オーディオ
ko: 오디오
zh_hans: 音频
zh_hant: 音訊

# RSE_Cat_Files
source: Files
cs: Soubory
de: Dateien
es: Archivos
ja: ファイル
ko: 파일
zh_hans: 文件
zh_hant: 檔案

# RSE_Cat_Other
source: Other
cs: Jiné
de: Sonstiges
es: Otro
ja: その他
ko: 기타
zh_hans: 其他
zh_hant: 其他

# RSE_Btn_Add
source: &Add
cs: Přid&at
de: Hinz&ufügen
es: &Agregar
ja: 追加(&A)
ko: 추가(&A)
zh_hans: 添加(&A)
zh_hant: 新增(&A)

# RSE_Btn_Remove
source: &Remove
cs: Odeb&rat
de: &Entfernen
es: &Quitar
ja: 削除(&R)
ko: 제거(&R)
zh_hans: 删除(&R)
zh_hant: 移除(&R)

# RSE_Btn_Views
source: &Views
cs: &Zobrazení
de: &Ansichten
es: &Vistas
ja: ビュー(&V)
ko: 뷰(&V)
zh_hans: 视图(&V)
zh_hant: 檢視(&V)

# RSE_Btn_Add_ExistingFile
source: &Existing File...
cs: &Existující soubor...
de: &Vorhandene Datei...
es: &Archivo existente...
ja: 既存のファイル(&E)...
ko: 기존 파일(&E)...
zh_hans: 现有文件(&E)...
zh_hant: 現有檔案(&E)...

# RSE_Btn_Add_String
source: New &String
cs: No&vý řetězec
de: Neue &Zeichenfolge
es: Nueva &cadena
ja: 新しい文字列(&S)
ko: 새 문자열(&S)
zh_hans: 新字符串(&S)
zh_hant: 新增字串(&S)

# RSE_Btn_Add_Image
source: New &Image
cs: Nový o&brázek
de: Neues &Bild
es: Nueva &imagen
ja: 新しいイメージ(&I)
ko: 새 이미지(&I)
zh_hans: 新建图像(&I)
zh_hant: 新增影像(&I)

# RSE_Btn_Add_Image_PNG
source: &PNG Image...
cs: Obrázek ve formátu &PNG...
de: &PNG-Bild...
es: &Imagen PNG...
ja: PNG イメージ(&P)...
ko: PNG 이미지(&P)...
zh_hans: PNG 图像(&P)...
zh_hant: PNG 影像(&P)...

# RSE_Btn_Add_Image_BMP
source: &BMP Image...
cs: O&brázek ve formátu BMP...
de: &BMP-Bild...
es: &Imagen BMP...
ja: BMP イメージ(&B)...
ko: BMP 이미지(&B)...
zh_hans: BMP 图像(&B)...
zh_hant: BMP 影像(&B)...

# RSE_Btn_Add_Image_GIF
source: &GIF Image...
cs: Obrázek ve formátu &GIF...
de: &GIF-Bild...
es: &Imagen GIF...
ja: GIF イメージ(&G)...
ko: GIF 이미지(&G)...
zh_hans: GIF 图像(&G)...
zh_hant: GIF 影像(&G)...

# RSE_Btn_Add_Image_JPEG
source: &JPEG Image...
cs: Obrázek ve formátu &JPEG...
de: &JPEG-Bild...
es: &Imagen JPEG...
ja: JPEG イメージ(&J)...
ko: JPEG 이미지(&J)...
zh_hans: JPEG 图像(&J)...
zh_hant: JPEG 影像(&J)...

# RSE_Btn_Add_Image_TIFF
source: &TIFF Image...
cs: Obrázek ve formá&tu TIFF...
de: &TIFF-Bild...
es: &Imagen TIFF...
ja: TIFF イメージ(&T)...
ko: TIFF 이미지(&T)...
zh_hans: TIFF 图像(&T)...
zh_hant: TIFF 影像(&T)...

# RSE_Btn_Add_Icon
source: New I&con...
cs: Nová i&kona...
de: Neues &Symbol...
es: Nuevo i&cono...
ja: 新しいアイコン(&C)...
ko: 새 아이콘(&C)...
zh_hans: 新建图标(&C)...
zh_hant: 新增圖示(&C)...

# RSE_Btn_Add_TextFile
source: New &Text File...
cs: Nový &textový soubor...
de: Neue &Textdatei...
es: Nuevo &archivo de texto...
ja: 新しいテキスト ファイル(&T)...
ko: 새 텍스트 파일(&T)...
zh_hans: 新建文本文件(&T)...
zh_hant: 新增文字檔(&T)...

# RSE_Type_BMP
source: Windows Bitmap
cs: Bitová mapa Windows
es: Mapa de bits de Windows
ja: Windows ビットマップ
ko: Windows 비트맵
zh_hans: Windows 位图
zh_hant: Windows 點陣圖

# RSE_Type_EXIF
source: EXIF Image
cs: Obrázek EXIF
de: EXIF-Bild
es: Imagen EXIF
ja: EXIF イメージ
ko: EXIF 이미지
zh_hans: EXIF 图像
zh_hant: EXIF 影像

# RSE_Type_GIF
source: Graphics Interchange Format
cs: Formát GIF
es: Formato de intercambio de gráficos
ja: グラフィックス交換形式
zh_hans: 图形交换格式
zh_hant: 圖形交換格式 (GIF)

# RSE_Type_JPEG
source: JPEG File Interchange Format
cs: Formát JPEG
es: Formato de intercambio de archivos JPEG
ja: JPEG ファイル交換形式
ko: JPEG 파일 교환 형식
zh_hans: JPEG 文件交换格式
zh_hant: JPEG 檔案交換格式

# RSE_Type_MEMBMP
source: Windows Bitmap
cs: Bitová mapa Windows
es: Mapa de bits de Windows
ja: Windows ビットマップ
ko: Windows 비트맵
zh_hans: Windows 位图
zh_hant: Windows 點陣圖

# RSE_Type_PNG
source: Portable Network Graphics
cs: Formát PNG
es: Formato PNG (Portable Network Graphics)
ja: 移植可能なネットワーク グラフィックス
ko: 이동식 네트워크 그래픽
zh_hans: 可移植网络图形
zh_hant: 可攜式網路圖形

# RSE_Type_TIFF
source: Tag Image File Format
cs: Formát TIFF
es: Formato TIFF (Tag Image File Format)
ja: タグ イメージ ファイル形式
zh_hans: 标记图像文件格式
zh_hant: TIF 檔案格式

# RSE_Type_Icon
source: Icon
cs: Ikona
de: Symbol
es: Icono
ja: アイコン
ko: 아이콘
zh_hans: 图标
zh_hant: 圖示

# RSE_Type_TextFile
source: Text File
cs: Textový soubor
de: Textdatei
es: Archivo de texto
ja: テキスト ファイル
ko: 텍스트 파일
zh_hans: 文本文件
zh_hant: 文字檔

# RSE_Type_BinaryFile
source: Binary File
cs: Binární soubor
de: Binärdatei
es: Archivo binario
ja: バイナリ ファイル
ko: 이진 파일
zh_hans: 二进制文件
zh_hant: 二進位檔案

# RSE_Type_Wave
source: Wave Sound
cs: Zvuk ve formátu Wave
es: Archivo de sonido
ja: Wave サウンド
ko: 웨이브 사운드
zh_hans: 波形声音
zh_hant: 聲音音效

# RES_PersistenceMode_Linked
source: Linked at compile time
cs: Spojený až při kompilaci
de: Zur Kompilierzeit verknüpft
es: Vinculado en tiempo de compilación
ja: コンパイル時にリンクされました
ko: 컴파일 시간에 링크됨
zh_hans: 在编译时链接
zh_hant: 於編譯時間連結

# RES_PersistenceMode_Embeded
source: Embedded in .resx
cs: Vložený do souboru .resx
de: In .resx eingebettet

# RSE_Filter_Bitmap
source: Bitmaps
cs: Bitové mapy
es: Mapas de bits
ja: ビットマップ
ko: 비트맵
zh_hans: 位图
zh_hant: 點陣圖

# RSE_Filter_Icon
source: Icons
cs: Ikony
de: Symbole
es: Iconos
ja: アイコン
ko: 아이콘
zh_hans: 图标
zh_hant: 圖示

# RSE_Filter_Audio
source: Audio
cs: Zvuk
ja: オーディオ
ko: 오디오
zh_hans: 音频
zh_hant: 音訊

# RSE_Filter_Text
source: Text Files
cs: Textové soubory
de: Textdateien
es: Archivos de texto
ja: テキスト ファイル
ko: 텍스트 파일
zh_hans: 文本文件
zh_hant: 文字檔

# RSE_Filter_All
source: All Files
cs: Všechny soubory
de: Alle Dateien
es: Todos los archivos
ja: すべてのファイル
ko: 모든 파일
zh_hans: 所有文件
zh_hant: 所有檔案

# RSE_FilterSave_BMP
source: Windows Bitmap
cs: Bitová mapa Windows
es: Mapa de bits de Windows
ja: Windows ビットマップ
ko: Windows 비트맵
zh_hans: Windows 位图
zh_hant: Windows 點陣圖

# RSE_FilterSave_PNG
source: Portable Network Graphics
cs: Formát PNG
es: Formato PNG (Portable Network Graphics)
ja: 移植可能なネットワーク グラフィックス
ko: 이동식 네트워크 그래픽
zh_hans: 可移植网络图形
zh_hant: 可攜式網路圖形

# RSE_FilterSave_GIF
source: Graphics Interchange Format
cs: Formát GIF
es: Formato de intercambio de gráficos
ja: グラフィックス交換形式
zh_hans: 图形交换格式
zh_hant: 圖形交換格式 (GIF)

# RSE_FilterSave_JPEG
source: JPEG File Interchange Format
cs: Formát JPEG
es: Formato de intercambio de archivos JPEG
ja: JPEG ファイル交換形式
ko: JPEG 파일 교환 형식
zh_hans: JPEG 文件交换格式
zh_hant: JPEG 檔案交換格式

# RSE_FilterSave_TIFF
source: Tag Image File Format
cs: Formát TIFF
es: Formato TIFF (Tag Image File Format)
ja: タグ イメージ ファイル形式
zh_hans: 标记图像文件格式
zh_hant: TIF 檔案格式

# RSE_FilterSave_Icon
source: Icon
cs: Ikona
de: Symbol
es: Icono
ja: アイコン
ko: 아이콘
zh_hans: 图标
zh_hant: 圖示

# RSE_Btn_Views_List
source: &List
cs: &Seznam
de: &Liste
es: &Lista
ja: リスト(&L)
ko: 목록(&L)
zh_hans: 列表(&L)
zh_hant: 清單(&L)

# RSE_Btn_Views_Details
source: &Details
cs: Po&drobnosti
es: &Detalles
ja: 詳細(&D)
ko: 세부 정보(&D)
zh_hans: 详细信息(&D)
zh_hant: 詳細資料(&D)

# RSE_Btn_Views_Thumbnail
source: &Thumbnail
cs: &Miniatura
de: &Miniaturansicht
es: &Miniatura
ja: サムネイル(&T)
ko: 미리 보기(&T)
zh_hans: 缩略图(&T)
zh_hant: 縮圖(&T)

# RSE_ResourceEditor
source: Managed Resources Editor
cs: Editor spravovaných prostředků
de: Editor für verwaltete Ressourcen
es: Editor de recursos administrados
ja: マネージド リソース エディター
ko: 관리되는 리소스 편집기
zh_hans: 受管理资源编辑器
zh_hant: 受控資源編輯器

# RSE_DlgTitle_AddExisting
source: Add existing file to resources
cs: Přidat existující soubor k prostředkům
de: Vorhandene Datei zu Ressourcen hinzufügen
es: Agregar archivo existente a los recursos
ja: 既存のファイルをリソースに追加
ko: 리소스에 기존 파일 추가
zh_hans: 将现有文件添加到资源中
zh_hant: 將現有的檔案加入資源

# RSE_DlgTitle_Import_1Arg
source: Import file into resource '{0}'
cs: Importovat soubor do prostředku {0}
de: Datei in Ressource "{0}" importieren
es: Importar archivo en el recurso '{0}'
ja: ファイル '{0}' をリソースにインポートします
ko: '{0}' 리소스로 파일 가져오기
zh_hans: 将文件导入到资源“{0}”中
zh_hant: 將檔案匯入資源 '{0}'

# RSE_DlgTitle_Export_1Arg
source: Export resource '{0}' to file
cs: Exportovat prostředek {0} do souboru
de: Ressource "{0}" in Datei exportieren
es: Exportar el recurso '{0}' a un archivo
ja: リソース '{0}' をファイルにエクスポートします
ko: 파일로 '{0}' 리소스 내보내기
zh_hans: 将资源“{0}”导出到文件中
zh_hant: 將資源 '{0}' 匯出到檔案

# RSE_DlgTitle_AddNew
source: Please specify where to save the new file
cs: Zadejte prosím, kde má být nový soubor uložen
de: Speicherort der neuen Datei angeben
es: Especifique dónde desea guardar el nuevo archivo
ja: 新しいファイルの保存場所を指定してください
ko: 새 파일을 저장할 위치를 지정하세요.
zh_hans: 请指定保存新文件的位置
zh_hant: 請指定新檔案的儲存位置

# RSE_Dlg_ReplaceExistingFile
source: The file '{0}' already exists. Do you want to replace it?
cs: Soubor {0} už existuje. Chcete ho nahradit?
de: Die Datei "{0}" ist bereits vorhanden. Möchten Sie sie ersetzen?
es: El archivo '{0}' ya existe. ¿Quiere reemplazarlo?
ja: ファイル '{0}' は既に存在します。置き換えますか?
ko: ‘{0}’ 파일이 이미 있습니다. 바꾸시겠습니까?
zh_hans: 文件“{0}”已经存在。是否替换它?
zh_hant: 檔案 '{0}' 已經存在。要取代它嗎?

# RSE_Dlg_ReplaceExistingFiles
source: The following files already exist. Do you want to replace them?
cs: Následující soubory už existují. Chcete je nahradit?
de: Die folgenden Dateien sind bereits vorhanden. Möchten Sie sie ersetzen?
es: Los siguientes archivos ya existen. ¿Quiere reemplazarlos?
ja: 次のファイルは既に存在します。置き換えますか?
ko: 다음 파일이 이미 있습니다. 바꾸시겠습니까?
zh_hans: 以下文件已经存在。是否替换它们?
zh_hant: 下列檔案已經存在。要取代它們嗎?

# RSE_Dlg_ExportMultiple
source: Select a folder in which to export the resources.
cs: Vyberte složku, do které budou exportovány prostředky.
de: Wählen Sie einen Ordner zum Exportieren der Ressourcen aus.
es: Seleccione una carpeta para exportar los recursos.
ja: リソースをエクスポートするフォルダーを選択してください。
ko: 리소스를 내보낼 대상 폴더를 선택하세요.
zh_hans: 选择要将资源导出到的文件夹。
zh_hant: 選取要匯出資源的資料夾。

# RSE_Dlg_ContinueAnyway
source: Do you want to continue anyway?
cs: Chcete i přesto pokračovat?
de: Möchten Sie den Vorgang dennoch fortsetzen?
es: ¿Desea continuar de todas formas?
ja: 続行しますか?
ko: 계속하시겠습니까?
zh_hans: 是否仍要继续?
zh_hant: 您仍然要繼續嗎?

# RSE_Dlg_SetCustomTool
source: Do you want to enable strongly-typed resource generation for this file?
cs: Chcete pro tento soubor povolit generování prostředků se silnými typy?
de: Möchten Sie die Generierung von stark typisierten Ressourcen für diese Datei aktivieren?
es: ¿Desea habilitar la generación de recursos fuertemente tipados para este archivo?
ja: このファイルに対して厳密に型指定されたリソースの生成を有効にしますか?
ko: 이 파일에 대해 강력한 형식의 리소스 생성을 사용하시겠습니까?
zh_hans: 是否为此文件启用强类型资源生成?
zh_hant: 您要對這個檔案啟用強類型的資源產生嗎?

# RSE_Task_BadLink_2Args
source: Resource '{0}' could not be loaded because the file to which it is linked could not be found: {1}.
cs: Prostředek {0} se nedá načíst, protože se nenašel soubor, se kterým je svázaný: {1}.
de: Die Ressource "{0}" konnte nicht geladen werden, da die Datei, mit der sie verknüpft ist, nicht gefunden wurde: {1}.
es: No se puede cargar el recurso '{0}' porque no se encuentra el archivo al que está vinculado: {1}.
ja: リソース '{0}' は、リンクされたファイルが見つからなかったため、読み込めませんでした: {1}。
ko: 링크된 파일을 찾을 수 없어 '{0}' 리소스를 로드할 수 없습니다. {1}.
zh_hans: 由于未能找到资源“{0}”链接到的文件，未能加载该资源: {1}。
zh_hant: 無法載入資源 '{0}'，因為找不到連結的檔案: {1}。

# RSE_Task_CantInstantiate_2Args
source: Resource '{0}' could not be instantiated. {1}
cs: Nelze vytvořit instanci prostředku {0}. {1}
de: Die Ressource "{0}" konnte nicht instanziiert werden. {1}
es: No se puede crear una instancia del recurso '{0}'. {1}
ja: リソース '{0}' をインスタンス化できませんでした。 {1}
ko: '{0}' 리소스를 인스턴스화할 수 없습니다. {1}
zh_hans: 未能实例化资源“{0}”。 {1}
zh_hant: 無法將資源 '{0}' 具現化。{1}

# RSE_Task_NonrecommendedName_1Arg
source: Resource '{0}' has a name that is not recommended and that may cause compilation errors in your code. Please choose another name.
cs: Prostředek {0} má název, který se nedoporučuje, protože může v kódu způsobit chyby při kompilaci. Vyberte prosím jiný název.
de: Der Name der Ressource "{0}" ist nicht empfehlenswert und kann Kompilierungsfehler im Code verursachen. Wählen Sie einen anderen Namen aus.
es: El recurso '{0}' tiene un nombre no recomendado que puede producir errores de compilación en el código. Elija otro nombre.
ja: リソース '{0}' には、コードのコンパイル エラーの原因となる可能性のある、推奨されていない名前が付けられています。別の名前を選んでください。
ko: '{0}' 리소스가 권장되지 않는 이름을 사용하고 있으며 이 이름은 코드에서 컴파일 오류를 발생시킬 수 있습니다. 다른 이름을 선택하세요.
zh_hans: 资源“{0}”具有不建议使用的名称，可能会导致代码中出现编译错误。请选择其他名称。
zh_hant: 資源 '{0}' 使用不建議採用的名稱，可能導致程式碼發生編譯錯誤。請選擇其他名稱。
