Repository: dotnet/fsharp
Catalog: vsintegration/src/FSharp.ProjectSystem.PropertyPages/Resources/xlf/Microsoft.VisualStudio.Editors.Designer.*.xlf
Languages: cs, de, es, ja, ko, zh_hans, zh_hant

# CMN_AllFilesFilter
source: All Files
cs: Všechny soubory
de: Alle Dateien
es: Todos los archivos
ja: すべてのファイル
ko: 모든 파일
zh_hans: 所有文件
zh_hant: 所有檔案

# PPG_PropertyPageControlName
source: Property Page
cs: Stránka vlastností
de: Eigenschaftenseite
es: Página de propiedades
ja: プロパティ ページ
ko: 속성 페이지
zh_hans: 属性页
zh_hant: 屬性頁

# PPG_ReferencesTitle
source: References
cs: Odkazy
de: Verweise
es: Referencias
ja: 参照設定
ko: 참조
zh_hans: 引用
zh_hant: 參考

# PPG_SigningTitle
source: Signing
cs: Podepsání
de: Signieren
es: Firma
ja: 署名
ko: 서명
zh_hans: 签名
zh_hant: 簽署

# PPG_ApplicationTitle
source: Application
cs: Aplikace
de: Anwendung
es: Aplicación
ja: アプリケーション
ko: 애플리케이션
zh_hans: 应用程序
zh_hant: 應用程式

# PPG_CompileTitle
source: Compile
cs: Kompilovat
de: Kompilieren
es: Compilar
ja: コンパイル
ko: 컴파일
zh_hans: 编译
zh_hant: 編譯

# PPG_DebugTitle
source: Debug
cs: Ladit
de: Debuggen
es: Depurar
ja: デバッグ
ko: 디버그
zh_hans: 调试
zh_hant: 偵錯

# PPG_DeployTitle
source: Deploy
cs: Nasadit
de: Bereitstellen
es: Implementar
ja: 展開
ko: 배포
zh_hans: 部署
zh_hant: 部署

# PPG_VdtGeneralTitle
source: Database
cs: Databáze
de: Datenbank
es: Base de datos
ja: データベース
ko: 데이터베이스
zh_hans: 数据库
zh_hant: 資料庫

# PPG_Security
source: Security
cs: Zabezpečení
de: Sicherheit
es: Seguridad
ja: セキュリティ
ko: 보안
zh_hans: 安全
zh_hant: 安全性

# PPG_BuildTitle
source: Build
cs: Sestavení
es: Compilación
ja: ビルド
ko: 빌드
zh_hans: 生成
zh_hant: 建置

# PPG_BuildEventsTitle
source: Build Events
cs: Události sestavení
de: Buildereignisse
es: Eventos de compilación
ja: ビルド イベント
ko: 빌드 이벤트
zh_hans: 生成事件
zh_hant: 建置事件

# PPG_ReferencePathsTitle
source: Reference Paths
cs: Cesty odkazů
de: Verweispfade
es: Rutas de acceso de referencias
ja: 参照パス
ko: 참조 경로
zh_hans: 引用路径
zh_hant: 參考路徑

# PPG_PreBuildCommandLineTitle
source: Pre-build Event Command Line
cs: Příkazový řádek události před sestavením
de: Befehlszeile für Präbuildereignis
es: Línea de comandos del evento anterior a la compilación
ja: ビルド前に実行するコマンド ライン
ko: 빌드 전 이벤트 명령줄
zh_hans: 生成前事件命令行
zh_hant: 建置前事件命令列

# PPG_PostBuildCommandLineTitle
source: Post-build Event Command Line
cs: Příkazový řádek události po sestavení
de: Befehlszeile für Postbuildereignis
es: Línea de comandos del evento posterior a la compilación
ja: ビルド後に実行するコマンド ライン
ko: 빌드 후 이벤트 명령줄
zh_hans: 生成后事件命令行
zh_hant: 建置後事件命令列

# PPG_OutputPathNotSecure
source: The output path is not trusted. The application may throw security exceptions when it attempts to perform actions which require full trust. Click OK to ignore and continue. Click CANCEL to choose a different output path.
cs: Cesta výstupu není důvěryhodná. Při pokusech o provedení akcí vyžadujících úplný vztah důvěryhodnosti může v aplikaci docházet k bezpečnostním výjimkám. Pokud chcete tento stav ignorovat a pokračovat v operaci, klikněte na OK. Pokud chcete vybrat jinou cestu výstupu, klikněte na Zrušit.
de: Der Ausgabepfad ist nicht vertrauenswürdig. Bei Aktionen, die volle Vertrauenswürdigkeit erfordern, treten für die Anwendung unter Umständen Sicherheitsausnahmen auf. Klicken Sie auf "OK", um diese Meldung zu ignorieren und den Vorgang fortzusetzen. Klicken Sie auf "ABBRECHEN", um einen anderen Ausgabepfad zu wählen.
es: La ruta de acceso de salida no es de confianza. La aplicación puede producir excepciones de seguridad al intentar realizar acciones que requieran plena confianza. Haga clic en ACEPTAR para pasar esto por alto y continuar. Haga clic en CANCELAR para elegir otra ruta de acceso de salida.
ja: この出力パスは信頼されていません。 完全な信頼が必要なアクションを実行しようとすると、アプリケーションがセキュリティ例外をスローする可能性があります。 無視して続行するには [OK] をクリックしてください。別の出力パスを選ぶには [キャンセル] をクリックしてください。
ko: 출력 경로를 신뢰할 수 없습니다. 완전 신뢰가 필요한 동작을 수행할 때 애플리케이션에서 보안 예외를 throw할 수 있습니다. 무시하고 계속 실행하려면 [확인]을 클릭하고 다른 출력 경로를 선택하려면 [취소]를 클릭하세요.
zh_hans: 输出路径不受信任。 如果应用程序尝试执行需要完全信任的操作，可能会引发安全异常。 单击“确定”可忽略并继续。单击“取消”可选择其他输出路径。
zh_hant: 輸出路徑不受信任。 應用程式嘗試執行需要完全信任的動作時，可能會擲回安全性例外狀況。 按一下 [確定] 略過並繼續。按一下 [取消] 選擇其他輸出路徑。

# PPG_BrowseText
source: <Browse...>
cs: <Procházet...>
de: <Durchsuchen...>
es: <Examinar...>
ja: <参照...>
ko: <찾아보기...>
zh_hans: <浏览...>
zh_hant: <瀏覽...>

# PPG_StartupObjectNone
source: (None)
cs: (žádné)
de: (Keine)
es: (Ninguno)
ja: (なし)
ko: (없음)
zh_hans: (无)
zh_hant: (無)

# PPG_KeyFileNewText
source: <New...>
cs: <Nový...>
de: <Neu...>
es: <Nuevo...>
ja: <新しい...>
ko: <새로 만들기...>
zh_hans: <新建...>
zh_hant: <新增...>

# PPG_KeyFileBrowseText
source: <Browse...>
cs: <Procházet...>
de: <Durchsuchen...>
es: <Examinar...>
ja: <参照...>
ko: <찾아보기...>
zh_hans: <浏览...>
zh_hant: <瀏覽...>

# PPG_ComboBoxSelect_None
source: (None)
cs: (žádné)
de: (Keine)
es: (Ninguno)
ja: (なし)
ko: (없음)
zh_hans: (无)
zh_hant: (無)

# PPG_ActiveConfigOrPlatformFormatString_1Arg
source: Active ({0})
cs: Aktivní ({0})
de: Aktiv ({0})
es: Activa ({0})
ja: アクティブな ({0})
ko: 활성({0})
zh_hans: 活动({0})
zh_hant: 使用中 ({0})

# PPG_AllConfigurations
source: All Configurations
cs: Všechny konfigurace
de: Alle Konfigurationen
es: Todas las configuraciones
ja: すべての構成
ko: 모든 구성
zh_hans: 所有配置
zh_hant: 所有組態

# PPG_AllPlatforms
source: All Platforms
cs: Všechny platformy
de: Alle Plattformen
es: Todas las plataformas
ja: すべてのプラットフォーム
ko: 모든 플랫폼
zh_hans: 所有平台
zh_hant: 所有平台

# PPG_NotApplicable
source: N/A
cs: Není k dispozici
de: N/V
ja: なし
zh_hans: 不可用

# PPG_ConfigNotFound_2Args
source: Could not find the configuration '{0}' for platform '{1}'.
cs: Konfigurace {0} pro platformu {1} se nenašla.
de: Die Konfiguration "{0}" für die Plattform "{1}" wurde nicht gefunden.
es: No se encuentra la configuración '{0}' para la plataforma '{1}'.
ja: プラットフォーム '{1}' の構成 '{0}' が見つかりませんでした。
ko: '{1}' 플랫폼에 대한 '{0}' 구성을 찾을 수 없습니다.
zh_hans: 未能找到平台“{1}”的配置“{0}”。
zh_hant: 找不到平台 '{1}' 的組態 '{0}'。

# PPG_NeutralLanguage_None
source: (None)
cs: (žádné)
de: (Keine)
es: (Ninguno)
ja: (なし)
ko: (없음)
zh_hans: (无)
zh_hant: (無)

# PPG_SelectFileTitle
source: Select File
cs: Vybrat soubor
de: Datei auswählen
es: Seleccionar archivo
ja: ファイルの選択
ko: 파일 선택
zh_hans: 选择文件
zh_hant: 選取檔案

# PPG_AddExistingFilesTitle
source: Add existing file to project
cs: Přidat existující soubor do projektu
de: Vorhandene Datei zum Projekt hinzufügen
es: Agregar archivo existente al proyecto
ja: 既存のファイルをプロジェクトに追加
ko: 프로젝트에 기존 파일 추가
zh_hans: 将现有文件添加到项目中
zh_hant: 將現有的檔案加入專案

# PPG_AddIconFilesFilter
source: Icon Files
cs: Soubory ikon
de: Symboldateien
es: Archivos de icono
ja: アイコン ファイル
ko: 아이콘 파일
zh_hans: 图标文件
zh_hant: 圖示檔

# PPG_ExeFilesFilter
source: Executable Files
cs: Spustitelné soubory
de: Ausführbare Dateien
es: Archivos ejecutables
ja: 実行可能ファイル
ko: 실행 파일
zh_hans: 可执行文件
zh_hant: 可執行檔

# PPG_SelectWorkingDirectoryTitle
source: Select Working Directory
cs: Vybrat pracovní adresář
de: Arbeitsverzeichnis auswählen
es: Seleccionar directorio de trabajo
ja: 作業ディレクトリの選択
ko: 작업 디렉터리 선택
zh_hans: 选择工作目录
zh_hant: 選取工作目錄

# PPG_SelectOutputPathTitle
source: Select Output Path
cs: Vybrat cestu výstupu
de: Ausgabepfad auswählen
es: Seleccionar ruta de acceso de salida
ja: 出力パスの選択
ko: 출력 경로 선택
zh_hans: 选择输出路径
zh_hant: 選取輸出路徑

# PPG_SelectReferencePath
source: Select Reference Path
cs: Vybrat cestu k odkazu
de: Verweispfad auswählen
es: Seleccionar ruta de acceso de referencia
ja: 参照パスの選択
ko: 참조 경로 선택
zh_hans: 选择引用路径
zh_hant: 選取參考路徑

# PPG_AddWin32ResourceFilter
source: Win32 Resource Files
cs: Soubory prostředků Win32
de: Win32-Ressourcendateien
es: Archivos de recursos de Win32
ja: Win32 リソース ファイル
ko: Win32 리소스 파일
zh_hans: Win32 资源文件
zh_hant: Win32 資源檔

# PPG_AddWin32ResourceTitle
source: Add Win32 resource file to project
cs: Přidat soubor prostředků Win32 do projektu
de: Win32-Ressourcendatei zum Projekt hinzufügen
es: Agregar archivo de recursos de Win32 al proyecto
ja: Win32 リソース ファイルをプロジェクトに追加
ko: 프로젝트에 Win32 리소스 파일 추가
zh_hans: 将 Win32 资源文件添加到项目中
zh_hant: 將 Win32 資源檔加入專案

# PPG_InvalidFolderPath
source: Folder path does not exist. Please select a valid folder path.
cs: Cesta ke složce neexistuje. Vyberte prosím platnou cestu ke složce.
de: Der Ordnerpfad ist nicht vorhanden. Wählen Sie einen gültigen Ordnerpfad aus.
es: La ruta de acceso de la carpeta no existe. Seleccione una ruta de acceso de carpeta válida.
ja: フォルダー パスが存在しません。 有効なフォルダー パスを選択してください。
ko: 폴더 경로가 없습니다. 올바른 폴더 경로를 선택하세요.
zh_hans: 文件夹路径不存在。 请选择有效的文件夹路径。
zh_hant: 資料夾路徑不存在。 請選取有效的資料夾路徑。

# PPG_AdvancedCompilerSettings_Title
source: Advanced Compiler Settings
cs: Pokročilé nastavení kompilátoru
de: Erweiterte Compilereinstellungen
es: Configuración avanzada del compilador
ja: コンパイラの詳細設定
ko: 고급 컴파일러 설정
zh_hans: 高级编译器设置
zh_hant: 進階編譯器設定

# PPG_AdvancedBuildSettings_Title
source: Advanced Build Settings
cs: Pokročilé nastavení sestavení
de: Erweiterte Buildeinstellungen
es: Configuración avanzada de compilación
ja: ビルドの詳細設定
ko: 고급 빌드 설정
zh_hans: 高级生成设置
zh_hant: 進階建置設定

# PPG_CompilerWarnings_Title
source: Compiler Warnings
cs: Upozornění kompilátoru
de: Compilerwarnungen
es: Advertencias del compilador
ja: コンパイラの警告
ko: 컴파일러 경고
zh_hans: 编译器警告
zh_hant: 編譯器警告

# PPG_ReferencePaths_Title
source: Reference Paths
cs: Cesty odkazů
de: Verweispfade
es: Rutas de acceso de referencias
ja: 参照パス
ko: 참조 경로
zh_hans: 引用路径
zh_hant: 參考路徑

# PPG_CompatibleSettings_Title
source: Compatible Settings
cs: Kompatibilní nastavení
de: Kompatible Einstellungen
es: Configuración compatible
ja: 互換性のある設定
ko: 호환되는 설정
zh_hans: 兼容设置
zh_hant: 相容設定

# PPG_AssemblyInfo_Title
source: Assembly Information
cs: Informace o sestavení
de: Assemblyinformationen
es: Información de ensamblado
ja: アセンブリ情報
ko: 어셈블리 정보
zh_hans: 程序集信息
zh_hant: 組件資訊

# PPG_AssemblyInfo_InvalidVersion
source: Invalid version format, expected "[Major]", "[Major].[Minor]", "[Major].[Minor].[Build]" or "[Major].[Minor].[Build].[Revision]"
cs: Neplatný formát verze, očekává se [Major], [Major].[Minor], [Major].[Minor].[Build] nebo [Major].[Minor].[Build].[Revision].
de: Ungültiges Versionsformat, "[Hauptversion]", "[Hauptversion].[Nebenversion]", "[Hauptversion].[Nebenversion].[Build]" oder "[Hauptversion].[Nebenversion].[Build].[Revision]" wurde erwartet.
es: Formato de versión no válido; se esperaba "[Principal]", "[Principal].[Secundaria]", "[Principal].[Secundaria].[Compilación]" o "[Principal].[Secundaria].[Compilación].[Revisión]"
ja: 無効なバージョン形式です。"[Major]"、"[Major].[Minor]"、"[Major].[Minor].[Build]"、"[Major].[Minor].[Build].[Revision]" のいずれかの形式であることが必要です
ko: 버전 형식이 잘못되었습니다. 올바른 형식은 "[Major]", "[Major].[Minor]", "[Major].[Minor].[Build]" 또는 "[Major].[Minor].[Build].[Revision]"입니다.
zh_hans: 版本格式无效，应为“[主版本]”、“[主版本].[次版本]”、“[主版本].[次版本].[内部版本]”或“[主版本].[次版本].[内部版本].[修订版]”
zh_hant: 無效的版本格式，必須是 "[Major]"、"[Major].[Minor]"、"[Major].[Minor].[Build]" 或 "[Major].[Minor].[Build].[Revision]"

# PPG_AssemblyInfo_BadWildcard
source: A wildcard ("*") is not allowed in this field.
cs: Zástupný znak (*) není v tomto poli povolený.
de: In diesem Feld sind Platzhalter ("*") nicht zulässig.
es: No se permite el uso de caracteres comodín ("*") en este campo.
ja: このフィールドにワイルドカード ("*") は使用できません。
ko: 이 필드에는 와일드카드("*")를 사용할 수 없습니다.
zh_hans: 此字段不允许使用通配符("*")。
zh_hant: 此欄位不允許萬用字元 ("*")。

# PPG_AssemblyInfo_VersionOutOfRange_2Args
source: Each part of the version number for '{0}' must be an integer between 0 and {1}.
cs: Každá část čísla verze {0} musí být celočíselná hodnota z intervalu 0 až {1}.
de: Jeder Teil der Versionsnummer für "{0}" muss eine ganze Zahl zwischen 0 und {1} sein.
es: Cada parte del número de versión de '{0}' debe ser un número entero entre 0 y {1}.
ja: '{0}' のバージョン番号の各部分は 0 から {1} までの整数である必要があります。
ko: '{0}'의 각 버전 번호 부분은 0에서 {1} 사이의 정수여야 합니다.
zh_hans: “{0}”的版本号的每个部分都必须是介于 0 和 {1} 之间的整数。
zh_hant: '{0}' 的版本號碼的每個部分都必須是介於 0 和 {1} 之間的整數。

# PPG_Application_DefaultIconText
source: (Default Icon)
cs: (Výchozí ikona)
de: (Standardsymbol)
es: (Icono predeterminado)
ja: (既定のアイコン)
ko: (기본 아이콘)
zh_hans: (默认值: 图标)
zh_hant: (預設圖示)

# PPG_Application_InvalidSubMainStartup
source: Startup object must be a form when 'Enable application framework' is checked.
cs: Pokud jste zaškrtli Povolit rozhraní Framework aplikace, spouštěcí objekt musí být formulář.
de: Das Startobjekt muss ein Formular sein, wenn "Anwendungsframework aktivieren" aktiviert ist.
es: El objeto de inicio debe ser un formulario cuando la opción 'Habilitar marco de trabajo de la aplicación' está activada.
ja: [アプリケーション フレームワークを有効にする] がオンのとき、スタートアップ オブジェクトはフォームでなければなりません。
ko: '애플리케이션 프레임워크 사용'이 선택된 경우 시작 개체는 폼이어야 합니다.
zh_hans: 选中“启用应用程序框架”时，启动对象必须是窗体。
zh_hant: 核取 [啟用應用程式架構] 時，啟始物件必須是表單。

# PPG_Application_StartupObjectNotSet
source: (Not set)
cs: (nenastaveno)
de: (Nicht festgelegt)
es: (No establecido)
ja: (未設定)
ko: (설정 안 함)
zh_hans: (未设置)
zh_hant: (未設定)

# PPG_Application_CantAddIcon
source: Icon could not be added to the project.
cs: Ikona se do projektu nedá přidat.
de: Das Symbol konnte dem Projekt nicht hinzugefügt werden.
es: No se pudo agregar el icono al proyecto.
ja: アイコンをプロジェクトに追加できませんでした。
ko: 아이콘을 프로젝트에 추가할 수 없습니다.
zh_hans: 未能将图标添加到项目中。
zh_hant: 無法將圖示加入專案。

# PPG_Application_BadIcon
source: Invalid icon file.
cs: Neplatný soubor ikony.
de: Ungültige Symboldatei.
es: Archivo de icono no válido.
ja: アイコン ファイルが無効です。
ko: 아이콘 파일이 잘못되었습니다.
zh_hans: 无效图标文件。
zh_hant: 圖示檔無效。

# PPG_Application_BadIcon_1Arg
source: {0} is not a valid icon file.
cs: {0} není platným souborem ikony.
de: "{0}" ist keine gültige Symboldatei.
es: {0} no es un archivo de icono válido.
ja: {0} は有効なアイコン ファイルではありません。
ko: {0}은(는) 올바른 아이콘 파일이 아닙니다.
zh_hans: {0} 不是有效的图标文件。
zh_hant: {0} 不是有效的圖示檔。

# PPG_Application_BadGuid
source: The GUID should match the format dddddddd-dddd-dddd-dddd-dddddddddddd.
cs: Identifikátor GUID by měl odpovídat formátu dddddddd-dddd-dddd-dddd-dddddddddddd.
de: Die GUID muss das folgende Format aufweisen: dddddddd-dddd-dddd-dddd-dddddddddddd.
es: El GUID debe tener el siguiente formato dddddddd-dddd-dddd-dddd-dddddddddddd.
ja: GUID は dddddddd-dddd-dddd-dddd-dddddddddddd の形式でなければなりません。
ko: GUID는 dddddddd-dddd-dddd-dddd-dddddddddddd 형식이어야 합니다.
zh_hans: GUID 应匹配格式 dddddddd-dddd-dddd-dddd-dddddddddddd。
zh_hant: GUID 應符合 dddddddd-dddd-dddd-dddd-dddddddddddd 格式。

# PPG_Application_MyAppCommentLine1
source: NOTE: This file is auto-generated; do not modify it directly. To make changes,
cs: POZNÁMKA: Neměňte přímo tento soubor, protože se generuje automaticky. Pokud chcete provést změny,
de: HINWEIS: Diese Datei wird automatisch generiert und darf nicht direkt bearbeitet werden. Wenn Sie Änderungen vornehmen möchten
es: NOTA: Este archivo se genera automáticamente; no lo modifique directamente. Para hacer cambios,
ja: メモ:このファイルは自動生成されました。直接変更しないでください。変更したり、
ko: 참고: 자동으로 생성되므로 직접 이 파일을 수정하지 마세요. 변경할 사항이 있거나
zh_hans: 注意:此文件是自动生成的；请勿直接进行修改。若要更改，
zh_hant: 注意:這是自動產生的檔案，請勿直接修改它。若要進行變更，

# PPG_Application_MyAppCommentLine2
source: or if you encounter build errors in this file, go to the Project Designer
cs: nebo pokud dojde v tomto souboru k chybám sestavení, jděte do návrháře projektu
de: oder in dieser Datei Buildfehler auftreten, wechseln Sie zum Projekt-Designer.
es: o si detecta errores de compilación en este archivo, vaya al Diseñador de proyectos
ja: ビルド エラーが発生した場合は、プロジェクト デザイナー へ移動し (プロジェクト
ko: 파일에서 빌드 오류가 발생하는 경우 프로젝트 디자이너로
zh_hans: 或者如果您在此文件中遇到生成错误，请转至项目设计器
zh_hant: 或者您在這個檔案發生建置錯誤，請到專案設計工具

# PPG_Application_MyAppCommentLine3
source: (go to Project Properties or double-click the My Project node in
cs: (přejděte na vlastnosti projektu, nebo dvakrát klikněte na uzel Můj projekt v
de: (Wechseln Sie dazu zu den Projekteigenschaften, oder doppelklicken Sie auf den Knoten "Mein Projekt" im
es: (vaya a Propiedades del proyecto o haga doble clic en el nodo My Project en el
ja: プロパティに移動するか、またはソリューション エクスプローラーのマイ プロジェクト
ko: 이동([프로젝트 속성]으로 이동하거나 솔루션 탐색기에서 My Project 노드를
zh_hans: (转至“项目属性”或在解决方案资源管理器中双击“我的项目”节点)，
zh_hant: (移至專案屬性或者在 [方案總管] 中按兩下 [My Project] 節點)，

# PPG_Application_MyAppCommentLine4
source: Solution Explorer), and make changes on the Application tab.
cs: Průzkumníku řešení), a proveďte změny v kartě Aplikace.
de: Projektmappen-Explorer). Nehmen Sie auf der Registerkarte "Anwendung" entsprechende Änderungen vor.
es: Explorador de soluciones) y realice cambios en la pestaña Aplicación.
ja: ノード上でダブルクリック)、アプリケーション タブ上で変更を行います。
ko: 두 번 클릭)한 다음 [애플리케이션] 탭에서 변경하세요.
zh_hans: 然后在“应用程序”选项卡中进行更改。
zh_hant: 然後在 [應用程式] 索引標籤上進行變更。

# PPG_Application_InvalidIdentifierStartupForm_1Arg
source: '{0}' is not a valid identifier. Please select a different Startup form.
cs: {0} není platný identifikátor. Vyberte prosím jiný úvodní formulář.
de: "{0}" ist kein gültiger Bezeichner. Wählen Sie ein anderes Startformular aus.
es: '{0}' no es un identificador válido. Seleccione otro formulario de inicio.
ja: '{0}' は有効な識別子ではありません別のスタートアップ フォームを選択してください。
ko: '{0}'이(가) 올바른 식별자가 아닙니다. 다른 시작 폼을 선택하세요.
zh_hans: “{0}”不是有效标识符。请选择其他启动窗体。
zh_hant: '{0}' 不是有效的識別碼。請選取其他的啟動表單。

# PPG_Application_InvalidIdentifierSplashScreenForm_1Arg
source: '{0}' is not a valid identifier. Please select a different Splash screen form.
cs: {0} není platný identifikátor. Vyberte prosím jiný formulář úvodní obrazovky.
de: "{0}" ist kein gültiger Bezeichner. Wählen Sie ein anderes Begrüßungsbildschirmformular aus.
es: '{0}' no es un identificador válido. Seleccione otro formulario de pantalla de presentación.
ja: '{0}' は有効な識別子ではありません別のスプラッシュ スクリーン フォームを選択してください。
ko: '{0}'이(가) 올바른 식별자가 아닙니다. 다른 시작 화면 폼을 선택하세요.
zh_hans: “{0}”不是有效标识符。请选择其他初始屏幕窗体。
zh_hant: '{0}' 不是有效的識別碼。請選取其他的啟動顯示畫面表單。

# PPG_Application_SplashSameAsStart
source: The splash screen form cannot be the start-up form.
cs: Z úvodní obrazovky neleze vytvořit úvodní formulář.
de: Das Formular für den Begrüßungsbildschirm muss sich vom Startformular unterscheiden.
es: La pantalla de presentación no puede ser el formulario de inicio.
ja: スプラッシュ スクリーン フォームをスタートアップ フォームにすることはできません。
ko: 시작 화면 폼은 시작 폼일 수 없습니다.
zh_hans: 初始屏幕窗体不能是启动窗体。
zh_hant: 啟動顯示畫面表單不能是啟動表單。

# PPG_Application_StartupFormLabelText
source: Startup f&orm:
cs: Sp&ouštěcí formulář:
de: &Startformular:
es: &Formulario de inicio:
ja: スタートアップ フォーム(&O):
ko: 시작 폼(&O):
zh_hans: 启动窗体(&O):
zh_hant: 起始形式(&O):

# PPG_Application_AppEventsCommentLine1
source: The following events are available for MyApplication:
cs: Pro MyApplication jsou dostupné následující události:
de: Für MyApplication sind folgende Ereignisse verfügbar:
es: Los siguientes eventos están disponibles para MyApplication:
ja: 次のイベントは MyApplication に対して利用できます:
ko: MyApplication에 대해 다음 이벤트를 사용할 수 있습니다:
zh_hans: 以下事件可用于 MyApplication:
zh_hant: MyApplication 可以使用下列事件:

# PPG_Application_AppEventsCommentLine3
source: Startup: Raised when the application starts, before the startup form is created.
cs: Úvodní: Volá se při spouštění aplikace, před vytvořením úvodního formuláře.
de: Startup: Wird beim Starten der Anwendung noch vor dem Erstellen des Startformulars ausgelöst.
es: Inicio: Se genera cuando se inicia la aplicación, antes de que se cree el formulario de inicio.
ja: Startup:アプリケーションが開始されたとき、スタートアップ フォームが作成される前に発生します。
ko: Startup: 애플리케이션이 시작되고 시작 폼이 만들어지기 전에 발생합니다.
zh_hans: Startup:应用程序启动时在创建启动窗体之前引发。
zh_hant: Startup:在應用程式啟動時，但尚未建立啟動表單之前引發。

# PPG_Application_AppEventsCommentLine4
source: Shutdown: Raised after all application forms are closed. This event is not raised if the application terminates abnormally.
cs: Závěrečný: Volá se po zavření všech formulářů aplikací. V případě nestandardního ukončení aplikace se tato událost nevolá.
de: Shutdown: Wird nach dem Schließen aller Anwendungsformulare ausgelöst. Dieses Ereignis wird nicht ausgelöst, wenn die Anwendung mit einem Fehler beendet wird.
es: Apagado: Se genera después de haberse cerrado todos los formularios de aplicación. Este evento no se genera si la aplicación termina de forma anómala.
ja: Shutdown:アプリケーション フォームがすべて閉じられた後に発生します。このイベントは、アプリケーションが異常終了したときには発生しません。
ko: Shutdown: 모든 애플리케이션 폼이 닫힌 후에 발생합니다. 이 이벤트는 애플리케이션이 비정상적으로 종료되는 경우에는 발생하지 않습니다.
zh_hans: Shutdown:在关闭所有应用程序窗体后引发。如果应用程序非正常终止，则不会引发此事件。
zh_hant: Shutdown:在所有應用程式表單關閉之後引發。如果應用程式不正常終止，就不會引發此事件。

# PPG_Application_AppEventsCommentLine5
source: UnhandledException: Raised if the application encounters an unhandled exception.
cs: UnhandledException: Volá se, když v aplikaci dojde k neošetřené výjimce.
de: UnhandledException: Wird bei einem Ausnahmefehler ausgelöst.
es: UnhandledException: Se genera si la aplicación encuentra una excepción no controlada.
ja: UnhandledException:ハンドルされない例外がアプリケーションで発生したときに発生します。
ko: UnhandledException: 애플리케이션에서 처리되지 않은 예외가 발생하는 경우 이 이벤트가 발생합니다.
zh_hans: UnhandledException:在应用程序遇到未经处理的异常时引发。
zh_hant: UnhandledException:在應用程式發生未處理的例外狀況時引發。

# PPG_Application_AppEventsCommentLine6
source: StartupNextInstance: Raised when launching a single-instance application and the application is already active.
cs: StartupNextInstance: Volá se při spuštění aplikace s jednou instancí, pokud už je aplikace aktivní.
de: StartupNextInstance: Wird beim Starten einer Einzelinstanzanwendung ausgelöst, wenn die Anwendung bereits aktiv ist.
es: StartupNextInstance: Se genera cuando se inicia una aplicación de instancia única y dicha aplicación está ya activa.
ja: StartupNextInstance:単一インスタンス アプリケーションが起動され、それが既にアクティブであるときに発生します。
ko: StartupNextInstance: 단일 인스턴스 애플리케이션을 시작할 때 해당 애플리케이션이 이미 활성 상태인 경우 발생합니다.
zh_hans: StartupNextInstance:在启动单实例应用程序且应用程序已处于活动状态时引发。
zh_hant: StartupNextInstance:在啟動單一執行個體應用程式且應用程式已於使用中時引發。

# PPG_Application_AppEventsCommentLine7
source: NetworkAvailabilityChanged: Raised when the network connection is connected or disconnected.
cs: NetworkAvailabilityChanged: Volá se při připojení k síti nebo odpojení od sítě.
de: NetworkAvailabilityChanged: Wird beim Herstellen oder Trennen der Netzwerkverbindung ausgelöst.
es: NetworkAvailabilityChanged: Se genera cuando se conecta o desconecta la conexión de red.
ja: NetworkAvailabilityChanged:ネットワーク接続が接続されたとき、または切断されたときに発生します。
ko: NetworkAvailabilityChanged: 네트워크가 연결되거나 연결이 끊어질 때 발생합니다.
zh_hans: NetworkAvailabilityChanged:在连接或断开网络连接时引发。
zh_hant: NetworkAvailabilityChanged:在建立或中斷網路連線時引發。

# PPG_AdvancedBuildSettings_InvalidBaseAddress
source: Base address must be a hexadecimal number with less than or equal to 8 digits, for example, 0x11000000.
cs: Základní adresa musí být šestnáctkové číslo maximálně s osmi číslicemi, např. 0x11000000.
de: Die Basisadresse muss eine Hexadezimalzahl mit höchstens 8 Ziffern sein, z.B. 0x11000000.
es: La dirección base debe ser un número hexadecimal menor o igual a 8 dígitos, por ejemplo, 0x11000000.
ja: ベース アドレスは 8 桁以下の 16 進数である必要があります (例: 0x11000000)。
ko: 기준 주소는 0x11000000과 같이 8자리 이하의 16진수여야 합니다.
zh_hans: 基址必须是十六进制数，位数小于或等于 8，如 0x11000000。
zh_hant: 基底位址必須是小於或等於 8 位數的十六進位數字，例如 0x11000000。

# PPG_Compile_Notification_None
source: None
cs: žádné
de: Keine
ja: なし
zh_hans: 没有
zh_hant: 無

# PPG_Compile_Notification_Warning
source: Warning
cs: Upozornění
de: Warnung
es: Advertencia
ja: 警告
ko: 경고
zh_hans: 警告
zh_hant: 警告

# PPG_Compile_Notification_Error
source: Error
cs: Chyba
de: Fehler
ja: エラー
ko: 오류
zh_hans: 错误
zh_hant: 錯誤

# PPG_Compile_OptionStrict_Custom
source: (custom)
cs: (vlastní)
de: (benutzerdefiniert)
es: (personalizado)
ja: (カスタム)
ko: (사용자 지정)
zh_hans: (自定义)
zh_hant: (自訂)

# PPG_Compile_42016
source: Implicit conversion
cs: Implicitní převod
de: Implizite Konvertierung
es: Conversión implícita
ja: 暗黙的な変換です
ko: 암시적 변환
zh_hans: 隐式转换
zh_hant: 隱含轉換

# PPG_Compile_42017_42018_42019
source: Late binding; call could fail at run time
cs: Pozdní vazba. Volání může při běhu selhat.
de: Späte Bindung. Aufruf kann zur Laufzeit Fehler verursachen.
es: Enlace en tiempo de ejecución; la llamada podría fallar en tiempo de ejecución
ja: 遅延バインディングです。呼び出しが実行時に失敗する可能性があります
ko: 런타임에 바인딩; 호출이 실패할 수 있음
zh_hans: 后期绑定；调用可能在运行时失败
zh_hant: 晚期繫結，執行階段時呼叫可能失敗
