Repository: dotnet/fsharp
Catalog: vsintegration/src/FSharp.ProjectSystem.PropertyPages/Resources/xlf/Microsoft.VisualStudio.Editors.Designer.*.xlf
Languages: cs, de, es, ja, ko, zh_hans, zh_hant

# DFX_DesignerReadOnlyCaption
source: {0} [Read Only]
cs: {0} [jen pro čtení]
de: {0} [schreibgeschützt]
es: {0} [solo lectura]
ja: {0} [読み取り専用]
ko: {0}[읽기 전용]
zh_hans: {0} [只读]
zh_hant: {0} [唯讀]

# DFX_DesignerLoaderIVsTextStreamNotFound
source: The editor could not get the IVsTextStream for file {0}.
cs: Editoru se nepodařilo pro soubor {0} získat IVsTextStream.
de: Der Editor konnte den IVsTextStream für die Datei "{0}" nicht abrufen.
es: El editor no pudo obtener IVsTextStream para el archivo {0}.
ja: エディターでファイル {0} の IVsTextStream を取得できませんでした。
ko: 편집기에서 {0} 파일에 대한 IVsTextStream을 가져올 수 없습니다.
zh_hans: 编辑器未能获取文件 {0} 的 IVsTextStream。
zh_hant: 編輯器無法取得檔案 {0} 的 IVsTextStream。

# DFX_DesignerLoaderIVsTextStreamNotFoundNoFile
source: The editor could not get the IVsTextStream.
cs: Editoru se nepovedlo získat IVsTextStream.
de: Der Editor konnte den IVsTextStream nicht abrufen.
es: El editor no pudo obtener IVsTextStream.
ja: エディターで IVsTextStream を取得できませんでした。
ko: 편집기에서 IVsTextStream을 가져올 수 없습니다.
zh_hans: 编辑器未能获取 IVsTextStream。
zh_hant: 編輯器無法取得 IVsTextStream。

# DFX_EditorNoDesignerService
source: No DesignerService for file '{0}'.
cs: Pro soubor {0} není dostupná žádná služba DesignerService.
de: Kein DesignerService für die Datei "{0}".
es: No hay ningún DesignerService para el archivo '{0}'.
ja: ファイル '{0}' に対する DesignerService がありません。
ko: '{0}' 파일에 대한 DesignerService가 없습니다.
zh_hans: 没有用于文件“{0}”的 DesignerService。
zh_hant: 檔案 '{0}' 沒有 DesignerService。

# DFX_InvalidPhysicalViewName
source: Invalid physical view name.
cs: Neplatný název fyzického zobrazení.
de: Ungültiger Name für physische Ansicht.
es: Nombre de vista física no válido.
ja: 無効な物理ビュー名です。
ko: 실제 뷰 이름이 잘못되었습니다.
zh_hans: 物理视图名无效。
zh_hant: 實體檢視名稱無效。

# DFX_UnableCreateTextBuffer
source: Unable to create text buffer.
cs: Nelze vytvořit textový zásobník.
de: Textpuffer kann nicht erstellt werden.
es: No se puede crear el búfer del texto.
ja: テキスト バッファーを作成できません。
ko: 텍스트 버퍼를 만들 수 없습니다.
zh_hans: 无法创建文本缓冲区。
zh_hant: 無法建立文字緩衝區。

# DFX_NoLocalRegistry
source: No LocalRegistry service.
cs: Není dostupná žádná služba LocalRegistry.
de: Kein LocalRegistry-Dienst.
es: No hay ningún servicio LocalRegistry.
ja: LocalRegistry サービスがありません。
ko: LocalRegistry 서비스가 없습니다.
zh_hans: 无 LocalRegistry 服务。
zh_hant: 沒有 LocalRegistry 服務。

# DFX_ReplaceTextStreamFailed
source: Replacing text stream failed:{0}
cs: Nahrazení textového streamu nebylo úspěšné: {0}
de: Fehler beim Ersetzen des Textstreams: {0}
es: No se pudo reemplazar la secuencia de texto: {0}
ja: テキスト ストリームの置換に失敗しました: {0}
ko: 텍스트 스트림을 바꾸지 못했습니다. {0}
zh_hans: 替换文本流失败: {0}
zh_hant: 取代文字資料流失敗:{0}

# DFX_BufferReadOnly
source: Buffer is read only.
cs: Vyrovnávací paměť je jen pro čtení.
de: Der Puffer ist schreibgeschützt.
es: El búfer es de solo lectura
ja: バッファーは読み取り専用です。
ko: 버퍼가 읽기 전용입니다.
zh_hans: 缓冲区为只读。
zh_hant: 緩衝區為唯讀。

# DFX_IncompatibleBuffer
source: File is already opened in an incompatible editor.
cs: Soubor je už otevřený v nekompatibilním editoru.
de: Die Datei ist bereits in einem inkompatiblen Editor geöffnet.
es: El archivo ya está abierto en un editor no compatible.
ja: ファイルは、互換性のないエディターで既に開かれています。
ko: 호환되지 않는 편집기에서 파일을 이미 열었습니다.
zh_hans: 已经在不兼容的编辑器中打开了文件。
zh_hant: 已經在不相容的編輯器中開啟了檔案。

# DFX_NotSupported
source: Unsupported format.
cs: Formát není podporovaný.
de: Nicht unterstütztes Format.
es: Formato no admitido.
ja: サポートされていない形式です。
ko: 지원되지 않는 형식입니다.
zh_hans: 不支持的格式。
zh_hant: 不支援的格式。

# DFX_WindowPane_UnknownError
source: Unknown Error.
cs: Neznámá chyba.
de: Unbekannter Fehler.
es: Error desconocido.
ja: 不明なエラーです。
ko: 알 수 없는 오류입니다.
zh_hans: 未知错误。
zh_hant: 未知的錯誤。

# DFX_CreateEditorInstanceFailed_Ex
source: Unable to create the designer. {0}
cs: Nelze vytvořit návrháře. {0}
de: Designer kann nicht erstellt werden. {0}
es: No se puede crear el diseñador. {0}
ja: デザイナーを作成できません。{0}
ko: 디자이너를 만들 수 없습니다. {0}
zh_hans: 无法创建设计器。 {0}
zh_hant: 無法建立設計工具。{0}

# DFX_UnableToCheckout
source: Unable to check out the current file. The file may be read-only or locked, or you may need to check the file out manually.
cs: Aktuální soubor nejde zarezervovat. Soubor může být zamčený, určený jen pro čtení nebo ho budete muset zarezervovat ručně.
de: Die aktuelle Datei konnte nicht ausgecheckt werden. Die Datei ist unter Umständen schreibgeschützt oder gesperrt oder muss manuell ausgecheckt werden.
es: El archivo actual no se puede extraer del repositorio. Puede que el archivo sea de solo lectura o que esté bloqueado, o quizá sea necesario extraer el archivo del repositorio manualmente.
ja: 現在のファイルをチェックアウトできません。ファイルが読み取り専用かロックされています。あるいは、ファイルを手動でチェックアウトする必要がある可能性があります。
ko: 현재 파일을 체크 아웃할 수 없습니다. 파일이 읽기 전용이거나 잠겨 있을 수 있습니다. 또는 수동으로 파일을 체크 아웃해야 할 수도 있습니다.
zh_hans: 无法签出当前文件。该文件可能为只读或已锁定，或者可能需要手动签出文件。
zh_hant: 無法簽出目前檔案。檔案可能處於唯讀或鎖定的狀態，或者您需要手動簽出檔案。

# OptionPage_Editor_InvalidTabSize
source: Please enter an integer between 1 and 60.
cs: Zadejte prosím celočíselnou hodnotu mezi 1 a 60.
de: Geben Sie eine ganze Zahl zwischen 1 und 60 ein.
es: Especifique un entero entre 1 y 60.
ja: 1 から 60 までの整数を入力してください。
ko: 1에서 60 사이의 정수를 입력하세요.
zh_hans: 请输入 1 到 60 之间的整数。
zh_hant: 請輸入介於 1 和 60 之間的整數。

# OptionPage_Editor_InvalidIndentSize
source: Please enter an integer between 1 and 60.
cs: Zadejte prosím celočíselnou hodnotu mezi 1 a 60.
de: Geben Sie eine ganze Zahl zwischen 1 und 60 ein.
es: Especifique un entero entre 1 y 60.
ja: 1 から 60 までの整数を入力してください。
ko: 1에서 60 사이의 정수를 입력하세요.
zh_hans: 请输入 1 到 60 之间的整数。
zh_hant: 請輸入介於 1 和 60 之間的整數。

# OptionPage_Environment_StartUpShowEmptyEnvironment
source: Show empty environment
cs: Zobrazit prázdné prostředí
de: Leere Umgebung anzeigen
es: Mostrar el entorno vacío
ja: 空の環境の表示
ko: 빈 환경 표시
zh_hans: 显示空环境
zh_hant: 顯示空白環境

# OptionPage_Environment_StartUpLoadLastLoadedSolution
source: Load last loaded solution
cs: Načíst poslední načtené řešení
de: Letzte Projektmappe laden
es: Cargar la última solución cargada
ja: 最後に読み込んだソリューションの読み込み
ko: 마지막에 로드한 솔루션 로드
zh_hans: 加载上一次加载的解决方案
zh_hant: 載入上次載入的解決方案

# OptionPage_Environment_StartUpShowNewProjectDialogBox
source: Show New Project dialog box
cs: Zobrazit dialogové okno Nový projekt
de: Dialogfeld "Neues Projekt" anzeigen
es: Mostrar Nuevo proyecto
ja: [新しいプロジェクト] ダイアログ ボックスの表示
ko: [새 프로젝트] 대화 상자 표시
zh_hans: 显示“新建项目”对话框
zh_hant: 顯示 [新增專案] 對話方塊

# OptionPage_Environment_StartUpShowOpenProjectDialogBox
source: Show Open Project dialog box
cs: Zobrazit dialogové okno Otevřít projekt
de: Dialogfeld "Projekt öffnen" anzeigen
es: Mostrar Abrir proyecto
ja: [プロジェクトを開く] ダイアログ ボックスの表示
ko: [프로젝트 열기] 대화 상자 표시
zh_hans: 显示“打开项目”对话框
zh_hant: 顯示 [開啟專案] 對話方塊

# OptionPage_Environment_ShowHelpOptionRequiresRestartOfIde
source: Changes in Help Options will not take effect until the environment is restarted.
cs: Změny v možnostech nápovědy se projeví až po restartování prostředí.
de: Änderungen bei den Hilfeoptionen werden erst nach einem Neustart der Umgebung wirksam.
es: Los cambios en las opciones de la Ayuda no tendrán efecto hasta que se reinicie el entorno.
ja: ヘルプ オプションの変更は、環境が再起動されたときに有効になります。
ko: 도움말 옵션의 변경 내용은 개발 환경을 다시 시작하기 전까지 적용되지 않습니다.
zh_hans: 重新启动环境之后，帮助选项中的更改才会生效。
zh_hant: 在重新啟動環境之前，[說明] 選項中的變更將不會生效。

# OptionPage_Project_IllegalDefaultProjectDirectory
source: The location specified is on an invalid or read-only disk, or contains a device name reserved for the system.
cs: Zadané umístění je buď neplatné, nachází se na disku určeném pouze pro čtení, nebo obsahuje název zařízení rezervovaný systémem.
de: Der angegebene Pfad führt zu einem ungültigen oder schreibgeschützten Datenträger oder enthält einen Gerätenamen, der für das System reserviert ist.
es: La ubicación especificada corresponde a un disco no válido o de solo lectura o contiene el nombre de un dispositivo reservado para el sistema.
ja: 指定されたディスクは無効か、読み取り専用か、またはシステムで予約されたデバイス名を含んでいます。
ko: 지정한 위치가 잘못된 디스크 또는 읽기 전용 디스크에 있거나 시스템용으로 예약된 장치 이름을 포함하고 있습니다.
zh_hans: 所指定的位置在无效或只读的磁盘上，或者包含为系统保留的设备名。
zh_hant: 指定的位置不正確或是唯讀磁碟，或含有為系統保留的裝置名稱。

# AttrEditor_CategoryCOM
source: COM
cs: Model COM

# AttrEditor_CategoryComponentModel
source: Component Design
cs: Návrh komponent
de: Komponentendesign
es: Diseño de componentes
ja: コンポーネント デザイン
ko: 구성 요소 디자인
zh_hans: 组件设计
zh_hant: 元件設計

# AttrEditor_CategorySerialization
source: Serialization
cs: Serializace
de: Serialisierung
es: Serialización
ja: シリアル化
zh_hans: 序列化
zh_hant: 序列化

# AttrEditor_COMClassAttrDescription
source: Expose {0} to COM.
cs: Vystavit {0} modelu COM
de: Legt {0} für COM offen.
es: Exponer {0} a COM.
ja: {0} を COM に公開します。
ko: {0}을(를) COM에 노출합니다.
zh_hans: 将 {0} 向 COM 公开。
zh_hant: 將 {0} 公開至 COM。

# AttrEditor_COMClassAttrDisplayName
source: COM Class
cs: Třída COM
de: COM-Klasse
es: Clase COM
ja: COM クラス
ko: COM 클래스
zh_hans: COM 类
zh_hant: COM 類別

# AttrEditor_COMVisibleAttrDescription
source: Make {0} visible through COM.
cs: Zviditelnit {0} prostřednictvím modelu COM
de: {0} durch COM sichtbar machen.
es: Hacer {0} visible a través de COM.
ja: COM で {0} を表示します。
ko: COM을 통해 {0}을(를) 노출합니다.
zh_hans: 使 {0} 在整个 COM 中可见。
zh_hant: 讓 {0} 可以透過 COM 顯示。

# AttrEditor_COMVisibleAttrDisplayName
source: COM Visible
cs: Viditelný pro model COM
de: Für COM sichtbar
es: Visible a través de COM
ja: COM 参照可能
ko: COM 노출
zh_hans: COM 可见
zh_hant: COM 可見

# AttrEditor_DispIdAttrDescription
source: Set explicit DispId to this {0}.
cs: Nastavit pro {0} explicitní hodnotu DispId
de: Explizite DispId für diese(n/s) {0} festlegen.
es: Establecer el valor DispId explícito a {0}.
ja: 明示的な DispId をこの {0} に設定します。
ko: 이 {0}에 명시적 DispId를 설정합니다.
zh_hans: 将显式 DispId 设置为此 {0}。
zh_hant: 將明確 DispId 設定為這個 {0}。

# AttrEditor_DispIdPropName
source: Value
cs: Hodnota
de: Wert
es: Valor
ja: 値
ko: 값
zh_hans: 值
zh_hant: 值

# AttrEditor_DispIdPropDescription
source: Explicit DispId value for this {0}.
cs: Explicitní hodnota DispId pro {0}
de: Expliziter DispId-Wert für diese(s/n) {0}.
es: Valor DispId explícito para {0}.
ja: この {0} に対する明示的な DispId 値です。
ko: 이 {0}에 대한 명시적 DispId 값입니다.
zh_hans: 此 {0} 的显式 DispId 值。
zh_hant: 這個 {0} 的明確 DispId 值。

# AttrEditor_DispIdPropDisplayName
source: Value
cs: Hodnota
de: Wert
es: Valor
ja: 値
ko: 값
zh_hans: 值
zh_hant: 值

# AttrEditor_DispIdInvalidValue
source: DispId value should be an integer greater than or equal to 1.
cs: Hodnota DispId by měla být celé číslo větší než nebo rovno jedné.
de: DispId-Wert sollte ein Integer größer als bzw. gleich 1 sein.
es: El valor DispId debe ser un número entero mayor o igual a 1.
ja: DispId 値は 1 以上の整数でなければなりません。
ko: DispId 값은 1보다 크거나 같은 정수여야 합니다.
zh_hans: DispId 值应该是大于或等于 1 的整数。
zh_hant: DispId 值必須是大於或等於 1 的整數。

# AttrEditor_CategoryAttrName
source: Category
cs: Kategorie
de: Kategorie
es: Categoría
ja: カテゴリ
ko: 범주
zh_hans: 类别
zh_hant: 分類

# AttrEditor_CategoryAttrDescription
source: Category group for the property.
cs: Skupina kategorií pro vlastnost
de: Kategoriegruppe für die Eigenschaft.
es: Grupo de categorías de la propiedad.
ja: プロパティのカテゴリ グループ
ko: 속성의 범주 그룹입니다.
zh_hans: 属性的类别组。
zh_hant: 屬性的分類群組。

# AttrEditor_CategoryAttrDisplayName
source: Category
cs: Kategorie
de: Kategorie
es: Categoría
ja: カテゴリ
ko: 범주
zh_hans: 类别
zh_hant: 分類

# AttrEditor_DefaultEventAttrName
source: Default Event
cs: Výchozí událost
de: Standardereignis
es: Evento predeterminado
ja: 既定のイベント
ko: 기본 이벤트
zh_hans: 默认事件
zh_hant: 預設事件

# AttrEditor_DefaultEventAttrDescription
source: Default event for the class.
cs: Výchozí událost třídy
de: Standardereignis für die Klasse.
es: Evento predeterminado para la clase.
ja: このクラスの既定のイベントです。
ko: 클래스의 기본 이벤트입니다.
zh_hans: 类的默认事件。
zh_hant: 類別的預設事件。

# AttrEditor_DefaultEventAttrDisplayName
source: Default Event
cs: Výchozí událost
de: Standardereignis
es: Evento predeterminado
ja: 既定のイベント
ko: 기본 이벤트
zh_hans: 默认事件
zh_hant: 預設事件

# AttrEditor_DefaultValueAttrName
source: Default Value
cs: Výchozí hodnota
de: Standardwert
es: Valor predeterminado
ja: 既定値
zh_hans: 默认值
zh_hant: 預設值

# AttrEditor_DefaultValueAttrDescription
source: Default value for the property.
cs: Výchozí událost vlastnosti
de: Standardwert für die Eigenschaft.
es: Valor predeterminado de la propiedad.
ja: プロパティの既定値です。
ko: 속성의 기본값입니다.
zh_hans: 属性的默认值。
zh_hant: 屬性的預設值。

# AttrEditor_DefaultValueAttrDisplayName
source: Default Value
cs: Výchozí hodnota
de: Standardwert
es: Valor predeterminado
ja: 既定値
zh_hans: 默认值
zh_hant: 預設值

# AttrEditor_NonSerializedAttrDescription
source: Field should not be serialized.
cs: Pole by nemělo být serializované.
de: Das Feld sollte nicht serialisiert werden.
es: No se debe serializar el campo.
ja: フィールドはシリアル化できません。
ko: 필드는 serialize할 수 없습니다.
zh_hans: 字段不应序列化。
zh_hant: 欄位不可以序列化。

# AttrEditor_NonSerializedAttrDisplayName
source: Non Serialized
cs: Neserializované
de: Nicht serialisiert
es: No serializado
ja: 逆シリアル化
ko: Serialize되지 않음
zh_hans: 未序列化
zh_hant: 非序列化

# AttrEditor_SerializableAttrName
source: Serializable
cs: Serializovatelné
de: Serialisierbar
ja: シリアル化可能
ko: 직렬화 가능
zh_hans: 可序列化
zh_hant: 可序列化

# AttrEditor_SerializableAttrDescription
source: Enable serialization for this {0} and its members.
cs: Povolit serializaci pro {0} včetně členů
de: Aktiviert die Serialisierung für diese(n/s) {0} und die entsprechenden Member.
es: Habilitar serialización para estos {0} y sus miembros.
ja: この {0} およびそのメンバーに対するシリアル化を有効にします。
ko: 이 {0} 및 해당 멤버에 대해 serialization을 활성화합니다.
zh_hans: 为此 {0} 及其成员启用序列化。
zh_hant: 啟用這個 {0} 及其成員的序列化。

# AttrEditor_SerializableAttrDisplayName
source: Serializable
cs: Serializovatelné
de: Serialisierbar
ja: シリアル化可能
ko: 직렬화 가능
zh_hans: 可序列化
zh_hant: 可序列化

# AttrEditor_WebMethodAttrDescription
source: Expose method via web services.
cs: Vystavit metodu prostřednictvím webových služeb
de: Legt die Methode über Webdienste offen.
es: Exponer método a través de servicios Web.
ja: Web サービスでメソッドを公開します。
ko: 웹 서비스를 통해 메서드를 노출합니다.
zh_hans: 通过 Web 服务公开方法。
zh_hant: 透過 Web 服務公開方法。

# AttrEditor_WebMethodAttrDisplayName
source: Web Method
cs: Metoda webové služby
de: Webmethode
es: Método web
ja: Web メソッド
ko: 웹 메서드
zh_hans: Web 方法
zh_hant: Web 方法

# AttrEditor_WebMethodDescName
source: Description
cs: Popis
de: Beschreibung
es: Descripción
ja: 説明
ko: 설명
zh_hans: 说明
zh_hant: 描述

# AttrEditor_WebMethodDescDescription
source: Description for the Web Method.
cs: Popis metody webové služby
de: Beschreibung der Webmethode.
es: Descripción del método web.
ja: Web メソッドの説明です。
ko: 웹 메서드에 대한 설명입니다.
zh_hans: Web 方法的说明。
zh_hant: Web 方法的描述。

# AttrEditor_WebMethodDescDisplayName
source: Description
cs: Popis
de: Beschreibung
es: Descripción
ja: 説明
ko: 설명
zh_hans: 说明
zh_hant: 描述

# AttrEditor_WebMethodEnableSessionDescription
source: Maintain session state.
cs: Zachovat stav relace
de: Behält den Sitzungszustand bei.
es: Mantener estado de sesión.
ja: セッション状態を維持します。
ko: 세션 상태를 유지합니다.
zh_hans: 维护会话状态。
zh_hant: 維護工作階段狀態。

# AttrEditor_WebMethodEnableSessionDisplayName
source: Enable Session
cs: Povolit relaci
de: Sitzung aktivieren
es: Habilitar sesión
ja: セッションを有効にする
ko: 세션 사용
zh_hans: 启用会话
zh_hant: 啟用工作階段

# AttrEditor_WebMethodTransactionDescription
source: Set transaction options.
cs: Nastavit možnosti transakce
de: Legt Transaktionsoptionen fest.
es: Establecer opciones de transacción.
ja: トランザクション オプションを設定します。
ko: 트랜잭션 옵션을 설정합니다.
zh_hans: 设置事务选项。
zh_hant: 設定異動選項。

# AttrEditor_WebMethodTransactionDisplayName
source: Transaction Options
cs: Možnosti transakce
de: Transaktionsoptionen
es: Opciones de transacción
ja: トランザクション オプション
ko: 트랜잭션 옵션
zh_hans: 事务选项
zh_hant: 異動選項

# AttrEditor_WebServiceAttrDescription
source: Configure the Web Service settings.
cs: Konfigurovat nastavení webové služby
de: Konfiguriert die Webdiensteinstellungen.
es: Configurar los parámetros del servicio Web.
ja: Web サービス設定を構成します。
ko: 웹 서비스 설정을 구성합니다.
zh_hans: 配置 Web 服务设置。
zh_hant: 設定 Web 服務的設定。

# AttrEditor_WebServiceAttrDisplayName
source: Web Service
cs: Webová služba
de: Webdienst
es: Servicio Web
ja: Web サービス
ko: 웹 서비스
zh_hans: Web 服务
zh_hant: Web 服務

# AttrEditor_WebServiceNameName
source: Name
cs: Název
es: Nombre
ja: 名前
ko: 이름
zh_hans: 名称
zh_hant: 名稱

# AttrEditor_WebServiceNameDescription
source: Name for the web service.
cs: Název webové služby
de: Name des Webdiensts.
es: Nombre del servicio Web.
ja: Web サービスの名前です。
ko: 웹 서비스의 이름입니다.
zh_hans: Web 服务的名称。
zh_hant: Web 服務的名稱。

# AttrEditor_WebServiceNameDisplayName
source: Name
cs: Název
es: Nombre
ja: 名前
ko: 이름
zh_hans: 名称
zh_hant: 名稱

# AttrEditor_WebServiceDescName
source: Description
cs: Popis
de: Beschreibung
es: Descripción
ja: 説明
ko: 설명
zh_hans: 说明
zh_hant: 描述

# AttrEditor_WebServiceDescDescription
source: Description for the web service.
cs: Popis webové služby
de: Beschreibung des Webdiensts.
es: Descripción del servicio Web.
ja: Web サービスの説明です
ko: 웹 서비스에 대한 설명입니다.
zh_hans: Web 服务的说明。
zh_hant: Web 服務的描述。

# AttrEditor_WebServiceDescDisplayName
source: Description
cs: Popis
de: Beschreibung
es: Descripción
ja: 説明
ko: 설명
zh_hans: 说明
zh_hant: 描述

# AttrEditor_WebServiceNSName
source: Namespace
cs: Obor názvů
es: Espacio de nombres
ja: 名前空間
ko: 네임스페이스
zh_hans: 命名空间
zh_hant: 命名空間

# AttrEditor_WebServiceNSDescription
source: Namespace for the web service.
cs: Obor názvů webové služby
de: Namespace für den Webdienst.
es: Espacio de nombres del servicio Web.
ja: Web サービスの名前空間です。
ko: 웹 서비스의 네임스페이스입니다.
zh_hans: Web 服务的命名空间。
zh_hant: Web 服務的命名空間。

# AttrEditor_WebServiceNSDisplayName
source: Namespace
cs: Obor názvů
es: Espacio de nombres
ja: 名前空間
ko: 네임스페이스
zh_hans: 命名空间
zh_hant: 命名空間

# AttrEditor_CAT_Default
source: Default
cs: Výchozí
de: Standard
es: Predeterminado
ja: 既定
ko: 기본값
zh_hans: 默认值
zh_hant: 預設

# AttrEditor_CAT_Action
source: Action
cs: Akce
de: Aktion
es: Acción
ja: アクション
ko: 작업
zh_hans: 操作
zh_hant: 動作

# AttrEditor_CAT_Appearance
source: Appearance
cs: Vzhled
de: Darstellung
es: Apariencia
ja: 外観
ko: 모양
zh_hans: 外观
zh_hant: 外觀

# AttrEditor_CAT_Behavior
source: Behavior
cs: Chování
de: Verhalten
es: Comportamiento
ja: 動作
ko: 동작
zh_hans: 行为
zh_hant: 行為

# AttrEditor_CAT_Focus
source: Focus
cs: Fokus
de: Fokus
es: Foco
ja: フォーカス
ko: 포커스
zh_hans: 焦点
zh_hant: 焦點

# AttrEditor_CAT_Format
source: Format
cs: Formát
es: Formato
ja: 形式
ko: 서식
zh_hans: 格式
zh_hant: 格式

# AttrEditor_CAT_Key
source: Key
cs: Klíč
de: Taste
es: Clave
ja: キー
ko: 키
zh_hans: 键
zh_hant: 索引鍵

# AttrEditor_CAT_Layout
source: Layout
cs: Rozložení
es: Diseño
ja: レイアウト
ko: 레이아웃
zh_hans: 布局
zh_hant: 配置

# AttrEditor_CAT_Mouse
source: Mouse
cs: Myš
de: Maus
ja: マウス
ko: 마우스
zh_hans: 鼠标
zh_hant: 滑鼠

# AttrEditor_DE_None
source: (None)
cs: (žádné)
de: (Keine)
es: (Ninguno)
ja: (なし)
ko: (없음)
zh_hans: (无)
zh_hant: (無)

# PermissionSet_Requires
source: Requires:
cs: Vyžaduje:
de: Erforderlich:
es: Requiere:
ja: 必要なアクセス許可:
ko: 필요한 권한:
zh_hans: 要求:
zh_hant: 需要:

# RSE_ResourceNameColumn
source: Name
cs: Název
es: Nombre
ja: 名前
ko: 이름
zh_hans: 名称
zh_hant: 名稱

# RSE_TypeColumn
source: Type
cs: Typ
de: Typ
es: Tipo
ja: 種類
zh_hans: 类型
zh_hant: 型別

# RSE_ResourceColumn
source: Value
cs: Hodnota
de: Wert
es: Valor
ja: 値
ko: 값
zh_hans: 值
zh_hant: 值

# RSE_CommentColumn
source: Comment
cs: Komentář
de: Kommentar
es: Comentario
ja: コメント
ko: 주석
zh_hans: 注释
zh_hant: 註解

# SingleFileGenerator_FailedToGenerateFile_1Arg
source: Failed to generate file: {0}
cs: Generování souboru selhalo: {0}
de: Fehler beim Generieren der Datei: {0}
es: No se pudo generar el archivo: {0}
ja: ファイルの生成に失敗しました: {0}
ko: {0} 파일을 생성하지 못했습니다.
zh_hans: 未能生成文件: {0}
zh_hant: 無法產生檔案: {0}

# RSE_Err_CantEditEmbeddedResource
source: Editing embedded resources directly is not supported. Do you wish to convert this item to a linked resource in order to edit it?
cs: Přímá úprava vložených prostředků není podporovaná. Chcete tuto položku převést na propojený prostředek, abyste ho mohli upravit?
de: Die direkte Bearbeitung eingebetteter Ressourcen wird nicht unterstützt. Möchten Sie das Element in eine verknüpfte Ressource konvertieren, um sie zu bearbeiten?
es: No se admite la edición directa de recursos insertados ¿Quiere convertir este elemento en un recurso vinculado para poder editarlo?
ja: 埋め込まれたリソースを直接編集する機能はサポートされていません。このアイテムをリンクされたリソースに変換して編集しますか?
ko: 포함 리소스는 직접 편집할 수 없습니다. 이 항목을 편집이 가능한 링크된 리소스로 변환하시겠습니까?
zh_hans: 不支持直接编辑嵌入的资源。是否将此项转换为链接资源，以便对其进行编辑?
zh_hant: 不支援直接編輯內嵌資源。要將此項目轉換成連結資源以便進行編輯嗎?

# RSE_Err_RenameNotSupported
source: The current object is auto-generated and only supports renaming through the Managed Resources Editor.
cs: Aktuální objekt se vygeneroval automaticky a podporuje přejmenovávání jenom pomocí editoru spravovaných prostředků.
de: Das aktuelle Objekt wurde automatisch generiert und kann nur mithilfe des Editors für verwaltete Ressourcen umbenannt werden.
es: El objeto actual se genera automáticamente y sólo admite el cambio de nombre a través del Editor de recursos administrados.
ja: 現在のオブジェクトは自動生成されていて、マネージド リソース エディターによる名前の変更のみサポートしています。
ko: 현재 개체는 자동으로 생성되었으며 관리되는 리소스 편집기를 통해서만 이름을 바꿀 수 있습니다.
zh_hans: 当前对象是自动生成的，只支持通过受管理资源编辑器重命名。
zh_hant: 目前的物件是自動產生的，而且僅支援透過受控資源編輯器重新命名。

# RSE_Err_CantFindResourceFile_1Arg
source: Cannot find the file '{0}'. It may have been moved or deleted.
cs: Soubor {0} se nedá najít. Možná byl přesunut nebo odstraněn.
de: Die Datei "{0}" wurde nicht gefunden. Möglicherweise wurde sie verschoben oder gelöscht.
es: No se encuentra el archivo '{0}'. Puede que se haya movido o eliminado.
ja: ファイル '{0}' が見つかりません。移動または削除された可能性があります。
ko: '{0}' 파일을 찾을 수 없습니다. 이동되었거나 삭제된 것 같습니다.
zh_hans: 无法找到文件“{0}”。该文件可能已被移动或删除。
zh_hant: 找不到檔案 '{0}'，可能已移動或刪除。

# RSE_Err_LoadingResource_1Arg
source: Unable to load resource from file '{0}'.
cs: Ze souboru '{0}' se nepodařilo načíst prostředek.
de: Die Ressource aus Datei "{0}" kann nicht geladen werden.
es: No se puede cargar el recurso del archivo '{0}'.
ja: ファイル '{0}' からリソースを読み込めません。
ko: '{0}' 파일에서 리소스를 로드할 수 없습니다.
zh_hans: 无法从文件“{0}”加载资源。
zh_hant: 無法從檔案 '{0}' 載入資源。

# RSE_Err_NameBlank
source: The resource name cannot be empty.
cs: Název prostředku nemůže být prázdný.
de: Der Ressourcenname darf nicht leer sein.
es: El nombre del recurso no puede estar vacío.
ja: リソース名は空白にできません。
ko: 리소스 이름을 비워둘 수 없습니다.
zh_hans: 资源名称不能是空的。
zh_hant: 資源名稱不能為空白。

# RSE_Err_DuplicateName_1Arg
source: There is already another resource with the name '{0}'.
cs: Už existuje jiný prostředek s názvem {0}.
de: Es ist bereits eine andere Ressource mit dem Namen "{0}" vorhanden.
es: Ya existe un recurso con el nombre '{0}'.
ja: '{0}' という名前の付いた別のリソースが既にあります。
ko: 이름이 '{0}'인 다른 리소스가 이미 있습니다.
zh_hans: 已经存在使用名称“{0}”的其他资源。
zh_hant: 已經有另一個名為 '{0}' 的資源。

# RSE_Err_UnexpectedResourceType
source: The resource was not of the expected type.
cs: Prostředek není očekávaného typu.
de: Die Ressource hatte nicht den erwarteten Typ.
es: El recurso no era del tipo esperado.
ja: リソースは、予期された型ではありませんでした。
ko: 리소스가 올바른 형식이 아닙니다.
zh_hans: 资源不是需要的类型。
zh_hant: 資源不是預期的類型。

# RSE_Err_CantCreateNewResource_2Args
source: Unable to create new resource file '{0}'. {1}
cs: Nepodařilo se vytvořit nový soubor prostředku {0}. {1}
de: Die neue Ressourcendatei "{0}" konnte nicht erstellt werden. {1}
es: No se puede crear el nuevo archivo de recursos '{0}'. {1}
ja: 新しいリソース ファイル '{0}' を作成できません。 {1}
ko: 새 리소스 파일 '{0}'을(를) 만들 수 없습니다. {1}
zh_hans: 无法创建新的资源文件“{0}”。 {1}
zh_hant: 無法建立新的資源檔 '{0}'。{1}

# RSE_Err_CantPlay_1Arg
source: Unable to play the audio resource. {0}
cs: Nelze přehrát zdroj zvuku. {0}
de: Die Audioressource kann nicht wiedergegeben werden. {0}
es: No se puede reproducir el recurso de sonido. {0}
ja: オーディオ リソースを再生できません。{0}
ko: 오디오 리소스를 재생할 수 없습니다. {0}
zh_hans: 无法播放音频资源。 {0}
zh_hant: 無法播放音效資源。{0}
