Repository: dotnet/fsharp
Catalog: vsintegration/src/FSharp.ProjectSystem.PropertyPages/Resources/xlf/Microsoft.VisualStudio.Editors.Designer.*.xlf
Languages: cs, de, es, ja, ko, zh_hans, zh_hant

# PPG_Signing_NoData
source: (none)
cs: (žádné)
de: (keine)
es: (ninguno)
ja: (なし)
ko: (없음)
zh_hans: (无)
zh_hant: (無)

# PPG_Signing_OpenExistingKeyPasswordTitle
source: Enter password to open file
cs: Zadat heslo pro otevření souboru
de: Kennwort zum Öffnen der Datei eingeben
es: Escriba la contraseña para abrir el archivo
ja: ファイルを開くためのパスワードを入力してください。
ko: 파일을 여는 데 필요한 암호 입력
zh_hans: 输入密码以打开文件
zh_hant: 輸入密碼以開啟檔案

# PPG_Signing_OpenExistingKeyPasswordPrompt
source: Enter &password to open file {0}
cs: Zadejte &heslo pro otevření souboru {0}
de: &Kennwort eingeben, um Datei zu öffnen {0}
es: Escriba la &contraseña para abrir archivo {0}
ja: ファイル {0} を開くためのパスワードを入力(&P)
ko: {0} 파일을 여는 데 필요한 암호 입력(&P)
zh_hans: 输入密码打开文件 {0}(&P)
zh_hant: 輸入密碼以開啟檔案 {0}(&P)

# PPG_Signing_CreateNewKeyPasswordPrompt
source: Enter &password for new file {0}
cs: Zadejte &heslo pro nový soubor {0}
de: &Kennwort für neue Datei {0} eingeben
es: Escriba la &contraseña para el nuevo archivo {0}
ja: 新しいファイル {0} のパスワードを入力(&P)
ko: 새 파일 {0}의 암호 입력(&P)
zh_hans: 输入新文件 {0} 的密码(&P)
zh_hant: 輸入新檔案 {0} 的密碼(&P)

# PPG_Signing_ProjectAlreadyContainsFile
source: The project already contains a file with that name. Choose another certificate file or rename the file in your project.
cs: Soubor s tímto názvem už projekt obsahuje. Vyberte jiný soubor certifikátu nebo soubor v projektu přejmenujte.
de: Das Projekt enthält bereits eine Datei mit diesem Namen. Wählen Sie eine andere Zertifikatsdatei aus, oder benennen Sie die Datei in Ihrem Projekt um.
es: El proyecto ya contiene un archivo con ese nombre. Elija otro archivo de certificado o cámbiele el nombre al archivo del proyecto.
ja: プロジェクトには既にその名前のファイルが含まれています。別の証明書ファイルを選択するか、またはプロジェクト内のファイル名を変更してください。
ko: 같은 이름의 파일이 프로젝트에 이미 있습니다. 다른 인증서 파일을 선택하거나 프로젝트에 있는 파일 이름을 바꾸세요.
zh_hans: 项目已包含具有该名称的文件。请选择其他证书文件或重命名项目中的文件。
zh_hant: 專案已經包含相同名稱的檔案。請選擇另一個憑證檔，或將專案中的檔案重新命名。

# PPG_Signing_CouldNotImportFile
source: The file '{0}' could not be imported: {1}
cs: Soubor {0} nejde naimportovat: {1}
de: Die Datei "{0}" konnte nicht importiert werden: {1}
es: No se puede importar el archivo '{0}': {1}
ja: ファイル '{0}' をインポートできませんでした: {1}
ko: '{0}' 파일을 가져올 수 없습니다. {1}
zh_hans: 未能导入文件“{0}”: {1}
zh_hant: 無法匯入檔案 '{0}': {1}

# PPG_Signing_CertificateNotCodeSigning
source: The selected certificate is not valid for code signing. Choose another certificate file.
cs: Vybraný certifikát nejde použít k podepisování kódu, protože je neplatný. Vyberte jiný soubor certifikátu.
de: Das ausgewählte Zertifikat ist für das Codesignieren nicht gültig. Wählen Sie eine andere Zertifikatsdatei aus.
es: El certificado seleccionado no es válido para la firma de código. Elija otro archivo de certificado.
ja: 選択された証明書はコードの署名には無効です。別の証明書ファイルを選択してください。
ko: 선택한 인증서는 코드 서명에 사용할 수 없습니다. 다른 인증서 파일을 선택하세요.
zh_hans: 所选证书对代码签名无效。请另行选择证书文件。
zh_hant: 選取的憑證對程式碼簽署無效。請選擇其他憑證檔。

# PPG_UndoTransaction
source: Change property: {0}
cs: Změnit vlastnost: {0}
de: Eigenschaft ändern: {0}
es: Cambiar la propiedad: {0}
ja: プロパティの変更: {0}
ko: 속성 변경: {0}
zh_hans: 更改属性: {0}
zh_hant: 變更屬性: {0}

# PPG_WindowsApp
source: Windows Application
cs: Aplikace systému Windows
de: Windows-Anwendung
es: Aplicación Windows
ja: Windows アプリケーション
ko: Windows 애플리케이션
zh_hans: Windows 应用程序
zh_hant: Windows 應用程式

# PPG_WindowsService
source: Windows Service
cs: Služba Windows
de: Windows-Dienst
es: Servicio de Windows
ja: Windows サービス
ko: Windows 서비스
zh_hans: Windows 服务
zh_hant: Windows 服務

# PPG_WindowsClassLib
source: Class Library
cs: Knihovna tříd
de: Klassenbibliothek
es: Biblioteca de clases
ja: クラス ライブラリ
ko: 클래스 라이브러리
zh_hans: 类库
zh_hant: 類別庫

# PPG_CommandLineApp
source: Console Application
cs: Konzolová aplikace
de: Konsolenanwendung
es: Aplicación de consola
ja: コンソール アプリケーション
ko: 콘솔 애플리케이션
zh_hans: 控制台应用程序
zh_hant: 主控台應用程式

# PPG_WebControlLib
source: Web Control Library
cs: Knihovna webových prvků
de: Websteuerelementbibliothek
es: Biblioteca de controles web
ja: Web コントロール ライブラリ
ko: 웹 컨트롤 라이브러리
zh_hans: Web 控件库
zh_hant: Web 控制項程式庫

# PPG_Reference_CanNotRemoveReference
source: Cannot remove '{0}'. {1}
cs: {0} nejde odebrat. {1}
de: "{0}" kann nicht entfernt werden. {1}
es: No se puede quitar '{0}'. {1}
ja: '{0}' を削除できません。 {1}
ko: '{0}'을(를) 제거할 수 없습니다. {1}
zh_hans: 无法删除“{0}”。{1}
zh_hant: 無法移除 '{0}'。{1}

# PPG_Reference_RemoveImportsFailUnexpected
source: Adding or removing '{0}' as a project import failed because of an unexpected error from the project system. The error returned was: '{1}'.
cs: Přidání nebo odebrání {0} při importu projektu selhalo kvůli nečekané chybě systému projektu. Vrácená chyba: {1}
de: Unerwarteter Fehler des Projektsystems beim Hinzufügen oder Löschen von "{0}" als Projektimport. Zurückgegebener Fehler: {1}.
es: No se pudo agregar o quitar '{0}' como importación de proyecto debido a un error inesperado del sistema del proyecto. El error devuelto es: '{1}'.
ja: プロジェクト システムからの予期しないエラーのため、'{0}' をプロジェクトのインポートとして追加または削除できませんでした。次のエラーが返されました: '{1}'
ko: 프로젝트 시스템에서 예기치 않은 오류가 발생하여 '{0}'을(를) 프로젝트 가져오기로 추가하거나 제거하지 못했습니다. 반환된 오류는 '{1}'입니다.
zh_hans: 由于项目系统中发生意外错误，未能将“{0}”作为项目导入进行添加或删除。返回的错误为:“{1}”。
zh_hant: 由於專案系統發生未預期的錯誤，導致專案匯入時新增或移除 '{0}' 失敗。傳回的錯誤是: '{1}'。

# PPG_Reference_AddWebReference
source: Adding web reference failed. {0}
cs: Webový odkaz se nepodařilo přidat. {0}
de: Fehler beim Hinzufügen des Webverweises. {0}
es: No se pudo agregar la referencia web. {0}
ja: Web 参照の追加に失敗しました。{0}
ko: 웹 참조를 추가하지 못했습니다. {0}
zh_hans: 添加 Web 引用失败。{0}
zh_hant: 新增 Web 參考失敗。{0}

# PPG_Reference_FailedToUpdateWebReference
source: Updating web reference '{0}' failed. {1}
cs: Webový odkaz {0} nejde aktualizovat. {1}
de: Fehler beim Aktualisieren des Webverweises "{0}". {1}
es: No se pudo actualizar la referencia web '{0}'. {1}
ja: Web 参照 '{0}' の更新に失敗しました。 {1}
ko: 웹 참조 '{0}'을(를) 업데이트하지 못했습니다. {1}
zh_hans: 更新 Web 引用“{0}”失败。 {1}
zh_hant: 更新 Web 參考 '{0}' 失敗。 {1}

# PPG_WebReferenceTypeName
source: Web Reference Properties
cs: Vlastnosti webového odkazu
de: Webverweiseigenschaften
es: Propiedades de la referencia web
ja: Web 参照プロパティ
ko: 웹 참조 속성
zh_hans: Web 引用属性
zh_hant: Web 參考屬性

# PPG_UrlBehavior_Static
source: Static
cs: Statický
de: Statisch
es: Estático
ja: 静的
ko: 정적
zh_hans: 静态
zh_hant: 靜態

# PPG_UrlBehavior_Dynamic
source: Dynamic
cs: Dynamický
de: Dynamisch
es: Dinámico
ja: 動的
ko: 동적
zh_hans: 动态
zh_hant: 動態

# PPG_WebReferenceNameDescription
source: Name of the web reference
cs: Název webového odkazu
de: Name des Webverweises
es: Nombre de la referencia web
ja: Web 参照の名前です
ko: 웹 참조 이름
zh_hans: Web 引用的名称
zh_hant: Web 參考的名稱

# PPG_UrlBehaviorName
source: URL Behavior
cs: Chování URL
de: URL-Verhalten
es: Comportamiento de la URL
ja: URL の動作
ko: URL 동작
zh_hans: URL 行为
zh_hant: URL 行為

# PPG_UrlBehaviorDescription
source: Web reference URL behavior
cs: Chování URL webového odkazu
de: Webverweis-URL-Verhalten
es: Comportamiento de la dirección URL de la referencia web
ja: Web 参照 URL の動作
ko: 웹 참조 URL 동작
zh_hans: Web 引用 URL 行为
zh_hant: Web 參考 URL 行為

# PPG_WebReferenceUrlName
source: Web Reference URL
cs: URL webového odkazu
de: Webverweis-URL
es: URL de referencia web
ja: Web 参照 URL
ko: 웹 참조 URL
zh_hans: Web 引用 URL
zh_hant: Web 參考 URL

# PPG_WebReferenceUrlDescription
source: Web Reference URL
cs: URL webového odkazu
de: Webverweis-URL
es: URL de referencia web
ja: Web 参照 URL
ko: 웹 참조 URL
zh_hans: Web 引用 URL
zh_hant: Web 參考 URL

# PPG_ReferenceDetail_Title
source: Reference Properties
cs: Vlastnosti odkazu
de: Verweiseigenschaften
es: Propiedades de la referencia
ja: 参照プロパティ
ko: 참조 속성
zh_hans: 引用属性
zh_hant: 參考屬性

# PropPage_RemoteMachineBlankError
source: The remote machine name cannot be blank. Please specify the name of the machine to debug remotely.
cs: Název vzdáleného počítače nesmí být prázdný. Zadejte prosím název vzdáleně laděného počítače.
de: Der Name des Remotecomputers darf nicht leer sein. Geben Sie den Namen des Computers für das Remotedebuggen ein.
es: El nombre de la máquina remota no puede estar en blanco. Especifique el nombre de la máquina para la depuración remota.
ja: リモート コンピューター名を空白にすることはできません。リモートでデバッグするコンピューターの名前を指定してください。
ko: 원격 컴퓨터 이름은 비워 둘 수 없습니다. 원격으로 디버그할 컴퓨터의 이름을 지정하세요.
zh_hans: 远程计算机名称不能为空。请指定要远程调试的计算机的名称。
zh_hant: 遠端電腦名稱不能為空白。請指定電腦名稱以進行遠端偵錯。

# PropPage_ProgramNotExist
source: The external program cannot be found. Please enter a valid executable file.
cs: Externí program se nedá najít. Zadejte prosím platný spustitelný soubor.
de: Das externe Programm wurde nicht gefunden. Geben Sie eine gültige ausführbare Datei ein.

# PropPage_NeedExternalProgram
source: The external program property cannot be empty. Please enter a valid executable file.
cs: Vlastnost s externím programem nesmí být prázdná. Zadejte prosím platný spustitelný soubor.
de: Die Eigenschaft für das externe Programm darf nicht leer sein. Geben Sie eine gültige ausführbare Datei ein.
es: La propiedad de programa externo no puede estar vacía. Especifique un archivo ejecutable válido.
ja: 外部プログラム プロパティは空にできません。有効な実行可能ファイルを入力してください。
ko: 외부 프로그램 속성은 비워 둘 수 없습니다. 올바른 실행 파일을 입력하세요.
zh_hans: 外部程序属性不能为空。请输入有效的可执行文件。
zh_hant: 外部程式屬性不可為空白。請輸入有效的可執行檔。

# PropPage_NotAnExeError
source: We can only debug an EXE file. Please enter a valid executable file.
cs: Ladit jde jenom soubor EXE. Zadejte prosím platný spustitelný soubor.
de: Das Debuggen ist nur bei EXE-Dateien möglich. Geben Sie eine gültige ausführbare Datei ein.
es: Solo podemos depurar un archivo EXE. Especifique un archivo ejecutable válido.
ja: EXE ファイルのみをデバッグすることができます。有効な実行可能ファイルを入力してください。
ko: EXE 파일만 디버그할 수 있습니다. 올바른 실행 파일을 입력하세요.
zh_hans: 只能调试 EXE 文件。请输入有效的可执行文件。
zh_hant: 僅可為 EXE 檔案偵錯。請輸入有效的可執行檔。

# PropPage_NeedURL
source: The URL property cannot be empty. Please enter a valid URL.
cs: Vlastnost URL nesmí být prázdná. Zadejte platnou adresu URL.
de: Die URL-Eigenschaft darf nicht leer sein. Geben Sie eine gültige URL ein.
es: La propiedad URL no puede estar vacía. Especifique una dirección URL válida.
ja: URL プロパティは空にできません。有効な URL を入力してください。
ko: URL 속성은 비워 둘 수 없습니다. 올바른 URL을 입력하세요.
zh_hans: URL 属性不能为空。请输入有效的 URL
zh_hant: URL 屬性不可為空白。請輸入有效的 URL。

# PropPage_InvalidURL
source: The URL is invalid. Please enter a valid URL like "http://www.microsoft.com/"
cs: Adresa URL není platná. Zadejte prosím platnou adresu URL, třeba http://www.microsoft.com/.
de: Die URL ist ungültig. Geben Sie eine gültige URL (beispielsweise "http://www.microsoft.com/") ein.
es: La dirección URL no es válida. Escriba una dirección URL válida, como "http://www.microsoft.com/"
ja: URL が無効です。"http://www.microsoft.com/" のような有効な URL を入力してください。
ko: URL이 잘못되었습니다. "http://www.microsoft.com/"과 같은 올바른 URL을 입력하세요.
zh_hans: URL 无效。请输入有效的 URL，如“http://www.microsoft.com/”
zh_hant: URL 無效。請輸入有效的 URL，例如 "http://www.microsoft.com/"

# PropPage_WorkingDirError
source: The working directory you entered does not exist. Please enter a valid working directory.
cs: Zadaný pracovní adresář neexistuje. Zadejte prosím platný pracovní adresář.
de: Das eingegebene Arbeitsverzeichnis ist nicht vorhanden. Geben Sie ein gültiges Arbeitsverzeichnis ein.
es: El directorio de trabajo especificado no existe. Escriba un directorio de trabajo válido.
ja: 入力した作業ディレクトリは存在しません。有効な作業ディレクトリを入力してください。
ko: 입력한 작업 디렉터리가 없습니다. 올바른 작업 디렉터리를 입력하세요.
zh_hans: 输入的工作目录不存在。请输入有效的工作目录。
zh_hant: 您輸入的工作目錄不存在。請輸入有效的工作目錄。

# PropPage_ReferenceNotFound
source: <The system cannot find the reference specified>
cs: <Systém nemůže najít zadaný odkaz.>
de: <System kann den angegebenen Verweis nicht finden>
es: <El sistema no puede encontrar la referencia especificada>
ja: <システムは、指定された参照を見つけることができません>
ko: <지정한 참조를 찾을 수 없습니다.>
zh_hans: <系统找不到指定的引用>
zh_hant: <系統找不到指定的參考>

# PropPage_UnusedReferenceTitle
source: Unused References
cs: Nepoužité odkazy
de: Nicht verwendete Verweise
es: Referencias sin usar
ja: 未使用の参照
ko: 사용하지 않는 참조
zh_hans: 未使用的引用
zh_hant: 未使用的參考

# PropPage_UnusedReferenceRemoveButton
source: &Remove
cs: Odeb&rat
de: &Entfernen
es: &Quitar
ja: 削除(&R)
ko: 제거(&R)
zh_hans: 删除(&R)
zh_hant: 移除(&R)

# PropPage_UnusedReferenceNoUnusedReferences
source: No unused references
cs: Žádné nepoužité odkazy
de: Keine nicht verwendeten Verweise vorhanden
es: No hay referencias sin usar
ja: 未使用の参照はありません
ko: 사용하지 않는 참조가 없습니다.
zh_hans: 没有未使用的引用
zh_hant: 沒有未使用的參考

# PropPage_UnusedReferenceCompileFail
source: Project compilation failed. Cannot determine unused references.
cs: Kompilace projektu se nezdařila. Nepoužité odkazy se nedají určit.
de: Fehler beim Kompilieren des Projekts. Nicht verwendete Verweise konnten nicht ermittelt werden.
es: No se pudo compilar el proyecto. No se pueden determinar las referencias no usadas.
ja: プロジェクトをコンパイルできませんでした。未使用の参照を特定できませんでした。
ko: 프로젝트를 컴파일하지 못했습니다. 사용하지 않는 참조를 확인할 수 없습니다.
zh_hans: 项目编译失败。无法确定未使用的引用。
zh_hant: 專案編譯失敗。無法判斷未使用的參考。

# PropPage_UnusedReferenceCompileWaiting
source: Gathering list of unused references...
cs: Shromažďuje se seznam nepoužitých odkazů...
de: Liste der nicht verwendeten Verweise wird gesammelt...
es: Recopilando la lista de referencias sin utilizar...
ja: 未使用の参照を収集しています...
ko: 사용하지 않는 참조 목록을 수집하고 있습니다...
zh_hans: 正在收集未使用的引用的列表...
zh_hant: 正在蒐集未使用的參考清單...

# PropPage_UnusedReferenceError
source: Error getting unused references.
cs: Při zjišťování nepoužitých odkazů došlo k chybě.
de: Nicht verwendete Verweise konnten nicht abgerufen werden.
es: Error al obtener las referencias no usadas.
ja: 未使用の参照を取得するときにエラーが発生しました。
ko: 사용하지 않는 참조를 가져오는 동안 오류가 발생했습니다.
zh_hans: 获取未使用的引用时出错。
zh_hant: 取得未使用的參考時發生錯誤。

# PPG_InvalidHexString
source: Base address must be a hexadecimal number with less than or equal to 8 digits, for example, &H11000000.
cs: Základní adresa musí být hexadecimální číslo s osmi nebo méně číslicemi, třeba &H11000000.
de: Die Basisadresse muss eine hexadezimale Zahl mit 8 oder weniger Ziffern sein, z.B. "&H11000000".
es: La dirección base debe ser un número hexadecimal con 8 dígitos o menos; por ejemplo, &H11000000.
ja: ベース アドレスは、8 桁以下の 16 進数値 (例: &H11000000) でなければなりません。
ko: 기준 주소는 &H11000000과 같이 8자리 이하의 16진수여야 합니다.
zh_hans: 基址必须是十六进制数，位数小于或等于 8，如 &H11000000。
zh_hant: 基底位址 (Base Address) 必須是少於或等於 8 位數的十六進位數字，例如 &H11000000。

# PropPage_NeedResFile
source: "Resource files must have a .res file extension. Please enter a valid resource file name."
cs: „Soubory prostředků musí mít příponu .res. Zadejte prosím platný název souboru prostředků.“
de: "Ressourcendateien müssen die Dateierweiterung ".res" besitzen. Geben Sie einen gültigen Ressourcendateinamen ein."
es: "Los archivos de recursos deben tener una extensión de archivo .res. Escriba un nombre de archivo de recursos válido".
ja: "リソース ファイルには .res 拡張子が必要です。有効なリソース ファイル名を入力してください。"
ko: "리소스 파일의 확장명은 .res여야 합니다. 올바른 리소스 파일 이름을 입력하세요."
zh_hans: “资源文件必须具有文件扩展名 .res。请输入有效的资源文件名。”
zh_hant: "資源檔必須具有 .res 副檔名。請輸入有效的資源檔名稱。"

# PropPage_ResourceFileNotExist
source: "The resource file entered does not exist."
cs: "Zadaný soubor prostředků neexistuje."
de: "Die eingegebene Ressourcendatei ist nicht vorhanden."

# APPDES_Title
source: Project Designer
cs: Návrhář projektu
de: Projekt-Designer
es: Diseñador de proyectos
ja: プロジェクト デザイナー
ko: 프로젝트 디자이너
zh_hans: 项目设计器
zh_hant: 專案設計工具

# APPDES_SettingsTabTitle
source: Settings
cs: Nastavení
de: Einstellungen
es: Configuración
ja: 設定
ko: 설정
zh_hans: 设置
zh_hant: 設定

# APPDES_ResourceTabTitle
source: Resources
cs: Prostředky
de: Ressourcen
es: Recursos
ja: リソース
ko: 리소스
zh_hans: 资源
zh_hant: 資源

# APPDES_ErrorLoading_Msg
source: An error occurred trying to load the project properties window. Close the window and try again. {0}
cs: Při pokusu o načtení okna vlastností projektu došlo k chybě. Zavřete okno a zkuste to znovu. {0}
de: Fehler beim Laden des Projekteigenschaftenfensters. Schließen Sie das Fenster, und wiederholen Sie den Vorgang. {0}
es: Error al intentar cargar la ventana de propiedades del proyecto. Cierre la ventana y vuelva a intentarlo. {0}
ja: プロジェクト プロパティ ウィンドウを読み込もうとしているときにエラーが発生しました。ウィンドウを閉じて、もう一度試してください。 {0}
ko: 프로젝트 속성 창을 로드하는 동안 오류가 발생했습니다. 창을 닫고 다시 시도하세요. {0}
zh_hans: 尝试加载项目属性窗口时出错。请关闭窗口并重试。 {0}
zh_hant: 嘗試載入專案屬性視窗時發生錯誤。請關閉視窗後再試一次。 {0}

# APPDES_ErrorLoadingPropPage
source: An error occurred trying to load the page.
cs: Při pokusu o načtení stránky došlo k chybě.
de: Fehler beim Laden der Seite.
es: Error al intentar cargar la página.
ja: ページの読み込み中にエラーが発生しました。
ko: 페이지를 로드하는 동안 오류가 발생했습니다.
zh_hans: 尝试加载该页时出错。
zh_hant: 嘗試載入頁面時發生錯誤。

# APPDES_DesignerLoader_NotDeferred
source: The designer cannot be shown because the document for it was never loaded.
cs: Návrhář se nedá zobrazit, protože se pro něj ještě nenačetl dokument.
de: Der Designer kann nicht angezeigt werden, weil das entsprechende Dokument nie geladen wurde.
es: No se puede mostrar el diseñador porque no se cargó el documento correspondiente.
ja: ドキュメントが読み込まれなかったため、デザイナーを表示できません。
ko: 디자이너에 대한 문서를 로드하지 않았으므로 디자이너를 표시할 수 없습니다.
zh_hans: 由于从未加载设计器的文档，因此无法显示设计器。
zh_hant: 無法顯示設計工具，因為設計工具的文件尚未載入。

# APPDES_ClickHereCreateResx
source: This project does not contain a default resources file. Click here to create one.
cs: Projekt neobsahuje soubor výchozích prostředků. Kliknutím ho vytvořte.
de: Dieses Projekt enthält keine Standardressourcendatei. Klicken Sie hier, um eine solche Datei zu erstellen.
es: Este proyecto no contiene un archivo de recursos predeterminado. Haga clic aquí para crear uno.
ja: このプロジェクトには既定のリソース ファイルが含まれていません。ファイルを作成するには、ここをクリックしてください。
ko: 이 프로젝트에는 기본 리소스 파일이 없습니다. 기본 리소스 파일을 만들려면 여기를 클릭하세요.
zh_hans: 此项目不包含默认的资源文件。单击此处可进行创建。
zh_hant: 此專案未包含預設的資源檔。請按一下這裡建立資源檔。

# APPDES_ClickHereCreateSettings
source: This project does not contain a default settings file. Click here to create one.
cs: Projekt neobsahuje soubor výchozího nastavení. Kliknutím ho vytvořte.
de: Dieses Projekt enthält keine Standardeinstellungsdatei. Klicken Sie hier, um eine solche Datei zu erstellen.
es: Este proyecto no contiene un archivo de configuración predeterminado. Haga clic aquí para crear uno.
ja: このプロジェクトには既定の設定ファイルが含まれていません。ファイルを作成するには、ここをクリックしてください。
ko: 이 프로젝트에는 기본 설정 파일이 없습니다. 기본 설정 파일을 만들려면 여기를 클릭하세요.
zh_hans: 此项目不包含默认的设置文件。单击此处可进行创建。
zh_hant: 此專案未包含預設的設定檔。請按一下這裡建立資源檔。

# APPDES_FileNotFound_1Arg
source: Could not find the file '{0}'.
cs: Soubor {0} se nepovedlo najít.
de: Die Datei "{0}" wurde nicht gefunden.
es: No se encuentra el archivo '{0}'.
ja: ファイル '{0}' が見つかりません。
ko: '{0}' 파일을 찾을 수 없습니다.
zh_hans: 未能找到文件“{0}”。
zh_hant: 找不到檔案 '{0}'。

# APPDES_EditorAlreadyOpen_1Arg
source: The file '{0}' is already open in an editor. Please close the file and try again.
cs: Soubor {0} už je v editoru otevřený. Zavřete ho prosím a zkuste to znovu.
de: Die Datei "{0}" ist bereits in einem Editor geöffnet. Schließen Sie die Datei, und wiederholen Sie den Vorgang.
es: El archivo '{0}' ya está abierto en un editor. Ciérrelo y vuelva a intentarlo.
ja: ファイル '{0}' は既にエディターで開かれています。ファイルを閉じて、もう一度操作を行ってください。
ko: '{0}' 파일이 이미 편집기에서 열려 있습니다. 파일을 닫고 다시 시도하세요.
zh_hans: 文件“{0}”已在某个编辑器中打开。请关闭文件并重试。
zh_hant: 檔案 '{0}' 已在編輯器中開啟。請關閉檔案後再試一次。

# APPDES_OverflowButton_AccessibilityName
source: All Project Designer Pages
cs: Všechny stránky návrháře projektu
de: Alle Projekt-Designer-Seiten
es: Todas las páginas del Diseñador de proyectos
ja: すべてのプロジェクト デザイナー ページ
ko: 모든 프로젝트 디자이너 페이지
zh_hans: 所有项目设计器页
zh_hant: 所有的專案設計工具頁面

# APPDES_OverflowButton_Tooltip
source: More Settings
cs: Další nastavení
de: Weitere Einstellungen
es: Más configuración
ja: その他の設定
ko: 추가 설정
zh_hans: 更多设置
zh_hant: 其他設定

# APPDES_SpecialFileNotSupported
source: The requested file type is not supported in projects of this type.
cs: Požadovaný typ souboru se v projektech tohoto typu nepodporuje.
de: Der angeforderte Dateityp wird in Projekten dieses Typs nicht unterstützt.
es: El tipo de archivo solicitado no es compatible en proyectos de este tipo.
ja: 要求されたファイルの種類はこの種類のプロジェクトでサポートされていません。
ko: 이 형식의 프로젝트에서는 요청한 파일 형식이 지원되지 않습니다.
zh_hans: 此类项目中不支持所请求的文件类型。
zh_hant: 這種類型的專案不支援所要求的檔案類型。

# PPG_Property_AssemblyName
source: Assembly Name
cs: Název sestavení
es: Nombre del ensamblado
ja: アセンブリ名
ko: 어셈블리 이름
zh_hans: 程序集名称
zh_hant: 組件名稱

# PPG_Property_RootNamespace
source: Root Namespace
cs: Kořenový obor názvů
de: Stammnamespace
es: Espacio de nombres raíz
ja: ルート名前空間
ko: 루트 네임스페이스
zh_hans: 根命名空间
zh_hant: 根命名空間

# PPG_Property_StartupObject
source: Startup Object
cs: Spouštěcí objekt
de: Startobjekt
es: Objeto de inicio
ja: スタートアップ オブジェクト
ko: 시작 개체
zh_hans: 启动对象
zh_hant: 啟始物件

# PPG_Property_ApplicationIcon
source: Application Icon
cs: Ikona aplikace
de: Anwendungssymbol
es: Icono de aplicación
ja: アプリケーション アイコン
ko: 애플리케이션 아이콘
zh_hans: 应用程序图标
zh_hant: 應用程式圖示

# PPG_Property_AssemblyVersion
source: Assembly Version
cs: Verze sestavení
es: Versión de ensamblado
ja: アセンブリ バージョン
ko: 어셈블리 버전
zh_hans: 程序集版本
zh_hant: 組件版本

# PPG_Property_AssemblyFileVersion
source: Assembly File Version
cs: Verze souboru sestavení
de: Assemblydateiversion
es: Versión del archivo de ensamblado
ja: アセンブリ ファイル バージョン
ko: 어셈블리 파일 버전
zh_hans: 程序集文件版本
zh_hant: 組件檔版本

# PPG_Property_AssemblyGuid
source: Assembly GUID
cs: GUID sestavení
es: GUID del ensamblado
ja: アセンブリ GUID
ko: 어셈블리 GUID
zh_hans: 程序集 GUID
zh_hant: 組件 GUID

# PPG_Property_CustomSubMain
source: Enable application framework
cs: Povolit aplikační framework
de: Anwendungsframework aktivieren
es: Habilitar marco de trabajo de la aplicación
ja: アプリケーション フレームワークを有効にする
ko: 애플리케이션 프레임워크 사용
zh_hans: 启用应用程序框架
zh_hant: 啟用應用程式架構

# PPG_Property_StartProgram
source: External Program Path
cs: Cesta k externímu programu
de: Externer Programmpfad
es: Ruta de acceso del programa externo
ja: 外部プログラム パス
ko: 외부 프로그램 경로
zh_hans: 外部程序路径
zh_hant: 外部程式路徑

# PPG_Property_StartURL
source: Start Browser With URL
cs: Spustit prohlížeč s URL
de: Browser mit URL starten
es: Iniciar explorador con la dirección URL
ja: ブラウザーを開始時に使用する URL
ko: 다음 URL로 브라우저 시작
zh_hans: 使用 URL 启动浏览器
zh_hant: 瀏覽器起始 URL

# PPG_Property_StartWorkingDirectory
source: Working Directory
cs: Pracovní adresář
de: Arbeitsverzeichnis
es: Directorio de trabajo
ja: 作業ディレクトリ
ko: 작업 디렉터리
zh_hans: 工作目录
zh_hant: 工作目錄

# PPG_Property_RemoteDebugMachine
source: Remote Machine Name
cs: Název vzdáleného počítače
de: Name des Remotecomputers
es: Nombre de la máquina remota
ja: リモート コンピューター名
ko: 원격 컴퓨터 이름
zh_hans: 远程计算机名称
zh_hant: 遠端電腦名稱

# APPDES_HostingPanelName
source: Project Designer Page Container
cs: Kontejner stránky návrháře projektu
de: Container für Projekt-Designer-Seite
es: Contenedor de página del Diseñador de proyectos
ja: プロジェクト デザイナー ページ コンテナー
ko: 프로젝트 디자이너 페이지 컨테이너
zh_hans: 项目设计器页容器
zh_hant: 專案設計工具頁面容器

# APPDES_TabButtonDefaultAction
source: Switch Project Designer Page
cs: Přepnout stránku návrháře projektu
de: Projekt-Designer-Seite wechseln
es: Cambiar página del Diseñador de proyectos
ja: プロジェクト デザイナー ページの切り替え
ko: 프로젝트 디자이너 페이지 전환
zh_hans: 切换项目设计器页
zh_hant: 切換專案設計工具頁面

# APPDES_TabListDescription
source: Allow switching between active pages of the project designer (use Ctrl+PageUp and Ctrl+PageDown)
cs: Umožňuje přepínání mezi aktivními stránkami návrháře projektu (pomocí Ctrl+PageUp a Ctrl+PageDown).
de: Wechseln zwischen aktiven Seiten des Projekt-Designers zulassen (mit STRG+PageUp und STRG+PageDown)
es: Permitir cambiar entre páginas activas del Diseñador de proyectos (utilizar Ctrl+PageUp y Ctrl+PageDown)
ja: プロジェクト デザイナーのアクティブ ページ間の切り替えを許可します (Ctrl + PageUp キーおよび Ctrl + PageDown キーを使用)
ko: Ctrl+PageUp 및 Ctrl+PageDown을 사용하여 프로젝트 디자이너의 활성 페이지 간에 전환할 수 있습니다.
zh_hans: 允许在项目设计器的活动页之间进行切换(使用 Ctrl+PageUp 和 Ctrl+PageDown)
zh_hant: 允許在使用中的專案設計工具頁面之間進行切換 (使用 Ctrl+PageUp 和 Ctrl+PageDown)

# APPDES_PageName
source: {0} page:
cs: Strana {0}:
de: {0}-Seite:
es: Página {0}:
ja: {0} ページ:
ko: {0} 페이지:
zh_hans: {0} 页:
zh_hant: {0} 頁:
