Repository: dotnet/fsharp
Catalog: vsintegration/src/FSharp.ProjectSystem.PropertyPages/Resources/xlf/Microsoft.VisualStudio.Editors.Designer.*.xlf
Languages: cs, de, es, ja, ko, zh_hans, zh_hant

# RSE_Task_CantChangeCustomToolOrNamespace
source: Unable to set the Custom Tool or Custom Tool Namespace properties of this file in order to change strongly-typed resource generation options. If the project file is checked in, try checking it out.
cs: U tohoto souboru se nepodařilo nastavit vlastnosti Vlastní nástroje a Obor názvů vlastního nástroje, aby bylo možné změnit tučně napsané možnosti generování prostředků. Pokud je soubor projektu zaškrtnutý, zkuste ho odškrtnout.
de: Die Eigenschaften für das benutzerdefinierte Tool oder für den Namespace des benutzerdefinierten Tools dieser Datei können nicht festgelegt werden, um Optionen für die stark typisierte Ressourcengenerierung zu ändern. Falls die Projektdatei eingecheckt ist, checken Sie sie aus.
es: No se pueden establecer las propiedades “Herramienta personalizada” o “Espacio de nombres de la herramienta personalizada” de este archivo para cambiar opciones de generación de recursos fuertemente tipados. Si el archivo del proyecto está insertado en el repositorio, pruebe extrayéndolo del repositorio.
ja: 厳密に型指定されたリソースの生成オプションを変更するためにこのファイルのカスタム ツール、またはカスタム ツールの名前空間プロパティを設定できませんでした。プロジェクト ファイルがチェックインされている場合、チェックアウトしてください。
ko: 강력한 형식의 리소스 생성 옵션을 변경하도록 이 파일의 사용자 지정 도구 또는 사용자 지정 도구 네임스페이스 속성을 설정할 수 없습니다. 프로젝트 파일이 체크 인되었으면 해당 파일을 체크 아웃하세요.
zh_hans: 无法设置此文件的“自定义工具”或“自定义工具命名空间”属性以更改强类型资源生成选项。如果已签入此项目文件，请尝试将它签出。
zh_hant: 無法設定此檔案的自訂工具或自訂工具命名空間屬性，因此無法變更強型別的資源產生選項。如果專案檔已簽入，請試著將它簽出。

# RSE_Task_WarningCustomToolNotSet
source: Double-click here to enable strongly-typed resources for this file.
cs: Pokud chcete pro tento soubor povolit prostředky se silnými typy, poklikejte sem.
de: Doppelklicken Sie hier, um für diese Datei stark typisierte Ressourcen zuzulassen.
es: Haga doble clic aquí para habilitar los recursos fuertemente tipados para este archivo.
ja: このファイルに対して厳密に型指定されたリソースを有効にするには、ここをダブルクリックしてください。
ko: 이 파일에 대해 강력한 형식의 리소스를 사용하려면 여기를 두 번 클릭하세요.
zh_hans: 双击此处可为此文件启用强类型资源。
zh_hant: 按兩下這裡，啟用此檔案的強類型資源。

# RSE_Task_InvalidName_1Arg
source: The resource name '{0}' is not a valid identifier.
cs: Název prostředku {0} není platný identifikátor.
de: Der Ressourcenname "{0}" ist kein gültiger Bezeichner.
es: El nombre del recurso '{0}' no es un identificador válido.
ja: リソース名 '{0}' は有効な識別子ではありません。
ko: 리소스 이름 '{0}'은(는) 올바른 식별자가 아닙니다.
zh_hans: 资源名称“{0}”不是有效的标识符。
zh_hant: 資源名稱 '{0}' 不是有效的識別項。

# RSE_EncodingDisplayName
source: {0} - Codepage {1}
cs: {0} – znaková sada {1}
es: {0}: Página de códigos {1}
ja: {0} - コードページ {1}
ko: {0} - 코드 페이지 {1}
zh_hans: {0} - 代码页 {1}
zh_hant: {0} - 字碼頁 {1}

# RSE_DefaultEncoding
source: (Default)
cs: (výchozí)
de: (Standard)
es: (Predeterminada)
ja: (既定)
ko: (기본값)
zh_hans: (默认值)
zh_hant: (預設)

# RSE_Undo_ChangeName
source: Change resource name
cs: Změnit název prostředku
de: Ressourcenname ändern
es: Cambiar nombre de recurso
ja: リソース名の変更
ko: 리소스 이름 변경
zh_hans: 更改资源名称
zh_hant: 變更資源名稱

# RSE_Undo_AddResources_1Arg
source: Add {0} new resource(s)
cs: Přidat nové prostředky {0}
de: {0} neue Ressource(n) hinzufügen
es: Agregar {0} recursos nuevos
ja: {0} 個のリソースの追加
ko: {0}개의 새 리소스 추가
zh_hans: 添加 {0} 个新资源
zh_hant: 新增 {0} 個新資源

# RSE_Undo_RemoveResources_1Arg
source: Remove {0} resource(s)
cs: Odebrat prostředky {0}
de: {0} Ressource(n) entfernen
es: Quitar {0} recursos
ja: {0} 個のリソースの削除
ko: {0}개 리소스 제거
zh_hans: 移除 {0} 个新资源
zh_hant: 移除 {0} 個資源

# RSE_Undo_DeleteResourceCell
source: Delete values in {0} cell(s)
cs: Odstranit hodnoty buněk {0}
de: Werte in {0} Zelle(n) löschen
es: Eliminar valores en {0} celdas
ja: {0} 個のセルの値を消去します
ko: {0}개 셀에서 값 삭제
zh_hans: 删除 {0} 个单元格中的值
zh_hant: 刪除 {0} 個儲存格中的值

# RSE_CategiesLabel
source: &Categories:
cs: &Kategorie:
de: &Kategorien:

# RSE_PropDesc_Name
source: Name used to identify the resource in code.
cs: Název používaný k identifikaci prostředku v kódu
de: Name zur Identifizierung der Ressource im Code.
es: Nombre utilizado para identificar el recurso en el código.
ja: コード内のリソースを識別するために使用する名前です。
ko: 코드에서 리소스를 식별하는 데 사용되는 이름입니다.
zh_hans: 用于在代码中标识资源的名称。
zh_hant: 用來在程式碼中識別資源的名稱。

# RSE_PropDesc_Comment
source: Additional information about the resource. This property is only meaningful at design time.
cs: Další informace o prostředku. Tato vlastnost je užitečná jen v okamžiku návrhu.
de: Weitere Informationen zur Ressource. Diese Eigenschaft ist nur zur Entwurfszeit von Bedeutung.
es: Información adicional sobre el recurso. Esta propiedad solo es significativa en tiempo de diseño.
ja: リソースについての追加情報ですこのプロパティは、デザイン時にのみ有効です。
ko: 리소스에 대한 추가 정보입니다. 이 속성은 디자인 타임에서만 의미가 있습니다.
zh_hans: 关于该资源的附加信息。此属性仅在设计时有意义。
zh_hant: 資源的其他資訊。這個屬性僅在設計階段時有意義。

# RSE_PropDesc_Encoding
source: Character encoding of the file.
cs: Kódování znaků souboru
de: Zeichencodierung der Datei.
es: Codificación de caracteres del archivo.
ja: ファイルの文字エンコードです。
ko: 파일의 문자 인코딩입니다.
zh_hans: 文件的字符编码。
zh_hant: 檔案的字元編碼方式。

# RSE_PropDesc_Filename
source: The path to the linked resource.
cs: Cesta k propojenému prostředku
de: Pfad zur verknüpften Ressource.
es: Ruta de acceso del recurso vinculado.
ja: リンクされたリソースへのパスです。
ko: 링크된 리소스의 경로입니다.
zh_hans: 指向链接资源的路径。
zh_hant: 連結資源的路徑。

# RSE_PropDesc_FileType
source: Specifies whether the file resource is text or binary.
cs: Určuje, jestli je soubor prostředku textový nebo binární.
de: Gibt an, ob es sich bei der Dateiressource um eine Text- oder Binärdatei handelt.
es: Especifica si el recurso de archivo es de texto o binario.
ja: ファイル リソースが、テキストかバイナリかを指定します。
ko: 파일 리소스가 텍스트 또는 이진 형식인지 여부를 지정합니다.
zh_hans: 指定文件资源是文本格式还是二进制格式。
zh_hant: 指定檔案資源是文字或二進位格式。

# RSE_PropDesc_Persistence
source: Specifies whether the resource is embedded or linked. Embedded resources are saved in the resource file. Linked resources reside in an external location on disk.
cs: Určuje, jestli je prostředek vložený nebo připojený. Vložené prostředky se ukládají do souboru prostředků. Propojené prostředky jsou externě umístěné na disku.
de: Gibt an, ob es sich um eine eingebettete oder um eine verknüpfte Ressource handelt. Eingebettete Ressourcen werden in der Ressourcendatei gespeichert. Verknüpfte Ressourcen befinden sich auf einem Datenträger an einem externen Ort.
es: Especifica si el recurso se inserta o se vincula. Los recursos insertados se guardan en el archivo de recursos. Los recursos vinculados residen en una ubicación externa del disco.
ja: リソースを埋め込むかリンクするかを指定します。埋め込まれたリソースはリソース ファイルに保存されます。リンクされたリソースは、ディスク上の外部の場所に存在します。
ko: 리소스가 포함 또는 링크되어 있는지 여부를 지정합니다. 포함 리소스는 리소스 파일에 저장되고 링크된 리소스는 디스크의 외부 위치에 저장됩니다.
zh_hans: 指定资源是嵌入的资源还是链接的资源。嵌入的资源保存在资源文件中。链接的资源驻留在磁盘的外部位置。
zh_hant: 指定資源為內嵌還是連結。內嵌資源儲存在資源檔中，而連結資源則位於磁碟上的外部位置。

# RSE_PropDesc_Type
source: The resource will be generated as this type in the strongly-typed resource class. For example, the resource might be generated as a String or Bitmap object.
cs: Prostředek se vygeneruje do tučně napsané třídy prostředků jako tento typ. Prostředek může být vygenerovaný třeba jako objekt řetězce nebo bitové mapy.
de: Die Ressource wird in der stark typisierten Ressourcenklasse als dieser Typ generiert. So kann die Ressource etwa als Zeichenfolgen- oder Bitmapobjekt generiert werden.
es: El recurso se generará con este tipo en la clase de recurso fuertemente tipada. Por ejemplo, puede que el recurso se genere como un objeto String o Bitmap.
ja: このリソースは、この型として厳密に型指定されたリソース クラスで生成されます。たとえば、リソースは String または Bitmap オブジェクトとして生成されます。
ko: 강력한 형식의 리소스 클래스에 이 형식으로 리소스가 생성됩니다. 예를 들어 리소스가 String 또는 Bitmap 개체로 생성될 수 있습니다.
zh_hans: 在强类型资源类中，资源将生成为此类型。例如，资源可能生成为 String 对象或 Bitmap 对象。
zh_hant: 將會在強型別資源類別中以此類型產生資源。例如，可能會將資源產生為 String 或 Bitmap 物件。

# RSE_PropDesc_Value
source: The value of the resource.
cs: Hodnota prostředku
de: Der Wert der Ressource.
es: Valor del recurso.
ja: リソースの値です。
ko: 리소스의 값입니다.
zh_hans: 资源的值。
zh_hant: 資源的值。

# RFS_CantCreateResourcesFolder_Folder_ExMsg
source: Unable to add a '{0}' folder to this project. {1}
cs: Do projektu se nepodařilo přidat složku {0}. {1}
de: Diesem Projekt kann kein Ordner vom Typ "{0}" hinzugefügt werden. {1}
es: No se puede agregar una carpeta '{0}' a este proyecto. {1}
ja: このプロジェクトに '{0}' フォルダーを追加できません。 {1}
ko: 이 프로젝트에 '{0}' 폴더를 추가할 수 없습니다. {1}
zh_hans: 无法将“{0}”文件夹添加到此项目中。 {1}
zh_hant: 無法將 '{0}' 資料夾新增至此專案。 {1}

# RFS_CantAddFileToProject_File_ExMsg
source: Unable to add '{0}' to the project. {1}
cs: Do projektu se nepodařilo přidat '{0}'. {1}
de: "{0}" kann dem Projekt nicht hinzugefügt werden. {1}
es: No se puede agregar '{0}' al proyecto. {1}
ja: プロジェクトに '{0}' を追加できません。 {1}
ko: 프로젝트에 '{0}'을(를) 추가할 수 없습니다. {1}
zh_hans: 无法将“{0}”添加到项目中。 {1}
zh_hant: 無法將 '{0}' 加入專案。 {1}

# RFS_CantAddFileToProject_File
source: Unable to add '{0}' to the project.
cs: Do projektu se nepodařilo přidat '{0}'.
de: "{0}" kann dem Projekt nicht hinzugefügt werden.
es: No se puede agregar '{0}' al proyecto.
ja: プロジェクトに '{0}' を追加できません。
ko: 프로젝트에 '{0}'을(를) 추가할 수 없습니다.
zh_hans: 无法将“{0}”添加到项目中。
zh_hant: 無法將 '{0}' 加入專案。

# RFS_QueryReplaceFile_File
source: A file with the name '{0}' already exists. Do you want to replace it?
cs: Soubor s názvem {0} už existuje. Chcete ho nahradit?
de: Eine Datei mit dem Namen "{0}" ist bereits vorhanden. Möchten Sie sie ersetzen?
es: Ya existe un archivo con el nombre '{0}'. ¿Quiere reemplazarlo?
ja: '{0}' という名前のファイルは既に存在します。置き換えますか?
ko: 이름이 '{0}'인 파일이 이미 있습니다. 바꾸시겠습니까?
zh_hans: 名为“{0}”的文件已存在。是否替换它?
zh_hant: 名稱為 '{0}' 的檔案已經存在。要取代它嗎?

# RFS_QueryReplaceFileTitle_Editor
source: {0} - Destination File Exists
cs: {0} – cílový soubor existuje
de: {0} – Zieldatei vorhanden
es: {0}: El archivo de destino ya existe
ja: {0} - ターゲット ファイルが存在します
ko: {0} - 대상 파일 있음
zh_hans: {0} - 目标文件已存在
zh_hant: {0} - 目的檔案已經存在

# RFS_QueryRemoveLink_Folder_Link
source: There is already a linked file with the name "{0}" in the project folder "{1}". Do you want to remove it?
cs: Složka projektu {1} už propojený soubor s názvem {0} obsahuje. Chcete ho odebrat?
de: Im Projektordner "{1}" ist bereits eine verknüpfte Datei mit dem Namen "{0}" vorhanden. Soll sie entfernt werden?
es: Ya hay un archivo vinculado con el nombre "{0}" en la carpeta de proyecto "{1}". ¿Quiere quitarlo?
ja: "{0}" というリンク ファイルは既にプロジェクト フォルダー "{1}" の中にあります。削除しますか?
ko: 프로젝트 폴더 "{1}"에 이름이 "{0}"인 링크된 파일이 이미 있습니다. 해당 파일을 제거하시겠습니까?
zh_hans: 项目文件夹“{1}”中已经有一个名为“{0}”的链接文件。是否删除它?
zh_hant: 已經有名為 "{0}" 的連結檔案存在專案資料夾 "{1}" 中。要移除它嗎?

# RFS_QueryRemoveLinkTitle_Editor
source: {0} - Destination File Exists
cs: {0} – cílový soubor existuje
de: {0} – Zieldatei vorhanden
es: {0}: El archivo de destino ya existe
ja: {0} - ターゲット ファイルが存在します
ko: {0} - 대상 파일 있음
zh_hans: {0} - 目标文件已存在
zh_hant: {0} - 目的檔案已經存在

# RFS_FindNotFound_File
source: Cannot find the file '{0}'. It may have been moved or deleted.
cs: Soubor {0} se nedá najít. Možná byl přesunut nebo odstraněn.
de: Die Datei "{0}" wurde nicht gefunden. Möglicherweise wurde sie verschoben oder gelöscht.
es: No se encuentra el archivo '{0}'. Puede que se haya movido o eliminado.
ja: ファイル '{0}' が見つかりません。移動または削除された可能性があります。
ko: '{0}' 파일을 찾을 수 없습니다. 이동되었거나 삭제된 것 같습니다.
zh_hans: 无法找到文件“{0}”。该文件可能已被移动或删除。
zh_hant: 找不到檔案 '{0}'，可能已移動或刪除。

# SD_ComboBoxItem_ConnectionStringType
source: Connection string
cs: Připojovací řetězec
de: Verbindungszeichenfolge
es: Cadena de conexión
ja: 接続文字列
ko: 연결 문자열
zh_hans: 连接字符串
zh_hant: 連接字串

# SD_ComboBoxItem_WebReferenceType
source: Web Service URL
cs: URL webové služby
de: Webdienst-URL
es: URL del servicio web
ja: Web サービス URL
ko: 웹 서비스 URL
zh_hans: Web 服务 URL
zh_hant: Web 服務 URL

# SD_ComboBoxItem_BrowseType
source: Browse...
cs: Procházet...
de: Durchsuchen...
es: Examinar...
ja: 参照...
ko: 찾아보기...
zh_hans: 浏览...
zh_hant: 瀏覽...

# SD_ComboBoxItem_ApplicationScope
source: Application
cs: Aplikace
de: Anwendung
es: Aplicación
ja: アプリケーション
ko: 애플리케이션
zh_hans: 应用程序
zh_hant: 應用程式

# SD_ComboBoxItem_UserScope
source: User
cs: Uživatel
de: Benutzer
es: Usuario
ja: ユーザー
ko: 사용자
zh_hans: 用户
zh_hant: 使用者

# SD_GridViewNameColumnHeaderText
source: Name
cs: Název
es: Nombre
ja: 名前
ko: 이름
zh_hans: 名称
zh_hant: 名稱

# SD_GridViewTypeColumnHeaderText
source: Type
cs: Typ
de: Typ
es: Tipo
ja: 種類
zh_hans: 类型
zh_hant: 型別

# SD_GridViewScopeColumnHeaderText
source: Scope
cs: Rozsah
de: Bereich
es: Ámbito
ja: スコープ
ko: 범위
zh_hans: 范围
zh_hant: 範圍

# SD_GridViewValueColumnHeaderText
source: Value
cs: Hodnota
de: Wert
es: Valor
ja: 値
ko: 값
zh_hans: 值
zh_hant: 值

# SD_UnknownType
source: Type '{0}' is not defined.
cs: Typ {0} není definovaný.
de: Der Typ "{0}" ist nicht definiert.
es: El tipo '{0}' no está definido.
ja: 型 '{0}' は定義されていません。
ko: '{0}' 형식이 정의되지 않았습니다.
zh_hans: 未定义类型“{0}”。
zh_hant: 類型 '{0}' 未定義。

# SD_UndoTran_NameChanged
source: Name changed
cs: Název se změnil.
de: Name geändert
es: Cambio de nombre
ja: 変更された名前
ko: 이름이 변경되었습니다.
zh_hans: 名称已更改
zh_hant: 名稱已變更

# SD_UndoTran_TypeChanged
source: Type changed
cs: Typ se změnil.
de: Typ geändert
es: Cambio de tipo
ja: 変更された型
ko: 형식이 변경되었습니다.
zh_hans: 类型已更改
zh_hant: 類型已變更

# SD_UndoTran_ScopeChanged
source: Scope changed
cs: Rozsah se změnil.
de: Bereich geändert
es: Cambio de ámbito
ja: 変更されたスコープ
ko: 범위가 변경되었습니다.
zh_hans: 范围已更改
zh_hant: 範圍已變更

# SD_UndoTran_RoamingChanged
source: Roaming changed
cs: Roaming se změnil.
de: Roaming geändert
es: Cambio de itinerancia
ja: 変更されたローミング
ko: 로밍이 변경되었습니다.
zh_hans: 漫游已更改
zh_hant: 漫遊已變更

# SD_UndoTran_DescriptionChanged
source: Description changed
cs: Popis se změnil.
de: Beschreibung geändert
es: Cambio de descripción
ja: 変更された説明
ko: 설명이 변경되었습니다.
zh_hans: 说明已更改
zh_hant: 描述已變更

# SD_UndoTran_ProviderChanged
source: Provider changed
cs: Poskytovatel se změnil.
de: Anbieter geändert
es: Cambio de proveedor
ja: 変更されたプロバイダー
ko: 공급자가 변경되었습니다.
zh_hans: 提供程序已更改
zh_hant: 提供者已變更

# SD_UndoTran_SerializedValueChanged
source: Value changed
cs: Hodnota se změnila.
de: Wert geändert
es: Cambio de valor
ja: 変更された値
ko: 값이 변경되었습니다.
zh_hans: 值已更改
zh_hant: 值已變更

# SD_UndoTran_GenerateDefaultValueInCode
source: Generate default value in code changed
cs: Generovat výchozí hodnotu ve změněném kódu
de: Standardwert in geändertem Code generieren
es: Generar valor predeterminado en el código cambiado
ja: 変更されたコードの既定値を生成します
ko: 코드의 기본값 생성이 변경되었습니다.
zh_hans: 在代码中生成的默认值已更改
zh_hant: 在已變更的程式碼中產生預設值

# SD_UndoTran_RemoveMultipleSettings_1Arg
source: Remove {0} setting(s)
cs: Odebrat nastavení {0}
de: {0} Einstellung(en) entfernen
es: Quitar configuración {0}
ja: {0} 個の設定の削除
ko: {0}개 설정 제거
zh_hans: 删除 {0} 个设置
zh_hant: 移除 {0} 項設定

# SD_Err_CantLoadSettingsFile
source: Unable to load settings file. It might be corrupted or contain invalid XML or contain duplicate identifiers.
cs: Soubor nastavení se nepodařilo načíst. Může být poškozený nebo může obsahovat neplatný kód XML nebo duplicitní identifikátory.
de: Die Einstellungsdatei konnte nicht geladen werden. Sie ist möglicherweise beschädigt oder enthält ungültigen XML-Code oder doppelte Bezeichner.
es: No se puede cargar el archivo de configuración. Puede que esté dañado, que contenga código XML no válido o identificadores de duplicados.
ja: 設定ファイルを読み込めませんでした。設定ファイルが壊れているか、無効な XML を含んでいるか、または重複した ID を含んでいる可能性があります。
ko: 설정 파일을 로드할 수 없습니다. 파일이 손상되었거나 잘못된 XML 또는 중복되는 식별자를 포함하고 있습니다.
zh_hans: 无法加载设置文件。它可能已损坏、包含无效的 XML，或者包含重复的标识符。
zh_hant: 無法載入設定檔。檔案可能已損毀，或是包含無效的 XML 或重複的識別碼。

# SD_NewValuesAdded
source: New values from the app.config file were automatically added
cs: Automaticky se přidaly nové hodnoty ze souboru app.config.
de: Neue Werte aus der Datei "app.config" wurden automatisch hinzugefügt.
es: Se agregaron automáticamente nuevos valores del archivo app.config
ja: app.config から新しい値が自動的に追加されました
ko: app.config 파일의 새 값이 자동으로 추가되었습니다.
zh_hans: 已自动添加 app.config 文件中的新值
zh_hant: app.config 檔的新值已自動加入

# SD_ReplaceValueWithAppConfigValueTitle
source: Value of setting '{0}' was changed in the app.config file.
cs: Hodnota nastavení '{0}' byla v souboru app.config změněna.
de: Der Wert der Einstellung "{0}" wurde in der Datei "app.config" geändert.
es: El valor de la configuración '{0}' se cambió en el archivo app.config.
ja: 設定 '{0}' の値が app.config ファイルで変更されました。
ko: app.config 파일에서 '{0}' 설정의 값이 변경되었습니다.
zh_hans: 已在 app.config 文件中更改设置“{0}”的值。
zh_hant: 在 app.config 檔中，設定 '{0}' 的值已經變更。

# SD_ReplaceValueWithAppConfigValue
source: The current value in the .settings file is '{0}' The new value in the app.config file is '{1}' Do you want to update the value in the .settings file?
cs: Aktuální hodnota v souboru .settings je {0}. Nová hodnota v souboru app.config je {1}. Chcete aktualizovat hodnotu v souboru .settings?
de: Aktueller Wert in der SETTINGS-Datei: {0} Neuer Wert in der Datei "app.config": {1} Möchten Sie den Wert in der SETTINGS-Datei aktualisieren?
es: El valor actual en el archivo .settings es '{0}' El nuevo valor del archivo app.config es '{1}' ¿Quiere actualizar el valor del archivo .settings?
ja: .settings ファイルでの現在の値は '{0}' です app.config ファイルでの新しい値は '{1}' です .settings ファイル内の値を更新しますか?
ko: .settings 파일의 현재 값은 '{0}'이고 app.config 파일의 새 값은 '{1}'입니다. .settings 파일의 값을 업데이트하시겠습니까?
zh_hans: .settings 文件中的当前值为“{0}” app.config 文件中的新值为“{1}” 是否要更新 .settings 文件中的值?
zh_hant: .settings 檔的目前值是 '{0}' app.config 檔的新值是 '{1}' 要更新 .settings 檔的值嗎?

# SD_FailedToLoadAppConfigValues
source: An error occurred while reading the app.config file. The file might be corrupted or contain invalid XML.
cs: Při čtení souboru app.config došlo k chybě. Soubor může být poškozený nebo může obsahovat neplatný kód XML.
de: Fehler beim Lesen der Datei "app.config". Die Datei ist möglicherweise beschädigt oder enthält ungültigen XML-Code.
es: Error al leer el archivo app.config. Puede que esté dañado o que contenga código XML no válido.
ja: app.config ファイルの読み取り中にエラーが発生しました。ファイルが壊れているか、無効な XML を含んでいる可能性があります。
ko: app.config 파일을 읽는 동안 오류가 발생했습니다. 파일이 손상되었거나 잘못된 XML이 포함되어 있습니다.
zh_hans: 读取 app.config 文件时出错。该文件可能已损坏或者包含无效的 XML。
zh_hant: 讀取 app.config 檔時發生錯誤。檔案可能已損毀或是包含無效的 XML。

# SD_FailedToSaveAppConfigValues
source: An error occurred while saving values to the app.config file. The file might be corrupted or contain invalid XML.
cs: Při ukládání hodnot do souboru app.config došlo k chybě. Soubor může být poškozený nebo může obsahovat neplatný kód XML.
de: Fehler beim Speichern von Werten in der Datei "app.config". Die Datei ist möglicherweise beschädigt oder enthält ungültigen XML-Code.
es: Error al guardar valores en el archivo app.config. Puede que esté dañado o que contenga código XML no válido.
ja: app.config ファイルに値を保存しているときにエラーが発生しました。ファイルが壊れているか、無効な XML を含んでいる可能性があります。
ko: app.config 파일에 값을 저장하는 동안 오류가 발생했습니다. 파일이 손상되었거나 잘못된 XML이 포함되어 있습니다.
zh_hans: 将值保存到 app.config 文件时出错。该文件可能已损坏或者包含无效的 XML。
zh_hant: 將值儲存到 app.config 檔時發生錯誤。檔案可能已損毀或是包含無效的 XML。

# SD_ERR_DuplicateName_1Arg
source: There is already another setting with the name '{0}'.
cs: Nastavení s názvem {0} už existuje.
de: Es ist bereits eine andere Einstellung mit dem Namen "{0}" vorhanden.
es: Ya existe otra configuración con el nombre '{0}'.
ja: '{0}' という名前の別の設定が既にあります。
ko: 이름이 '{0}'인 다른 설정이 이미 있습니다.
zh_hans: 已有另一个名为“{0}”的设置。
zh_hant: 已經有另一個名為 '{0}' 的設定。

# SD_ERR_InvalidIdentifier_1Arg
source: '{0}' is not a valid identifier.
cs: {0} není platný identifikátor.
de: "{0}" ist kein gültiger Bezeichner.
es: '{0}' no es un identificador válido.
ja: '{0}' は有効な識別子ではありません
ko: '{0}'이(가) 올바른 식별자가 아닙니다.
zh_hans: “{0}”不是有效标识符。
zh_hant: '{0}' 不是有效的識別碼。

# SD_ERR_InvalidTypeName_1Arg
source: '{0}' is not a valid type name.
cs: {0} není platný název typu.
de: "{0}" ist kein gültiger Typname.
es: '{0}' no es un nombre de tipo válido.
ja: '{0}' は有効な型名ではありません。
ko: '{0}'은(는) 올바른 형식 이름이 아닙니다.
zh_hans: “{0}”不是有效的类型名称。
zh_hant: '{0}' 不是有效的類型名稱。

# SD_ERR_NameEmpty
source: The setting name cannot be empty.
cs: Název nastavení nemůže být prázdný.
de: Der Einstellungsname darf nicht leer sein.
es: El nombre del valor de configuración no puede estar vacío.
ja: 設定名は空白にできません。
ko: 설정 이름은 비워 둘 수 없습니다.
zh_hans: 设置名称不能是空的。
zh_hant: 設定名稱不可為空白。

# SD_ERR_InvalidValue_2Arg
source: '{0}' cannot be converted to an instance of type '{1}'.
cs: {0} se nedá převést na instanci typu {1}.
de: "{0}" kann nicht in eine Instanz vom Typ "{1}" konvertiert werden.
es: '{0}' no se puede convertir en una instancia de tipo '{1}'.
ja: 型 '{1}' のインスタンスに '{0}' を変換できません。
ko: '{0}'을(를) '{1}' 형식의 인스턴스로 변환할 수 없습니다.
zh_hans: “{0}”无法转换为“{1}”类型的实例。
zh_hant: '{0}' 不能轉換成類型 '{1}' 的執行個體。

# SD_ERR_GenericTypesNotSupported_1Arg
source: Generic types are not supported.
cs: Obecné typy se nepodporují.
de: Generische Typen werden nicht unterstützt.
es: Los tipos genéricos no son compatibles.
ja: ジェネリック型はサポートされていません。
ko: 제네릭 형식은 지원되지 않습니다.
zh_hans: 不支持泛型类型。
zh_hant: 不支援泛型類型。

# SD_ERR_AbstractTypesNotSupported_1Arg
source: Abstract types are not supported.
cs: Abstraktní typy nejsou podporované.
de: Abstrakte Typen werden nicht unterstützt.
es: Los tipos abstractos no son compatibles.
ja: 抽象型はサポートされていません。
ko: 추상 형식은 지원되지 않습니다.
zh_hans: 不支持抽象类型。
zh_hant: 不支援抽象類型。

# SD_ERR_RenameNotSupported
source: The current object is auto-generated and only supports renaming through the Settings Designer.
cs: Aktuální objekt se vygeneroval automaticky a dá se přejmenovat jenom pomocí návrháře nastavení.
de: Das aktuelle Objekt wurde automatisch generiert und kann nur mithilfe des Einstellungs-Designers umbenannt werden.
es: El objeto actual se generó automáticamente y sólo admite el cambio de nombre a través del Diseñador de configuración.
ja: 現在のオブジェクトは自動生成されていて、設定デザイナーによる名前の変更のみサポートしています。
ko: 현재 개체는 자동으로 생성되었으며 설정 디자이너를 통해서만 이름을 바꿀 수 있습니다.
zh_hans: 当前对象是自动生成的，只支持通过“设置设计器”为其重命名。
zh_hant: 目前的物件是自動產生的，而且僅支援透過設定設計工具重新命名。

# SD_ERR_ModifyParamsNotSupported
source: The current object is auto-generated and does not support modifying parameters.
cs: Stávající objekt se vytváří automaticky a nepodporuje změnu parametrů.
de: Das aktuelle Objekt wird automatisch generiert und unterstützt das Ändern von Parametern nicht.
es: El objeto actual se generó automáticamente y no admite parámetros de modificación.
ja: 現在のオブジェクトは自動生成されていて、パラメーターの変更をサポートしていません。
ko: 현재 개체는 자동으로 생성되었으므로 매개 변수를 수정할 수 없습니다.
zh_hans: 当前对象是自动生成的，不支持修改参数。
zh_hant: 目前的物件是自動產生的，而且不支援修改參數的功能。

# SD_ERR_CantEditInDebugMode
source: The settings file cannot be modified at this time.
cs: Soubor nastavení se teď nedá změnit.
de: Die Einstellungsdatei kann momentan nicht geändert werden.
es: El archivo de configuración no se puede modificar en este momento.
ja: 設定ファイルは、現時点では変更できません。
ko: 지금은 설정 파일을 수정할 수 없습니다.
zh_hans: 此时无法修改设置文件。
zh_hant: 目前無法修改設定檔。

# SD_MNU_AddSettingText
source: &Add Setting
cs: Přid&at nastavení
de: &Einstellung hinzufügen
es: &Agregar ajuste
ja: 設定を追加(&A)
ko: 설정 추가(&A)
zh_hans: 添加设置(&A)
zh_hant: 新增設定(&A)

# SD_MNU_RemoveSettingText
source: R&emove Setting
cs: Od&ebrat nastavení
de: &Einstellung entfernen
es: Quit&ar ajuste
ja: 設定の削除(&E)
ko: 설정 제거(&E)
zh_hans: 删除设置(&E)
zh_hant: 移除設定(&E)
