Repository: dotnet/fsharp
Catalog: vsintegration/src/FSharp.ProjectSystem.PropertyPages/Resources/xlf/WCF.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Status_StartAddService_1Arg
source: Creating new service reference to '{0}'...
cs: Vytváří se nový odkaz na službu do {0}...
de: Neuer Dienstverweis auf "{0}" wird erstellt...
es: Creando nueva referencia de servicio en '{0}'...
fr: Création d'une référence de service à '{0}'...
it: Creazione di un nuovo riferimento al servizio all'indirizzo '{0}'...
ja: '{0}' への新しいサービス参照を作成しています...
ko: '{0}'에 대한 새 서비스 참조를 만드는 중...
pl: Tworzenie nowego odwołania do usługi do {0}...
pt_br: Criando nova referência de serviço para '{0}'...
ru: Создание ссылки на службу "{0}"...
tr: '{0}' için yeni hizmet başvurusu oluşturuluyor...
zh_hans: 正在新建对“{0}”的服务引用...
zh_hant: 正在建立 '{0}' 的新服務參考...

# CSRDlg_NoAssemblySelected
source: No assembly is selected.
cs: Nevybrali jste žádné sestavení.
de: Es wurde keine Assembly ausgewählt.
es: No se seleccionó ningún ensamblado.
fr: Aucun assembly sélectionné.
it: Nessun assembly selezionato.
ja: アセンブリが選択されていません。
ko: 선택된 어셈블리가 없습니다.
pl: Nie wybrano zestawu.
pt_br: Nenhum assembly está selecionado.
ru: Сборка не выбрана.
tr: Bir bütünleştirilmiş kod seçilmedi.
zh_hans: 未选择任何程序集。
zh_hant: 沒有選取任何組件。

# ReferenceGroup_AsyncOpPending
source: The requested operation is not valid while an asynchronous operation is in progress.
cs: Dokud probíhá asynchronní operace, požadovaná operace není platná.
de: Der angeforderte Vorgang ist unzulässig, während ein asynchroner Vorgang ausgeführt wird.
es: La operación solicitada no es válida cuando una operación asincrónica está en curso.
fr: L'opération demandée n'est pas valide tant qu'une opération asynchrone est en cours.
it: L'operazione richiesta non è valida quando è in corso un'operazione asincrona.
ja: 要求された操作は、非同期操作を実行している間は無効です。
ko: 비동기 작업이 진행되는 동안에는 요청된 작업이 유효하지 않습니다.
pl: Żądana operacja nie jest prawidłowa, gdy trwa operacja asynchroniczna.
pt_br: A operação solicitada não é válida enquanto uma operação assíncrona está em andamento.
ru: Запрошенная операция не действительная, пока действует асинхронная операция.
tr: Asenkron bir işlem yürütülürken istenen işlem geçerli değil.
zh_hans: 异步操作期间，请求的操作无效。
zh_hant: 當非同步作業進行中時，要求的作業無效。

# CSRDlg_MultipleURL
source: Multiple addresses (editable in .svcmap file)
cs: Víc adres (upravitelné v souboru .svcmap)
de: Mehrere Adressen (in SVCMAP-Datei bearbeitbar)
es: Varias direcciones (editables en el archivo .svcmap)
fr: Plusieurs adresses (modifiables dans le fichier .svcmap)
it: Più indirizzi (modificabili nel file con estensione svcmap)
ja: 複数アドレス (.svcmap ファイルで編集可能)
ko: 여러 주소(.svcmap 파일에서 편집 가능)
pl: Wiele adresów (edytowalne w pliku svcmap)
pt_br: Vários endereços (editáveis no arquivo .svcmap)
ru: Несколько адресов (изменяются в файле .svcmap)
tr: Birden çok adres (.svcmap dosyasında düzenlenebilir)
zh_hans: 多个地址(可在 .svcmap 文件中编辑)
zh_hant: 多重位址 (可在 .svcmap 檔案中編輯)

# AddSvcRefDlg_ContractsFoundAtUrl_2Args
source: {0} contract(s) found at address '{1}'.
cs: Na adrese {1} se našly kontrakty ({0}).
de: {0} Vertrag/Verträge gefunden bei Adresse "{1}".
es: Se encontraron {0} contratos en la dirección '{1}'.
fr: {0} contrats trouvés à l'adresse '{1}'.
it: {0} contratto/i trovato/i all'indirizzo '{1}'.
ja: アドレス '{1}' で {0} 個のコントラクトが見つかりました。
ko: 주소 '{1}'에서 {0}개의 계약을 찾았습니다.
pl: Pod adresem {1} znaleziono następującą liczbę kontraktów: {0}.
pt_br: {0} contrato(s) encontrado(s) no endereço '{1}'.
ru: Найдено {0} контрактов по адресу "{1}".
tr: {1}' adresinde {0} sözleşme bulundu.
zh_hans: 在地址“{1}”处找到 {0} 个协定。
zh_hant: 在位址 '{1}' 找到 {0} 個合約。

# AddSvcRefDlg_Error_CantCreateTempFile
source: Unable to create temporary configuration file for downloading service information.
cs: Nedá se vytvořit dočasný konfigurační soubor pro stažení informací o službě.
de: Temporäre Konfigurationsdatei für das Herunterladen von Dienstinformationen kann nicht erstellt werden.
es: No se puede crear el archivo de configuración temporal para descargar la información del servicio.
fr: Impossible de créer un fichier config temporaire pour le téléchargement des informations de service.
it: Non è possibile creare il file di configurazione temporaneo per scaricare le informazioni del servizio.
ja: サービス情報をダウンロードするための一時構成ファイルを作成できません。
ko: 서비스 정보를 다운로드하기 위한 임시 구성 파일을 만들 수 없습니다.
pl: Nie można utworzyć tymczasowego pliku konfiguracji dla pobieranych informacji o usłudze.
pt_br: Não é possível criar o arquivo de configuração temporário para baixar informações do serviço.
ru: Не удалось создать файл временной конфигурации, необходимый для загрузки информации о сервисе.
tr: Hizmet bilgilerini indirmek için geçici yapılandırma dosyası oluşturulamıyor.
zh_hans: 无法为下载服务信息创建临时配置文件。
zh_hant: 無法建立暫存組態檔進行下載服務資訊。

# ConfigurationFileOpenedInIncompatibleEditor
source: The file is already opened in an incompatible editor.
cs: Soubor je už otevřený v nekompatibilním editoru.
de: Die Datei ist bereits in einem inkompatiblen Editor geöffnet.
es: El archivo ya está abierto en un editor incompatible.
fr: Le fichier est déjà ouvert dans un éditeur incompatible.
it: File già aperto in un editor non compatibile.
ja: ファイルが、互換性のないエディターで既に開かれています。
ko: 이 파일은 호환되지 않는 편집기에 이미 열려 있습니다.
pl: Plik jest już otwarty w niezgodnym edytorze.
pt_br: O arquivo já está aberto em um editor incompatível.
ru: Файл уже открыт в несовместимом редакторе.
tr: Dosya uyumsuz bir düzenleyicide önceden açılmış.
zh_hans: 已经在不兼容的编辑器中打开了文件。
zh_hant: 這個檔案已經在不相容的編輯器中開啟。

# Status_DownloadingMetadata
source: Downloading service information...
cs: Stahují se informace o službě...
de: Dienstinformationen werden heruntergeladen...
es: Descargando información del servicio...
fr: Téléchargement des informations de service en cours...
it: Download delle informazioni sul servizio...
ja: サービス情報をダウンロードしています...
ko: 서비스 정보를 다운로드하는 중...
pl: Pobieranie informacji o usłudze...
pt_br: Baixando informações do serviço...
ru: Загрузка данных службы...
tr: Hizmet bilgileri indiriliyor...
zh_hans: 正在下载服务信息...
zh_hant: 正在下載服務資訊...

# AddSvcRefDlg_Error_ExistingRefGroupNotSupported
source: The current version of the software does not support adding a service reference to an existing service reference group.
cs: Aktuální verze softwaru nepodporuje přidávání odkazů na služby do existující skupiny odkazů na služby.
de: Die aktuelle Version der Software unterstützt das Hinzufügen von Dienstverweisen zu einer vorhandenen Dienstverweisgruppe nicht.
es: La versión actual del software no permite agregar una referencia de servicio a un grupo de referencias de servicio existente.
fr: La version actuelle du logiciel ne prend pas en charge l'ajout d'une référence de service à un groupe de références de services existant.
it: La versione corrente del software non supporta l'aggiunta di un riferimento al servizio a un gruppo di riferimenti al servizio esistente.
ja: ソフトウェアの現在のバージョンでは、既存のサービス参照グループへのサービス参照の追加はサポートされていません。
ko: 현재 버전의 소프트웨어에서는 기존 서비스 참조 그룹에 서비스 참조를 추가할 수 없습니다.
pl: Bieżąca wersja oprogramowania nie obsługuje dodawania odwołania do usługi do istniejącej grupy odwołań do usługi.
pt_br: A versão atual do software não dá suporte à adição de uma referência de serviço a um grupo de referências de serviço existente.
ru: Текущая версия ПО не поддерживает добавление ссылки на службу к существующей группе ссылок на службы.
tr: Yazılımın mevcut sürümü, mevcut hizmet başvuru grubuna bir hizmet başvurusu eklemeyi desteklemiyor.
zh_hans: 软件的当前版本不支持向现有服务引用组中添加服务引用。
zh_hant: 目前的軟體版本不支援將服務參考加入現有的服務參考群組中。

# Discovery_ErrorBuildSolution
source: If the service is defined in the current solution, try building the solution and adding the service reference again.
cs: Pokud je odkaz na službu v aktuálním řešení definovaný, pokuste se prosím řešení sestavit a odkaz na službu přidat znovu.
de: Wenn der Dienst in der aktuellen Projektmappe definiert ist, sollten Sie die Projektmappe erstellen und den Dienstverweis erneut hinzufügen.
es: Si el servicio se define en la solución actual, intente compilar la solución y agregar de nuevo la referencia de servicio.
fr: Si le service est défini dans la solution actuelle, essayez de générer la solution et d'ajouter de nouveau la référence du service.
it: Se il servizio è definito nella soluzione corrente, provare a compilare la soluzione e ad aggiungere nuovamente il riferimento al servizio.
ja: サービスが現在のソリューションに定義されている場合は、ソリューションの構築とサービス参照の追加を再試行してください。
ko: 서비스가 현재 솔루션에 정의되어 있으면 다시 솔루션을 빌드하고 서비스 참조를 추가해 보세요.
pl: Jeśli usługa została zdefiniowana w bieżącym rozwiązaniu, spróbuj skompilować rozwiązanie i dodać ponownie odwołanie do usługi.
pt_br: Se o serviço está definido na solução atual, tente compilar a solução e adicionar a referência de serviço novamente.
ru: Если служба определена в текущем решении, попробуйте собрать решение и добавить ссылку на службу еще раз.
tr: Hizmet geçerli çözüm içerisinde tanımlıysa çözümü yeniden derlemeyi ve hizmet başvurusunu yeniden eklemeyi deneyin.
zh_hans: 如果该服务已在当前解决方案中定义，请尝试生成该解决方案，然后再次添加服务引用。
zh_hant: 如果目前方案中已定義該服務，請重試一次建置方案，並加入服務參考。

# ReferenceGroup_MismatchBeginEndBatch
source: Mismatching Begin/EndBatch calls. You have called EndBatch more times than BeginBatch.
cs: Volání Begin/EndBatch se neshodují. EndBatch jste zavolali víckrát než BeginBatch.
de: Begin/EndBatch-Aufrufe stimmen nicht überein. "EndBatch" wurde häufiger aufgerufen als "BeginBatch".
es: Las llamadas a Begin/EndBatch no coinciden. Ha llamado más veces a EndBatch que a BeginBatch.
fr: Non-correspondance des appels Begin/EndBatch. Vous avez appelé EndBatch plus de fois que BeginBatch.
it: Mancata corrispondenza tra chiamate BeginBatch/EndBatch. EndBatch è stato chiamato più volte di BeginBatch.
ja: Begin/EndBatch の呼び出しが対応していません。EndBatch が BeginBatch よりも多く呼び出されています。
ko: BeginBatch와 EndBatch의 호출 횟수가 일치하지 않습니다. BeginBatch보다 EndBatch를 더 많이 호출했습니다.
pl: Niezgodne wywołania Begin/EndBatch. Wywołano element EndBatch więcej razy niż element BeginBatch.
pt_br: Chamadas Begin/EndBatch incompatíveis. Você chamou EndBatch mais vezes que BeginBatch.
ru: Нарушена парность вызовов Begin/EndBatch. EndBatch вызывался больше раз, чем BeginBatch.
tr: Eşleşmeyen Begin/EndBatch çağrıları. EndBatch'i BeginBatch'den daha fazla çağırdınız.
zh_hans: Begin/EndBatch 调用不匹配。调用 EndBatch 的次数比调用 BeginBatch 的次数多。
zh_hant: 不相符的 Begin/EndBatch 呼叫。EndBatch 的呼叫次數多於 BeginBatch。

# SingleFileGenerator_FailedToGenerateTypes_1Arg
source: Failed to generate code for the service reference '{0}'. Please check other error and warning messages for details.
cs: Generování kódu pro odkaz na službu {0} selhalo. Podrobnosti najdete v ostatních chybových zprávách a upozorněních.
de: Fehler beim Generieren von Code für den Dienstverweis "{0}". Weitere Details entnehmen Sie den anderen Fehler- und Warnmeldungen.
es: No se pudo generar código para la referencia al servicio '{0}'. Consulte otros mensajes de advertencia y error para obtener más detalles.
fr: Impossible de générer du code pour la référence de service '{0}'. Vérifiez les autres messages d'erreur et d'avertissement pour plus d'informations.
it: Non è stato possibile generare il codice per il riferimento al servizio '{0}'. Per altre informazioni, vedere gli altri messaggi di errore e di avviso.
ja: サービス参照 '{0}' のコードを生成できませんでした。詳細については、他のエラー メッセージと警告メッセージを確認してください。
ko: 서비스 참조 '{0}'에 대해 코드를 생성하지 못했습니다. 자세한 내용은 기타 오류 및 경고 메시지를 확인하세요.
pl: Nie można wygenerować kodu dla odwołania do usługi {0}. Aby uzyskać więcej szczegółów, sprawdź inne komunikaty o błędach i ostrzeżeniach.
pt_br: Falha ao gerar código para a referência de serviço '{0}'. Verifique outras mensagens de erro e aviso para mais detalhes.
ru: Не удалось создать код для ссылки службы "{0}". Проверьте другие сообщения об ошибках и предупреждениях.
tr: '{0}' hizmet başvurusu için kod oluşturulamadı. Ayrıntılar için diğer hata ve uyarı iletilerini kontrol edin.
zh_hans: 无法生成服务引用“{0}”的代码。 请检查其他错误和警告信息，了解详细信息。
zh_hant: 無法為服務參考 '{0}' 產生程式碼。如需詳細資訊，請檢查其他錯誤與警告訊息。
