Repository: dotnet/fsharp
Catalog: vsintegration/src/FSharp.ProjectSystem.PropertyPages/Resources/xlf/WCF.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ReferenceGroup_DeleteFailedConfigurationError
source: The configuration for the service reference could not be deleted due to the following issue: {0}
cs: Konfiguraci odkazu na službu nejde z následujícího důvodu smazat: {0}
de: Die Konfiguration für den Dienstverweis konnte aufgrund des folgenden Problems nicht gelöscht werden: {0}
es: No se pudo eliminar la configuración de la referencia del servicio debido al problema siguiente: {0}
fr: Impossible de supprimer la configuration de la référence de service en raison du problème suivant : {0}
it: Non è stato possibile eliminare la configurazione per il riferimento al servizio a causa del problema seguente: {0}
ja: 次の問題により、サービス参照の構成を削除できませんでした: {0}
ko: 다음 문제로 인해 서비스 참조의 구성을 삭제할 수 없습니다. {0}
pl: Nie można usunąć konfiguracji dla odwołania do usługi z powodu następującego problemu: {0}
pt_br: A configuração para referência de serviço não pôde ser deletada devido ao seguinte problema: {0}
ru: Конфигурация ссылки на службу не может быть удалена по следующей причине: {0}
tr: Şu sorundan dolayı hizmet başvurusu yapılandırması silinemedi: {0}
zh_hans: 未能删除服务引用的配置，因为存在以下问题: {0}
zh_hant: 由於有下列問題，所以無法刪除此服務參考的組態: {0}

# ReferenceGroup_UpdateFailedConfigurationError
source: The configuration for the service reference could not be updated due to the following issue: {0}
cs: Konfiguraci odkazu na službu nejde z následujícího důvodu aktualizovat: {0}
de: Die Konfiguration für den Dienstverweis konnte aufgrund des folgenden Problems nicht aktualisiert werden: {0}
es: No se pudo actualizar la configuración de la referencia de servicio debido al problema siguiente: {0}
fr: Impossible de mettre à jour la configuration de la référence de service en raison du problème suivant : {0}
it: Non è stato possibile aggiornare la configurazione per il riferimento al servizio a causa del problema seguente: {0}
ja: 次の問題により、サービス参照の構成を更新できませんでした: {0}
ko: 다음 문제로 인해 서비스 참조의 구성을 업데이트할 수 없습니다. {0}
pl: Nie można zaktualizować konfiguracji dla odwołania do usługi z powodu następującego problemu: {0}
pt_br: A configuração para a referência de serviço não pôde ser atualizada devido ao seguinte problema: {0}
ru: Конфигурацию для ссылки на службу не удалось обновить по следующей причине: {0}
tr: Hizmet başvurusu yapılandırması şu sorun nedeniyle güncelleştirilemedi: {0}
zh_hans: 未能更新服务引用的配置，因为存在以下问题: {0}
zh_hant: 由於有下列問題，所以無法更新此服務參考的組態: {0}

# ReferenceGroup_AddFailedConfigurationError
source: The configuration for the service reference could not be added due to the following issue: {0}
cs: Konfiguraci odkazu na službu nejde z následujícího důvodu přidat: {0}
de: Die Konfiguration für den Dienstverweis konnte aufgrund des folgenden Problems nicht hinzugefügt werden: {0}
es: No se pudo agregar la configuración de la referencia de servicio debido al problema siguiente: {0}
fr: Impossible d'ajouter la configuration de la référence de service en raison du problème suivant : {0}
it: Non è stato possibile aggiungere la configurazione per il riferimento al servizio a causa del problema seguente: {0}
ja: 次の問題により、サービス参照の構成を追加できませんでした: {0}
ko: 다음 문제로 인해 서비스 참조의 구성을 추가할 수 없습니다. {0}
pl: Nie można dodać konfiguracji dla odwołania do usługi z powodu następującego problemu: {0}
pt_br: A configuração para a referência de serviço não pôde ser adicionada devido ao seguinte problema: {0}
ru: Не удается добавить конфигурацию для ссылки на службу по следующей причине: {0}
tr: Şu sorundan dolayı hizmet başvurusu yapılandırması eklenemedi: {0}
zh_hans: 未能添加服务引用的配置，因为存在以下问题: {0}
zh_hant: 由於有下列問題，所以無法加入此服務參考的組態: {0}

# AddSvcRefDlg_NothingSelectedOnGo
source: Please enter the address for a service.
cs: Zadejte prosím adresu služby.
de: Geben Sie die Adresse für einen Dienst ein.
es: Escriba la dirección de un servicio.
fr: Entrez l'adresse d'un service.
it: Immettere l'indirizzo per un servizio.
ja: サービスのアドレスを入力してください。
ko: 서비스의 주소를 입력하세요.
pl: Wprowadź adres dla usługi.
pt_br: Digite um endereço para um serviço.
ru: Введите адрес службы.
tr: Lütfen hizmetin adresini girin.
zh_hans: 请输入服务的地址。
zh_hant: 請輸入服務的位址。

# AddSvcRefDlg_Error_DiscoverUrl_1Arg
source: An error occurred while attempting to find services at '{0}'.
cs: Při pokusu o nalezení služeb na adrese {0} došlo k chybě.
de: Fehler beim Versuch, Dienste bei "{0}" zu suchen.
es: Error al intentar buscar servicios en '{0}'.
fr: Une erreur s'est produite lors de la recherche de services à l'adresse '{0}'.
it: Errore durante il tentativo di individuare servizi su '{0}'.
ja: '{0}' でサービスを検索しようとしてエラーが発生しました。
ko: '{0}'에서 서비스를 찾는 동안 오류가 발생했습니다.
pl: Wystąpił błąd w czasie próby znalezienia usług w {0}.
pt_br: Um erro ocorreu durante a tentativa de encontrar os serviços de '{0}'.
ru: Произошла ошибка при попытке найти службы на "{0}".
tr: '{0}' konumunda hizmetleri bulmaya çalışırken bir hata oluştu.
zh_hans: 尝试在“{0}”处查找服务时出错。
zh_hant: 嘗試在 '{0}' 找出服務時發生錯誤。

# AddSvcRefDlg_Error_ServicesInSolution
source: An error occurred while searching for services in the solution.
cs: Při hledání služeb v řešení došlo k chybě.
de: Fehler beim Suchen nach Diensten in der Projektmappe.
es: Error al buscar servicios en la solución.
fr: Une erreur s'est produite lors de la recherche de services dans la solution.
it: Errore durante la ricerca di servizi nella soluzione.
ja: ソリューションでサービスを検索中にエラーが発生しました。
ko: 솔루션에서 서비스를 검색하는 동안 오류가 발생했습니다.
pl: Wystąpił błąd podczas wyszukiwania usług w rozwiązaniu.
pt_br: Erro ao procurar serviços na solução.
ru: Произошла ошибка при поиске служб в решении.
tr: Çözüm içinde hizmetleri ararken bir hata oluştu.
zh_hans: 尝试在解决方案中搜索服务时出错。
zh_hant: 搜尋方案中的服務時發生錯誤。

# AddSvcRefDlg_Error_StartService_1Arg1
source: An error occurred while attempting to start services at '{0}'".
cs: Při pokusu o spuštění služeb na adrese {0} došlo k chybě.
de: Fehler beim Versuch, Dienste bei "{0}" zu starten.
es: Error al intentar iniciar servicios en '{0}'".
fr: Une erreur s'est produite lors du démarrage des services à l'adresse '{0}'".
it: Si è verificato un errore durante il tentativo di avviare servizi su '{0}'.
ja: '{0}' でサービスを開始しようとしてエラーが発生しました。
ko: '{0}'에서 서비스를 시작하는 동안 오류가 발생했습니다.
pl: Wystąpił błąd w czasie próby uruchomienia usług w {0}.
pt_br: Um erro ocorreu ao tentar iniciar os serviços em '{0}'".
ru: Произошла ошибка при попытке запуска службы на "{0}".
tr: '{0}' konumunda hizmetleri başlatmaya çalışırken bir hata oluştu.
zh_hans: 尝试在“{0}”处启动服务时出错。
zh_hant: 嘗試啟動位於 '{0}' 的服務時發生錯誤。

# AddSvcRefDlg_PleaseWait
source: Please wait for service information to be downloaded or click Stop.
cs: Počkejte, dokud se nestáhnou informace o službě, nebo klikněte na Zastavit.
de: Warten Sie, bis die Dienstinformationen heruntergeladen wurden, oder klicken Sie auf "Beenden".
es: Espere a que se descargue la información del servicio o haga clic en Detener.
fr: Patientez pendant le téléchargement des informations de service ou cliquez sur Arrêter.
it: Attendere il completamento del download delle informazioni del servizio oppure fare clic su Arresta.
ja: サービス情報がダウンロードされるまでお待ちください。または [停止] をクリックしてください。
ko: 서비스 정보가 다운로드될 때까지 기다리거나 [중지]를 클릭하세요.
pl: Zaczekaj na pobranie informacji o usłudze lub kliknij przycisk Zatrzymaj.
pt_br: Aguarde o download das informações do serviço ou clique em Parar.
ru: Подождите, пока не загрузятся данные служб. Для отмены операции нажмите кнопку "Остановить".
tr: Lütfen hizmet bilgilerinin indirilmesini bekleyin veya Durdur'a tıklayın.
zh_hans: 正在下载服务信息，请稍候，或者请单击“停止”。
zh_hant: 請等候下載服務資訊，或者按一下 [停止]。

# ReferenceGroup_FailedToGetReferencedAssembliesFromProject
source: Cannot get referenced assemblies from the project system.
cs: Ze systému projektů se nedala získat odkazovaná sestavení.
de: Assemblys, auf die verwiesen wird, können nicht aus dem Projektsystem abgerufen werden.
es: No se pueden obtener los ensamblados a los que se hace referencia del sistema del proyecto.
fr: Impossible d'obtenir les assemblys référencés à partir du système de projet.
it: Non è possibile ottenere gli assembly di riferimento dal sistema del progetto.
ja: 参照されたアセンブリをプロジェクト システムから取得できません。
ko: 참조된 어셈블리를 프로젝트 시스템에서 가져올 수 없습니다.
pl: Nie można pobrać przywoływanych zestawów z systemu projektów.
pt_br: Não é possível obter assemblies referenciados do sistema de projeto.
ru: Не удается найти сборки, на которые есть ссылки в системе проектов.
tr: Proje sisteminden başvurulan bütünleştirilmiş kodlar alınamıyor.
zh_hans: 无法从项目系统中获取引用的程序集。
zh_hant: 無法從專案系統中取得參考的組件。

# ReferenceGroup_SvcMapFileIsMissing
source: The service reference is invalid, because the .svcmap file ('{0}') cannot be found. It may have been moved, deleted or excluded from the project. To generate a new .svcmap file, delete the service reference and add it again.
cs: Odkaz na službu je neplatný, protože se nepovedlo najít soubor .svcmap ({0}). Možná je přesunutý, smazaný nebo vyloučený z projektu. Aby se dal vygenerovat nový soubor .svcmap, smažte odkaz na službu a potom ho znovu přidejte.
de: Der Dienstverweis ist ungültig, da die SVCMAP-Datei ("{0}") nicht gefunden wurde. Möglicherweise wurde sie verschoben, gelöscht oder aus dem Projekt ausgeschlossen. Wenn Sie eine neue SVCMAP-Datei generieren möchten, löschen Sie den Dienstverweis und fügen ihn erneut hinzu.
es: La referencia de servicio no es válida porque no se encuentra el archivo .svcmap ('{0}'). Puede que se haya movido, eliminado o excluido del proyecto. Para generar un nuevo archivo .svcmap, elimine la referencia de servicio y agréguela de nuevo.
fr: La référence de service n'est pas valide, car le fichier .svcmap ('{0}') est introuvable. Il a peut être été déplacé, supprimé ou exclu du projet. Pour générer un nouveau fichier .svcmap, supprimez la référence de service et ajoutez-la de nouveau.
it: Riferimento al servizio non valido. File con estensione ('{0}') non trovato. Potrebbe essere stato spostato, eliminato o escluso dal progetto. Per generare un nuovo file con estensione svcmap, eliminare il riferimento al servizio e aggiungerlo di nuovo.
ja: .svcmap ファイル ('{0}') が見つからないためサービス参照が無効です。移動または削除されたか、プロジェクトから除外されている可能性があります。新しい .svcmap ファイルを生成するには、サービス参照を削除してから再び追加してください。
ko: .svcmap 파일('{0}')을 찾을 수 없으므로 서비스 참조가 유효하지 않습니다. 이 파일은 이동 또는 삭제되었거나 프로젝트에서 제외되었을 수 있습니다. 새 .svcmap 파일을 생성하려면 서비스 참조를 삭제하고 다시 추가하세요.
pl: Odwołanie do usługi jest nieprawidłowe, ponieważ nie można odnaleźć pliku .svcmap ({0}). Mógł on zostać przeniesiony, usunięty lub wykluczony z projektu. Aby wygenerować nowy plik .svcmap, usuń odwołanie do usługi i ponownie je dodaj.
pt_br: A referência de serviço é inválida, pois o arquivo .svcmap ('{0}') não pode ser encontrado. Ele pode ter sido movido, excluído ou removido do projeto. Para gerar um novo arquivo .svcmap, exclua a referência de serviço e adicione-a novamente.
ru: Ссылка на службу недействительна, ибо не удается найти файл svcmsp ("{0}"). Возможно, он был перемещен, удален или исключен из проекта. Чтобы создать новый svcmap-файл, удалите ссылку на службу и добавьте ее снова.
tr: .svcmap dosyası ('{0}') bulunamadığından hizmet başvurusu geçersiz. Dosya taşınmış, silinmiş veya projeden çıkartılmış olabilir. Yeni bir .svcmap dosyası oluşturmak için hizmet başvurusunu silin ve yeniden ekleyin.
zh_hans: 服务引用无效，原因是找不到 .svcmap 文件(“{0}”)。该文件可能已从项目中移动、删除或排除。 若要生成新的 .svcmap 文件，请删除该服务引用，然后再添加它。
zh_hant: 該服務參考無效，因為找不到 .svcmap 檔案 ('{0}')。可能已經從專案中移除、刪除或排除該檔案。若要產生新的 .svcmap 檔案，請刪除該服務參考，並再次將其加入。

# ReferenceGroup_SvcMapFileBadFormat
source: The service reference is invalid. The .svcmap file ('{0}') cannot be loaded. It may be corrupted or in a bad format: {1}
cs: Odkaz na službu je neplatný. Soubor .svcmap ({0}) se nepovedlo načíst. Může být poškozený nebo ve špatném formátu: {1}
de: Der Dienstverweis ist ungültig. Die SVCMAP-Datei ("{0}") kann nicht geladen werden. Möglicherweise ist sie beschädigt oder hat ein unzulässiges Format: {1}
es: La referencia de servicio no es válida. No se puede cargar el archivo .svcmap ('{0}'). Puede que esté dañado o que tenga un formato incorrecto: {1}
fr: La référence de service n'est pas valide. Impossible de charger le fichier .svcmap ('{0}'). Il peut être endommagé ou dans un format incorrect : {1}
it: Il riferimento al servizio non è valido. Non è possibile caricare il file con estensione svcmap ('{0}'). È possibile che il file sia danneggiato o in formato non valido: {1}
ja: サービス参照が無効です。.svcmap ファイル ('{0}') を読み込むことができません。破損しているか、無効な形式の可能性があります: {1}
ko: 서비스 참조가 잘못되었습니다. .svcmap 파일('{0}')을 로드할 수 없습니다. 이 파일은 손상되거나 형식이 잘못되어 있을 수 있습니다. {1}
pl: Odwołanie do usługi jest nieprawidłowe. Nie można załadować pliku .svcmap ({0}). Plik może być uszkodzony lub ma zły format: {1}
pt_br: A referência de serviço é inválida O arquivo .svcmap ('{0}') não pode ser carregado. Ele pode estar corrompido ou em um formato ruim: {1}
ru: Ссылка на службу недействительна. Не удается загрузить файл svcmap ("{0}"). Возможно, он поврежден или имеет неверный формат: {1}
tr: Hizmet başvurusu geçersiz. .svcmap dosyası ('{0}') yüklenemiyor. Bozuk veya biçimi hatalı olabilir: {1}
zh_hans: 服务引用无效。无法加载 .svcmap 文件(“{0}”)。该文件可能已损坏或格式不正确: {1}
zh_hant: 該服務參考無效。無法載入 .svcmap 檔案 ('{0}')。它可能已損毀或是格式錯誤: {1}

# AddSvcRegDlg_ShowErrorDetails
source: (Details)
cs: (Podrobnosti)
es: (Detalles)
fr: (Détails)
it: (Dettagli)
ja: (詳細)
ko: (자세히)
pl: (Szczegóły)
pt_br: (Detalhes)
ru: (Подробности)
tr: (Ayrıntılar)
zh_hans: (详细信息)
zh_hant: (詳細資料)

# AddSvcRefDlg_OPSelectContract
source: Select a service contract to view its operations.
cs: Pro zobrazení operací služby vyberte její kontrakt.
de: Wählen Sie einen Dienstvertrag aus, um seine Abläufe anzuzeigen.
es: Seleccione un contrato de servicio para ver sus operaciones.
fr: Sélectionnez un contrat de service pour afficher ses opérations.
it: Selezionare un contratto di servizio per visualizzarne le operazioni.
ja: サービス コントラクトを選択して操作を表示します。
ko: 서비스 계약을 선택하여 해당 작업을 확인하세요.
pl: Wybierz kontrakt usługi, aby wyświetlić jego operacje.
pt_br: Selecione um contrato de serviço para exibir as operações.
ru: Чтобы просмотреть операции службы, выберете контракт службы.
tr: İşlemlerini görüntülemek için bir hizmet sözleşmesi seçin.
zh_hans: 选择服务协定可查看其操作。
zh_hant: 選取要檢視其作業的服務合約。

# CSRDlg_Title
source: Service Reference Settings
cs: Nastavení odkazu na službu
de: Dienstverweiseinstellungen
es: Configuración de referencia de servicio
fr: Paramètres de référence de service
it: Impostazioni riferimento al servizio
ja: サービス参照設定
ko: 서비스 참조 설정
pl: Ustawienia odwołań do usługi
pt_br: Configurações de Referência de Serviço
ru: Настройки ссылок на службы
tr: Hizmet Başvuru Ayarları
zh_hans: 服务引用设置
zh_hant: 服務參考設定

# CSRDlg_CustomType
source: ( Custom )
cs: ( Vlastní )
de: (Benutzerdefiniert)
es: (Personalizado)
fr: ( Personnalisé )
it: ( Personalizzato )
ja: (カスタム)
ko: ( 사용자 지정 )
pl: ( Niestandardowe )
pt_br: ( Personalizado )
ru: (Настройка)
tr: (Özel)
zh_hans: (自定义)
zh_hant: (自訂)

# CSRDlg_AssemblyNotFoundError
source: The assembly '{0}' could not be found.
cs: Sestavení {0} se nedá najít.
de: Die Assembly "{0}" wurde nicht gefunden.
es: No se encontró el ensamblado '{0}'.
fr: L'assembly '{0}' est introuvable.
it: L'assembly '{0}' non è stato trovato.
ja: アセンブリ '{0}' が見つかりませんでした。
ko: '{0}' 어셈블리를 찾을 수 없습니다.
pl: Nie odnaleziono zestawu „{0}”.
pt_br: Não foi possível encontrar o assembly '{0}'.
ru: Не удается найти сборку ''{0}''.
tr: '{0}' bütünleştirilmiş kodu bulunamadı.
zh_hans: 未能找到程序集“{0}”。
zh_hant: 找不到組件 '{0}'。

# CSRDlg_NullURL
source: Address should be a valid non-empty URL.
cs: Adresa by měla být platná, neprázdná adresa URL.
de: Die Adresse muss eine gültige, nicht leere URL sein.
es: La dirección debe ser una dirección URL no vacía válida.
fr: L'adresse doit être une URL valide non vide.
it: L'indirizzo deve essere un URL valido non vuoto.
ja: アドレスには空ではない有効な URL を指定してください。
ko: 주소는 비어 있지 않은 올바른 URL이어야 합니다.
pl: Adres powinien być prawidłowym, niepustym adresem URL.
pt_br: O endereço deve ser uma URL válida não vazia.
ru: Адрес должен быть действительным не пустым URL.
tr: Adres, boş olmayan geçerli bir URL olmalıdır.
zh_hans: 地址应为有效的非空 URL。
zh_hant: 位址必須是有效、非空白的 URL。

# AddSvcRefDlg_ServicesFound_1Arg
source: {0} service(s) found.
cs: Nalezené služby ({0})
de: {0} Dienst(e) gefunden.
es: {0} servicios encontrados.
fr: {0} services trouvés.
it: Servizi trovati: {0}.
ja: {0} 個のサービスが見つかりました。
ko: {0}개의 서비스를 찾았습니다.
pl: Znaleziono usługi ({0}).
pt_br: {0} serviço(s) encontrado(s).
ru: Сервисов найдено: {0}
tr: {0} hizmet bulundu.
zh_hans: 找到 {0} 个服务。
zh_hant: 已找到 {0} 個服務。

# Err_UserCancelled
source: The operation was cancelled.
cs: Operace se zrušila.
de: Der Vorgang wurde abgebrochen.
es: Se canceló la operación.
fr: L'opération a été annulée.
it: Operazione annullata.
ja: 処理が取り消されました。
ko: 작업이 취소되었습니다.
pl: Operacja została anulowana.
pt_br: A operação foi cancelada.
ru: Операция отменена.
tr: İşlem iptal edildi.
zh_hans: 操作被取消。
zh_hant: 作業已取消。

# UpdateDialog_Title_1Arg
source: Updating Service Reference '{0}'
cs: Aktualizuje se odkaz na službu {0}.
de: Dienstverweis "{0}" wird aktualisiert
es: Actualizando referencia de servicio '{0}'.
fr: Mise à jour de la référence de service '{0}'
it: Aggiornamento del riferimento al servizio '{0}'
ja: サービス参照 '{0}' を更新しています
ko: 서비스 참조 '{0}'을(를) 업데이트하는 중
pl: Aktualizowanie odwołania do usługi {0}
pt_br: Atualizando a Referência de Serviço '{0}'
ru: Обновление ссылки на службу "{0}"
tr: '{0}' Hizmet Başvurusu Güncelleştiriliyor
zh_hans: 正在更新服务引用“{0}”
zh_hant: 正在更新服務參考 '{0}'

# Status_UpdateComplete
source: Service reference update complete.
cs: Aktualizace referencí na službu je dokončená.
de: Die Aktualisierung des Dienstverweises ist abgeschlossen.
es: Actualización de referencia de servicio completada.
fr: Mise à jour de la référence de service terminée.
it: Aggiornamento del riferimento al servizio completato.
ja: サービス参照の更新が完了しました。
ko: 서비스 참조가 업데이트되었습니다.
pl: Ukończono aktualizowanie odwołania do usługi.
pt_br: Atualização de referência de serviço concluída.
ru: Обновление ссылки на службу завершено.
tr: Hizmet başvurusu güncelleştirme tamamlandı.
zh_hans: 服务引用更新完毕。
zh_hant: 服務參考的更新完成。

# Status_GeneratingProxy
source: Generating service reference client code...
cs: Generuje se klientský kód odkazu na službu...
de: Dienstverweis-Clientcode wird generiert...
es: Generando código de cliente de referencia de servicio...
fr: Génération du code client de référence de service en cours...
it: Generazione del codice client del riferimento al servizio...
ja: サービス参照クライアント コードを生成しています...
ko: 서비스 참조 클라이언트 코드를 생성하는 중...
pl: Generowanie kodu klienta odwołania do usługi...
pt_br: Gerando código de cliente de referência de serviço...
ru: Создание клиентского кода для ссылки на службу...
tr: Hizmet başvurusu istemci kodu oluşturuluyor...
zh_hans: 正在生成服务引用客户端代码...
zh_hant: 正在產生服務參考的用戶端程式碼...

# Status_GeneratingProxyComplete
source: Generation of service reference client code complete.
cs: Generování klientského kódu odkazu na službu se dokončilo.
de: Das Generieren des Dienstverweis-Clientcodes ist abgeschlossen.
es: Generación del código cliente de referencia de servicio completada.
fr: Génération du code client de référence de service terminée.
it: Generazione del codice client del riferimento al servizio completata.
ja: サービス参照クライアント コードの生成が完了しました。
ko: 서비스 참조 클라이언트 코드가 생성되었습니다.
pl: Ukończono generowanie kodu klienta odwołania do usługi.
pt_br: Geração do código de cliente de referência de serviço concluída.
ru: Клиентский код для ссылки на службу создан.
tr: Hizmet başvurusu istemci kodu oluşturma tamamlandı.
zh_hans: 服务引用客户端代码生成完毕。
zh_hant: 產生服務參考的用戶端程式碼完成。

# Status_StartUpdate_1Arg
source: Updating service reference '{0}'...
cs: Aktualizuje se odkaz na službu {0}...
de: Dienstverweis "{0}" wird aktualisiert...
es: Actualizando referencia de servicio '{0}'...
fr: Mise à jour de la référence de service '{0}'...
it: Aggiornamento del riferimento al servizio '{0}'...
ja: サービス参照 '{0}' を更新しています...
ko: 서비스 참조 '{0}'을(를) 업데이트하는 중...
pl: Aktualizowanie odwołania do usługi {0}...
pt_br: Atualizando a referência de serviço '{0}'...
ru: Обновление ссылки на службу "{0}"...
tr: '{0}' hizmet başvurusu güncelleştiriliyor...
zh_hans: 正在更新服务引用“{0}”...
zh_hant: 正在更新服務參考 '{0}'...

# Status_UpdatingConfig
source: Updating configuration...
cs: Aktualizuje se konfigurace...
de: Konfiguration wird aktualisiert...
es: Actualizando configuración...
fr: Mise à jour de la configuration en cours...
it: Aggiornamento della configurazione in corso...
ja: 構成を更新しています...
ko: 구성을 업데이트하는 중...
pl: Aktualizowanie konfiguracji...
pt_br: Atualizando configuração...
ru: Обновление конфигурации...
tr: Yapılandırma güncelleştiriliyor...
zh_hans: 正在更新配置...
zh_hant: 正在更新組態...

# Status_UpdatingConfigComplete
source: Configuration update complete.
cs: Aktualizace konfigurace se dokončila.
de: Die Konfigurationsaktualisierung ist abgeschlossen.
es: Actualización de configuración completada.
fr: Mise à jour de la configuration terminée.
it: Aggiornamento della configurazione completato.
ja: 構成の更新が完了しました。
ko: 구성이 업데이트되었습니다.
pl: Ukończono aktualizowanie konfiguracji.
pt_br: Atualização de configuração concluída.
ru: Обновление конфигурации завершено.
tr: Yapılandırma güncelleştirmesi tamamlandı.
zh_hans: 配置更新完毕。
zh_hant: 組態更新完成。

# Status_UpdateCancelled
source: Service reference update was cancelled.
cs: Aktualizace referencí na službu se zrušila.
de: Die Aktualisierung des Dienstverweises wurde abgebrochen.
es: Se canceló la actualización de referencia de servicio.
fr: Mise à jour de la référence de service annulée.
it: Aggiornamento del riferimento al servizio annullato.
ja: サービス参照の更新が取り消されました。
ko: 서비스 참조 업데이트가 취소되었습니다.
pl: Aktualizacja odwołania do usługi została anulowana.
pt_br: Atualização da referência de serviço foi cancelada.
ru: Обновление ссылки на службу отменено.
tr: Hizmet başvurusu güncelleştirme iptal edildi.
zh_hans: 服务引用更新已取消。
zh_hant: 已取消服務參考的更新。

# Status_UpdateFailed
source: Service reference update failed.
cs: Aktualizace referencí na službu selhala.
de: Fehler beim Aktualisieren des Dienstverweises.
es: No se pudo actualizar la referencia de servicio.
fr: Échec de la mise à jour de la référence de service.
it: Non è stato possibile aggiornare il riferimento al servizio.
ja: サービス参照の更新が失敗しました。
ko: 서비스 참조를 업데이트하지 못했습니다.
pl: Nie można zaktualizować odwołania do usługi.
pt_br: Falha na atualização de referência de serviço.
ru: Произошла ошибка при обновлении ссылки на службу.
tr: Hizmet başvurusu güncelleştirme başarısız oldu.
zh_hans: 服务引用更新失败。
zh_hant: 服務參考的更新失敗。

# Status_AddServiceComplete
source: Add service reference complete.
cs: Přidání odkazu na službu se dokončilo.
de: Das Hinzufügen des Dienstverweises ist abgeschlossen.
es: Incorporación de referencia de servicio completada.
fr: Ajout de la référence de service terminé.
it: Aggiunta del riferimento al servizio completata.
ja: サービス参照の追加が完了しました。
ko: 서비스 참조가 추가되었습니다.
pl: Ukończono dodawanie odwołania do usługi.
pt_br: Adição de referência de serviço concluída.
ru: Добавление ссылки на службу завершено.
tr: Hizmet başvurusu ekleme tamamlandı.
zh_hans: 服务引用添加完毕。
zh_hant: 加入服務參考完成。

# Status_AddServiceFailed
source: Add service reference failed.
cs: Přidání odkazu na službu selhalo.
de: Fehler beim Hinzufügen des Dienstverweises.
es: No se pudo agregar la referencia de servicio.
fr: Échec de l'ajout de la référence de service.
it: Non è stato possibile aggiungere il riferimento al servizio.
ja: サービス参照の追加が失敗しました。
ko: 서비스 참조를 추가하지 못했습니다.
pl: Nie można dodać odwołania do usługi.
pt_br: Falha ao adicionar a referência de serviço.
ru: Не удалось добавить ссылку на службу.
tr: Hizmet başvurusu ekleme başarısız.
zh_hans: 服务引用添加失败。
zh_hant: 加入服務參考失敗。
