Repository: dotnet/fsharp
Catalog: vsintegration/src/FSharp.ProjectSystem.PropertyPages/Resources/xlf/WCF.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AddSvcRefDlg_DefaultDialogTitle
source: Add Service Reference
cs: Přidat odkaz na službu
de: Dienstverweis hinzufügen
es: Agregar referencia de servicio
fr: Ajouter une référence de service
it: Aggiungi riferimento al servizio
ja: サービス参照の追加
ko: 서비스 참조 추가
pl: Dodawanie odwołania do usługi
pt_br: Adicionar Referência de Serviço
ru: Добавить ссылку на службу
tr: Hizmet Başvurusu Ekle
zh_hans: 添加服务引用
zh_hant: 加入服務參考

# CodeGenerator_UnableToGetCodeDomProvider
source: Unable to find a code generator (CodeDomProvider).
cs: Nepovedlo se najít generátor kódu (CodeDomProvider).
de: Es wurde kein Code-Generator (CodeDomProvider) gefunden.
es: No se encontró un generador de código (CodeDomProvider).
fr: Impossible de trouver un générateur de code (CodeDomProvider).
it: Non è stato trovato alcun generatore del codice (CodeDomProvider).
ja: コード ジェネレーター (CodeDomProvider) が見つかりません。
ko: 코드 생성기(CodeDomProvider)를 찾을 수 없습니다.
pl: Nie można odnaleźć generatora kodu (CodeDomProvider).
pt_br: Não foi possível encontrar o gerador de código (CodeDomProvider).
ru: Не удалось найти генератор кода (CodeDomProvider).
tr: Kod oluşturucusu (CodeDomProvider) bulunamıyor.
zh_hans: 无法找到代码生成器(CodeDomProvider)。
zh_hant: 找不到程式碼產生器 (CodeDomProvider)。

# Configuration_CantSaveTemporaryConfigurations
source: Configuration could not be saved. Make sure the configuration file exists and can be edited.
cs: Konfigurace se nedá uložit. Ujistěte se prosím, že konfigurační soubor existuje a že se dá upravovat.
de: Die Konfiguration konnte nicht gespeichert werden. Stellen Sie sicher, dass die Konfigurationsdatei vorhanden ist und bearbeitet werden kann.
es: No se pudo guardar la configuración. Asegúrese de que el archivo de configuración existe y se puede modificar.
fr: Impossible d'enregistrer la configuration. Vérifiez que le fichier config existe et qu'il peut être modifié.
it: Non è stato possibile salvare la configurazione. Verificare che i file di configurazione siano presenti e possano essere modificati.
ja: 構成を保存できません。構成ファイルが存在し、編集できることを確認してください。
ko: 구성을 저장할 수 없습니다. 구성 파일이 있는지, 그리고 편집할 수 있는지 확인하세요.
pl: Nie można zapisać konfiguracji. Upewnij się, że plik konfiguracji istnieje i można go edytować.
pt_br: Não foi possível salvar a configuração. Verifique se o arquivo de configuração existe e se ele pode ser editado.
ru: Не удалось сохранить конфигурацию. Убедитесь, что конфигурационных файл существует и что его можно изменить.
tr: Yapılandırma kaydedilemedi. Yapılandırma dosyasının var olduğundan ve düzenlenebildiğinden emin olun.
zh_hans: 未能保存配置。请确保配置文件存在且可供编辑。
zh_hant: 無法儲存組態。請確認組態檔是否存在、是否可編輯。

# Configuration_IVsProjectSpecialFilesNotSupported
source: The current project does not support configuration files.
cs: Aktuální projekt konfigurační soubory nepodporuje.
de: Das aktuelle Projekt unterstützt keine Konfigurationsdateien.
es: El proyecto actual no admite archivos de configuración.
fr: Le projet actif ne prend pas en charge les fichiers de configuration.
it: Il progetto corrente non supporta i file di configurazione.
ja: 現在のプロジェクトは構成ファイルをサポートしていません。
ko: 현재 프로젝트에서 구성 파일을 지원하지 않습니다.
pl: Bieżący projekt nie obsługuje plików konfiguracji.
pt_br: O projeto atual não dá suporte a arquivos de configuração.
ru: Текущий проект не поддерживает конфигурационные файлы.
tr: Geçerli proje yapılandırma dosyalarını desteklemiyor.
zh_hans: 当前项目不支持配置文件。
zh_hant: 目前的專案不支援組態檔。

# AddSvcRefDlg_NoServicesFoundInSolution
source: No services found in the solution.
cs: V řešení se nenašly žádné služby.
de: In der Projektmappe wurden keine Dienste gefunden.
es: No se encontraron servicios en la solución.
fr: Aucun service présent dans la solution.
it: Nessun servizio trovato nella soluzione.
ja: ソリューションにサービスが見つかりません。
ko: 솔루션에서 서비스를 찾을 수 없습니다.
pl: Nie znaleziono żadnych usług w rozwiązaniu.
pt_br: Nenhum serviço foi encontrado na solução.
ru: В решении не найдено служб.
tr: Çözümde herhangi bir hizmet bulunamadı.
zh_hans: 未在解决方案中找到服务。
zh_hant: 在方案中找不到服務。

# AddSvcRefDlg_ErrorOnOK
source: There was an error downloading metadata from the address. Please verify that you have entered a valid address.
cs: Při stahování metadat z dané adresy došlo k chybě. Zkontrolujte prosím, jestli jste zadali platnou adresu.
de: Fehler beim Herunterladen von Metadaten von der Adresse. Stellen Sie sicher, dass die eingegebene Adresse gültig ist.
es: Hubo un error al descargar los metadatos desde esta dirección. Compruebe que ha especificado una dirección válida.
fr: Erreur lors du téléchargement de métadonnées à partir de l'adresse. Vérifiez que vous avez entré une adresse valide.
it: Errore durante il download dei metadati dall'indirizzo. Verificare di avere immesso un indirizzo valido.
ja: アドレスからメタデータをダウンロードするときに、エラーが発生しました。有効なアドレスを入力していることを確認してください。
ko: 주소에서 메타데이터를 다운로드하는 동안 오류가 발생했습니다. 올바른 주소를 입력했는지 확인하세요.
pl: Wystąpił błąd podczas pobierania metadanych z adresu. Sprawdź, czy wprowadzono poprawny adres.
pt_br: Erro ao baixar metadados do endereço. Verifique se você inseriu um endereço válido.
ru: Возникла ошибка при загрузке метаданных с указанного адреса. Проверьте корректность введенного адреса.
tr: Adresten meta veri indirilirken bir hata oluştu. Lütfen geçerli bir adres girdiğinizi doğrulayın.
zh_hans: 从此地址下载元数据时出错。请确认您输入了有效地址。
zh_hant: 從這個位址下載中繼資料時發生錯誤。請確認您輸入的是有效的位址。

# AddSvcRefDlg_ServicesFoundAtUrl_2Args
source: {0} service(s) found at address '{1}'.
cs: Na adrese {1} se našly služby ({0}).
de: {0} Dienst(e) gefunden bei Adresse "{1}".
es: {0} servicios encontrados en la dirección '{1}'.
fr: {0} services trouvés à l'adresse '{1}'.
it: {0} servizio o servizi trovato/i all'indirizzo '{1}'.
ja: アドレス '{1}' で {0} 個のサービスが見つかりました。
ko: 주소 '{1}'에서 {0}개의 서비스를 찾았습니다.
pl: Znaleziono usługi ({0}) pod adresem {1}.
pt_br: {0} serviço(s) encontrado(s) no endereço '{1}'.
ru: Сервисов найдено по адресу "{1}": {0}.
tr: {1}' adresinde {0} hizmet bulundu.
zh_hans: 在地址“{1}”处找到 {0} 个服务。
zh_hant: 在位址 '{1}' 找到 {0} 個服務。

# AddSvcRefDlg_ServicesFoundInSolution_1Arg
source: {0} service(s) found in the solution.
cs: V řešení se našly služby ({0}).
de: {0} Dienst(e) in der Projektmappe gefunden.
es: {0} servicios encontrados en la solución.
fr: {0} services trouvés dans la solution.
it: Servizi trovati nella soluzione: {0}.
ja: ソリューションで {0} 個のサービスが見つかりました。
ko: 솔루션에서 {0}개의 서비스를 찾았습니다.
pl: Znaleziono usługi ({0}) w rozwiązaniu.
pt_br: {0} serviço(s) encontrado(s) na solução.
ru: Сервисов найдено в решении: {0}
tr: Çözümde {0} hizmet bulundu.
zh_hans: 在解决方案中找到 {0} 个服务。
zh_hant: 在方案中找到 {0} 個服務。

# Configuration_OnlyRootItemIdSupported
source: It is only possible to access the default (ITEMID_ROOT) configuration file.
cs: Je možné přistupovat jenom k výchozímu (ITEMID_ROOT) konfiguračnímu souboru.
de: Es ist nicht möglich, auf die Standardkonfigurationsdatei (ITEMID_ROOT) zuzugreifen.
es: Solo se puede obtener acceso al archivo de configuración (ITEMID_ROOT) predeterminado.
fr: L'accès n'est possible qu'au fichier config (ITEMID_ROOT) par défaut.
it: È possibile accedere solo al file di configurazione (ITEMID_ROOT) predefinito.
ja: 既定の (ITEMID_ROOT) 構成ファイルにのみアクセスすることができます。
ko: 기본(ITEMID_ROOT) 구성 파일에만 액세스할 수 있습니다.
pl: Możliwy jest tylko dostęp do domyślnego pliku konfiguracji (ITEMID_ROOT).
pt_br: Só é possível acessar o arquivo de configuração padrão (ITEMID_ROOT).
ru: Возможно лишь открыть конфигурационный файл по умолчанию (ITEMID_ROOT).
tr: Yalnızca varsayılan (ITEMID_ROOT) yapılandırma dosyasına erişmek mümkün.
zh_hans: 只能访问默认的(ITEMID_ROOT)配置文件。
zh_hant: 只能存取預設 (ITEMID_ROOT) 組態檔。

# ReferenceGroup_InvalidNamespace
source: '{0}' is not a valid namespace for the service reference.
cs: {0} není platným oborem názvů pro odkaz na službu.
de: {0} ist kein gültiger Namespace für den Dienstverweis.
es: '{0}' no es un espacio de nombres válido para la referencia de servicio.
fr: '{0}' n'est pas un espace de noms valide pour la référence de service.
it: '{0}' non è uno spazio dei nomi valido per il riferimento al servizio.
ja: '{0}' はサービス参照に有効な名前空間ではありません。
ko: '{0}'은(는) 올바른 서비스 참조 네임스페이스가 아닙니다.
pl: Wartość {0} nie jest prawidłową przestrzenią nazw dla odwołania do usługi.
pt_br: '{0}' não é um namespace válido para a referência de serviço.
ru: {0} не является действительным пространством имен для ссылки на службу.
tr: '{0}', hizmet başvurusu için geçerli bir ad alanı değil.
zh_hans: “{0}”不是有效的服务引用命名空间。
zh_hant: '{0}' 不是服務參考的有效命名空間。

# ReferenceGroup_NamespaceConflictsOther
source: Cannot create a service reference with namespace '{0}' because the name is already in use by an existing service reference, folder or file.
cs: Nedá se vytvořit odkaz na službu s oborem názvů {0}, protože tento název už používá existující odkaz na službu, složka nebo soubor.
de: Ein Dienstverweis mit dem Namespace "{0}" kann nicht erstellt werden, weil der Name bereits von einem vorhandenen Dienstverweis bzw. einem Ordner oder einer Datei verwendet wird.
es: No se puede crear una referencia de servicio con el espacio de nombres '{0}' porque el nombre ya se está usando en una referencia de servicio, carpeta o archivo existente.
fr: Impossible de créer une référence de service avec un espace de noms '{0}' car ce nom est déjà utilisé par un fichier, un dossier ou une référence de service existant.
it: Non è possibile creare un riferimento al servizio con lo spazio dei nomi '{0}' perché il nome è già in uso da parte di un riferimento al servizio, una cartella o un file esistente.
ja: 同じ名前が既存のサービス参照、フォルダー、またはファイルによって使用されているので、名前空間 '{0}' を持つサービス参照を作成できません。
ko: 기존 서비스 참조, 폴더 또는 파일에서 '{0}' 이름을 이미 사용하고 있으므로 이 이름의 네임스페이스로 서비스 참조를 만들 수 없습니다.
pl: Nie można utworzyć odwołania do usługi z przestrzenią nazw {0}, ponieważ ta nazwa jest już używana przez istniejące odwołanie do usługi, folder lub plik.
pt_br: Não é possível criar uma referência de serviço com namespace '{0}' porque o nomes já está sendo usado por uma referência de serviço, pasta ou arquivo existentes.
ru: Не удалось создать группу ссылок с пространством имен "{0}", потому что имя уже используется либо существующей группой ссылок, либо каталогом, либо файлом.
tr: '{0}' ad alanı daha önce var olan bir hizmet başvurusu, klasör veya dosya tarafından kullanıldığı için bu adlı bir hizmet başvurusu oluşturulamaz.
zh_hans: 无法创建命名空间为“{0}”的服务引用，因为此名称已由某个现有服务引用、文件夹或文件使用。
zh_hant: 無法用命名空間 '{0}' 建立服務參考，因為此名稱已經由現有的參考群組、資料夾或檔案使用。

# ReferenceGroup_AddMultipleReference
source: Unable to add a new reference. One or more references already exists or the 'Metadata' section is not empty in the .svcmap file. Edit the .svcmap file and clear all the entries from the 'Metadata' section.
cs: Nedá se přidat nový odkaz. Jeden nebo víc odkazů už existuje, nebo sekce Metadata v souboru .svcmap není prázdná. Upravte prosím soubor .svcmap a smažte všechny položky v sekci Metadata.
de: Neuer Verweis kann nicht hinzugefügt werden. Mindestens ein Verweis ist bereits vorhanden, oder der Abschnitt "Metadata" in der SVCMAP-Datei ist nicht leer. Bearbeiten Sie die SVCMAP-Datei, und löschen Sie alle Einträge im Abschnitt "Metadata".
es: No se puede agregar una nueva referencia. Ya existen una o varias referencias, o la sección 'Metadatos' no está vacía en el archivo .svcmap. Edite el archivo .svcmap y borre todas las entradas de la sección 'Metadatos'.
fr: Impossible d'ajouter une nouvelle référence. Une ou plusieurs références existent déjà ou la section 'Metadata' n'est pas vide dans le fichier .svcmap. Modifiez le fichier .svcmap et supprimez toutes les entrées de la section 'Metadata'.
it: Non è possibile aggiungere un nuovo riferimento. Sono già presenti uno o più riferimenti o la sezione 'Metadata' non è vuota nel file con estensione svcmap. Modificare il file svcmap e cancellare tutte le voci dalla sezione 'Metadata'.
ja: 新しい参照を追加できません。1 つ以上の参照が既に存在するか、.svcmap ファイルの 'Metadata' セクションが空ではありません。.svcmap ファイルを編集して 'Metadata' セクションのすべてのエントリをクリアしてください。
ko: 새 참조를 추가할 수 없습니다. .svcmap 파일에 이미 하나 이상의 참조가 있거나 'Metadata' 섹션이 비어 있지 않습니다. .svcmap 파일을 편집하여 'Metadata' 섹션의 모든 항목을 지우세요.
pl: Nie można dodać nowego odwołania. Istnieje już co najmniej jedno odwołanie lub sekcja Metadata w pliku .svcmap nie jest pusta. Zmodyfikuj plik .svcmap i wyczyść wszystkie wpisy z sekcji Metadata.
pt_br: Não é possível adicionar uma nova referência. Uma ou mais referências já existem ou a seção 'Metadados' não está vazia no arquivo .svcmap. Edite esse arquivo e remova todas as entradas da seção 'Metadados'.
ru: Не удается добавить новую ссылку. Либо уже существует одна или более ссылок, либо секция "Metadata" в svcmap-файле не пуста. Исправьте svcmap-файл и очистите все записи из секции "Metadata".
tr: Yeni başvuru eklenemiyor. Bir veya daha fazla başvuru zaten var veya .svcmap dosyasındaki 'Metadata' bölümü boş değil. .svcmap dosyasını düzenleyin ve 'Metadata' bölümündeki tüm girdileri temizleyin.
zh_hans: 无法添加新的引用。在 .svcmap 文件中已经有一个或多个引用，或者“Metadata”部分不为空。请编辑 .svcmap 文件并清除“Metadata”部分中的所有项。
zh_hant: 無法加入新的參考。這個 .svcmap 檔案中已經有一或多個參考，或是其中的 'Metadata' 區段不是空的。請編輯這個 .svcmap 檔案，並清除 'Metadata' 區段中的所有項目。

# ReferenceGroup_NamespaceCantBeEmpty
source: A namespace needs to be specified for this service reference.
cs: Pro tento odkaz na službu se musí zadat obor názvů.
de: Ein Namespace muss für diesen Dienstverweis angegeben werden.
es: Debe especificarse un espacio de nombres para esta referencia de servicio.
fr: Vous devez spécifier un espace de noms pour cette référence de service.
it: Per il riferimento al servizio è necessario specificare uno spazio dei nomi.
ja: このサービス参照に対して名前空間を指定する必要があります。
ko: 이 서비스 참조에 네임스페이스를 지정해야 합니다.
pl: Należy określić przestrzeń nazw dla tego odwołania do usługi.
pt_br: Um namespace precisa ser especificado para esta referência de serviço.
ru: Нужно указать пространство имен для этой ссылки на службу.
tr: Bu hizmet başvurusu için ad alanı belirtilmelidir.
zh_hans: 需要为此服务引用指定命名空间。
zh_hant: 必須指定此服務參考的命名空間。

# ReferenceGroup_InvalidName
source: {0}' is not a valid name for a service reference.
cs: {0} není platným názvem pro odkaz na službu.
de: {0} ist kein gültiger Name für einen Dienstverweis.
es: {0}' no es un nombre válido para una referencia de servicio.
fr: {0}' n'est pas un nom valide pour une référence de service.
it: {0}' non è un nome valido per un riferimento al servizio.
ja: '{0}' はサービス参照に有効な名前ではありません。
ko: '{0}'은(는) 올바른 서비스 참조 이름이 아닙니다.
pl: Wartość {0} nie jest prawidłową nazwą dla odwołania do usługi.
pt_br: {0}' não é um nome válido para uma referência de serviço.
ru: {0} не является действительным именем для ссылки на службу.
tr: '{0}', hizmet başvurusu için geçerli bir ad değil.
zh_hans: “{0}”不是有效的服务引用名称。
zh_hant: {0}' 不是服務參考的有效名稱。

# ReferenceGroup_NameCantBeEmpty
source: Empty string is not a valid name for a reference group.
cs: Prázdný řetězec není platným názvem referenční skupiny.
de: Eine leere Zeichenfolge ist kein gültiger Name für eine Verweisgruppe.
es: Una cadena vacía no es un nombre válido para un grupo de referencias.
fr: La chaîne vide n'est pas un nom valide pour un groupe de référence.
it: Una stringa vuota non è un nome valido per un gruppo di riferimenti.
ja: 空の文字列は参照グループに有効な名前ではありません。
ko: 빈 문자열은 올바른 참조 그룹 이름이 아닙니다.
pl: Pusty ciąg nie jest prawidłową nazwą dla grupy odwołania.
pt_br: Uma cadeia de caracteres vazia não é um nome válido para um grupo de referências.
ru: Пустая строка не является действительным именем для группы ссылок.
tr: Boş dize başvuru grubu için geçerli bir ad değildir.
zh_hans: 空字符串不能用作引用组的有效名称。
zh_hant: 空字串不是參考群組的有效名稱。

# ReferenceGroup_NameConflictsOther
source: Cannot create a reference group named '{0}' because the name is already being used by an existing reference group, folder or file.
cs: Nepovedlo se vytvořit referenční skupinu {0}, protože tento název už používá existující referenční skupina, složka nebo soubor.
de: Die Verweisgruppe mit dem Namen "{0}" kann nicht erstellt werden, weil der Name bereits von einer vorhandenen Verweisgruppe bzw. einem Ordner oder einer Datei verwendet wird.
es: No se puede crear un grupo de referencias con el nombre '{0}' porque este nombre ya se está usando en un grupo de referencias, carpeta o archivo existente.
fr: Impossible de créer un groupe de référence intitulé '{0}' car ce nom est déjà utilisé par un fichier, un dossier ou un groupe de référence existant.
it: Non è possibile creare un gruppo di riferimenti denominato '{0}' perché il nome è già in uso da un gruppo di riferimenti, una cartella o un file esistente.
ja: 同じ名前が既存の参照グループ、フォルダー、またはファイルによって使用されているので、'{0}' という名前の参照グループを作成できません。
ko: 기존 참조 그룹, 폴더 또는 파일에서 이미 '{0}'(이)라는 이름을 사용하고 있으므로 이 이름으로 참조 그룹을 만들 수 없습니다.
pl: Nie można utworzyć grupy odwołania o nazwie {0}, ponieważ nazwa ta jest już używana przez istniejącą grupę odwołania, folder lub plik.
pt_br: Não é possível criar um grupo de referencias nomeado '{0}' porque o nome já está sendo usado por um grupo de referências, pasta ou arquivo existentes.
ru: Не удалось создать группу ссылок с именем "{0}", потому что имя уже используется либо существующей группой ссылок, либо каталогом, либо файлом.
tr: '{0}' adı daha önce var olan bir başvuru grubu, klasör veya dosya tarafından kullanıldığı için bu adlı bir başvuru grubu oluşturulamaz.
zh_hans: 无法创建名称为“{0}”的引用组，因为此名称已由某个现有引用组、文件夹或文件使用。
zh_hant: 無法建立名為 '{0}' 的參考群組，因為此名稱已經由現有的參考群組、資料夾或檔案使用。

# ReferenceGroup_NameCantStartEndWithSpace
source: Cannot create a reference group with namespace or name with leading or trailing whitespace characters.
cs: Nedá se vytvořit referenční skupina s oborem názvů nebo názvem začínajícím nebo končícím prázdnými znaky.
de: Eine Verweisgruppe, deren Namespace oder Name führende oder nachstehende Leerzeichen enthält, kann nicht erstellt werden.
es: No se puede crear un grupo de referencias con un espacio de nombres o un nombre que tenga caracteres de espacio iniciales o finales.
fr: Impossible de créer un groupe de référence avec un espace de noms ou un nom contenant des caractères d'espace blanc de début ou de fin.
it: Non è possibile creare un gruppo di riferimenti con un nome o uno spazio dei nomi contenente spazi iniziali o finali.
ja: 名前空間または名前の先頭や末尾にスペース文字を含む参照グループは作成できません。
ko: 선행 공백 또는 후행 공백 문자가 있는 네임스페이스나 이름으로 참조 그룹을 만들 수 없습니다.
pl: Nie można utworzyć grupy odwołania z przestrzenią nazw lub nazwą rozpoczynającą się lub kończącą znakami odstępu.
pt_br: Não é possível criar um grupo de referências com o namespace ou nome com caracteres de espaços em branco no início ou no término destes.
ru: Нельзя создать группу ссылок с пространством имен или именем, в начале или конце которого присутствуют пробелы.
tr: Adının başında ya da sonunda boşluk karakterleri olan veya ad alanı içeren bir başvuru grubu oluşturulamaz.
zh_hans: 无法创建其命名空间或名称带前导或尾随空白字符的引用组。
zh_hant: 無法用前端或後端有空白字元的命名空間或名稱建立參考群組。

# ReferenceGroup_NotFoundThroughPath
source: The .svcmap file cannot be found. It may have been moved or deleted. To generate a new .svcmap file, delete the service reference and add it again.
cs: Soubor .svcmap se nepovedlo najít. Možná je přesunutý nebo smazaný. Abyste mohli vygenerovat nový soubor .svcmap, smažte odkaz na službu a potom ho znovu přidejte.
de: Die SVCMAP-Datei wurde nicht gefunden. Möglicherweise wurde sie verschoben oder gelöscht. Wenn Sie eine neue SVCMAP-Datei generieren möchten, löschen Sie den Dienstverweis und fügen ihn erneut hinzu.
es: No se encuentra el archivo .svcmap. Es posible que se haya movido o eliminado. Para generar un nuevo archivo .svcmap, elimine la referencia de servicio y agréguela de nuevo.
fr: Impossible de trouver le fichier .svcmap. Il a peut-être été déplacé ou supprimé. Pour générer un nouveau fichier .svcmap, supprimez la référence de service et ajoutez-la de nouveau.
it: Il file con estensione svcmap non è stato trovato. Potrebbe essere stato spostato o eliminato. Per generare un nuovo file con estensione svcmap, eliminare il riferimento al servizio e aggiungerlo di nuovo.
ja: .svcmap ファイルが見つかりません。移動したか、または削除された可能性があります。新しい .svcmap ファイルを生成するには、サービス参照を削除してから再び追加してください。
ko: .svcmap 파일을 찾을 수 없습니다. 이동되었거나 삭제되었을 수 있습니다. 새 .svcmap 파일을 생성하려면 서비스 참조를 삭제하고 다시 추가하세요.
pl: Nie można odnaleźć pliku .svcmap. Mógł on zostać przeniesiony lub usunięty. Aby wygenerować nowy plik .svcmap, usuń odwołanie do usługi i ponownie je dodaj.
pt_br: O arquivo .svcmap não foi encontrado. Ele pode ter sido movido ou excluído. Para gerar um novo arquivo .svcmap, exclua a referência de serviço e adicione-a novamente.
ru: Не удалось найти svcmap-файл. Возможно, он перемещен или удален. Чтобы создать новый svcmap-файл, удалите ссылку на службу и добавьте ее снова.
tr: .svcmap dosyası bulunamıyor. Taşınmış veya silinmiş olabilir. Yeni bir .svcmap dosyası oluşturmak için hizmet başvurusunu silin ve yeniden ekleyin.
zh_hans: 无法找到 .svcmap 文件。它可能已被移动或删除。 若要生成一个新的 .svcmap 文件，请删除此服务引用，然后再次添加它。
zh_hant: 找不到 .svcmap 檔案，可能已經移除或刪除。若要產生新的 .svcmap 檔案，請刪除此服務參考，然後再次將它加入。

# ReferenceGroup_NotSupportedInCurrentProject
source: The current project does not support service references. To enable Windows Communication Foundation support, change the target version of the Microsoft .NET Framework.
cs: Aktuální projekt nepodporuje odkazy na služby. Aby se dala zapnout podpora Windows Communication Foundation, změňte cílovou verzi rozhraní Microsoft .NET Framework.
de: Das aktuelle Projekt unterstützt keine Dienstverweise. Um die Unterstützung der Windows Communication Foundation zu aktivieren, ändern Sie die Zielversion von Microsoft .NET Framework.
es: El proyecto actual no admite referencias de servicio. Para permitir la compatibilidad con Windows Communication Foundation, cambie la versión de destino de Microsoft .NET Framework.
fr: Le projet actif ne prend pas en charge les références de service. Pour activer la prise en charge de Windows Communication Foundation, changez la version cible de Microsoft .NET Framework.
it: Il progetto corrente non supporta riferimenti al servizio. Per abilitare il supporto di Windows Communication Foundation, cambiare la versione di destinazione di Microsoft .NET Framework.
ja: 現在のプロジェクトはサービス参照をサポートしていません。Windows Communication Foundation サポートを有効にするには、対象の Microsoft .NET Framework のバージョンを変更してください。
ko: 현재 프로젝트에서는 서비스 참조를 지원하지 않습니다. Windows Communication Foundation이 지원되도록 하려면 Microsoft .NET Framework의 대상 버전을 변경하세요.
pl: Bieżący projekt nie obsługuje odwołań do usług. Aby włączyć obsługę struktury Windows Communication Foundation, zmień docelową wersję programu Microsoft .NET Framework.
pt_br: O projeto atual não dá suporte a referências de serviço. Para habilitar o suporte ao Windows Communication Foundation, altere a versão de destino do Microsoft .NET Framework.
ru: Данный проект не поддерживает ссылки на службы. Чтобы включить поддержку Windows Communication Foundation, измените заданную версию Microsoft .NET Framework.
tr: Geçerli proje hizmet başvurularını desteklemiyor. Windows Communication Foundation desteğini etkinleştirmek için hedef Microsoft .NET Framework sürümünü değiştirin.
zh_hans: 当前项目不支持服务引用。若要启用 Windows Communication Foundation 支持，请更改 Microsoft .NET Framework 的目标版本。
zh_hant: 目前的專案並不支援服務參考。若要啟用 Windows Communication Foundation 支援，請變更 Microsoft .NET Framework 的目標版本。
