Repository: dotnet/fsharp
Catalog: vsintegration/src/FSharp.ProjectSystem.*/xlf/Microsoft.VisualStudio.Package.Project.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# CancelQueryEdit
source: The command you are attempting cannot be completed because the file '{0}' that must be modified cannot be changed. If the file is under source control, you may want to check it out; if the file is read-only on disk, you may want to change its attributes.
cs: Příkaz se nedá dokončit, protože soubor {0}, který je potřeba upravit, nejde změnit. Pokud je soubor součástí správy zdrojových kódů, rezervujte ho; pokud má soubor na disku označení jen pro čtení, můžete změnit jeho atributy.
de: Der von Ihnen eingegebene Befehl kann nicht ausgeführt werden, da die Datei "{0}", die geändert werden muss, nicht geändert werden kann. Wenn die Datei der Quellcodeverwaltung unterliegt, checken Sie sie aus, und wiederholen Sie den Vorgang. Wenn die Datei auf dem Datenträger schreibgeschützt ist, ändern Sie ihre Attribute.
es: El comando que intenta ejecutar no se puede completar porque el archivo '{0}' que se debe modificar no se puede cambiar. Si el archivo está bajo control de código fuente, es conveniente desprotegerlo; si es de solo lectura y está en el disco, es aconsejable cambiar los atributos.
fr: La commande que vous essayez d'utiliser ne peut pas être exécutée, car le fichier '{0}' qui doit être modifié ne peut pas l'être. Si ce fichier est sous contrôle de code source, vous pouvez l'extraire ; si le fichier est en lecture seule sur le disque, vous pouvez changer ses attributs.
it: Non è possibile completare il comando che si sta provando a eseguire perché il file '{0}' da modificare non può essere modificato. Se il file è sottoposto al controllo del codice sorgente, è possibile estrarlo. Se il file è di sola lettura su disco, è invece possibile modificarne gli attributi.
ja: 変更しなければならないファイル '{0}' を変更できないため、実行しようとしているコマンドを完了できません。このファイルがソース管理下にある場合は、チェックアウトしてください。ファイルがディスク上で読み取り専用の場合は、ファイルの属性を変更してください。
ko: 수정해야 하는 '{0}' 파일을 변경할 수 없으므로 사용하려는 명령을 완료할 수 없습니다. 해당 파일을 소스 제어에서 사용 중인 경우 체크 아웃해야 할 수 있습니다. 파일이 디스크에서 읽기 전용인 경우 파일의 특성을 변경해야 할 수 있습니다.
pl: Nie można ukończyć wykonywania polecenia, ponieważ nie jest możliwe wprowadzenie zmian w pliku „{0}” wymagającym modyfikacji. Jeśli plik podlega kontroli źródła, wyewidencjonuj go. Jeśli plik znajduje się na dysku i jest tylko do odczytu, zmień jego atrybuty.
pt_br: O comando que você está tentando não pode ser concluído porque o arquivo '{0}' que deve ser modificado não pode ser alterado. Se o arquivo está sob controle do código-fonte você pode desejar verificá-lo; se o arquivo é somente leitura no disco você pode desejar alterar seus atributos.
ru: Выполнение данной команды невозможно, поскольку изменение файла "{0}", который необходимо изменить, невозможно. Если этот файл находится в системе управления версиями, его можно извлечь; если файл доступен на диске только для чтения, может потребоваться изменение его атрибутов.
tr: Değiştirilmesi gereken '{0}' dosyası değiştirilemediği için gönderdiğiniz komut tamamlanamadı. Dosya kaynak denetimi altındaysa, kullanıma alabilirsiniz; dosya salt okunur bir diskteyse, özniteliklerini değiştirebilirsiniz.
zh_hans: 您尝试执行的命令无法完成，因为无法更改必须修改的文件“{0}”。如果该文件受源代码管理，则可能需要将其签出；如果该文件是磁盘上的只读文件，则可能需要更改其特性。
zh_hant: 您嘗試執行的命令無法完成，因為無法變更必須要被修改的檔案 '{0}'。如果此檔案是在原始檔控制之下，您需要將它簽出; 如果它在磁碟上是唯讀檔案，您需要變更它的屬性。

source: Parameter must be a valid guid.
cs: Parametr musí být platný identifikátor GUID.
de: Der Parameter muss eine gültige GUID sein.
es: El parámetro debe ser un GUID válido.
fr: Le paramètre doit être un guid valide.
it: Il parametro deve essere un GUID valido.
ja: パラメーターは有効な GUID でなければなりません。
ko: 매개 변수는 올바른 GUID여야 합니다.
pl: Parametr musi być prawidłowym identyfikatorem GUID.
pt_br: O parâmetro deve ser um GUID válido.
ru: Значение параметра должно быть допустимым идентификатором GUID.
tr: Parametre geçerli bir guid olmalıdır.
zh_hans: 参数必须是有效的 GUID。
zh_hant: 參數必須是有效的 GUID。

# InvalidLoggerType
source: Invalid logger type\nExpected: {0}\nReceived: {1}
cs: Neplatný typ protokolovacího nástroje\nOčekávaný: {0}\nPřijatý: {1}
de: Typ des Protokollierungsmoduls ungültig\nErwartet: {0}\nEmpfangen: {1}
es: Tipo de registrador no válido\nSe esperaba: {0}\nSe recibió: {1}
fr: Type de journal non valide\nAttendu : {0}\nReçu : {1}
it: Tipo di logger non valido\nPrevisto: {0}\nRicevuto: {1}
ja: ロガーの種類が無効です\n必要な種類: {0}\n受け取った種類: {1}
ko: 로거 형식이 잘못되었습니다.\n필요한 형식: {0}\n받은 형식: {1}
pl: Nieprawidłowy typ rejestratora\nOczekiwano: {0}\nOtrzymano: {1}
pt_br: Tipo de agente inválido\nEsperado: {0}\nRecebido: {1}
ru: Недопустимый тип средства ведения журнала\nОжидается: {0}\nПолучено: {1}
tr: Geçersiz günlükçü türü\nBeklenen: {0}\nAlınan: {1}
zh_hans: 记录器类型无效\n应为: {0}\n接收到: {1}
zh_hant: 無效的記錄器類型\n必須是: {0}\n已收到: {1}

source: InvalidParameter
pl: Nieprawidłowy parametr

# ParameterMustBeAValidItemId
source: Parameter must be a valid item identifier.
cs: Parametr musí být platný identifikátor položky.
de: Der Parameter muss eine gültige Element-ID sein.
es: El parámetro debe ser un identificador de elemento válido.
fr: Le paramètre doit être un identificateur d'élément valide.
it: Il parametro deve essere un identificatore di elemento valido.
ja: パラメーターは有効な項目の識別子でなければなりません。
ko: 매개 변수는 올바른 항목 식별자여야 합니다.
pl: Parametr musi być prawidłowym identyfikatorem elementu.
pt_br: O parâmetro deve ser um identificador de item válido.
ru: Значение параметра должно быть допустимым идентификатором элемента.
tr: Parametre geçerli bir madde tanımlayıcısı olmalıdır.
zh_hans: 参数必须是有效的项标识符。
zh_hant: 參數必須是有效的項目識別項。

source: File Properties
cs: Vlastnosti souboru
de: Dateieigenschaften
es: Propiedades del archivo
fr: Propriétés du fichier
it: Proprietà file
ja: ファイルのプロパティ
ko: 파일 속성
pl: Właściwości pliku
pt_br: Propriedades do Arquivo
ru: Свойства файла
tr: Dosya özellikleri
zh_hans: 文件属性
zh_hant: 檔案屬性

source: Folder Properties
cs: Vlastnosti složky
de: Ordnereigenschaften
es: Propiedades de la carpeta
fr: Propriétés du dossier
it: Proprietà cartelle
ja: フォルダーのプロパティ
ko: 폴더 속성
pl: Właściwości folderu
pt_br: Propriedades da Pasta
ru: Свойства папки
tr: Klasör Özellikleri
zh_hans: 文件夹属性
zh_hant: 資料夾屬性

source: Project Properties
cs: Vlastnosti projektu
de: Projekteigenschaften
es: Propiedades del proyecto
fr: Propriétés du projet
it: Proprietà progetto
ja: プロジェクトのプロパティ
ko: 프로젝트 속성
pl: Właściwości projektu
pt_br: Propriedades do Projeto
ru: Свойства проекта
tr: Proje Özellikleri
zh_hans: 项目属性
zh_hant: 專案屬性

source: Reference Properties
cs: Vlastnosti odkazu
de: Verweiseigenschaften
es: Propiedades de la referencia
fr: Propriétés de la référence
it: Proprietà del riferimento
ja: 参照プロパティ
ko: 참조 속성
pl: Właściwości odwołania
pt_br: Propriedades de Referência
ru: Свойства ссылки
tr: Başvuru Özellikleri
zh_hans: 引用属性
zh_hant: 參考屬性

# FileOrFolderAlreadyExists
source: A file or folder with the name '{0}' already exists on disk at this location. Please choose another name.
cs: Soubor nebo složka s názvem {0} už na disku v tomto umístění existuje. Zvolte prosím jiný název.
de: Auf dem Datenträger ist an diesem Speicherort bereits eine Datei oder ein Ordner mit dem Namen "{0}" vorhanden. Wählen Sie einen anderen Namen aus.
es: Ya existe un archivo o carpeta con el nombre '{0}' en el disco en esta ubicación. Elija otro nombre.
fr: Il existe déjà un fichier ou un dossier nommé '{0}' à cet emplacement sur le disque. Choisissez un autre nom.
it: In questo percorso sul disco esiste già un file o una cartella con il nome '{0}'. Selezionare un altro nome.
ja: {0}' という名前のファイルまたはフォルダーが、ディスク上のこの場所に既に存在します。別の名前を選択してください。
ko: 이름이 '{0}'인 파일 또는 폴더가 이 위치의 디스크에 이미 있습니다. 다른 이름을 선택하세요.
pl: Plik lub folder o nazwie „{0}” już istnieje na dysku w tej lokalizacji. Wybierz inną nazwę.
pt_br: Já existe um arquivo ou uma pasta com o nome '{0}' no disco neste local. Escolha outro nome.
ru: Файл или папка с именем "{0}" уже существует в данном расположении. Выберите другое имя.
tr: Diskte bu konumda '{0}' adlı bir dosya veya klasör zaten var. Lütfen başka bir ad seçin.
zh_hans: 磁盘上的此位置已经存在名为“{0}”的文件或文件夹。请选择其他名称。
zh_hant: 磁碟的這個位置已經有名稱為 '{0}' 的檔案或資料夾存在。請選擇其他名稱。

# FolderCannotBeRenamed
source: This folder cannot be renamed to '{0}' as it already exists on disk.\n\nOnly empty folders can be renamed to existing folders. This folder contains files within it on disk.
cs: Tuto složku nejde přejmenovat na {0}, protože už existuje na disku.\n\nJen prázdné složky jde přejmenovat na existující složky. Tato složka obsahuje soubory na disku.
de: Dieser Ordner kann nicht in "{0}" umbenannt werden, da ein Ordner dieses Namens bereits auf dem Datenträger vorhanden ist.\n\nNur leere Ordner können in vorhandene Ordner umbenannt werden. Dieser Ordner enthält Dateien auf dem Datenträger.
es: No se puede cambiar el nombre de la carpeta a "{0}" porque ya existe en el disco.\n\nSolo los nombres de las carpetas vacías pueden cambiarse a los de carpetas existentes. Esta carpeta contiene archivos en el disco.
fr: Impossible de renommer ce dossier en '{0}', car il existe déjà sur le disque.\n\nSeuls les dossiers vides peuvent être renommés comme des dossiers existants. Ce dossier contient des fichiers sur le disque.
it: Non è possibile rinominare questa cartella in '{0}' perché esiste già nel disco.\n\nÈ possibile rinominare cartelle esistenti solo se vuote. Questa cartella contiene file nel disco.
ja: このフォルダーは既にディスク上に存在するため、名前を '{0}' に変更できません。\n\n既存のフォルダー名に名前を変更できるのは空のフォルダーのみです。このフォルダーにはディスク上のファイルが含まれています。
ko: 이미 디스크에 동일한 이름이 존재하므로 이 폴더의 이름을 '{0}'(으)로 바꿀 수 없습니다.\n\n빈 폴더의 이름만 기존 폴더로 변경할 수 있습니다. 이 폴더는 디스크에서 내부에 파일을 포함합니다.
pl: Nazwy tego folderu nie można zmienić na „{0}”, ponieważ już istnieje on na dysku.\n\nTylko nazwy pustych folderów można zmieniać na istniejące foldery. Ten folder zawiera pliki na dysku.
pt_br: Esta pasta não pode ser renomeada para '{0}', pois já existe no disco.\n\nSomente pastas vazias podem ser renomeadas para pastas existentes. Esta pasta tem arquivos dentro dela no disco.
ru: Эту папку невозможно переименовать в "{0}", так как она уже существует на диске.\n\nВ существующие папки можно переименовать только пустые папки. Эта папка содержит файлы на диске.
tr: Bu klasör, disk üzerinde zaten mevcut olduğundan '{0}' olarak yeniden adlandırılamaz.\n\nYalnızca boş klasörler mevcut klasörlerle yeniden adlandırılabilir. Bu klasör, disk üzerinde dosya içeriyor.
zh_hans: 无法将此文件夹重命名为“{0}”，因为它已存在于磁盘上。\n\n只有空文件夹才能重命名为现有文件夹。此文件夹包含磁盘上文件夹中的文件。
zh_hant: 因為此資料夾已存在於磁碟，所以無法將其重新命名為 '{0}'。\n\n只有空的資料夾可重新命名為現有的資料夾。此資料夾包含位於磁碟的檔案。

# BuildCaption
source: Build
cs: Sestavení
es: Compilación
it: Compilazione
ja: ビルド
ko: 빌드
pl: Kompilacja
pt_br: Compilar
ru: Сборка
tr: Oluştur
zh_hans: 生成
zh_hant: 建置

source: Output Path
cs: Výstupní cesta
de: Ausgabepfad
es: Ruta de acceso de salida
fr: Chemin de sortie
it: Percorso di output
ja: 出力パス
ko: 출력 경로
pl: Ścieżka wyjściowa
pt_br: Caminho de Saída
ru: Путь для создаваемых файлов
tr: Çıkış Yolu
zh_hans: 输出路径
zh_hant: 輸出路徑

# OutputPathDescription
source: The path to the primary output
cs: Cesta k primárnímu výstupu
de: Der Pfad zur primären Ausgabe
es: Ruta de acceso de la salida principal
fr: Le chemin de la sortie principale
it: Percorso dell'output primario
ja: プライマリ出力へのパス
ko: 기본 출력 경로
pl: Ścieżka do podstawowych danych wyjściowych
pt_br: O caminho para a saída principal
ru: Путь к основному выходному файлу
tr: Birincil çıkışın yolu
zh_hans: 主输出的路径
zh_hant: 主要輸出的路徑

# PathTooLong
source: The complete path to '{0}' exceeds the maximum number of characters permitted by the file system.
cs: Úplná cesta k souboru {0} přesahuje maximální počet znaků povolených systémem souborů.
de: Der vollständige Pfad zu "{0}" übersteigt die maximale Anzahl von Zeichen, die vom Dateisystem zugelassen sind.
es: La ruta de acceso completa a '{0}' supera el número máximo de caracteres permitido por el sistema de archivos.
fr: Le chemin d'accès complet à '{0}' dépasse le nombre de caractères maximal permis par le système de fichiers.
it: Il percorso completo di '{0}' supera il numero massimo di caratteri consentiti dal file system.
ja: '{0}' への絶対パスが、ファイル システムで許可されている最大文字数を超えています。
ko: '{0}'의 전체 경로가 파일 시스템에서 허용하는 최대 문자 수를 초과합니다.
pl: Pełna ścieżka do „{0}” przekracza maksymalną liczbę znaków dozwoloną przez system plików.
pt_br: O caminho completo para '{0}' excede o número máximo de caracteres permitido pelo sistema de arquivos.
ru: Длина полного пути к файлу "{0}" превышает максимальное количество символов, разрешенное в файловой системе.
tr: '{0}' öğesinin tam yolu, dosya sistemi tarafından izin verilen en yüksek karakter sayısını aşıyor.
zh_hans: “{0}”的完整路径超过了文件系统允许的最大字符数。
zh_hant: '{0}' 的完整路徑超過檔案系統允許的最大字元數。

source: Custom Tool
cs: Vlastní nástroj
de: Benutzerdefiniertes Tool
es: Herramienta personalizada
fr: Outil personnalisé
it: Strumento personalizzato
ja: カスタム ツール
ko: 사용자 지정 도구
pl: Narzędzie niestandardowe
pt_br: Ferramenta personalizada
ru: Пользовательский инструмент
tr: Özel Araç
zh_hans: 自定义工具
zh_hant: 自訂工具

# CustomToolDescription
source: Specifies the tool that transforms a file at design time and places the output of that transformation into another file. For example, a dataset (.xsd) file comes with a default custom tool.
cs: Určuje nástroj, který transformuje soubor v okamžiku návrhu a vloží výstup této transformace do jiného souboru. Například k souboru DataSet (.xsd) se dodává výchozí vlastní nástroj.
de: Gibt das Tool an, das eine Datei zur Entwurfszeit transformiert und die Ausgabe in einer anderen Datei speichert. Datasetdateien (.xsd) enthalten z.B. ein benutzerdefiniertes Standardtool.
es: Especifica la herramienta que transforma el archivo en tiempo de diseño y coloca la salida de la transformación en otro archivo. Por ejemplo, un archivo de conjunto de datos (.xsd) viene con una herramienta personalizada predeterminada.
fr: Spécifie l'outil qui transforme un fichier au moment du design et place le résultat de cette transformation dans un autre fichier. Par exemple, un fichier de dataset (.xsd) est fourni avec un outil personnalisé par défaut.
it: Consente di specificare lo strumento che trasforma un file in fase di progettazione e inserisce l'output di tale trasformazione in un altro file. Ad esempio, con un file dataset (con estensione xsd) viene fornito uno strumento personalizzato predefinito.
ja: 設計時にファイルを変換し、その変換結果を別のファイルに出力するツールを指定します。たとえば、データセット (.xsd) ファイルには既定のカスタム ツールが用意されています。
ko: 디자인 타임에 파일을 변환하고 변환 결과를 다른 파일에 저장하는 도구를 지정합니다. 예를 들어 데이터 세트 파일(.xsd)의 경우 기본 사용자 지정 도구가 제공됩니다.
pl: Określa narzędzie, które przekształca plik w czasie projektowania i umieszcza wynik przekształcenia w innym pliku. Na przykład plik zestawu danych (xsd) zawiera domyślne narzędzie niestandardowe.
pt_br: Especifica a ferramenta que transforma um arquivo em tempo de design e coloca o resultado dessa transformação em outro arquivo. Por exemplo, um arquivo de conjunto de dados (.xsd) vem com uma ferramenta personalizada padrão.
ru: Указывает инструмент, который преобразует файл во время разработки и помещает выходные данные этого преобразования в другой файл. Например, файл набора данных (XSD) поставляется с пользовательским инструментом по умолчанию.
tr: Bir dosyayı tasarım zamanında dönüştüren ve dönüştürme çıkışını başka bir dosyaya yerleştiren aracı belirtir. Örneğin, bir veri kümesi (.xsd) dosyası, varsayılan bir özel araçla gelir.
zh_hans: 指定一个工具，该工具在设计时转换文件，并将该转换的输出放在另一个文件中。例如，数据集(.xsd)文件附带默认自定义工具。
zh_hant: 指定於設計階段轉換檔案並將轉換的輸出放置到其他檔案的工具。例如，資料集 (.xsd) 檔案隨附預設自訂工具。

source: Custom Tool Namespace
cs: Obor názvů vlastního nástroje
de: Namespace des benutzerdefinierten Tools
es: Espacio de nombres de la herramienta personalizada
fr: Espace de noms de l'outil personnalisé
it: Spazio dei nomi dello strumento personalizzato
ja: カスタム ツールの名前空間
ko: 사용자 지정 도구 네임스페이스
pl: Przestrzeń nazw narzędzia niestandardowego
pt_br: Namespace da Ferramenta Personalizada
ru: Пространство имен пользовательского инструмента
tr: Özel Araç İsim Uzayı
zh_hans: 自定义工具命名空间
zh_hant: 自訂工具命名空間

# CustomToolNamespaceDescription
source: The namespace into which the output of the custom tool is placed.
cs: Obor názvů, do kterého se umístí výstup vlastního nástroje
de: Der Namespace, in den die Ausgabe des benutzerdefinierten Tools kopiert wird.
es: Espacio de nombres donde se sitúa la salida de la herramienta personalizada.
fr: Espace de noms dans lequel est placé le résultat de l'outil personnalisé.
it: Spazio dei nomi in cui viene inserito l'output dello strumento personalizzato.
ja: カスタム ツールの出力を配置する名前空間です。
ko: 사용자 지정 도구의 출력이 들어갈 네임스페이스입니다.
pl: Przestrzeń nazw, w której zostaną umieszczone dane wyjściowe narzędzia niestandardowego.
pt_br: O namespace em que o resultado da ferramenta personalizada é colocado.
ru: Пространство имен, в которое помещаются выходные данные пользовательского инструмента.
tr: Özel aracın çıktısının yerleştirileceği ad alanı.
zh_hans: 用于放置自定义工具的输出的命名空间。
zh_hant: 自訂工具產生的輸出所放置的命名空間。

# OutputBuilt
source: Primary Output
cs: Primární výstup
de: Primäre Ausgabe
es: Resultado principal
fr: Sortie principale
it: Output primario
ja: プライマリ出力
ko: 기본 출력
pl: Podstawowe dane wyjściowe
pt_br: Saída Primária
ru: Основные выходные файлы
tr: Birincil Çıkış
zh_hans: 主输出
zh_hant: 主要輸出

# OutputContentFiles
source: Content Files
cs: Soubory obsahu
de: Inhaltsdateien
es: Archivos de contenido
fr: Fichiers de contenu
it: File di dati
ja: コンテンツ ファイル
ko: 콘텐츠 파일
pl: Pliki zawartości
pt_br: Arquivos de Conteúdo
ru: Файлы содержимого
tr: İçerik Dosyaları
zh_hans: 内容文件
zh_hant: 內容檔

# OutputDocumentation
source: Documentation Files
cs: Soubory dokumentace
de: Dokumentationsdateien
es: Archivos de documentación
fr: Fichiers de documentation
it: File di documentazione
ja: ドキュメント ファイル
ko: 문서 파일
pl: Pliki dokumentacji
pt_br: Arquivos de Documentação
ru: Файлы документации
tr: Belge Dosyaları
zh_hans: 文档文件
zh_hant: 文件檔

# OutputLocalizedResourceDlls
source: Localized Resources
cs: Lokalizované prostředky
de: Lokalisierte Ressourcen
es: Recursos localizados
fr: Ressources localisées
it: Risorse localizzate
ja: ローカライズされたリソース
ko: 지역화된 리소스
pl: Zlokalizowane zasoby
pt_br: Recursos Localizados
ru: Локализованные ресурсы
tr: Yerelleştirilmiş Kaynaklar
zh_hans: 本地化资源
zh_hant: 當地語系化資源

# OutputSourceFiles
source: Source Files
cs: Zdrojové soubory
de: Quelldateien
es: Archivos de origen
fr: Fichiers sources
it: File di origine
ja: ソース ファイル
ko: 소스 파일
pl: Pliki źródłowe
pt_br: Arquivos de Origem
ru: Исходные файлы
tr: Kaynak Dosyalar
zh_hans: 源文件
zh_hant: 原始程式檔

# OutputSymbols
source: Debug Symbols
cs: Symboly ladění
de: Debugsymbole
es: Símbolos de depuración
fr: Symboles de débogage
it: Simboli di debug
ja: デバッグ シンボル
ko: 디버그 기호
pl: Symbole debugowania
pt_br: Símbolos de Depuração
ru: Отладочные символы
tr: Hata Ayıklama Sembolleri
zh_hans: 调试符号
zh_hant: 偵錯符號

# OutputXmlSerializer
source: XML Serialization Assemblies
cs: XML serializace sestavení
de: XML-Serialisierungsassemblys
es: Ensamblados de serialización XML
fr: Assemblys de sérialisation XML
it: Assembly di serializzazione XML
ja: XML シリアル化アセンブリ
ko: XML 직렬화 어셈블리
pl: Zestawy serializacji XML
pt_br: Assemblies de Serialização XML
ru: Сборки XML-сериализации
tr: XML Serileştirme Bütünleştirilmiş Kodları
zh_hans: XML 序列化程序集
zh_hant: XML 序列化組件

# OutputBuiltDescription
source: Contains the DLL or EXE built by the project.
cs: Obsahuje knihovnu DLL nebo soubor EXE sestavený podle projektu.
de: Enthält die DLL oder EXE, die durch das Projekt erstellt wurden.
es: Contiene los archivos DLL o EXE compilados por el proyecto.
fr: Contient le fichier DLL ou EXE généré par le projet.
it: Contiene il file DLL o EXE compilato dal progetto.
ja: プロジェクトでビルドされた DLL または EXE が含まれます。
ko: 프로젝트에서 빌드한 DLL 또는 EXE를 포함합니다.
pl: Zawiera pliki DLL lub EXE skompilowane na podstawie projektu.
pt_br: Contém a DLL ou o EXE compilado pelo projeto.
ru: DLL- или EXE-файлы, результат сборки проекта.
tr: Proje tarafından oluşturulan DLL veya EXE dosyasını içerir.
zh_hans: 包含由项目生成的 DLL 或 EXE。
zh_hant: 包含專案所建置的 DLL 或 EXE。

# OutputContentFilesDescription
source: Contains all content files in the project.
cs: Obsahuje všechny soubory obsahů projektu.
de: Enthält alle Inhaltsdateien des Projekts.
es: Contiene todos los archivos de contenido del proyecto.
fr: Comprend tous les fichiers de contenu du projet.
it: Contiene tutti i file di dati del progetto.
ja: プロジェクトのすべてのコンテンツ ファイルが含まれます。
ko: 프로젝트의 모든 콘텐츠 파일을 포함합니다.
pl: Zawiera wszystkie pliki zawartości projektu.
pt_br: Contém todos arquivos de conteúdo no projeto.
ru: Все файлы проекта, содержащие информацию.
tr: Projedeki tüm içerik dosyalarını içerir.
zh_hans: 包含项目中的所有内容文件。
zh_hant: 包含專案中所有內容檔。

# OutputDocumentationDescription
source: Contains the XML Documentation files for the project.
cs: Obsahuje soubory dokumentace XML pro projekt.
de: Enthält die XML-Dokumentationsdateien des Projekts.
es: Contiene los archivos de documentación XML del proyecto.
fr: Contient les fichiers de documentation XML du projet.
it: Contiene i file della documentazione XML per il progetto.
ja: プロジェクトの XML ドキュメント ファイルが含まれます。
ko: 프로젝트의 XML 문서 파일을 포함합니다.
pl: Zawiera pliki dokumentacji XML dla projektu.
pt_br: Contém os arquivos de Documentação XML do projeto.
ru: Содержит файлы XML-документации для проекта.
tr: Projenin XML Belge dosyalarını içerir.
zh_hans: 包含项目的 XML 文档文件。
zh_hant: 包含專案的 XML 文件檔案。

# OutputLocalizedResourceDllsDescription
source: Contains the satellite assemblies for each culture's resources.
cs: Obsahuje satelitní sestavení pro prostředky jednotlivých jazykových verzí.
de: Enthält die Satellitenassemblys für die Ressourcen aller Kulturen.
es: Contiene los ensamblados satélite para los recursos de cada referencia cultural.
fr: Contient les assemblys satellites de chacune des ressources de la culture.
it: Contiene gli assembly satellite per le risorse di ciascuna delle impostazioni cultura.
ja: 各カルチャのリソース用サテライト アセンブリが含まれます。
ko: 각 문화권 리소스의 위성 어셈블리를 포함합니다.
pl: Zawiera zestawy satelickie dla każdego zasobu kultury.
pt_br: Contém os assemblies satélite para cada recurso de cultura.
ru: Вспомогательные сборки для ресурсов каждого языка и региональных параметров.
tr: Her kültüre ait kaynakların uydu derlemelerini içerir.
zh_hans: 包含每种区域性资源的附属程序集。
zh_hant: 包含每個文化特性資源的附屬組件。

# OutputSourceFilesDescription
source: Contains all source files in the project.
cs: Obsahuje všechny zdrojové soubory projektu.
de: Enthält alle Quelldateien des Projekts.
es: Contiene todos los archivos de origen del proyecto.
fr: Contient tous les fichiers sources du projet.
it: Contiene tutti i file di origine del progetto.
ja: プロジェクトのすべてのソース ファイルが含まれます。
ko: 프로젝트의 모든 소스 파일을 포함합니다.
pl: Zawiera wszystkie pliki źródłowe projektu.
pt_br: Contém todos os arquivos de origem no projeto.
ru: Содержит все исходные файлы проекта.
tr: Projedeki tüm kaynak dosyaları içerir.
zh_hans: 包含项目中的所有源文件。
zh_hant: 包含專案中所有原始程式檔。

# OutputSymbolsDescription
source: Contains the debugging files for the project.
cs: Obsahuje soubory ladění pro projekt.
de: Enthält die Debugdateien des Projekts.
es: Contiene los archivos de depuración del proyecto.
fr: Contient les fichiers de débogage pour le projet.
it: Contiene i file di debug del progetto.
ja: プロジェクトのデバッグ ファイルが含まれます。
ko: 프로젝트의 디버깅 파일을 포함합니다.
pl: Zawiera pliki debugowania dla projektu.
pt_br: Contém os arquivos de depuração para o projeto.
ru: Файлы для отладки проекта.
tr: Projenin hata ayıklama dosyalarını içerir.
zh_hans: 包含项目的调试文件。
zh_hant: 包含專案的偵錯檔案。
