Repository: dotnet/fsharp
Catalog: vsintegration/src/FSharp.ProjectSystem.*/xlf/Microsoft.VisualStudio.Package.Project.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# UpgradeCannotOpenProjectFileForEdit
source: Cannot open project file for edit.
cs: Soubor projektu se nedá otevřít pro úpravy.
de: Die Projektdatei kann nicht zur Bearbeitung geöffnet werden.
es: No se puede abrir el archivo de proyecto para editarlo.
fr: Impossible d'ouvrir le fichier projet pour le modifier.
it: Non è possibile aprire il file di progetto per la modifica.
ja: プロジェクト ファイルを編集のために開くことができません。
ko: 프로젝트 파일을 편집용으로 열 수 없습니다.
pl: Nie można otworzyć pliku projektu do edycji.
pt_br: Não é possível abrir o arquivo do projeto para editar.
ru: Не удается открыть файл проекта для редактирования.
tr: Proje dosyası düzenleme için açılamıyor.
zh_hans: 无法打开项目文件以进行编辑。
zh_hant: 無法開啟專案檔進行編輯。

# UpgradeNoNeedToUpgradeAfterCheckout
source: Project file was checked out and is already upgraded.
cs: Soubor projektu se zaregistroval a už je upgradovaný.
de: Die Projektdatei wurde ausgecheckt und ein Upgrade bereits durchgeführt.
es: El archivo de proyecto se desprotegió y está ya actualizado.
fr: Le fichier projet a été extrait et est déjà mis à niveau.
it: Il file di progetto è stato estratto ed è già aggiornato.
ja: プロジェクト ファイルはチェックアウトされており、既にアップグレードされています。
ko: 프로젝트 파일을 체크 아웃했으며 이미 업그레이드되었습니다.
pl: Plik projektu został wyewidencjonowany i jest już uaktualniony.
pt_br: Arquivo do projeto foi verificado e já está atualizado.
ru: Файл проекта был извлечен и уже обновлен.
tr: Proje dosyası kullanıma alınmış ve zaten yükseltilmiş.
zh_hans: 项目文件已签出并进行了升级。
zh_hant: 專案檔已簽出，而且已經升級。

# CannotStartLibraries
source: A project with an Output Type of Class Library cannot be started directly.\n\nIn order to debug this project, add an executable project to this solution which references the library project. Set the executable project as the startup project.
cs: Projekt s výstupním typem Knihovna tříd se nedá spustit přímo.\n\nAbyste tento projekt mohli ladit, přidejte do tohoto řešení spustitelný projekt, který bude odkazovat na projekt knihovny. Nastavte spustitelný projekt jako projekt, který se spouští.
de: Ein Projekt mit einem Klassenbibliothek-Ausgabetyp kann nicht direkt gestartet werden.\n\nUm dieses Projekt zu debuggen, fügen Sie dieser Projektmappe ein ausführbares Projekt hinzu, das auf das Bibliothekprojekt verweist. Legen Sie das ausführbare Projekt als Startprojekt fest.
es: No se puede iniciar directamente un proyecto con un tipo de resultado de biblioteca de clases.\n\nPara depurar este proyecto, agregue a esta solución un proyecto ejecutable que haga referencia al proyecto de biblioteca. Establezca el proyecto ejecutable como proyecto de inicio.
fr: Un projet avec un type de sortie de bibliothèque de classes ne peut pas être démarré directement.\n\nPour déboguer ce projet, ajoutez à cette solution un projet exécutable qui fait référence au projet de bibliothèque. Définissez le projet exécutable comme projet de démarrage.
it: Non è possibile avviare direttamente un progetto con tipo di output della libreria di classi.\n\nPer eseguire il debug del progetto, aggiungere un progetto eseguibile alla soluzione che fa riferimento al progetto di libreria. Impostare il progetto eseguibile come progetto di avvio.
ja: 出力の種類がクラス ライブラリのプロジェクトを直接起動することはできません。\n\nこのプロジェクトをデバッグするには、ライブラリ プロジェクトを参照するこのソリューションに実行可能なプロジェクトを追加し、それをスタートアップ プロジェクトとして設定します。
ko: 출력 형식이 클래스 라이브러리인 프로젝트는 직접 시작할 수 없습니다.\n\n이 프로젝트를 디버깅하려면 라이브러리 프로젝트를 참조하는 실행 가능 프로젝트를 이 솔루션에 추가하고 해당 실행 가능 프로젝트를 시작 프로젝트로 설정하세요.
pl: Projekt z typem wyjściowym biblioteki klasy nie może zostać bezpośrednio uruchomiony.\n\nAby przeprowadzić jego debugowanie, dodaj projekt wykonywalny do rozwiązania, które odwołuje się do projektu biblioteki. Ustaw projekt wykonywalny jako projekt startowy.
pt_br: Um projeto com um Tipo de Saída de Biblioteca de Classe não pode ser iniciado diretamente.\n\nPara depurar este projeto adicione um projeto executável a esta solução que referencia o projeto de biblioteca. Defina o projeto executável como o projeto de inicialização.
ru: Проект, создающий библиотеку классов, не может быть непосредственно запущен.\n\nДля отладки данного проекта добавьте к решению проект, создающий приложение и ссылающийся на эту библиотеку, и сделайте его запускаемым.
tr: Çıkış Türü Sınıf Kitaplığı olan bir proje doğrudan başlatılamaz.\n\nBu projede hata ayıklamak için kitaplık projesine başvuran çalıştırılabilir bir projeyi bu çözüme ekleyin. Çalıştırılabilir projeyi başlangıç projesi olarak ayarlayın.
zh_hans: 无法直接启动输出类型为类库的项目。\n\n若要调试此项目，请将可执行项目添加到引用库项目的此解决方案。将这个可执行项目设置为启动项目。
zh_hant: 無法直接啟動輸出類型為類別庫的專案。\n\n為了偵錯此專案，請將可執行檔專案加入這個參考程式庫專案的方案，然後再將這個可執行檔專案設定為啟始專案。

# InvalidOutputPath
source: The entered path is not a valid output path
cs: Zadaná cesta není platnou výstupní cestou.
de: Der eingegebene Pfad ist kein gültiger Ausgabepfad.
es: La ruta de acceso especificada no es una ruta de acceso de resultados válida.
fr: Le chemin d'accès entré n'est pas un chemin de sortie valide
it: Il percorso immesso non è un percorso di output valido
ja: 入力されたパスは有効な出力パスではありません
ko: 입력한 경로는 올바른 출력 경로가 아닙니다.
pl: Wprowadzona ścieżka nie jest prawidłową ścieżką wyjściową
pt_br: O caminho introduzido não é um caminho de saída válido
ru: Введенный путь не является допустимым путем вывода
tr: Girilen yol geçerli bir çıkış yolu değil
zh_hans: 输入的路径不是有效的输出路径
zh_hant: 輸入的路徑不是有效的輸出路徑

# ProjectRefOnlyExeOrDll
source: The project {0} cannot be referenced. An assembly must have a 'dll' or 'exe' extension in order to be referenced.
cs: Na projekt {0} se nedá odkazovat. Aby to šlo, musí mít sestavení příponu dll nebo exe.
de: Auf das Projekt "{0}" kann nicht verwiesen werden. Damit auf eine Assembly verwiesen werden kann, muss sie die Erweiterung DLL oder EXE aufweisen.
es: No se puede hacer referencia al proyecto {0}. Para poder hacer referencia a un ensamblado, éste debe tener una extensión 'dll' o 'exe'.
fr: Impossible de référencer le projet {0}. Un assembly doit avoir une extension 'dll' ou 'exe' pour pouvoir être référencé.
it: Non è possibile fare riferimento al progetto {0}. Per fare riferimento a un assembly, è necessario che abbia estensione 'dll' o 'exe'.
ja: プロジェクト '{0}' を参照できません。アセンブリを参照するには 'dll' または 'exe' の拡張子を指定する必要があります。
ko: {0} 프로젝트를 참조할 수 없습니다. 어셈블리를 참조하려면 확장명이 'dll' 또는 'exe'여야 합니다.
pl: Nie można przywołać projektu {0}. Aby mógł zostać przywołany, zestaw musi mieć rozszerzenie „dll” lub „exe”.
pt_br: O projeto {0} não pode ser referenciado. Um assembly precisa ter uma extensão 'dll' ou 'exe' para ser referenciado.
ru: Невозможно задать ссылку на проект {0}. Сборка должна иметь расширение DLL или EXE для того, чтобы на нее можно было ссылаться.
tr: {0} projesine başvurulamıyor. Bir bütünleştirilmiş koda başvurulabilmesi için 'dll' veya 'exe' uzantısı olması gerekir.
zh_hans: 无法引用项目 {0}。程序集必须具有“dll”或“exe”扩展名才能被引用。
zh_hant: 無法參考專案 {0}。組件必須有 'dll' 或 'exe' 的副檔名才能參考。

# CannotBuildWhenBuildInProgress
source: Cannot start a build, because another build is already in progress.
cs: Sestavení se spustit nedá, protože už probíhá jiné sestavení.
de: Ein Buildvorgang kann nicht gestartet werden, da bereits ein Buildvorgang ausgeführt wird.
es: No se puede iniciar una compilación porque ya hay otra compilación en curso.
fr: Impossible de démarrer une build, car une autre build est déjà en cours.
it: Non è possibile avviare una compilazione perché ne è già in corso un'altra.
ja: 別のビルドが既に進行中であるため、ビルドを開始できません。
ko: 다른 빌드가 이미 진행 중이므로 빌드를 시작할 수 없습니다.
pl: Nie można uruchomić kompilacji, ponieważ trwa już inna kompilacja.
pt_br: Não é possível iniciar uma compilação porque outra já está em andamento.
ru: Не удается начать сборку, поскольку уже выполняется другая сборка.
tr: Zaten devam eden başka bir yapı olduğu için yapı başlatılamaz.
zh_hans: 无法启动生成，因为另一个生成已经在进行中。
zh_hant: 無法啟動建置，因為另一個建置已經在進行中。

# WorkingDirectoryNotExists
source: The working directory does not exist:\n'{0}'.
cs: Pracovní adresář neexistuje:\n{0}.
de: Das Arbeitsverzeichnis existiert nicht:\n'{0}'.
es: El directorio de trabajo no existe:\n'{0}'.
fr: Le répertoire de travail n'existe pas :\n'{0}'.
it: La directory di lavoro non esiste:\n'{0}'.
ja: 作業ディレクトリが存在しません:\n'{0}'。
ko: 작업 디렉터리가 없습니다.\n'{0}'.
pl: Katalog roboczy nie istnieje:\n„{0}”.
pt_br: O diretório de trabalho não existe\n'{0}'.
ru: Рабочий каталог не существует:\n'{0}'.
tr: Çalışma dizini yok:\n'{0}'.
zh_hans: 工作目录不存在:\n“{0}”。
zh_hant: 工作目錄不存在:\n'{0}'。

# ProjectReferencesDifferentFramework
source: A reference to library '{0}' cannot be added. This project targets a different framework ({2}) from the current project ({1}).
cs: Odkaz na knihovnu {0} se nedá přidat. Tento projekt je cílený na jiné rozhraní ({2}) než aktuální projekt ({1}).
de: Ein Verweis auf Bibliothek '{0}' kann nicht hinzugefügt werden. Dieses Projekt verwendet ein anderes Zielframework ({2}) als das aktuelle Projekt ({1}).
es: No se puede agregar una referencia a la biblioteca '{0}'. Este proyecto está destinado a una versión de .NET Framework ({2}) distinta a la del proyecto ({1}) actual.
fr: Impossible d'ajouter une référence à la bibliothèque '{0}'. Ce projet cible un Framework ({2}) différent du projet actuel ({1}).
it: Non è possibile aggiungere un riferimento alla libreria '{0}'. Questo progetto è indirizzato a un framework diverso ({2}) dal progetto corrente ({1}).
ja: ライブラリ '{0}' への参照を追加できません。このプロジェクトのターゲット フレームワーク ({2}) は現在のプロジェクトのターゲット フレームワーク ({1}) と異なります。
ko: {0}' 라이브러리에 대한 참조를 추가할 수 없습니다. 이 프로젝트는 현재 프로젝트({1})의 다른 프레임워크({2})를 대상으로 합니다.
pl: Nie można dodać odwołania do biblioteki „{0}”. Celem tego projektu jest inna platforma ({2}) niż cel bieżącego projektu ({1}).
pt_br: Não é possível adicionar uma referência à biblioteca '{0}'. Este projeto define como destino um framework diferente {2} do projeto atual ({1}).
ru: Не удается добавить ссылку на библиотеку "{0}". Этот проект предназначен для платформы ({2}), отличной от платформы текущего проекта ({1}).
tr: {0}' kitaplığına başvuru eklenemiyor. Bu proje geçerli projeden ({1}) farklı bir çerçeveyi ({2}) hedefliyor.
zh_hans: 无法添加对库“{0}”的引用。此项目以框架({2})为目标，这不同于当前项目({1})。
zh_hant: 無法加入程式庫 '{0}' 的參考。這個專案目標設定的 Framework ({2}) 與目前專案的目標設定 ({1}) 不同。

# CannotLoadUnknownTargetFrameworkProject
source: The project '{0}' is targeting '{1}'; however, the target framework is not installed on the machine.
cs: Projekt {0} je zaměřený na {1}. Cílová verze architektury .NET Framework ale na tomto počítači není nainstalovaná.
de: Das Projekt "{0}" hat das Ziel "{1}". Das Zielframework ist jedoch nicht auf dem Computer installiert.
es: El proyecto '{0}' tiene como destino '{1}'. Sin embargo, la versión de .NET Framework de destino no está instalada en la máquina.
fr: Le projet '{0}' cible '{1}', or le framework cible n'est pas installé sur cet ordinateur.
it: Il progetto '{0}' è destinato a '{1}'; tuttavia, il framework di destinazione non è installato nel computer.
ja: プロジェクト '{0}' のターゲットは '{1}' ですが、ターゲット フレームワークがコンピューターにインストールされていません。
ko: {0}' 프로젝트가 '{1}'을(를) 대상으로 하지만 컴퓨터에 대상 프레임워크가 설치되어 있지 않습니다.
pl: Celem projektu „{0}” jest „{1}”. Jednak platforma docelowa nie jest zainstalowana na komputerze.
pt_br: O projeto '{0}' está direcionando para '{1}'; no entanto, o framework de destino não está instalado no computador.
ru: Проект "{0}" предназначен для "{1}"; однако на этом компьютере не установлена целевая версия платформы.
tr: {0}' projesi '{1}' hedefliyor; ancak, hedef Framework makinede yüklü değil.
zh_hans: 项目“{0}”的目标为“{1}”；但计算机上未安装该目标框架。
zh_hant: 專案 '{0}' 目標設定為 '{1}'; 但是，電腦上未安裝目標 Framework。

# ProjectReferencesHigherVersionWarning
source: The referenced project '{0}' is targeting a higher framework version ({1}) than this project’s current target framework version ({2}). This may lead to build failures if types from assemblies outside this project’s target framework are used by any project in the dependency chain.
cs: Odkazovaný projekt {0} je cílený na vyšší verzi rozhraní .NET Framework ({1}), než je aktuální verze cílové architektury tohoto projektu ({2}). Pokud se budou typy ze sestavení mimo verzi cílové architektury tohoto projektu používat kdekoliv ve struktuře závislostí projektů, může to vést k chybám sestavení.
de: Das Projekt '{0}', auf das verwiesen wird, verwendet eine höhere Zielframeworkversion ({1}) als die aktuelle Zielframeworkversion ({2}) dieses Projekts. Dies kann zu Buildfehlern führen, wenn Typen von Assemblys außerhalb des Zielframeworks dieses Projekts von einem beliebigen Projekt in der Abhängigkeitskette verwendet werden.
es: El proyecto '{0}' al que se hace referencia tiene como destino una versión de .NET Framework ({1}) posterior a la actual de este proyecto ({2}). Esto puede producir errores de compilación si cualquier proyecto de la cadena de dependencia usa tipos de ensamblados fuera de la versión de .NET Framework de destino de este proyecto.
fr: Le projet référencé '{0}' cible une version de framework supérieure ({1}) à la version actuelle du framework cible du projet ({2}). Cela peut provoquer l'échec de la génération si des types d'assemblys en dehors du framework cible de ce projet sont utilisés par un projet dans la chaîne de dépendance.
it: Il progetto a cui si fa riferimento '{0}' è indirizzato a una versione di framework più alta ({1}) della versione del framework di destinazione corrente del progetto ({2}). È possibile che si verifichino errori se i tipi degli assembly esterni al framework di destinazione di questo progetto vengono utilizzati da un progetto nella catena delle dipendenze.
ja: 参照されているプロジェクト '{0}' は、より新しいバージョン ({1}) のフレームワークをターゲットとしています。このプロジェクトの現在のターゲット フレームワークのバージョンは {2} です。このプロジェクトのターゲット フレームワークの範囲外のアセンブリの種類が依存関係チェーンのいずれかのプロジェクトで使用されている場合、バージョンの違いが原因でビルドに失敗する可能性があります。
ko: 참조된 '{0}' 프로젝트가 현재 대상 프레임워크 버전({2})보다 더 높은 프레임워크 버전({1})을 대상으로 합니다. 이로 인해 종속성 체인의 프로젝트에서 이 프로젝트의 대상 프레임워크 외부에 있는 어셈블리의 형식을 사용하는 경우 빌드 오류가 발생할 수 있습니다.
pl: Celem przywoływanego projektu „{0}” jest platforma o wyższej wersji ({1}) niż bieżąca wersja platformy docelowej tego projektu ({2}). Może to spowodować błędy kompilacji, jeśli typy z zestawów spoza platformy docelowej tego projektu są używane przez dowolny projekt w łańcuchu zależności.
pt_br: O projeto referenciado '{0}' está definindo como destino um framework de versão mais recente ({1}) do que a do framework atual ({2}). Isso pode levar a falhas na compilação caso os assemblies de projetos externos sejam usados por alguma cadeia de dependência.
ru: Ссылочный проект "{0}" предназначен для более высокой версии платформы ({1}), чем текущая требуемая версия платформы ({2}) этого проекта. Это может привести к ошибкам сборки, если в каких-либо проектах из цепочки зависимостей будут использоваться типы из сборок, не принадлежащих требуемой версии платформы данного проекта.
tr: Başvurulan '{0}' projesi, bu projenin geçerli hedef çerçeve sürümünden ({2}) daha yüksek bir çerçeve sürümünü ({1}) hedefliyor. Bu projenin hedef çerçevesinin dışındaki bütünleştirilmiş kodlara ait türler bağımlılık zincirindeki herhangi bir proje tarafından kullanılırsa bu durum oluşturma hatalarına neden olabilir.
zh_hans: 被引用项目“{0}”的目标为高于此项目的当前目标框架版本({2})的框架版本({1})。如果此项目的目标框架之外的程序集中的类型被依赖链中的任何项目使用，则上述情况可能会导致生成失败。
zh_hant: 參考的專案 '{0}' 目標設定的 Framework 版本 ({1}) 比這個專案的目前目標 Framework 版本 ({2}) 高。如果相依性鏈結中的任何專案使用這個專案的目標 Framework 以外的組件中的類型，可能導致組建失敗。

# ProjectConversionNotRequired
source: The project file does not require conversion.
cs: Soubor projektu nevyžaduje převod.
de: Die Projektdatei erfordert keine Konvertierung.
es: El archivo de proyecto no requiere conversión.
fr: Le fichier projet ne doit pas être converti.
it: Il file di progetto non richiede conversione.
ja: プロジェクト ファイルを変換する必要はありません。
ko: 변환이 필요 없는 프로젝트 파일입니다.
pl: Plik projektu nie wymaga konwersji.
pt_br: O arquivo de projeto não requer conversão.
ru: Файл проекта не нуждается в преобразовании.
tr: Proje dosyası dönüştürme gerektirmiyor.
zh_hans: 项目文件不需要转换。
zh_hant: 專案檔不需要轉換。

# ConversionNotRequired
source: No Conversion Required
cs: Nejsou potřebné žádné konverze.
de: Keine Konvertierung erforderlich
es: No requiere conversión
fr: Aucune conversion requise
it: Conversione non necessaria
ja: 変換の必要なし
ko: 변환 필요 없음
pl: Żadna konwersja nie jest wymagana
pt_br: Nenhuma Conversão Necessária
ru: Преобразование не требуется
tr: Dönüştürme Gerekli Değil
zh_hans: 无需转换
zh_hant: 不需要轉換

# ErrorMakingProjectBackup
source: Error creating backup of project file: {0}
cs: Chyba při vytváření zálohy souboru projektu: {0}
de: Fehler beim Erstellen einer Sicherungskopie der Projektdatei: {0}
es: Error al crear la copia de seguridad del archivo de proyecto: {0}
fr: Erreur lors de la création d'une sauvegarde du fichier projet : {0}
it: Errore durante il backup del file di progetto: {0}
ja: プロジェクト ファイルのバックアップ作成中にエラーが発生しました: {0}
ko: 프로젝트 파일의 백업을 만드는 동안 오류가 발생했습니다. {0}
pl: Wystąpił błąd podczas tworzenia kopii zapasowej pliku projektu: {0}
pt_br: Erro ao criar backup do arquivo de projeto: {0}
ru: Ошибка при создании резервной копии файла проекта: {0}
tr: Proje dosyasının yedeği oluşturulurken hata: {0}
zh_hans: 创建项目文件的备份期间出错: {0}
zh_hant: 建立專案檔備份時發生錯誤: {0}

# ProjectBackupSuccessful
source: Project file successfully backed up as {0}
cs: Soubor projektu se úspěšně zálohoval jako {0}.
de: Projektdatei erfolgreich gesichert als {0}
es: Se realizó correctamente la copia de seguridad del archivo de proyecto {0}
fr: Fichier projet correctement sauvegardé en tant que {0}
it: Backup del file di progetto completato con nome {0}
ja: プロジェクト ファイルは正常に {0} としてバックアップされました
ko: 프로젝트 파일을 {0}(으)로 백업했습니다.
pl: Pomyślnie utworzono kopię zapasową pliku projektu jako {0}
pt_br: O backup do arquivo de projeto foi concluído com êxito como {0}
ru: Резервная копия файла проекта успешно сохранена под именем {0}
tr: Proje dosyası başarıyla {0} olarak yedeklendi
zh_hans: 已成功将项目文件备份为 {0}
zh_hant: 專案檔已成功備份為 {0}

# BackupNameConflict
source: Backup file name conflict. Renaming file to: {0}
cs: Konflikt názvu záložního souboru. Přejmenujte soubor na: {0}
de: Namenskonflikt bei Sicherungsdateien. Datei wird umbenannt in: {0}
es: Conflicto del nombre del archivo de Backup. Cambiando el nombre del archivo a: {0}
fr: Conflit de nom du fichier de sauvegarde. Renommer le fichier en : {0}
it: Conflitto nel nome del file di backup. Il file verrà rinominato in {0}
ja: バックアップ ファイル名が競合しています。ファイル名を {0} に変更します。
ko: 백업 파일 이름이 충돌합니다. 파일의 이름을 {0}(으)로 바꿉니다.
pl: Wystąpił konflikt nazw plików kopii zapasowej. Zmienianie nazwy pliku na: {0}
pt_br: Conflito de nome de arquivo de backup. Renomeando arquivo para: {0}
ru: Конфликт имени файла резервной копии. Файл будет переименован в: {0}
tr: Yedekleme dosya adı çakışması. Dosya şuna yeniden adlandırılıyor: {0}
zh_hans: 备份文件名冲突。请将文件重命名为: {0}
zh_hant: 備份檔名衝突。將檔案重新命名為: {0}

# ProjectContainsLinkedFile
source: Backed up project may not build. Project contains linked file: {0}
cs: Zálohovaný projekt se možná nesestaví. Projekt obsahuje propojený soubor: {0}
de: Das gesicherte Projekt wird möglicherweise nicht erstellt. Das Projekt enthält die verknüpfte Datei: {0}
es: Puede que la copia de seguridad del proyecto no se pueda compilar. El proyecto contiene un archivo vinculado: {0}
fr: Impossible de générer le projet sauvegardé. Le projet contient le fichier lié : {0}
it: Il progetto di cui si è effettuato il backup potrebbe non essere compilato. Il progetto contiene il seguente file collegato: {0}
ja: バックアップされたプロジェクトはビルドしない可能性があります。プロジェクトはリンク ファイル {0} を含んでいます。
ko: 백업된 프로젝트를 빌드할 수 없습니다. 프로젝트에 링크된 파일이 있습니다. {0}
pl: Projekt, którego kopię zapasową utworzono, może nie zostać skompilowany. Projekt zawiera połączony plik: {0}
pt_br: O projeto em backup não pode compilar. O projeto contém um arquivo vinculado: {0}
ru: Возможны ошибки при сборке восстановленного проекта. Проект содержит скомпонованный файл: {0}
tr: Yedeklenmiş proje oluşturulmayabilir. Proje bağlantılı dosya içeriyor: {0}
zh_hans: 备份项目无法生成。项目包含链接的文件: {0}
zh_hant: 無法建置備份專案。專案包含連結的檔案: {0}

# ErrorMakingBackup
source: Failed to backup file as {0}
cs: Soubor se nepovedlo zálohovat jako {0}.
de: Fehler beim Sichern der Datei als {0}
es: Error al hacer copia de seguridad del archivo como {0}
fr: Échec de la sauvegarde du fichier avec le nom {0}
it: Non è stato possibile eseguire il backup del file con nome {0}
ja: ファイルを {0} としてバックアップするのに失敗しました
ko: 파일을 {0}(으)로 백업하지 못했습니다.
pl: Nie można utworzyć kopii zapasowej pliku jako {0}
pt_br: Falha ao fazer backup do arquivo como {0}
ru: Не удалось создать резервную копию файла под именем {0}
tr: Dosya {0} olarak yedeklenemedi
zh_hans: 未能将文件备份为 {0}
zh_hant: 無法將檔案備份為 {0}

# BackupSuccessful
source: File successfully backed up as {0}
cs: Soubor se úspěšně zálohoval jako {0}.
de: Datei erfolgreich gesichert als {0}
es: Se realizó correctamente la copia de seguridad del archivo {0}
fr: Fichier correctement sauvegardé en tant que {0}
it: Backup del file completato con nome {0}
ja: ファイルは正常に {0} としてバックアップされました
ko: 파일을 {0}(으)로 백업했습니다.
pl: Pomyślnie utworzono kopię zapasową pliku jako {0}
pt_br: O backup do arquivo foi concluído com êxito como {0}
ru: Резервная копия файла успешно сохранена под именем {0}
tr: Dosya başarıyla {0} olarak yedeklendi
zh_hans: 文件已成功备份为 {0}
zh_hant: 檔案已成功備份為 {0}

source: Identity
cs: Identita
de: Identität
es: Identidad
fr: Identité
it: Identità
ja: ID
ko: ID
pl: Tożsamość
pt_br: Identidade
ru: Идентификатор
tr: Kimlik
zh_hans: 标识
zh_hant: 識別

# IdentityDescription
source: Security identity of the referenced assembly.
cs: Identita zabezpečení odkazovaného sestavení
de: Sicherheits-ID der referenzierten Assembly
es: Identidad de seguridad del ensamblado al que se hace referencia.
fr: Identité de sécurité de l'assembly référencé.
it: Identità di sicurezza dell'assembly a cui viene fatto riferimento.
ja: 参照アセンブリのセキュリティ ID です。
ko: 참조된 어셈블리의 보안 ID입니다.
pl: Tożsamość zabezpieczeń przywoływanego zestawu.
pt_br: Identidade de segurança do assembly referenciado.
ru: Идентификатор безопасности сборки, на которую указывает ссылка.
tr: Başvurulan bütünleştirilmiş kodun güvenlik kimliği.
zh_hans: 引用的程序集的安全标识。
zh_hant: 被參考之組件的安全性識別。

source: Path
cs: Cesta
de: Pfad
es: Ruta de acceso
fr: Chemin
it: PERCORSO
ja: パス
ko: 경로
pl: ŚCIEŻKA
pt_br: Caminho
ru: Путь
tr: Yol
zh_hans: 路径
zh_hant: 路徑

# PathDescription
source: Location of file being referenced.
cs: Umístění odkazovaného souboru
de: Speicherort der Datei, auf die verwiesen wird.
es: Ubicación del archivo al que se hace referencia.
fr: Emplacement du fichier référencé.
it: Percorso del file a cui viene fatto riferimento.
ja: 参照されているファイルの場所です。
ko: 참조되는 파일의 위치입니다.
pl: Lokalizacja przywoływanego pliku.
pt_br: Local do arquivo que está sendo referenciado.
ru: Расположение адресуемого файла.
tr: Başvurulmakta olan dosyanın konumu.
zh_hans: 所引用的文件的位置。
zh_hant: 所參考檔案的位置。

source: Version
es: Versión
it: Versione
ja: バージョン
ko: 버전
pl: Wersja
pt_br: Versão
ru: Версия
tr: SÜRÜM
zh_hans: 版本
zh_hant: 版本

# CopyOf
source: Copy of {0}
cs: Kopie {0}
de: Kopie von {0}
es: Copia de {0}
fr: Copie de {0}
it: Copia di {0}
ja: コピー ～ {0}
ko: 사본 - {0}
pl: Kopia {0}
pt_br: Cópia de {0}
ru: Копия {0}
tr: {0} kopyası
zh_hans: {0} 的副本
zh_hant: {0} 的複本

# CopyOf2
source: Copy ({0}) of {1}
cs: Kopie ({0}) z {1}
de: Kopie ({0}) von {1}
es: Copia ({0}) de {1}
fr: Copie ({0}) de {1}
it: Copia ({0}) di {1}
ja: コピー ({0}) /{1}
ko: 사본({0}) - {1}
pl: Kopia ({0}) z {1}
pt_br: Copiar ({0}) de {1}
ru: Копия ({0}) {1}
tr: {1} öğesinin ({0}) kopyası
zh_hans: {1} 的副本({0})
zh_hant: {1} 的複本 ({0})

source: Program
de: Programm
es: Programa
fr: Programme
it: Programma
ja: プログラム
ko: 프로그램
pt_br: Programa
ru: Программа
zh_hans: 程序
zh_hant: 程式

# ParameterCannotBeNullOrEmpty
source: ParameterCannotBeNullOEmpty
ru: ParameterCannotBeNullOrEmpty
