Repository: dotnet/fsharp
Catalog: vsintegration/src/FSharp.ProjectSystem.*/xlf/Microsoft.VisualStudio.Package.Project.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# OutputXmlSerializerDescription
source: Contains the XML serialization assemblies for the project.
cs: Obsahuje XML serializaci sestavení pro projekt.
de: Enthält die XML-Serialisierungsassemblys für das Projekt.
es: Contiene los ensamblados de serialización XML para el proyecto.
fr: Contient les assemblys de sérialisation XML pour le projet.
it: Contiene gli assembly di serializzazione XML per il progetto.
ja: プロジェクトの XML シリアル化アセンブリが含まれます。
ko: 프로젝트의 XML Serialization 어셈블리를 포함합니다.
pl: Zawiera zestawy serializacji XML dla projektu.
pt_br: Contém os assemblies de serialização XML para o projeto.
ru: Содержит сборки XML-сериализации для проекта.
tr: Projenin XML serileştirme derlemelerini içerir.
zh_hans: 包含项目的 XML 序列化程序集。
zh_hant: 包含專案的 XML 序列化組件。

# QueryReloadNestedProject
source: The project file '{0}' has been modified outside of Visual Studio. Do you want to reload the project?
cs: Soubor projektu {0} se změnil mimo Visual Studio. Chcete projekt znovu načíst?
de: Die Projektdatei "{0}" wurde außerhalb von Visual Studio geändert. Möchten Sie das Projekt erneut laden?
es: El archivo de proyecto '{0}' se ha modificado fuera de Visual Studio. ¿Desea recargar el proyecto?
fr: Le fichier projet '{0}' a été modifié en dehors de Visual Studio. Voulez-vous recharger le projet ?
it: Il file di progetto '{0}' è stato modificato all'esterno di Visual Studio. Ricaricare il progetto?
ja: プロジェクト ファイル '{0}' は Visual Studio の外部で変更されています。プロジェクトを再度読み込みますか?
ko: 프로젝트 파일 '{0}'이(가) Visual Studio 외부에서 수정되었습니다. 프로젝트를 다시 로드하시겠습니까?
pl: Plik projektu „{0}” został zmodyfikowany poza programem Visual Studio. Czy chcesz ponownie załadować projekt?
pt_br: O arquivo do projeto '{0}' foi modificado fora do Visual Studio. Deseja recarregar o projeto?
ru: Файл проекта "{0}" изменен вне среды разработки Visual Studio. Перезагрузить проект?
tr: '{0}' proje dosyası Visual Studio'nun dışında değiştirilmiş. Projeyi yeniden yüklemek istiyor musunuz?
zh_hans: 已在 Visual Studio 之外修改了项目文件“{0}”。 是否重新加载该项目?
zh_hant: 專案檔 '{0}' 已在 Visual Studio 之外修改過。您要重新載入專案嗎?

# NestedProjectFailedToReload
source: The nested project has failed to reload.
cs: Při pokusu znovu načíst vnořený projekt došlo k chybě.
de: Fehler beim erneuten Laden des geschachtelten Projekts.
es: No se pudo recargar el proyecto anidado.
fr: Échec du rechargement du projet imbriqué.
it: Non è stato possibile ricaricare il progetto annidato.
ja: 入れ子にされたプロジェクトの再読み込みに失敗しました。
ko: 중첩된 프로젝트를 다시 로드하지 못했습니다.
pl: Nie można załadować ponownie projektu zagnieżdżonego.
pt_br: Falha ao recarregar o projeto aninhado.
ru: Не удалось перезагрузить вложенный проект.
tr: İç içe projeler yeniden yüklenemedi.
zh_hans: 嵌套的项目重新加载失败。
zh_hant: 巢狀專案無法重新載入。

# FileOrFolderCannotBeFound
source: The item '{0}' cannot be found on disk, either because it has been renamed, deleted, or moved to a new location.
cs: Položka {0} se na disku nedá najít. Je buď přejmenovaná, smazaná, nebo přesunutá do nového umístění.
de: Das Element "{0}" wurde nicht auf dem Datenträger gefunden, weil es umbenannt, gelöscht oder an einen neuen Speicherort verschoben wurde.
es: No se encuentra el elemento '{0}' en el disco. Puede que se le haya cambiado el nombre, se haya eliminado o se haya movido a otra ubicación.
fr: L'élément '{0}' est introuvable sur le disque. Il a peut-être été renommé, supprimé ou déplacé.
it: L'elemento '{0}' non è stato trovato nel disco perché è stato rinominato, eliminato o spostato in un nuovo percorso.
ja: 項目 '{0}' がディスクに見つかりません。名前が変更されたか、削除されたか、または新しい場所に移動した可能性があります。
ko: '{0}' 항목은 이름이 바뀌었거나 삭제되었거나 또는 새 위치로 이동되었기 때문에 디스크에서 찾을 수 없습니다.
pl: Nie można odnaleźć elementu „{0}” na dysku, ponieważ została zmieniona jego nazwa albo został on usunięty lub przeniesiony do nowej lokalizacji.
pt_br: O item '{0}' não foi encontrado no disco, ele foi renomeado, excluído ou movido para um novo local.
ru: Элемент "{0}" не удается найти на диске, поскольку элемент был переименован, удален или перемещен в новое место.
tr: Adı değiştiğinden, silindiğinden veya yeni konuma taşındığından '{0}' öğesi diskte bulunamıyor.
zh_hans: 在磁盘上找不到项“{0}”，可能是因为它已重命名、删除或移动到新位置。
zh_hant: 在磁碟上找不到項目 '{0}'，因為該項目已經重新命名、遭到刪除或移動至新位置。

# ErrorReferenceCouldNotBeAdded
source: A reference to {0} could not be added. Please make sure that the file is accessible, and that it is a valid assembly or COM component.
cs: Odkaz na soubor {0} se nepovedlo přidat. Zkontrolujte, jestli je soubor dostupný a jedná se o platné sestavení nebo komponentu COM.
de: Es konnte kein Verweis auf "{0}" hinzugefügt werden. Achten Sie darauf, dass die Datei zugänglich ist und dass es sich um eine gültige Assembly- oder COM-Komponente handelt.
es: No se pudo agregar una referencia a {0}. Asegúrese de que el archivo es accesible y de que se trata de un ensamblado o componente COM válido.
fr: Impossible d'ajouter une référence à {0}. Vérifiez que ce fichier est accessible et qu'il s'agit d'un assembly ou d'un composant COM valide.
it: Non è stato possibile aggiungere un riferimento a {0}. Assicurarsi che il file sia accessibile e che sia un componente COM o un assembly valido.
ja: {0} への参照を追加できませんでした。ファイルがアクセス可能で、有効なアセンブリまたは COM コンポーネントであることを確認してください。
ko: {0}에 대한 참조를 추가할 수 없습니다. 파일이 액세스 가능한지, 올바른 어셈블리 또는 COM 구성 요소인지 확인하십시오.
pl: Nie można dodać odwołania do {0}. Upewnij się, że plik jest dostępny i jest prawidłowym zestawem lub składnikiem COM.
pt_br: Não foi possível adicionar uma referência a {0}. Verifique se esse arquivo está acessível e se é um assembly ou componente COM válido.
ru: Не удалось добавить ссылку на {0}. Убедитесь в том, что файл доступен и является допустимой сборкой или COM-компонентом.
tr: {0} öğesine başvuru eklenemedi. Lütfen dosyanın erişilebilir olduğundan ve geçerli bir derleme ya da COM bileşeni olduğundan emin olun.
zh_hans: 未能添加对 {0} 的引用。请确保此文件可访问并且是一个有效的程序集或 COM 组件。
zh_hant: 無法加入 {0} 的參考。請確定這是個可存取的檔案，且是有效組件或 COM 元件。

# DetailsImport
source: An 'Import' of the file '{1}' was found in the project file '{0}'. This file is not registered as a safe file to import, and could contain targets and tasks that are harmful. If this imported file is indeed considered safe, then it can be registered by writing to the registry key {2}.
cs: V souboru projektu {0} se našel Import souboru {1}. Tento soubor není registrovaný jako soubor bezpečný pro import a může obsahovat škodlivé cíle a úkoly. Pokud se tento importovaný soubor skutečně považuje za bezpečný, dá se zaregistrovat zápisem do klíče registru {2}.
de: Ein "Import" der Datei "{1}" wurde in der Projektdatei "{0}" gefunden. Diese Datei ist nicht als sichere Datei für den Import registriert und könnte schädliche Ziele und Aufgaben enthalten. Wenn diese importierte Datei als sicher betrachtet wird, kann sie durch Schreiben in den Registrierungsschlüssel {2} registriert werden.
es: Se encontró una acción 'Import' del archivo '{1}' en el archivo de proyecto '{0}'. Este archivo no está registrado como un archivo seguro para importarlo y podría contener destinos y tareas perjudiciales. Si, en efecto, este archivo importado se considera seguro puede registrarse escribiendo la clave del Registro {2}.
fr: Un élément 'Import' du fichier '{1}' a été trouvé dans le fichier projet '{0}'. Ce fichier n'est pas enregistré comme un fichier sûr à importer et peut contenir des cibles et des tâches risquées. Si ce fichier importé est bien considéré comme sûr, il peut être enregistré en écrivant dans la clé de Registre {2}.
it: Tag 'Import' del file '{1}' trovato nel file di progetto '{0}'. Questo file non è registrato come sicuro ai fini dell'importazione e potrebbe contenere destinazioni e attività dannose. Se tale file importato viene considerato sicuro, è possibile registrarlo nella chiave del Registro di sistema {2}.
ja: プロジェクト ファイル '{0}' にファイル '{1}' の 'Import' が見つかりました。このファイルはインポートできる安全なファイルとして登録されていません。危害を及ぼすターゲットおよびタスクが含まれているおそれがあります。このインポートされるファイルが確実に安全と見なされる場合は、レジストリ キー {2} に書き込むことでファイルを登録できます。
ko: {1}' 파일의 'Import'가 프로젝트 파일 '{0}'에 있습니다. 이 파일은 가져올 수 있는 안전한 파일로 등록되지 않았으며 유해한 대상 및 작업을 포함할 수 있습니다. 가져온 이 파일이 실제로 안전한 경우에는 레지스트리 키 {2}에 작성하여 등록할 수 있습니다.
pl: W pliku projektu „{0}” znaleziono import pliku „{1}”, który nie jest zarejestrowany jako plik bezpieczny do zaimportowania i może zawierać szkodliwe cele i zadania. Jeśli importowany plik można uznać za bezpieczny, możesz go zarejestrować, zapisując w kluczu rejestru {2}.
pt_br: Uma 'Importação' do arquivo '{1}' foi encontrada no arquivo do projeto '{0}'. Esse arquivo não está registrado como um arquivo seguro para importação e pode conter destinos e tarefas prejudiciais. Se este arquivo de importação for realmente considerado seguro, então ele poderá ser registrado escrevendo o mesmo na chave de registro {2}.
ru: В файле проекта "{1}" найден импорт файла "{0}". Этот файл не зарегистрирован как безопасный для импорта и может содержать уязвимые места или злонамеренные задачи. Если этот файл в самом деле безопасен, его можно зарегистрировать при помощи записи в раздел реестра {2}.
tr: {0}' proje dosyasında '{1}' dosyasının 'Import' eylemi bulundu. Bu dosya içeri aktarılması güvenli bir dosya olarak kaydedilmedi ve zararlı hedefler ve görevler içerebilir. İçeri aktarılan bu dosya güvenli olarak kabul ediliyorsa, {2} kayıt defteri anahtarına yazılarak kaydedilebilir.
zh_hans: 在项目文件“{0}”中找到文件“{1}”的“Import”。此文件未注册为要导入的安全文件，并可能包含有害的目标和任务。 如果确实认为此导入的文件是安全的，则可以通过将其写入注册表项 {2} 进行注册。
zh_hant: 在專案檔 '{0}' 中找到檔案 '{1}' 的 'Import'。這個檔案並未註冊為安全的匯入檔案，可能包含具有傷害性的目標和工作。如果這個匯入檔案確實是安全無虞的，則可以寫入登錄機碼 {2} 以進行註冊。

# DetailsUserImport
source: An 'Import' of the file '{1}' was found in the user project file '{0}'. All imports in user project files are considered unsafe.
cs: V uživatelském souboru projektu {0} je položka Import souboru {1}. Veškeré importy v uživatelských souborech projektu se považují za nebezpečné.
de: Ein "Import" der Datei "{1}" wurde in der Benutzerprojektdatei "{0}" gefunden. Alle Importe in Benutzerprojektdateien werden als nicht sicher angesehen.
es: Se encontró una acción 'Import' del archivo '{1}' en el archivo de proyecto de usuario '{0}'. Todas las importaciones en archivos de proyecto de usuario se consideran no seguras.
fr: Un élément 'Import' du fichier '{1}' a été trouvé dans le fichier projet utilisateur '{0}'. Toutes les importations dans les fichiers projet utilisateur sont considérées comme unsafe.
it: Tag 'Import' del file '{1}' trovato nel file di progetto '{0}' dell'utente. Tutte le importazioni nei file di progetto utente vengono considerate non sicure.
ja: ユーザー プロジェクト ファイル '{0}' にファイル '{1}' の 'Import' が見つかりました。ユーザー プロジェクト ファイル内のインポートはすべて安全でないと見なされます。
ko: ’{1}' 파일의 'Import'가 사용자 프로젝트 파일 '{0}'에 있습니다. 사용자 프로젝트 파일에 있는 가져온 항목은 모두 안전하지 않은 것으로 간주됩니다.
pl: W pliku projektu użytkownika „{0}” znaleziono import pliku „{1}”. Wszystkie importy w plikach projektu użytkownika są uważane za niebezpieczne.
pt_br: Uma 'Importação' do arquivo '{1}' foi encontrada no arquivo do projeto do usuário '{0}'. Todas as importações em arquivos do projeto são consideradas inseguras.
ru: В файле проекта пользователя "{0}" найден импорт файла "{1}". Весь импорт в пользовательских файлах проекта считается небезопасным.
tr: {0}' kullanıcı proje dosyasında '{1}' dosyasının 'Import' eylemi bulundu. Kullanıcı proje dosyalarındaki tüm içeri aktarma işlemleri güvensiz kabul edilir.
zh_hans: 在用户项目文件“{0}”中找到文件“{1}”的“Import”。 用户项目文件中的所有导入都被认为是不安全的。
zh_hant: 在使用者專案檔 '{0}' 中找到檔案 '{1}' 的 'Import'。系統會將使用者專案檔中的所有匯入視為不安全。

# DetailsItem
source: One or more items named '{1}' were found in the project file '{0}'. These items normally should not be specified in the project file. They can change the way targets and tasks are executed during project load, and this could have harmful effects.
cs: V souboru projektu {0} se našla jedna nebo víc položek s názvem {1}. Tyto položky by se do souboru projektu obvykle neměly zadávat. Můžou změnit způsob, jakým se provádějí cíle a úkoly během načítání projektu, a to může mít škodlivé účinky.
de: In der Projektdatei "{0}" wurde mindestens ein Element mit dem Namen "{1}" gefunden. Diese Elemente sollten normalerweise nicht in der Projektdatei angegeben werden. Sie können die Art und Weise ändern, wie Ziele und Aufgaben beim Laden des Projekts ausgeführt werden, was schädigende Auswirkungen haben kann.
es: Se encontraron en el archivo de proyecto '{0}' uno o varios elementos denominados '{1}'. Estos elementos normalmente no deberían especificarse en el archivo de proyecto, ya que pueden cambiar la forma de ejecución de destinos y tareas durante la carga del proyecto, lo cual podría tener efectos perjudiciales.
fr: Au moins un élément nommé '{1}' a été trouvé dans le fichier projet '{0}'. En principe, ces éléments ne doivent pas être spécifiés dans le fichier projet. Ils peuvent modifier la méthode d'exécution des cibles et des tâches lors du chargement du projet, ce qui présente des risques.
it: Uno o più elementi denominati '{1}' trovati nel file di progetto '{0}'. Normalmente questi elementi non dovrebbero essere specificati nel file di progetto. Essi possono modificare la modalità di esecuzione di destinazioni e attività durante il caricamento del progetto, con conseguenti effetti dannosi.
ja: プロジェクト ファイル '{0}' に '{1}' という項目が 1 つ以上見つかりました。通常、これらの項目はプロジェクト ファイル内で指定しないでください。プロジェクトの読み込み中、これらの項目によってターゲットやタスクの実行方法が変更される可能性があり、危害が及ぶおそれがあります。
ko: 이름이 '{1}'인 항목이 프로젝트 파일 '{0}'에 하나 이상 있습니다. 이러한 항목은 일반적으로 프로젝트 파일에 지정하면 안 됩니다. 이 항목으로 인해 프로젝트가 로드되는 동안 대상 및 작업이 실행되는 방법이 변경될 수 있으며, 그 결과로 나쁜 영향이 미칠 수 있습니다.
pl: W pliku projektu „{0}” znaleziono co najmniej jeden element o nazwie „{1}”. Takie elementy nie powinny być określane w pliku projektu, ponieważ mogą zmienić sposób wykonywania celów i zadań podczas ładowania projektu, co może mieć szkodliwe skutki.
pt_br: Um ou mais itens chamados '{1}' foram encontrados no arquivo do projeto '{0}'. Esses itens normalmente não devem ser especificados no arquivo do projeto. Eles podem alterar a forma com que os destinos e as tarefas são executados ao carregar o projeto e isso pode ser prejudicial.
ru: В файле проекта "{0}" найден один или более элементов "{1}". Обычно эти элементы не определяются в файле проекта. Они позволяют изменять способ выполнения целей и задач во время загрузки проекта, что может иметь не желательные эффекты.
tr: {0}' proje dosyasında '{1}' adlı bir veya daha çok öğe bulundu. Bu öğelerin normalde proje dosyasında belirtilmemesi gerekir. Bu öğeler, proje yükleme sırasında hedeflerin ve görevlerin yürütülme biçimini değiştirebilir ve bunun zararlı etkileri olabilir.
zh_hans: 在项目文件“{0}”中找到一个或多个名为“{1}”的项。通常不应在项目文件中指定这些项。它们可以更改项目加载过程中执行目标和任务的方式，这可能会产生有害影响。
zh_hant: 在專案檔 '{0}' 中找到一個或多個名為 '{1}' 的項目。這些項目通常不應在專案檔中指定。它們可以在專案載入期間變更目標和工作的執行方式，而這可能會造成有害的效果。

# DetailsProperty
source: A property named '{1}' was found in the project file '{0}'. This property normally should not be specified in the project file. Its value can change the way targets and tasks are executed during project load, and this could have harmful effects.
cs: V souboru projektu {0} se našla vlastnost s názvem {1}. Tato vlastnost by se do souboru projektu obvykle neměla zadávat. Její hodnota může změnit způsob, jakým se provádějí cíle a úkoly během načítání projektu, a to může mít škodlivé účinky.
de: In der Projektdatei "{0}" wurde eine Eigenschaft mit dem Namen "{1}" gefunden. Diese Eigenschaft sollte normalerweise nicht in der Projektdatei angegeben werden. Ihr Wert kann die Art und Weise ändern, wie Ziele und Aufgaben beim Laden des Projekts ausgeführt werden, was schädigende Auswirkungen haben kann.
es: Se encontró una propiedad denominada '{1}' en el archivo de proyecto '{0}'. Normalmente, esta propiedad no se debe especificar en dicho archivo, ya que su valor puede cambiar el modo de ejecutar los destinos y tareas durante la carga del proyecto, lo que podría tener efectos perjudiciales.
fr: Une propriété nommée '{1}' a été trouvée dans le fichier projet '{0}'. En principe, cette propriété ne devrait pas être spécifiée dans le fichier projet. Sa valeur peut modifier la méthode d'exécution des cibles et des tâches lors du chargement du projet, ce qui présente des risques.
it: Proprietà denominata '{1}' trovata nel file di progetto '{0}'. Normalmente questa proprietà non dovrebbe essere specificata nel file di progetto. Il suo valore può modificare la modalità di esecuzione di destinazioni e attività durante il caricamento del progetto, con conseguenti effetti dannosi.
ja: プロジェクト ファイル '{0}' に '{1}' というプロパティが見つかりました。通常、このプロパティはプロジェクト ファイル内で指定しないでください。プロジェクトの読み込み中、この値によってターゲットやタスクの実行方法が変更される可能性があり、危害が及ぶおそれがあります。
ko: 이름이 '{1}'인 속성이 프로젝트 파일 '{0}'에 있습니다. 이 속성은 일반적으로 프로젝트 파일에 지정하면 안 됩니다. 해당 값으로 인해 프로젝트가 로드되는 동안 대상 및 작업이 실행되는 방법이 변경될 수 있으며, 그 결과로 나쁜 영향을 줄 수 있습니다.
pl: W pliku projektu „{0}” znaleziono właściwość o nazwie „{1}”, która nie powinna być określana w pliku projektu. Jej wartość może zmienić sposób wykonywania celów i zadań podczas ładowania projektu, co może mieć szkodliwe skutki.
pt_br: Uma propriedade chamada '{1}' foi encontrada no arquivo do projeto '{0}'. Essa propriedade normalmente não deve ser especificada no arquivo do projeto. O seu valor pode alterar a forma com que os destinos e as tarefas são executados ao carregar o projeto e isso pode ser prejudicial.
ru: В файле проекта "{0}" было обнаружено свойство с именем "{1}". Обычно это свойство не определяется в файле проекта. Его значение позволяет изменять способ выполнения целей и задач во время загрузки проекта, что может иметь не желательные эффекты.
tr: {0}' proje dosyasında '{1}' adlı bir özellik bulundu. Bu özellik normalde proje dosyasında belirtilmemelidir. Özelliğin değeri proje yükleme sırasında hedeflerin ve görevlerin yürütülme biçimini değiştirebilir ve bunun zararlı etkileri olabilir.
zh_hans: 在项目文件“{0}”中找到一个名为“{1}”的属性。 通常不应在项目文件中指定此属性。 它的值可以更改项目加载过程中执行目标和任务的方式，这可能会产生有害影响。
zh_hant: 在專案檔 '{0}' 中找到名為 '{1}' 的屬性。這個屬性通常不應在專案檔中指定。它的值可以在專案載入期間變更目標和工作的執行方式，而這可能會造成有害的效果。

# DetailsUsingTask
source: A 'UsingTask' tag which registers the '{1}' task was found in the project file '{0}'. 'UsingTask' tags in the project file take precedence over those in the imported .TARGETS files, and therefore could be used to execute arbitrary code during an otherwise unmodified build process.
cs: V souboru projektu {0} se našla značka UsingTask, která registruje úlohu {1}. Značky UsingTask v souboru projektu mají přednost před těmi, které jsou v importovaných souborech .TARGETS, takže se dají použít k provádění libovolného kódu v jinak nezměněném procesu sestavení.
de: In der Projektdatei "{1}" wurde ein <UsingTask>-Tag gefunden, das die Aufgabe "{0}" registriert. <UsingTask>-Tags in der Projektdatei haben Vorrang gegenüber denen in importierten TARGETS-Dateien. Daher könnten sie dazu verwendet werden, willkürlichen Code während eines sonst unveränderten Buildprozesses auszuführen.
es: Se encontró una etiqueta 'UsingTask', que registra la tarea '{1}', en el archivo de proyecto '{0}'. Las etiquetas 'UsingTask del archivo de proyecto tienen preferencia sobre las que figuran en los archivos .TARGETS importados, por lo que se podrían utilizar para ejecutar código arbitrario durante un proceso de compilación no modificado de otro modo.
fr: Une balise 'UsingTask' qui inscrit la tâche '{1}' a été trouvée dans le fichier projet '{0}'. Les balises 'UsingTask' dans le fichier projet sont prioritaires par rapport à celles des fichiers .TARGETS importés et pourraient donc être utilisées pour exécuter du code arbitraire lors d'un processus de génération inchangé autrement.
it: Tag 'UsingTask' che registra l'attività '{1}' trovato nel file di progetto '{0}'. I tag 'UsingTask' presenti nel file di progetto hanno la precedenza rispetto a quelli nei file .TARGETS importati e potrebbero pertanto essere utilizzati per eseguire codice arbitrario durante un processo di compilazione altrimenti non modificato.
ja: プロジェクト ファイル '{0}' に、'{1}' タスクを登録する 'UsingTask' タグが見つかりました。プロジェクト ファイル内の 'UsingTask' タグは、インポートされた .TARGETS ファイル内のタグよりも優先されます。このため、その指定なしでは変更されないビルド処理中に、任意のコードを実行する目的で使用される可能性があります。
ko: {1}' 작업을 등록하는 'UsingTask' 태그가 프로젝트 파일 '{0}'에 있습니다. 프로젝트 파일의 'UsingTask' 태그는 가져온 .TARGETS 파일의 태그보다 우선 순위가 높으므로 수정되지 않은 빌드 프로세스 동안 임의의 코드를 실행하는 데 사용될 수 있습니다.
pl: W pliku projektu „{0}” znaleziono tag „UsingTask”, który rejestruje zadanie „{1}”. Tagi „UsingTask” w pliku projektu mają pierwszeństwo przed tagami w importowanych plikach TARGETS, dlatego można ich używać do wykonania dowolnego kodu podczas niemodyfikowanego w inny sposób procesu kompilacji.
pt_br: Uma marca 'UsingTask' que registra a tarefa '{1}' foi encontrada no arquivo do projeto '{0}'. As marcas 'UsingTask' do arquivo do projeto têm prioridade sobre os arquivos .DIRETORIO importados. Portanto, elas poderiam ser usadas para executar o código arbitrário durante um processo de compilação que, de outra forma, não seria modificado.
ru: В файле проекта "{0}" обнаружен тег "UsingTask", регистрирующий задачу "{1}". Теги "UsingTask" в файле проекта имеют превосходство перед импортированными .TARGETS-файлами, и поэтому могут быть использованы для выполнения произвольного кода во время не изменяемого другими средствами процесса сборки.
tr: {0}' proje dosyasında '{1}' görevini kaydeden 'UsingTask' etiketi bulundu. Proje dosyasındaki 'UsingTask' etiketleri, içeri aktarılan .TARGETS dosyalarından önceliklidir ve bu nedenle, tersine bir değişiklik yapılmamış oluşturma işlemi sırasında rastgele kodu yürütmek için kullanılabilir.
zh_hans: 在项目文件“{0}”中找到注册“{1}”任务的“UsingTask”标记。 项目文件中的“UsingTask”标记优先于已导入的 .TARGETS 文件中的那些标记，因而可用于在一个未经另外修改的生成过程中执行任意代码。
zh_hant: 在專案檔 '{0}' 中找到註冊 '{1}' 工作的 'UsingTask' 標記。專案檔中的 'UsingTask' 標記會比匯入的 .TARGETS 檔案內容優先考慮，因此可以用來在其他未經修改的建置程序期間執行任意程式碼。
