Repository: dotnet/fsharp
Catalog: vsintegration/src/FSharp.ProjectSystem.*/xlf/Microsoft.VisualStudio.Package.Project.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DetailsTarget
source: A 'Target' named '{1}' was found in the project file '{0}'. The tasks within this target could contain arbitrary code and may get executed as soon as the project is loaded in the IDE.
cs: V souboru projektu {0} se našel Target s názvem {1}. Úkoly v rámci tohoto cíle můžou obsahovat libovolný kód a můžou se provést hned po načtení projektu v prostředí IDE.
de: Ein "Ziel" mit dem Namen "{1}" wurde in der Projektdatei "{0}" gefunden. Die Aufgaben in diesem Ziel können willkürlichen Code enthalten und werden möglicherweise ausgeführt, sobald das Projekt in die IDE geladen wird.
es: Se encontró una etiqueta 'Target' denominada '{1}' en el archivo de proyecto '{0}'. Las tareas que se encuentren dentro de este destino podrían contener código arbitrario que se podría ejecutar tan pronto como el proyecto se cargue en el IDE.
fr: Un élément 'Target' nommé '{1}' a été trouvé dans le fichier projet '{0}'. Les tâches de cette cible peuvent contenir du code arbitraire et être exécutées dès le chargement du projet dans l'environnement IDE.
it: Un elemento 'Target' denominato '{1}' è stato trovato nel file di progetto '{0}'. Le attività della destinazione potrebbero contenere codice arbitrario e potrebbero venire eseguite al caricamento del progetto nell'IDE.
ja: プロジェクト ファイル '{0}' に '{1}' という 'Target' が見つかりました。このターゲット内のタスクには任意のコードが含まれ、IDE でプロジェクトが読み込まれるとすぐに実行される可能性があります。
ko: 이름이 '{1}'인 'Target'이 프로젝트 파일 '{0}'에 있습니다. 이 대상 내의 작업은 임의의 코드를 포함할 수 있으며 프로젝트가 IDE에 로드되는 즉시 실행될 수 있습니다.
pl: W pliku projektu „{0}” znaleziono cel o nazwie „{1}”. Zadania w obrębie tego celu mogą zawierać dowolny kod, który może zostać wykonany od razu po załadowaniu projektu w środowisku IDE.
pt_br: Um 'Destino' chamado '{1}' foi encontrado no arquivo do projeto '{0}'. As tarefas desse destino podem conter um código arbitrário e podem ser executadas no momento em que o projeto é carregado no IDE.
ru: В файле проекта "{0}" был обнаружен объект "цель" с именем "{1}". Задачи в этом элементе могут содержать произвольный код, который может быть выполнен как только проект загрузится в среду разработки.
tr: {0}' proje dosyasında '{1}' adlı bir 'Target' bulundu. Bu hedefteki görevler rastgele kod içerebilir ve proje IDE'ye yüklenir yüklenmez çalıştırılabilir.
zh_hans: 在项目文件“{0}”中找到一个名为“{1}”的“Target”。 此目标内的任务可以包含任意代码，在 IDE 中加载此项目后，可能会立即执行这些任务。
zh_hant: 在專案檔 '{0}' 中找到名為 '{1}' 的 'Target'。這個目標內的工作可能包含任意程式碼，並可能在專案載入於 IDE 時立刻執行。

# DetailsItemLocation
source: An item referring to the file '{1}' was found in the project file '{0}'. Since this file is located within a system directory, root directory, or network share, it could be harmful to write to this file.
cs: V souboru projektu {0} je položka odkazující na soubor {1}. Protože je tento soubor umístěný v systémovém adresáři, kořenovém adresáři nebo sdílené síťové složce, může být zápis do tohoto souboru nebezpečný.
de: Ein Element, das auf die Datei "{1}" verweist, wurde in der Projektdatei "{0}" gefunden. Da sich diese Datei innerhalb eines Systemverzeichnisses, eines Stammverzeichnisses oder auf einer Netzwerkfreigabe befindet, könnte ein Schreiben in diese Datei schädlich sein.
es: Se encontró en el archivo de proyecto '{0}' un elemento que hace referencia al archivo '{1}'. Dado que este archivo está ubicado en un directorio del sistema, un directorio raíz o un recurso compartido de red, podría ser perjudicial escribir en el mismo.
fr: Un élément qui fait référence au fichier '{1}' a été trouvé dans le fichier projet '{0}'. Dans la mesure où ce fichier se situe dans un répertoire système, un répertoire racine ou un partage réseau, il est risqué d'écrire dans ce fichier.
it: Elemento che fa riferimento al file '{1}' trovato nel file di progetto '{0}'. Poiché il file si trova all'interno di una directory di sistema, una directory radice o una condivisione di rete, la scrittura nel file potrebbe essere dannosa.
ja: プロジェクト ファイル '{0}' にファイル '{1}' を参照する項目が見つかりました。このファイルはシステム ディレクトリ、ルート ディレクトリ、またはネットワーク共有内に配置されているため、このファイルへの書き込みは危害を及ぼすおそれがあります。
ko: {1}' 파일을 참조하는 항목이 프로젝트 파일 '{0}'에 있습니다. 이 파일은 시스템 디렉터리, 루트 디렉터리 또는 네트워크 공유에 위치하므로 이 파일에 작성하는 것은 위험할 수 있습니다.
pl: W pliku projektu „{0}” znaleziono element odwołujący się do pliku „{1}”. Ponieważ ten plik znajduje się w katalogu systemowym, katalogu głównym lub udziale sieciowym, zapisanie w nim może mieć szkodliwe skutki.
pt_br: Um item referente ao arquivo '{1}' foi encontrado no arquivo do projeto '{0}'. Como esse arquivo está localizado em um diretório do sistema, diretório raiz ou compartilhamento de rede, talvez seja prejudicial gravar nele.
ru: В файле проекта "{0}" найден элемент, ссылающийся на файл "{1}". Так как это файл находится в системном каталоге, корневом каталоге или в общем сетевом каталоге, запись в данный файл может быть опасной.
tr: {0}' proje dosyasında '{1}' dosyasına başvuru yapan bir öğe bulundu. Bu dosya sistem dizininde, kök dizinde veya ağ paylaşımında bulunduğundan, bu dosyaya yazmak zararlı olabilir.
zh_hans: 在项目文件“{0}”中找到引用文件“{1}”的项。 由于此文件位于系统目录、根目录或网络共享中，因此，写入此文件可能会产生有害影响。
zh_hant: 在專案檔 '{0}' 中找到參考檔案 '{1}' 的項目。由於這個檔案是位在系統目錄、根目錄或網路共用中，所以寫入這個檔案可能會造成損害。

# ProjectLocationNotTrusted
source: The project location is not trusted:{0}{0}{1}{0}{0}Running the application may result in security exceptions when it attempts to perform actions which require full trust.{0}{0}Click OK to ignore and continue.
cs: Umístění projektu není důvěryhodné:{0}{0}{1}{0}{0}Spuštění aplikace může v případě pokusu o provedení akce, která vyžaduje úplný vztah důvěryhodnosti, způsobit bezpečnostní výjimky.{0}{0}Pokud chcete ignorovat toto upozornění a pokračovat, stiskněte OK.
de: Der Projektspeicherort ist nicht vertrauenswürdig:{0}{0}{1}{0}{0}Durch Ausführen der Anwendung könnten Sicherheitsausnahmen auftreten, wenn versucht wird, Aktionen auszuführen, für die volle Vertrauenswürdigkeit erforderlich ist.{0}{0}Klicken Sie auf "OK", um dies zu ignorieren und fortzufahren.
es: La ubicación del proyecto no es de confianza:{0}{0}{1}{0}{0}Si ejecuta la aplicación, puede dar lugar a excepciones de seguridad cuando intente realizar acciones que requieran plena confianza.{0}{0}Haga clic en Aceptar para pasarlo por alto y continuar.
fr: L'emplacement du projet n'est pas approuvé :{0}{0}{1}{0}{0}L'exécution de l'application risque de générer des exceptions de sécurité lors de la tentative d'exécution d'actions qui exigent une confiance totale.{0}{0}Cliquez sur OK pour ignorer et continuer.
it: Il percorso del progetto non è attendibile:{0}{0}{1}{0}{0}È possibile che l'applicazione generi eccezioni di sicurezza dovute all'esecuzione di azioni che richiedono l'attendibilità totale.{0}{0}Scegliere OK per ignorare e continuare.
ja: プロジェクトの場所が信頼されていません: {0}{0}{1}{0}{0}このアプリケーションを実行すると、完全な信頼が必要なアクションが試行されたときに、セキュリティ例外が発生する可能性があります。{0}{0}無視して続行するには、[OK] をクリックしてください。
ko: 프로젝트 위치를 신뢰할 수 없습니다.{0}{0}{1}{0}{0}애플리케이션을 실행하면 완전 신뢰가 필요한 작업을 수행할 때 보안 예외가 발생할 수 있습니다.{0}{0}무시하고 계속하려면 [확인]을 클릭하십시오.
pl: Lokalizacja projektu nie jest zaufana:{0}{0}{1}{0}{0}Uruchomienie aplikacji może spowodować wystąpienie wyjątków zabezpieczeń, gdy aplikacja spróbuje wykonać akcje wymagające pełnego zaufania.{0}{0}Kliknij przycisk OK, aby zignorować to ostrzeżenie i kontynuować.
pt_br: A localização do projeto não é confiável:{0}{0}{1}{0}{0}A execução da aplicação pode resultar em exceções de segurança durante a tentativa de executar ações que exigem confiança total.{0}{0}Clique em OK para ignorar e continuar.
ru: Расположение проекта не является доверенным:{0}{0}{1}{0}{0}Выполнение приложения может привести к исключениям безопасности при попытке выполнить действия, требующие полного доверия.{0}{0}Нажмите кнопку "ОК", чтобы игнорировать ошибку и продолжить.
tr: Proje konumu güvenilir değil:{0}{0}{1}{0}{0}Uygulamayı çalıştırmak, tam güven gerektiren eylemleri gerçekleştirmeye çalıştığında güvenlik özel durumlarına neden olabilir.{0}{0}Yoksayıp devam etmek için Tamam'a tıklayın.
zh_hans: 项目位置不受信任:{0}{0}{1}{0}{0}运行该应用程序可能会导致在尝试执行需要完全信任的操作时出现安全异常。{0}{0}单击“确定”忽略此异常并继续操作。
zh_hant: 專案位置不受信任:{0}{0}{1}{0}{0}執行應用程式時若嘗試執行需要完全信任的動作，可能會產生安全性例外狀況。{0}{0}按一下 [確定] 以忽略並繼續。

# BuildEventError
source: Exception was thrown during BuildBegin event\n{0}
cs: Během události BuildBegin se vyvolala výjimka\n{0}
de: Während des BuildBegin-Ereignisses wurde eine Ausnahme ausgelöst.\n{0}
es: Se produjo una excepción durante el evento BuildBegin.\n{0}
fr: Une exception a été levée lors de l'événement BuildBegin\n{0}
it: Eccezione generata durante l'evento BuildBegin\n{0}
ja: BuildBegin イベントで例外がスローされました\n{0}
ko: BuildBegin 이벤트를 수행하는 동안 예외가 throw되었습니다.\n{0}
pl: Podczas zdarzenia BuildBegin został zgłoszony wyjątek\n{0}
pt_br: Uma exceção foi lançada durante o evento BuildBegin\n{0}
ru: Возникло исключение во время события BuildBegin\n{0}
tr: BuildBegin olayı sırasında bir özel durum oluştu\n{0}
zh_hans: BuildBegin 事件期间引发异常\n{0}
zh_hant: BuildBegin 事件期間發生例外狀況\n{0}

source: Copy always
cs: Kopírovat vždycky
de: Immer kopieren
es: Copiar siempre
fr: Toujours copier
it: Copia sempre
ja: 常にコピーする
ko: 항상 복사
pl: Zawsze Kopiuj
pt_br: Copiar sempre
ru: Всегда копировать
tr: Her zaman kopyala
zh_hans: 始终复制
zh_hant: 永遠複製

source: Copy to Output Directory
cs: Kopírovat do výstupního adresáře
de: In Ausgabeverzeichnis kopieren
es: Copiar en el directorio de salida
fr: Copier dans le répertoire de sortie
it: Copia nella directory di output
ja: 出力ディレクトリにコピー
ko: 출력 디렉터리로 복사
pl: Kopiuj do katalogu wyjściowego
pt_br: Copiar para Diretório de Saída
ru: Копировать в выходной каталог
tr: Çıkış Dizinine Kopyala
zh_hans: 复制到输出目录
zh_hant: 複製到輸出目錄

# CopyToOutputDirectoryDescription
source: Specifies the source file will be copied to the output directory
cs: Určuje zdrojový soubor, který se zkopíruje do výstupního adresáře.
de: Gibt an, dass die Quelldatei in das Ausgabeverzeichnis kopiert wird.
es: Especifica que el archivo de origen se copiará en el directorio de salida.
fr: Spécifie le fichier source qui sera copié dans le répertoire de sortie
it: Specifica se il file del codice sorgente verrà copiato nella directory di output
ja: ソース ファイルを出力ディレクトリにコピーするよう指定します
ko: 소스 파일을 출력 디렉터리로 복사할 것인지 여부를 지정합니다.
pl: Określa plik źródłowy, który zostanie skopiowany do katalogu wyjściowego
pt_br: Especifica o arquivo de origem que será copiado para o diretório de saída
ru: Указывает, что исходный файл будет скопирован в указанный каталог
tr: Çıkış dizinine kopyalanacak kaynak dosyasını belirtir
zh_hans: 指定将源文件复制到输出目录
zh_hant: 指定是否要將原始程式檔複製到輸出目錄

source: Copy if newer
cs: Kopírovat, pokud je novější
de: Kopieren, wenn neuer
es: Copiar si es posterior
fr: Copier si plus récent
it: Copia se più recente
ja: 新しい場合はコピーする
ko: 새 버전이면 복사
pl: Kopiuj, jeśli nowszy
pt_br: Copiar se for mais novo
ru: Копировать более позднюю версию
tr: Daha yeniyse kopyala
zh_hans: 如果较新则复制
zh_hant: 有更新時才複製

source: Do not copy
cs: Nekopírovat
de: Nicht kopieren
es: No copiar
fr: Ne pas copier
it: Non copiare
ja: コピーしない
ko: 복사 안 함
pl: Nie kopiuj
pt_br: Não copiar
ru: Не копировать
tr: Kopyalama
zh_hans: 不复制
zh_hant: 不要複製

source: Specific Version
cs: Specifická verze
de: Bestimmte Version
es: Versión específica
fr: Version spécifique
it: Versione specifica
ja: 特定バージョン
ko: 특정 버전
pl: Określona wersja
pt_br: Versão Específica
ru: Конкретная версия
tr: Belirli Bir Sürüm
zh_hans: 特定版本
zh_hant: 特定版本

# SpecificVersionDescription
source: Indicates whether this reference is to a specific version of an assembly.
cs: Určuje, jestli je tento odkaz na určitou konkrétní verzi sestavení.
de: Gibt an, ob dieser Verweis auf eine bestimmte Version einer Assembly verweist.
es: Indica si esta referencia es de una versión específica de un ensamblado.
fr: Indique s'il s'agit d'une référence à une version spécifique d'un assembly.
it: Indica se il riferimento è per una versione specifica di un assembly.
ja: 特定バージョンのアセンブリへの参照かどうかを示します。
ko: 이 참조가 특정 어셈블리 버전에 대한 것인지 여부를 나타냅니다.
pl: Wskazuje, czy jest to odwołanie do określonej wersji zestawu.
pt_br: Indica se esta referência é a uma versão específica de um assembly.
ru: Показывает, является ли эта ссылка ссылкой на конкретную версию сборки.
tr: Bu başvurunun bütünleştirilmiş kodun belirli bir sürümüne yapılıp yapılmadığını belirtir.
zh_hans: 指示此引用是否指向某个特定的程序集版本。
zh_hant: 指出這個參考是否指向某一組件的特定版本。

# NoZeroImpactProjects
source: Microsoft Visual F# does not support zero-impact projects. To create an F# project from this project template, either go to the Visual Studio menu 'Tools, Options..., Projects and Solutions, General' and check the box marked 'Save new projects when created', or specify <PromptForSaveOnCreation>true</PromptForSaveOnCreation> in the <TemplateData> section of this project template's .vstemplate file, and then retry this operation.
cs: Microsoft Visual F# nepodporuje projekty s nulovým dopadem. Pokud chcete z této šablony projektu vytvořit projekt F#, přejděte buď do nabídky Visual Studia Nástroje, Možnosti..., Projekty a řešení, Obecné a zaškrtněte políčko Uložit nové projekty při vytvoření, nebo v oddílu <TemplateData> souboru .vstemplate této šablony projektu zadejte <PromptForSaveOnCreation>true</PromptForSaveOnCreation> a potom to zkuste znovu.
de: Microsoft Visual F# unterstützt keine Projekte ohne Auswirkungen. Um von dieser Projektvorlage ein F#-Projekt zu erstellen, wählen Sie in Visual Studio "Tools" -> "Optionen" -> "Projekte und Projektmappen" -> "Allgemein" aus, und aktivieren Sie das Kontrollkästchen "Neue Projekte beim Erstellen speichern". Oder legen Sie in der VSTEMPLATE-Datei der Vorlage dieses Projekts im Abschnitt <TemplateData> <PromptForSaveOnCreation>true</PromptForSaveOnCreation> fest, und wiederholen Sie dann den Vorgang.
es: Microsoft Visual F# no admite proyectos con impacto cero. Para crear un proyecto de F# a partir de esta plantilla de proyecto, en Visual Studio vaya a "Herramientas, Opciones, Proyectos y soluciones, General" y active la casilla "Guardar nuevos proyectos al crearlos", o bien especifique <PromptForSaveOnCreation>true</PromptForSaveOnCreation> en la sección <TemplateData> del archivo .vstemplate de esta plantilla de proyecto e intente de nuevo esta operación.
fr: Microsoft Visual F# ne prend pas en charge les projets d'impact nul. Pour créer un projet F# à partir de ce modèle de projet, accédez au menu Visual Studio 'Outils, Options..., Projets et solutions, Général' et activez la case à cocher 'Enregistrer les nouveaux projets lors de leur création', ou spécifiez <PromptForSaveOnCreation>true</PromptForSaveOnCreation> dans la section <TemplateData> du fichier .vstemplate de ce modèle de projet, puis réessayez l'opération.
it: Microsoft Visual F# non supporta progetti a impatto zero. Per creare un progetto F# da questo modello di progetto, accedere alla scheda Generale di Progetti e soluzioni scegliendo Opzioni dal menu Strumenti di Visual Studio e selezionare la casella 'Salva nuovi progetti alla creazione' oppure specificare <PromptForSaveOnCreation>true</PromptForSaveOnCreation> nella sezione <TemplateData> del file con estensione vstemplate del progetto, quindi provare a eseguire di nuovo l'operazione.
ja: Microsoft Visual F# では、ゼロインパクトのプロジェクトをサポートしていません。F# プロジェクトをこのプロジェクト テンプレートから作成するには、Visual Studio メニューの [ツール] の [オプション] をクリックし、[プロジェクトおよびソリューション] の [全般] の [作成時に新しいプロジェクトを保存] チェック ボックスをオンにするか、またはプロジェクト テンプレートの .vstemplate ファイルの <TemplateData> セクションで <PromptForSaveOnCreation>true</PromptForSaveOnCreation> を指定し、この操作を再試行してください。
ko: Microsoft Visual F#은 영향 값이 0인 프로젝트를 지원하지 않습니다. 이 프로젝트 템플릿에서 F# 프로젝트를 만들려면 Visual Studio 메뉴 '도구, 옵션..., 프로젝트 및 솔루션, 일반'으로 이동하여 '만들어질 때 새 프로젝트 저장' 확인란을 선택하거나, 이 프로젝트 템플릿의 .vstemplate 파일에서 <TemplateData> 섹션에 <PromptForSaveOnCreation>true</PromptForSaveOnCreation>를 지정한 다음 이 작업을 다시 시도하세요.
pl: Język Microsoft Visual F# nie obsługuje projektów, których kompilowanie nie ma żadnych skutków. Aby utworzyć projekt języka F# na podstawie szablonu, otwórz menu programu Visual Studio, wybierz kolejno opcje „Narzędzia, Opcje..., Projekty i rozwiązania, Ogólne” i zaznacz pole wyboru „Zapisuj nowe projekty, gdy zostaną utworzone” lub w pliku .vstemplate szablonu umieść element <PromptForSaveOnCreation>true</PromptForSaveOnCreation> w sekcji <TemplateData>, a następnie ponów operację.
pt_br: Microsoft Visual F# não dá suporte a projetos de impacto zero. Para criar um projeto F# a partir deste modelo de projeto, vá até o menu 'Ferramentas, Opções..., Projetos e Soluções, Geral' do Visual Studio e marque a caixa 'Salvar novo projeto quando criado', ou especifique <PromptForSaveOnCreation>true</PromptForSaveOnCreation> na seção <TemplateData> deste modelo de projeto de arquivo .vstemplate e repita esta operação.
ru: Microsoft Visual F# не поддерживает проекты с нулевым влиянием. Чтобы создать проект F# из этого шаблона проекта, последовательно выберите в меню Visual Studio "Сервис" команды "Параметры", "Проекты и решения", "Общие", а затем установите флажок "Сохранять новые проекты в момент создания" либо укажите <PromptForSaveOnCreation>true</PromptForSaveOnCreation> в разделе <TemplateData> файла .vstemplate этого шаблона, а затем повторите операцию.
tr: Microsoft Visual F# sıfır etkili projeleri desteklemez. Bu proje şablonundan bir F# projesi oluşturmak için Visual Studio menüsü 'Araçlar, Seçenekler..., Projeler ve Çözümler, Genel' seçeneğine gidip 'Oluşturulduklarında yeni projeleri kaydet' yazan kutuyu işaretleyin veya bu proje şablonunun .vstemplate dosyasındaki <TemplateData> bölümünde <PromptForSaveOnCreation>true</PromptForSaveOnCreation> belirttikten sonra bu işlemi yeniden deneyin.
zh_hans: Microsoft Visual F# 不支持零影响项目。若要从此项目模板创建 F# 项目，可以依次转到 Visual Studio 菜单“工具”、“选项...”、“项目和解决方案”、“常规”，并选中标记为“创建时保存新项目”的框，或者在此项目模板的 .vstemplate 文件的 <TemplateData> 部分中指定 <PromptForSaveOnCreation>true</PromptForSaveOnCreation>，然后重试此操作。
zh_hant: Microsoft Visual F# 不支援零影響專案。若要從這個專案範本建立 F# 專案，您可以前往 Visual Studio 功能表 [工具]、[選項...]、[專案和方案]、[一般]，然後選取標記為 [建立時儲存新專案]，或在這個專案範本的 .vstemplate 檔案的 <TemplateData> 區段中指定 <PromptForSaveOnCreation>true</PromptForSaveOnCreation>，然後重試這項作業。

# NoWildcardsInProject
source: "Cannot open F# project '{0}'. \nThis project uses wildcards in item specification: \n'{2}' for item type '{1}'\n\nWildcards in F# projects are not currently supported.
cs: Projekt {0} jazyka F# nelze otevřít. \nTento projekt používá ve specifikaci položky zástupné znaky: \n{2} pro položku typu {1}.\n\nZástupné znaky nejsou v projektech jazyka F# momentálně podporované.
de: "Das F#-Projekt "{0}" kann nicht geöffnet werden. \nDieses Projekt verwendet Platzhalter in der Elementspezifikation: \n"{2}" für den Elementtyp "{1}"\n\nPlatzhalter in F#-Projekten werden derzeit nicht unterstützt.
es: "No se puede abrir el proyecto de F# "{0}". \nEste proyecto usa comodines en la especificación de elemento: \n"{2}" para el tipo de elemento "{1}"\n\nActualmente no se admiten comodines en los proyectos de F#.
fr: "Impossible d'ouvrir le projet F# '{0}'. \nCe projet utilise des caractères génériques dans la spécification des éléments : \n'{2}' pour le type d'élément '{1}'\n\nLes caractères génériques des projets F# ne sont pas pris en charge.
it: "Non è possibile aprire il progetto F# '{0}'. \nIl progetto usa caratteri jolly nella specifica di elemento: \n'{2}' per il tipo di elemento '{1}'\n\nI caratteri jolly non sono attualmente supportati nei progetti F#.
ja: "F# プロジェクト '{0}' を開けません。 \nこのプロジェクトでは、項目の指定にワイルドカードを使用します: \n'{2}' (対象の項目の種類 '{1}')\n\nF# プロジェクトでのワイルドカードの使用は現在サポートされていません。
ko: "F# 프로젝트 '{0}'을(를) 열 수 없습니다. \n이 프로젝트에서는 항목 지정에 와일드카드를 사용합니다. \n항목 종류 '{1}'에 대한 '{2}'\n\nF# 프로젝트에서는 현재 와일드카드를 지원하지 않습니다.
pl: „Nie można otworzyć projektu w języku F# „{0}”. \nTen projekt używa symboli wieloznacznych w specyfikacji elementu: \n„{2}” dla typu elementu „{1}”\n\nSymbole wieloznaczne nie są obecnie obsługiwane w projektach w języku F#.
pt_br: "Não é possível abrir o projeto F# '{0}'. \nEste projeto usa curingas na especificação do item: \n'{2}', para o tipo de item '{1}'\n\nOs curingas nos projetos F# não recebem suporte.
ru: "Не удается открыть проект F# "{0}". \nЭтот проект использует подстановочные знаки в спецификации элемента: \n"{2}" для элемента типа "{1}"\n\nВ проектах F# подстановочные знаки сейчас не поддерживаются.
tr: "'{0}' adlı F# projesi açılamıyor. \nBu proje, öğe belirtiminde joker karakterler kullanıyor: \n'{1}' öğe türü için '{2}'\n\nŞu anda F# projelerinde joker karakterler desteklenmiyor.
zh_hans: “无法打开 F# 项目“{0}”。\n此项目在项类型“{1}”的项目规范“{2}”中\n使用了通配符\n\n当前不支持在 F# 项目中使用通配符。
zh_hant: "無法開啟 F# 專案 '{0}'。\n此專案在項目規格中使用萬用字元: \n'{2}' (項目類型 '{1}')\n\nF# 專案中目前不支援萬用字元。

# CannotAddItemToProjectWithWildcards
source: "Cannot add file {3} to F# project '{0}'. \nThis project uses wildcards in item specification: \n'{2}' for item type '{1}'\n\nWildcards in F# projects are not currently supported.
cs: Do projektu {0} jazyka F# nelze přidat soubor {3}. \nTento projekt používá ve specifikaci položky zástupné znaky: \n{2} pro položku typu {1}.\n\nZástupné znaky nejsou v projektech jazyka F# momentálně podporované.
de: "Die Datei {3} kann dem F#-Projekt "{0}" nicht hinzugefügt werden. \nDieses Projekt verwendet Platzhalter in der Elementspezifikation: \n"{2}" für den Elementtyp "{1}"\n\nPlatzhalter in F#-Projekten werden derzeit nicht unterstützt.
es: "No se puede agregar el archivo {3} al proyecto de F# "{0}". \nEste proyecto usa comodines en la especificación de elemento: \n"{2}" para el tipo de elemento "{1}"\n\nActualmente no se admiten comodines en los proyectos de F#.
fr: "Impossible d'ajouter le fichier {3} au projet F# '{0}'. \nCe projet utilise des caractères génériques dans la spécification des éléments : \n'{2}' pour le type d'élément '{1}'\n\nLes caractères génériques des projets F# ne sont pas pris en charge.
it: "Non è possibile aggiungere il file {3} al progetto F# '{0}'. \nIl progetto usa caratteri jolly nella specifica di elemento: \n'{2}' per il tipo di elemento '{1}'\n\nI caratteri jolly non sono attualmente supportati nei progetti F#.
ja: "ファイル {3} を F# プロジェクト '{0}' に追加できません。 \nこのプロジェクトでは、項目の指定にワイルドカードを使用します: \n'{2}' (対象の項目の種類 '{1}')\n\nF# プロジェクトでのワイルドカードの使用は現在サポートされていません。
ko: "F# 프로젝트 '{0}'에 {3} 파일을 추가할 수 없습니다. \n이 프로젝트에서는 항목 지정에 와일드카드를 사용합니다. \n항목 종류 '{1}'에 대한 '{2}'\n\nF# 프로젝트에서는 현재 와일드카드를 지원하지 않습니다.
pl: „Nie można dodać pliku {3} do projektu w języku F# „{0}”. \nTen projekt używa symboli wieloznacznych w specyfikacji elementu: \n„{2}” dla typu elementu „{1}”\n\nSymbole wieloznaczne nie są obecnie obsługiwane w projektach w języku F#.
pt_br: "Não é possível adicionar o arquivo {3} ao projeto F# '{0}'. \nEste projeto usa curingas na especificação do item: \n'{2}', para o tipo de item '{1}'\n\nOs curingas nos projetos F# não recebem suporte.
ru: "Не удается добавить файл {3} в проект F# "{0}". \nЭтот проект использует подстановочные знаки в спецификации элемента: \n"{2}" для элемента типа "{1}"\n\nВ проектах F# подстановочные знаки сейчас не поддерживаются.
tr: "{3} dosyası '{0}' adlı F# projesine eklenemiyor. \nBu proje, öğe belirtiminde joker karakterler kullanıyor: \n'{1}' öğe türü için '{2}'\n\nŞu anda F# projelerinde joker karakterler desteklenmiyor.
zh_hans: “无法向 F# 项目“{0}”添加文件 {3}。\n此项目在项类型“{1}”的项目规范“{2}”中\n使用了通配符\n\n当前不支持在 F# 项目中使用通配符。
zh_hant: "無法新增檔案 {3} 至 F# 專案 '{0}'。\n此專案在項目規格中使用萬用字元: \n'{2}' (項目類型 '{1}')\n\nF# 專案中目前不支援萬用字元。
