Repository: dotnet/fsharp
Catalog: vsintegration/src/FSharp.ProjectSystem.*/xlf/Microsoft.VisualStudio.Package.Project.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# FileAlreadyExists
source: A file with the same name '{0}' already exists. Do you want to overwrite it?
cs: Soubor se stejným názvem {0} už existuje. Chcete ho přepsat?
de: Eine Datei mit demselben Namen "{0}" ist bereits vorhanden. Möchten Sie sie überschreiben?
es: Ya existe un archivo con el nombre '{0}'. ¿Desea sobrescribirlo?
fr: Un fichier portant le nom '{0}' existe déjà. Voulez-vous le remplacer ?
it: Un file con lo stesso nome '{0}' esiste già. Sovrascriverlo?
ja: 同じ名前 '{0}' のファイルが既に存在します。上書きしますか?
ko: 같은 이름 '{0}'을(를) 사용하는 파일이 이미 있습니다. 덮어쓰시겠습니까?
pl: Plik o nazwie „{0}” już istnieje. Czy chcesz go zastąpić?
pt_br: Já existe um arquivo com o nome '{0}'. Deseja substituí-lo?
ru: Файл с именем "{0}" уже существует в проекте. Заменить этот файл?
tr: '{0}' ile aynı adlı bir dosya zaten var. Üstüne yazmak ister misiniz?
zh_hans: 名为“{0}”的文件已存在。是否覆盖它?
zh_hant: 已經存在相同名稱 '{0}' 的檔案。您要覆寫它嗎?

# FileAlreadyExistsAndCannotBeRenamed
source: A file with the same name '{0}' already exists.
cs: Soubor se stejným názvem {0} už existuje.
de: Eine Datei mit demselben Namen "{0}" ist bereits vorhanden.
es: Ya existe un archivo con el nombre '{0}'.
fr: Un fichier portant le nom '{0}' existe déjà.
it: Un file con lo stesso nome '{0}' esiste già.
ja: 同じ名前 '{0}' のファイルが既に存在します。
ko: 같은 이름 '{0}'을(를) 사용하는 파일이 이미 있습니다.
pl: Plik o nazwie „{0}” już istnieje.
pt_br: Já existe um arquivo com o nome '{0}'.
ru: Файл с именем "{0}" уже существует в проекте.
tr: '{0}' ile aynı adlı bir dosya zaten var.
zh_hans: 名为“{0}”的文件已存在。
zh_hant: 已經存在相同名稱 '{0}' 的檔案。

# FileAlreadyExistsCaption
source: Destination File Exists
cs: Cílový soubor existuje.
de: Die Zieldatei ist bereits vorhanden.
es: El archivo de destino ya existe
fr: Le fichier de destination existe
it: File di destinazione esistente
ja: 対象ファイルが存在します
ko: 대상 파일 있음
pl: Plik docelowy istnieje
pt_br: Arquivo de Destino Existente
ru: Конечный файл существует
tr: Hedef Dosya Var
zh_hans: 目标文件已存在
zh_hant: 目的檔案已經存在

# FileAlreadyInProject
source: A file of this name is already part of the project. Do you want to overwrite it?
cs: Soubor s tímto názvem už je součástí projektu. Chcete ho přepsat?
de: Eine Datei mit diesem Namen ist bereits Teil des Projekts. Möchten Sie sie überschreiben?
es: Ya hay un archivo con este nombre en el proyecto. ¿Desea sobrescribirlo?
fr: Un fichier de ce nom fait déjà partie du projet. Voulez-vous le remplacer ?
it: Un file con questo nome fa già parte del progetto. Sovrascriverlo?
ja: この名前のファイルは既にプロジェクトの一部です。上書きしますか?
ko: 이름이 같은 파일이 이미 프로젝트에 포함되어 있습니다. 덮어쓰시겠습니까?
pl: Plik o tej nazwie jest już częścią projektu. Czy chcesz go zastąpić?
pt_br: Um arquivo com este nome já faz parte do projeto. Deseja substituí-lo?
ru: Файл с таким именем уже существует в проекте. Заменить этот файл?
tr: Bu ada sahip bir dosya zaten projenin parçası. Bu dosyanın üzerine yazmak istiyor musunuz?
zh_hans: 项目中已有同名的文件。是否覆盖?
zh_hant: 此名稱的檔案已經是專案的一部分。要覆寫嗎?

# FileAlreadyInProjectCaption
source: Destination File Exists
cs: Cílový soubor existuje.
de: Die Zieldatei ist bereits vorhanden.
es: El archivo de destino ya existe
fr: Le fichier de destination existe
it: File di destinazione esistente
ja: 対象ファイルが存在します
ko: 대상 파일 있음
pl: Plik docelowy istnieje
pt_br: Arquivo de Destino Existente
ru: Конечный файл существует
tr: Hedef Dosya Var
zh_hans: 目标文件已存在
zh_hant: 目的檔案已經存在

# FileCannotBeRenamedToAnExistingFile
source: A file or folder with the name '{0}' already exists on disk at this location. Please choose another name.
cs: Soubor nebo složka s názvem {0} už na disku v tomto umístění existuje. Zvolte prosím jiný název.
de: Auf dem Datenträger ist an diesem Speicherort bereits eine Datei oder ein Ordner mit dem Namen "{0}" vorhanden. Wählen Sie einen anderen Namen aus.
es: Ya existe un archivo o carpeta con el nombre '{0}' en el disco en esta ubicación. Elija otro nombre.
fr: Il existe déjà un fichier ou un dossier nommé '{0}' à cet emplacement sur le disque. Choisissez un autre nom.
it: In questo percorso sul disco esiste già un file o una cartella con il nome '{0}'. Selezionare un altro nome.
ja: {0}' という名前のファイルまたはフォルダーが、ディスク上のこの場所に既に存在します。別の名前を選択してください。
ko: 이름이 '{0}'인 파일 또는 폴더가 이 위치의 디스크에 이미 있습니다. 다른 이름을 선택하세요.
pl: Plik lub folder o nazwie „{0}” już istnieje na dysku w tej lokalizacji. Wybierz inną nazwę.
pt_br: Já existe um arquivo ou uma pasta com o nome '{0}' no disco neste local. Escolha outro nome.
ru: Файл или папка с именем "{0}" уже существует в данном расположении. Выберите другое имя.
tr: Diskte bu konumda '{0}' adlı bir dosya veya klasör zaten var. Lütfen başka bir ad seçin.
zh_hans: 磁盘上的此位置已经存在名为“{0}”的文件或文件夹。请选择其他名称。
zh_hant: 磁碟的這個位置已經有名稱為 '{0}' 的檔案或資料夾存在。請選擇其他名稱。

# FileCopyError
source: Error Copying File
cs: Chyba při kopírování souboru
de: Fehler beim Kopieren der Datei.
es: Error al copiar el archivo
fr: Erreur lors de la copie du fichier
it: Errore durante la copia del file
ja: ファイルのコピー エラー
ko: 파일 복사 오류
pl: Błąd podczas kopiowania pliku
pt_br: Erro ao Copiar Arquivo
ru: Ошибка при копировании файла
tr: Dosya Kopyalanırken Hata Oluştu
zh_hans: 复制文件时出错
zh_hant: 複製檔案時發生錯誤

source: File Name
cs: Název souboru
de: Dateiname
es: Nombre de archivo
fr: Nom de fichier
it: Nome file
ja: ファイル名
ko: 파일 이름
pl: Nazwa pliku
pt_br: Nome do Arquivo
ru: Имя файла
tr: Dosya Adı
zh_hans: 文件名
zh_hant: 檔案名稱

# FileNameCannotContainALeadingPeriod
source: File and folder names cannot contain a leading period.
cs: Názvy souborů a složek nemůžou obsahovat na první pozici tečku.
de: Datei- und Ordnernamen dürfen nicht mit einem Punkt beginnen.
es: Los nombres de archivo y de carpeta no pueden contener un punto inicial.
fr: Les noms de fichiers et de dossiers ne peuvent pas commencer par un point.
it: I nomi di file e di cartelle non possono iniziare con un punto.
ja: ファイル名とフォルダー名の先頭にピリオドを使用することはできません。
ko: 파일 및 폴더 이름의 맨 앞에는 마침표를 사용할 수 없습니다.
pl: Nazwy plików i folderów nie mogą zawierać kropki na początku.
pt_br: Os nomes de arquivo e pasta não podem conter um ponto à esquerda.
ru: Имена файлов и папок не могут начинаться с точки.
tr: Dosya ve klasör adları nokta ile başlayamaz.
zh_hans: 文件和文件夹名称不能包含前导句点。
zh_hant: 檔案和資料夾名稱不可以包含前置句號。

# FileNameDescription
source: The name of the file or folder
cs: Jméno souboru nebo složky
de: Der Name der Datei oder des Ordners.
es: Nombre del archivo o carpeta
fr: Nom du fichier ou dossier
it: Nome del file o della cartella
ja: ファイルまたはフォルダーの名前です
ko: 파일 또는 폴더의 이름
pl: Nazwa pliku lub folderu
pt_br: O nome do arquivo ou da pasta
ru: Имя файла или папки
tr: Dosya veya klasörün adı
zh_hans: 文件或文件夹的名称
zh_hant: 檔案或資料夾的名稱

source: Folder Name
cs: Název složky
de: Ordnername
es: Nombre de carpeta
fr: Nom du dossier
it: Nome cartella
ja: フォルダー名
ko: 폴더 이름
pl: Nazwa folderu
pt_br: Nome da Pasta
ru: Имя папки
tr: Klasör Adı
zh_hans: 文件夹名称
zh_hant: 資料夾名稱

# FolderNameDescription
source: Name of this folder
cs: Název této složky
de: Name dieses Ordners
es: Nombre de esta carpeta
fr: Nom de ce dossier
it: Nome della cartella corrente
ja: このフォルダーの名前
ko: 이 폴더의 이름
pl: Nazwa tego folderu
pt_br: O nome desta pasta
ru: Имя этой папки
tr: Bu klasörün adı
zh_hans: 此文件夹的名称
zh_hant: 此資料夾的名稱

source: Full Path
cs: Úplná cesta
de: Vollständiger Pfad
es: Ruta de acceso completa
fr: Chemin d'accès complet
it: Percorso completo
ja: 完全パス
ko: 전체 경로
pl: Pełna ścieżka
pt_br: Caminho Completo
ru: Полный путь
tr: Tam yol
zh_hans: 完整路径
zh_hant: 完整路徑

# FullPathDescription
source: Location of the file
cs: Umístění souboru
de: Dateiort
es: Ubicación del archivo
fr: Emplacement du fichier
it: Percorso del file
ja: ファイルの場所
ko: 파일 위치
pl: Lokalizacja pliku
pt_br: Local do arquivo
ru: Расположение файла
tr: Dosyanın konumu
zh_hans: 文件的位置
zh_hant: 檔案的位置

# ItemDoesNotExistInProjectDirectory
source: The item '{0}' does not exist in the project directory. It may have been moved, renamed or deleted.
cs: Položka {0} v adresáři projektu neexistuje. Pravděpodobně je přesunutá, přejmenovaná nebo smazaná.
de: Das Element "{0}" ist im Projektverzeichnis nicht vorhanden. Möglicherweise wurde es verschoben, umbenannt oder gelöscht.
es: El elemento '{0}' no existe en el directorio del proyecto. Puede que se haya movido, cambiado de nombre o eliminado.
fr: L'élément '{0}' n'existe pas dans le répertoire du projet. Il a peut-être été renommé, supprimé ou déplacé.
it: L'elemento '{0}' non è presente nella directory del progetto. È possibile che sia stato spostato, rinominato o eliminato.
ja: 項目 '{0}' はプロジェクト ディレクトリに存在しません。移動されたか、名前が変更されたか、または削除された可能性があります。
ko: 프로젝트 디렉터리에 '{0}' 항목이 없습니다. 파일이 이동되었거나 이름이 바뀌었거나 삭제되었습니다.
pl: Element „{0}” nie istnieje w katalogu projektu. Mógł zostać przeniesiony, usunięty lub zmieniono jego nazwę.
pt_br: O item '{0}' não existe no diretório do projeto. Ele pode ter sido movido, renomeado ou excluído.
ru: Элемент "{0}" не существует в каталоге проекта. Возможно, он был перемещен, переименован или удален.
tr: '{0}' öğesi proje dizininde yok. Taşınmış, yeniden adlandırılmış veya silinmiş olabilir.
zh_hans: 该项目目录中不存在项“{0}”。它可能已经被移动、重命名或者删除。
zh_hant: 項目 '{0}' 不存在專案目錄中。可能已經移動、重新命名或刪除。

# LinkedItemsAreNotSupported
source: Cannot save '{0}' outside the project directory. Linked items are not supported.
cs: Soubor {0} nejde uložit mimo adresář projektu. Propojené položky nejsou podporované.
de: {0}" kann nicht außerhalb des Projektverzeichnisses gespeichert werden. Verknüpfte Elemente werden nicht unterstützt.
es: No se puede guardar '{0}' fuera del directorio del proyecto. No se admiten elementos vinculados.
fr: Impossible d'enregistrer '{0}' en dehors du répertoire du projet. Les éléments liés ne sont pas pris en charge.
it: Non è possibile salvare '{0}' all'esterno della directory del progetto. Gli elementi collegati non sono supportati.
ja: '{0}' をプロジェクト ディレクトリの外部に保存できません。リンクされた項目はサポートされていません。
ko: 프로젝트 디렉터리 외부에 '{0}'을(를) 저장할 수 없습니다. 연결된 항목이 지원되지 않습니다.
pl: Nie można zapisać elementu „{0}” poza katalogiem projektu. Elementy połączone nie są obsługiwane.
pt_br: Não é possível salvar '{0}' fora do diretório do projeto. Os itens vinculados não são compatíveis.
ru: Невозможно сохранить "{0}" вне каталога проекта. Связанные элементы не поддерживаются.
tr: '{0}', proje dizininin dışına kaydedilemez. Bağlı öğeler desteklenmiyor.
zh_hans: 不能在项目目录外保存“{0}”。不支持链接的项。
zh_hant: 無法將 '{0}' 儲存在專案目錄外。不支援連結項目。

# Library
source: Class Library
cs: Knihovna tříd
de: Klassenbibliothek
es: Biblioteca de clases
fr: Bibliothèque de classes
it: Libreria di classi
ja: クラス ライブラリ
ko: 클래스 라이브러리
pl: Biblioteka klas
pt_br: Biblioteca de Classes
ru: Библиотека классов
tr: Sınıf Kitaplığı
zh_hans: 类库
zh_hant: 類別庫

source: Minimal
cs: minimální
es: Mínimo
it: Minima
ja: 最小
pl: minimalne
pt_br: Mínimo
zh_hans: 最少
zh_hant: 最小

source: Misc
cs: Různé
de: Verschiedene
es: Varios
fr: Divers
it: Varie
ja: その他
ko: 기타
pl: Różne
pt_br: Diversos
ru: Прочее
tr: Çeşitli
zh_hans: 杂项
zh_hant: 其他

source: None
cs: žádné
de: Keine
fr: Aucun(e)
it: Nessuno
ja: なし
pl: brak
pt_br: NENHUM
tr: yok
zh_hans: 没有
zh_hant: 無

source: Normal
cs: Normální
pl: Normalny
zh_hans: 一般

# PasteFailed
source: Item is not available or corrupted and thus cannot be pasted.
cs: Položka není dostupná nebo je porušená, a proto se nedá vložit.
de: Das Element ist nicht verfügbar oder beschädigt und kann deshalb nicht eingefügt werden.
es: El elemento no está disponible o está dañado y, por tanto, no se puede pegar.
fr: L'élément n'est pas disponible ou est endommagé et ne peut pas être collé.
it: L'elemento non è disponibile o è danneggiato, pertanto non può essere incollato.
ja: 項目は使用できないか破損しているため、貼り付けることができません。
ko: 항목을 사용할 수 없거나 항목이 손상되어 붙여 넣을 수 없습니다.
pl: Element jest niedostępny lub uszkodzony i nie można go wkleić.
pt_br: O item não está disponível ou está corrompido e, portanto, não pode ser colado.
ru: Элемент не может быть вставлен, так как недоступен или поврежден.
tr: Öğe kullanılamıyor veya bozuk ve bu nedenle yapıştırılamaz.
zh_hans: 项不可用或者已损坏，因此无法粘贴。
zh_hant: 項目無法使用或已經損毀，所以無法貼上。

source: Project
cs: Projekt
de: Projekt
es: Proyecto
fr: Projet
it: PROGETTO
ja: プロジェクト
ko: 프로젝트
pl: Projekt
pt_br: Projeto
ru: Проект
tr: PROJE
zh_hant: 專案

# ProjectContainsCircularReferences
source: A reference to library '{0}' cannot be added. Adding this project as a reference would cause a circular dependency.
cs: Odkaz na knihovnu {0} se nedá přidat. Přidání tohoto projektu jako odkazu způsobí kruhovou závislost.
de: Ein Verweis auf die Bibliothek '{0}' kann nicht hinzugefügt werden. Das Hinzufügen dieses Projekts als Verweis würde eine Ringabhängigkeit verursachen.
es: No se puede agregar una referencia a la biblioteca '{0}'. Si se agrega este proyecto como una referencia, daría lugar a una dependencia circular.
fr: Impossible d'ajouter une référence à la bibliothèque '{0}'. L'ajout de ce projet en tant que référence créerait une dépendance circulaire.
it: Non è possibile aggiungere un riferimento alla libreria '{0}'. L'aggiunta di questo progetto come riferimento genera una dipendenza circolare.
ja: ライブラリ '{0}' への参照を追加できません。このプロジェクトを参照として追加すると、循環する依存関係が発生します。
ko: '{0}' 라이브러리에 대한 참조를 추가할 수 없습니다. 이 프로젝트를 참조로 추가하면 순환 종속성이 발생할 수 있습니다.
pl: Nie można dodać odwołania do biblioteki „{0}”. Dodanie tego projektu jako odwołania spowoduje utworzenie zależności cyklicznej.
pt_br: Uma referência à biblioteca '{0}' não pode ser adicionada. A inserção deste projeto como uma referência pode causar uma dependência circular.
ru: Невозможно добавить ссылку на библиотеку "{0}". Добавление этого проекта в виде ссылки может образовать циклическую зависимость.
tr: '{0}' kitaplığına başvuru eklenemiyor. Bu projeyi başvuru olarak eklemek döngüsel bağımlılığa neden olur.
zh_hans: 无法添加对库“{0}”的引用。将此项目添加为引用将导致循环依赖关系。
zh_hant: 無法加入程式庫 '{0}' 的參考。以參考方式加入此專案將導致循環相依性。

source: Project File
cs: Soubor projektu
de: Projektdatei
es: Archivo de proyecto
fr: Fichier projet
it: File di progetto
ja: プロジェクト ファイル
ko: 프로젝트 파일
pl: Plik projektu
pt_br: Arquivo de Projeto
ru: Файл проекта
tr: Proje dosyası
zh_hans: 项目文件
zh_hant: 專案檔

# ProjectFileDescription
source: The name of the file containing build, configuration, and other information about the project.
cs: Název souboru, který obsahuje sestavení, konfiguraci a informace o projektu
de: Der Name der Datei mit den Build-, Konfigurations- und anderen Informationen zum Projekt.
es: Nombre del archivo que contiene la información de compilación, configuración y otros datos sobre el proyecto.
fr: Nom du fichier contenant la build, la configuration et d'autres informations sur le projet.
it: Nome del file contenente le informazioni sul progetto relative alla compilazione, alla configurazione e altro.
ja: プロジェクトのビルド、構成、およびその他の情報を含むファイルの名前です。
ko: 빌드, 구성 및 기타 프로젝트 정보가 들어 있는 파일의 이름입니다.
pl: Nazwa pliku zawierającego kompilację, konfigurację i informacje o projekcie.
pt_br: O nome do arquivo que contém a compilação, a configuração e outras informações sobre o projeto.
ru: Имя файла, содержащего сведения о сборке и конфигурации, а также другую информацию о проекте.
tr: Derleme, yapılandırma ve proje ile ilgili diğer bilgileri içeren dosyanın adı.
zh_hans: 包含有关项目的生成、配置和其他信息的文件的名称。
zh_hant: 包含組建、組態以及其他專案相關資訊之檔案的名稱。

source: Project Folder
cs: Složka projektu
de: Projektordner
es: Carpeta del proyecto
fr: Dossier du projet
it: Cartella di progetto
ja: プロジェクト フォルダー
ko: 프로젝트 폴더
pl: Folder projektu
pt_br: Pasta do Projeto
ru: Папка проекта
tr: Proje Klasörü
zh_hans: 项目文件夹
zh_hant: 專案資料夾

# ProjectFolderDescription
source: The absolute location of the project.
cs: Absolutní umístění projektu
de: Der absolute Speicherort des Projekts.
es: Ubicación absoluta del proyecto.
fr: Emplacement absolu du projet.
it: Percorso assoluto del progetto.
ja: プロジェクトの保存場所です。絶対パスで指定されます。
ko: 프로젝트의 절대 위치입니다.
pl: Lokalizacja bezwzględna projektu.
pt_br: Localização absoluta do projeto.
ru: Абсолютный путь к расположению проекта.
tr: Projenin mutlak konumu.
zh_hans: 项目的绝对位置。
zh_hant: 專案的絕對位置。

source: Quiet
cs: Žádný
de: Still
es: No interactivo
fr: Silencieux
it: Non interattiva
ja: 非表示
ko: 최소
pl: Cichy
pt_br: Silencioso
ru: Тихий
tr: Sessiz
zh_hans: 安静
zh_hant: 無訊息

# RefName
source: (Name)
cs: (Název)
es: (Nombre)
fr: (Nom)
it: (Nome)
ja: (名前)
ko: (이름)
pl: (Nazwa)
pt_br: (Nome)
ru: (Имя)
tr: (Ad)
zh_hans: (名称)
zh_hant: (名稱)

# ReferencesNodeName
source: References
cs: Odkazy
de: Verweise
es: Referencias
fr: Références
it: Riferimenti
ja: 参照設定
ko: 참조
pl: Odwołania
pt_br: Referências
ru: Ссылки
tr: Başvurular
zh_hans: 引用
zh_hant: 參考

# RefNameDescription
source: Display name of the reference
cs: Zobrazit název odkazu
de: Anzeigename des Verweises
es: Nombre para mostrar de la referencia
fr: Nom complet de la référence
it: Nome visualizzato del riferimento
ja: 参照の表示名です
ko: 참조의 표시 이름입니다.
pl: Nazwa wyświetlana odwołania
pt_br: Nome de exibição da referência
ru: Отобразить имя ссылки
tr: Başvurunun görünen adı
zh_hans: 引用的显示名称
zh_hant: 參考的顯示名稱

# RenameFolder
source: Rename directory failed. {0}
cs: Chyba přejmenování adresáře. {0}
de: Fehler beim Umbenennen des Verzeichnisses. {0}
es: No se pudo cambiar el nombre del directorio. {0}
fr: Impossible de renommer le répertoire. {0}
it: Non è stato possibile rinominare la directory. {0}
ja: ディレクトリ名を変更できませんでした。{0}
ko: 디렉터리 이름을 바꾸지 못했습니다. {0}
pl: Nie udało się zmienić nazwy katalogu. {0}
pt_br: Falha ao renomear o diretório. {0}
ru: Не удалось переименовать каталог. {0}
tr: Dizini yeniden adlandırmada hata. {0}
zh_hans: 重命名目录失败。{0}
zh_hant: 重新命名目錄失敗。{0}

# SaveCaption
source: Save?
cs: Uložit?
de: Speichern?
es: ¿Desea guardar?
fr: Enregistrer ?
it: Salvare?
ja: 保存しますか?
ko: 저장하시겠습니까?
pl: Czy zapisać?
pt_br: Salvar?
ru: Сохранить?
tr: Kaydedilsin mi?
zh_hans: 是否保存?
zh_hant: 儲存嗎?

# SaveModifiedDocuments
source: Do you want to save modified documents?
cs: Chcete uložit změněné dokumenty?
de: Möchten Sie geänderte Dokumente speichern?
es: ¿Desea guardar los documentos modificados?
fr: Voulez-vous enregistrer les documents modifiés ?
it: Salvare i documenti modificati?
ja: 変更されたドキュメントを保存しますか?
ko: 수정된 문서를 저장하시겠습니까?
pl: Czy chcesz zapisać zmodyfikowane dokumenty?
pt_br: Deseja salvar os documentos modificados?
ru: Сохранить измененные документы?
tr: Değiştirilmiş belgeleri kaydetmek istiyor musunuz?
zh_hans: 是否保存修改的文档?
zh_hant: 您要儲存修改過的文件嗎?

# SaveOfProjectFileOutsideCurrentDirectory
source: The project file can only be saved into the project location '{0}'.
cs: Soubor projektu se dá uložit jenom do umístění projektu {0}.
de: Die Projektdatei kann nur am Projektspeicherort "{0}" gespeichert werden.
es: El archivo de proyecto sólo se puede guardar en la ubicación del proyecto '{0}'.
fr: Le fichier projet ne peut être enregistré que dans l'emplacement du projet '{0}'.
it: Il file di progetto può essere salvato solo nel percorso del progetto '{0}'.
ja: プロジェクト ファイルはプロジェクトの場所 '{0}' にのみ保存できます。
ko: 프로젝트 파일은 프로젝트 위치 '{0}'에만 저장할 수 있습니다.
pl: Plik projektu może zostać zapisany tylko w lokalizacji projektu „{0}”.
pt_br: O arquivo de projeto só pode ser salvo no local do projeto '{0}'.
ru: Файл проекта можно сохранить только в его папку "{0}".
tr: Bu proje dosyası sadece '{0}' proje konumuna kaydedilebilir.
zh_hans: 项目文件只能保存到项目位置“{0}”。
zh_hant: 專案檔只能儲存至專案位置 '{0}'。

# StandardEditorViewError
source: Error opening specified view '{0}' using standard editor.
cs: Chyba při otevírání zadaného zobrazení {0} pomocí standardního editoru
de: Fehler beim Öffnen der angegebenen Ansicht "{0}" unter Verwendung des Standard-Editors.
es: Error al abrir la vista '{0}' especificada con el editor estándar.
fr: Erreur lors de l'ouverture de la vue '{0}' spécifiée à l'aide de l'éditeur standard.
it: Errore durante l'apertura della visualizzazione specificata '{0}' utilizzando l'editor standard.
ja: 指定されたビュー '{0}' を標準のエディターで開くときにエラーが発生しました。
ko: 표준 편집기를 사용하여 지정한 뷰 '{0}'을(를) 여는 동안 오류가 발생했습니다.
pl: Wystąpił błąd podczas otwierania określonego widoku „{0}” przy użyciu standardowego edytora.
pt_br: Erro ao abrir a exibição especificada '{0}' usando o editor padrão.
ru: Обнаружена ошибка при открытии указанного представления "{0}" в стандартном редакторе.
tr: Belirtilen '{0}' görünümünün standart düzenleyiciyi kullanarak açılmasında hata oluştu.
zh_hans: 使用标准编辑器打开指定的视图“{0}”时出错。
zh_hant: 使用標準編輯器開啟指定的檢視 '{0}' 時發生錯誤。

source: URL
cs: Adresa URL
pl: Adres URL
ru: URL-адрес

# UseOfDeletedItemError
source: You are trying to use an item that has already been deleted or that does not exist.
cs: Pokoušíte se použít položku, která už je smazaná nebo neexistuje.
de: Sie versuchen, ein Element zu verwenden, das bereits gelöscht wurde oder nicht vorhanden ist.
es: Está intentando usar un elemento que se eliminó o no existe.
fr: Vous essayez d'utiliser un élément qui a déjà été supprimé ou qui n'existe pas.
it: Si sta tentando di usare un elemento che è già stato eliminato o che non esiste.
ja: 使用しようとしている項目は既に削除されているか存在しません。
ko: 이미 삭제되었거나 존재하지 않는 항목을 사용하려고 했습니다.
pl: Próbujesz użyć elementu, który został już usunięty lub nie istnieje.
pt_br: Você está tentando usar um item que já foi excluído ou que não existe.
ru: Этот элемент удален или не существует и поэтому недоступен.
tr: Önceden silinmiş olan veya var olmayan bir öğeyi kullanmaya çalışıyorsunuz.
zh_hans: 您尝试使用已删除或者不存在的项。
zh_hant: 您嘗試使用的項目已遭到刪除或不存在。

# v1
source: Microsoft .Net Framework v1.0
it: Microsoft .Net Framework versione 1.0
pl: Microsoft .Net Framework 1.0
ru: Microsoft .Net Framework, версия 1.0

# v11
source: Microsoft .Net Framework v1.1
it: Microsoft .Net Framework versione 1.1
pl: Microsoft .Net Framework 1.1
ru: Microsoft .Net Framework, версия 1.1

# v2
source: Microsoft .Net Framework v2.0
it: Microsoft .Net Framework versione 2.0
pl: Microsoft .Net Framework 2.0
ru: Microsoft .Net Framework, версия 2.0

source: warning
cs: Upozornění
de: Warnung
es: advertencia
fr: Avertissement
it: avviso
ja: 警告
ko: 경고
pl: ostrzeżenie
pt_br: Aviso
ru: Предупреждение
tr: Uyarı
zh_hans: 警告
zh_hant: 警告

# WinExe
source: Windows Application
cs: Aplikace systému Windows
de: Windows-Anwendung
es: Aplicación Windows
fr: Application Windows
it: Applicazione Windows
ja: Windows アプリケーション
ko: Windows 애플리케이션
pl: Aplikacja systemu Windows
pt_br: Aplicativo do Windows
ru: Приложение Windows
tr: Windows Uygulaması
zh_hans: Windows 应用程序
zh_hant: Windows 應用程式

# InvalidAutomationObject
source: Automation object invalid.
cs: Automatizační objekt je neplatný.
de: Das Automatisierungsobjekt ist ungültig.
es: Objeto de Automation no válido.
fr: Objet Automation non valide.
it: Oggetto di automazione non valido.
ja: オートメーション オブジェクトが無効です。
ko: 자동화 개체가 잘못되었습니다.
pl: Nieprawidłowy obiekt automatyzacji.
pt_br: Objeto de automação inválido.
ru: Недопустимый объект автоматизации.
tr: Otomasyon nesnesi geçersiz.
zh_hans: 自动化对象无效。
zh_hant: Automation 物件無效。
