Repository: dotnet/fsharp
Catalog: vsintegration/src/FSharp.ProjectSystem.*/xlf/Microsoft.VisualStudio.Package.Project.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AddToNullProjectError
source: Failed to add file '{0}' to project as project is null.
cs: Přidání souboru {0} do projektu se nepovedlo, protože projekt neexistuje.
de: Fehler beim Hinzufügen von Datei "{0}" zum Projekt, da das Projekt NULL ist.
es: No se pudo agregar el archivo '{0}' al proyecto porque el proyecto es nulo.
fr: Impossible d'ajouter le fichier '{0}' au projet car le projet est Null.
it: Non è stato possibile aggiungere il file '{0}' al progetto perché il progetto è Null.
ja: プロジェクトが null のため、ファイル '{0}' をプロジェクトに追加できませんでした。
ko: 프로젝트가 null이므로 '{0}' 파일을 프로젝트에 추가하지 못했습니다.
pl: Nie można dodać pliku „{0}” do projektu, ponieważ projekt ma wartość null.
pt_br: Falha ao adicionar o arquivo '{0}' ao projeto porque o projeto é nulo.
ru: Невозможно добавить в проект файл "{0}", так как проект указан как null.
tr: Proje null olduğundan '{0}' dosyası projeye eklenemedi.
zh_hans: 向项目添加文件“{0}”失败，因为项目为 null。
zh_hant: 無法將檔案 '{0}' 加入專案，因為專案是 null。

source: Advanced
cs: Upřesnit
de: Erweitert
es: Opciones avanzadas
fr: Avancé
it: Avanzate
ja: 詳細
ko: 고급
pl: Zaawansowane
pt_br: Avançado
ru: Дополнительный
tr: Gelişmiş
zh_hans: 高级
zh_hant: 進階

# ReferenceCouldNotBeAdded
source: A reference to '{0}' could not be added.
cs: Odkaz na {0} se nedal přidat.
de: Ein Verweis auf "{0}" konnte nicht hinzugefügt werden.
es: No se pudo agregar una referencia a '{0}'.
fr: Une référence à '{0}' n'a pas pu être ajoutée.
it: Non è stato possibile aggiungere un riferimento a '{0}'.
ja: '{0}' への参照を追加できませんでした。
ko: '{0}'에 대한 참조를 추가하지 못했습니다.
pl: Nie można dodać odwołania do elementu „{0}”.
pt_br: Não foi possível adicionar uma referência para'{0}'.
ru: Не удалось добавить ссылку на "{0}".
tr: '{0}' için bir başvuru eklenemedi.
zh_hans: 无法添加对“{0}”的引用。
zh_hant: 無法加入對 '{0}' 的參考。

# ReferenceAlreadyExists
source: A reference to '{0}' could not be added. A reference to the component '{1}' already exists in the project.
cs: Odkaz na {0} se nedal přidat. Odkaz na komponentu {1} už v projektu existuje.
de: Es konnte kein Verweis auf "{0}" hinzugefügt werden. Ein Verweis auf die Komponente "{1}" ist bereits im Projekt vorhanden.
es: No se puedo agregar una referencia a '{0}'. Ya existe una referencia al componente '{1}' en el proyecto.
fr: Impossible d'ajouter une référence à '{0}'. Une référence au composant '{1}' existe déjà dans le projet.
it: Non è stato possibile aggiungere un riferimento a '{0}'. Il progetto contiene già un riferimento al componente '{1}'.
ja: {0}' への参照を追加できませんでした。コンポーネント '{1}' への参照は、プロジェクトに既に存在します。
ko: {0}'에 대한 참조를 추가할 수 없습니다. '{1}' 구성 요소에 대한 참조가 프로젝트에 이미 있습니다.
pl: Nie można dodać odwołania do „{0}”. Odwołanie do składnika „{1}” istnieje już w projekcie.
pt_br: A referência para '{0}' não foi adicionada. A referência para o componente '{1}' já existe no projeto.
ru: Не удается добавить ссылку на "{0}". Ссылка на компонент "{1}" уже присутствует в данном проекте.
tr: {0}' başvurusu eklenemedi. Projede '{1}' bileşenine başvuru zaten var.
zh_hans: 未能添加对“{0}”的引用。项目中已存在对组件“{1}”的引用。
zh_hant: 無法加入 '{0}' 的參考。至 '{1}' 元件的參考已經存在於專案中

# ReferenceWithAssemblyNameAlreadyExists
source: A reference to '{0}' (with assembly name '{1}') could not be added. A reference to the component '{2}' with the same assembly name already exists in the project.
cs: Odkaz na {0} (s názvem sestavení {1}) se nedal přidat. Odkaz na komponentu {2} se stejným názvem sestavení už v projektu existuje.
de: Ein Verweis auf "{0}" (mit dem Assemblynamen "{1}") konnte nicht hinzugefügt werden. Im Projekt ist bereits ein Verweis auf die Komponente "{2}" mit dem gleichen Assemblynamen vorhanden.
es: No se puede agregar una referencia a '{0}' (con el nombre de ensamblado '{1}'). Ya existe en el proyecto una referencia al componente '{2}' con el mismo nombre del ensamblado.
fr: Impossible d'ajouter une référence à '{0}' (avec le nom d'assembly '{1}'). Une référence au composant '{2}' avec le même nom d'assembly existe déjà dans le projet.
it: Non è stato possibile aggiungere un riferimento a '{0}' (con nome assembly '{1}'). Nel progetto esiste già un riferimento al componente '{2}' con lo stesso nome assembly.
ja: {0}' への参照 (アセンブリ名 '{1}') を追加できませんでした。同じアセンブリ名を持つコンポーネント '{2}' が、プロジェクトに既に存在します。
ko: {0}'(어셈블리 이름 '{1}')에 대한 참조를 추가하지 못했습니다. 프로젝트에 같은 어셈블리 이름을 갖는 구성 요소 '{2}'에 대한 참조가 이미 있습니다.
pl: Nie można dodać odwołania do „{0}” (z nazwą zestawu „{1}”). Odwołanie do składnika „{2}” o tej samej nazwie zestawu już istnieje w projekcie.
pt_br: Uma referência para '{0}' (com nome de assembly '{1}') não pôde ser adicionado. Uma referência para o componente '{2}' com o mesmo nome assembly já existe no projeto.
ru: Не удалось добавить ссылку на "{0}" (с именем сборки "{1}"). Ссылка на компонент "{2}" с таким именем сборки уже существует в данном проекте.
tr: {0}' başvurusu ('{1}' bütünleştirilmiş kod adlı) eklenemedi. Aynı bütünleştirilmiş kod adıyla '{2}' bileşenine başvuru projede zaten var.
zh_hans: 无法添加对“{0}”(程序集名称为“{1}”)的引用。项目中已存在对具有相同程序集名称的组件“{2}”的引用。
zh_hant: 無法加入 '{0}' (組入名稱為 '{1}') 的參考。此專案中已經有相同組件名稱之元件 '{2}' 的參考。

# AttributeLoad
source: Could not load attribute '{0}' from project file '{1}'.
cs: Nejde nahrát atribut {0} ze souboru projektu {1}.
de: Attribut "{0}" konnte nicht aus Projektdatei "{1}" geladen werden.
es: No se pudo cargar el atributo '{0}' del archivo de proyecto '{1}'.
fr: Impossible de charger l'attribut '{0}' à partir du fichier projet '{1}'.
it: Non è stato possibile caricare l'attributo '{0}' dal file di progetto '{1}'.
ja: プロジェクト ファイル '{1}' から属性 '{0}' を読み込めませんでした。
ko: 프로젝트 파일 '{1}'에서 '{0}' 특성을 로드할 수 없습니다.
pl: Nie można załadować atrybutu „{0}” z pliku projektu „{1}”.
pt_br: Não foi possível carregar o atributo '{0}' do arquivo de projeto '{1}'.
ru: Не удалось загрузить атрибут "{0}" из файла проекта "{1}".
tr: {0}' özniteliği '{1}' proje dosyasından yüklenemedi.
zh_hans: 无法从项目文件“{1}”加载属性“{0}”。
zh_hant: 無法從專案檔 '{1}' 載入屬性 '{0}'。

source: Build Action
cs: Akce sestavení
de: Buildvorgang
es: Acción de compilación
fr: Action de génération
it: Azione di compilazione
ja: ビルド アクション
ko: 빌드 작업
pl: Akcja kompilacji
pt_br: Ação de compilação
ru: Действие сборки
tr: Derleme Eylemi
zh_hans: 生成操作
zh_hant: 建置動作

# BuildActionDescription
source: How the file relates to the build and deployment process
cs: Jaký je vztah souboru k procesu sestavení a nasazení
de: Wie sich die Datei auf den Build- und Bereitstellungsprozess bezieht
es: Relación del archivo con el proceso de compilación e implementación
fr: Description de la relation entre le fichier, la build et le processus de déploiement
it: Descrizione della relazione tra il file e i processi di compilazione e distribuzione
ja: ビルドおよび配置のプロセスにファイルがどのように関連しているかを示します
ko: 파일이 빌드 및 배포 프로세스와 연결되는 방법입니다.
pl: Sposób, w jaki plik jest związany z procesem kompilacji i wdrażania
pt_br: Como o arquivo se relaciona à compilação e ao processo de implantação
ru: Роль этого файла в процессе построения и развертывания
tr: Dosya derleme ve dağıtım işlemlerine nasıl ilişkilendiriliyor
zh_hans: 文件与生成和部署过程的关联方式
zh_hant: 檔案與組建和部署處理關聯的方式

# BuildVerbosity
source: Verbosity
cs: Podrobnosti
de: Ausführlichkeit
es: Nivel de detalle
fr: Commentaires
it: Livello di dettaglio
ja: 詳細
ko: 자세한 정도
pl: Poziom szczegółowości
pt_br: Detalhamento
ru: Уровень детализации
tr: Ayrıntı
zh_hans: 详细信息
zh_hant: 詳細資訊

# BuildVerbosityDescription
source: Specify how much information is included in the build output
cs: Určete, kolik informací je zahrnuto ve výstupu sestavení
de: Geben Sie an, wie viele Informationen in der Buildausgabe enthalten sein sollen.
es: Especifique la información que se incluirá en el resultado de la compilación.
fr: Indique les informations incluses dans la sortie de génération
it: Specificare la quantità di informazioni incluse nell'output di compilazione
ja: ビルド出力に含まれる情報の量を指定します
ko: 빌드 출력에 포함할 정보의 양을 지정합니다.
pl: Określ, ile informacji ma być uwzględnionych w danych wyjściowych kompilacji
pt_br: Especificar quantas informações são incluídas na saída da compilação
ru: Объем сведений, включаемых в выходные данные сборки
tr: Derleme çıktısında ne kadar bilgi bulunduğunu belirtin
zh_hans: 指定生成输出中包含多少信息
zh_hant: 指定組建輸出中要包含多少資訊

# cli1
source: ECMA-335 CLI compatible framework (location must be provided)
cs: Rozhraní kompatibilní se standardem ECMA-335 pro rozhraní CLI (musí být zadané umístění)
de: ECMA-335 CLI-kompatibles Framework (Ort muss angegeben werden)
es: Versión de .NET Framework compatible con ECMA-335 CLI (se debe proporcionar la ubicación)
fr: Framework compatible ECMA-335 CLI (emplacement doit être fourni)
it: Framework compatibile con lo standard ECMA-335 CLI (è necessario fornire il percorso)
ja: ECMA-335 CLI 互換フレームワーク (場所の指定が必要)
ko: ECMA-335 CLI 호환 프레임워크(위치를 지정해야 함)
pl: Platforma zgodna z ECMA-335 CLI (należy podać lokalizację)
pt_br: Estrutura compatível com a CLI da ECMA-335 (a localização deve ser fornecida)
ru: ECMA-335 CLI-совместимая инфраструктура (следует указать расположение)
tr: ECMA-335 CLI uyumlu Framework (konum sağlanmalıdır)
zh_hans: ECMA-335 CLI 兼容框架(必须提供位置)
zh_hant: ECMA-335 CLI 相容架構 (必須提供位置)

source: Compile
cs: Kompilovat
de: Kompilieren
es: Compilar
fr: Compiler
it: Compilazione
ja: コンパイル
ko: 컴파일
pl: Kompiluj
pt_br: Compilar
ru: Компиляция
tr: Derle
zh_hans: 编译
zh_hant: 編譯

# ConfirmExtensionChange
source: If you change a file name extension, the file may become unusable. Are you sure you want to change it?
cs: Pokud změníte příponu souboru, může se stát, že bude soubor nepoužitelný. Opravdu ji chcete změnit?
de: Wenn Sie eine Dateinamenerweiterung ändern, wird die Datei möglicherweise unbrauchbar. Möchten Sie sie ändern?
es: Si cambia la extensión de nombre de archivo, el archivo puede quedar inutilizable. ¿Está seguro de que desea cambiarla?
fr: Si vous changez l'extension d'un nom de fichier, le fichier risque de devenir inutilisable. Voulez-vous vraiment la modifier ?
it: Se si modifica un'estensione di file, il file potrebbe diventare inutilizzabile. Modificarla?
ja: ファイル名の拡張子を変更すると、ファイルが使用できなくなる可能性があります。変更しますか?
ko: 확장명을 바꾸면 파일을 사용할 수 없게 될 수도 있습니다. 확장명을 바꾸시겠습니까?
pl: Zmiana rozszerzenia nazwy pliku może spowodować, że plik stanie się bezużyteczny. Czy na pewno chcesz je zmienić?
pt_br: Se você alterar a extensão de nome de um arquivo, ele poderá se tornar inutilizável. Tem certeza de que deseja alterá-la?
ru: Смена расширения имени файла может помешать дальнейшей работе с ним. Изменить расширение?
tr: Dosya adı uzantısını değiştirirseniz dosya kullanılamayabilir. Değiştirmek istediğinizden emin misiniz?
zh_hans: 如果更改文件扩展名，则该文件可能无法使用。是否确实要更改它?
zh_hant: 如果變更副檔名，檔案可能變成無法使用。確定要變更嗎?

# CannotAddFileThatIsOpenInEditor
source: A file with name '{0}' already exists and is open in an editor. Please give a unique name to the item you are adding, or delete the existing item first.
cs: Soubor s názvem {0} už existuje a je otevřený v editoru. Položce, kterou přidáváte, dejte jedinečný název, nebo nejdřív odstraňte stávající položku.
de: Eine Datei mit dem Namen "{0}" ist bereits vorhanden und in einem Editor geöffnet. Geben Sie dem Element, das hinzugefügt wird, einen eindeutigen Namen, oder löschen Sie zuerst das vorhandene Element.
es: Ya existe un archivo con el nombre '{0}' y está abierto en el editor. Dé un nombre único al elemento que va a agregar o elimine primero el elemento existente.
fr: Un fichier portant le nom '{0}' existe déjà et est ouvert dans un éditeur. Attribuez un nom unique à l'élément que vous ajoutez ou supprimez au préalable l'élément existant.
it: Un file con il nome '{0}' esiste già ed è aperto in un editor. Assegnare un nome univoco all'elemento che si sta aggiungendo o eliminare l'elemento esistente.
ja: '{0}' という名前のファイルは既に存在し、エディターで開かれています。追加しようとしている項目に一意の名前を指定するか、最初に既存の項目を削除してください。
ko: 이름이 '{0}'인 파일이 이미 있으며 편집기에 열려 있습니다. 추가할 항목에 고유한 이름을 지정하거나 먼저 기존 항목을 삭제하세요.
pl: Plik o nazwie „{0}” już istnieje i jest otwarty w edytorze. Nadaj unikatową nazwę dodawanemu elementowi lub usuń najpierw istniejący element.
pt_br: Um arquivo com o nome '{0}' já existe e está aberto em um editor. Dê um nome exclusivo ao item que você está adicionando ou exclua o item existente primeiro.
ru: Файл с именем "{0}" уже существует и открыт в редакторе. Присвойте добавляемому элементу уникальное имя или сначала удалите существующий элемент.
tr: '{0}' adlı bir dosya zaten var ve bir düzenleyicide açık. Lütfen eklemekte olduğunuz öğeye benzersiz bir ad verin veya önce var olan öğeyi silin.
zh_hans: 名为“{0}”的文件已经存在，而且已在编辑器中打开。请为要添加的项指定唯一名称，或者先删除现有项。
zh_hant: 已經有名稱為 '{0}' 的檔案，而且已經在編輯器中開啟。請為所要加入的項目指定唯一的名稱，或者先刪除現有的同名項目。

# CanNotSaveFileNotOpeneInEditor
source: Cannot save '{0}' as it is not open in the editor.
cs: Soubor {0} se nedá uložit, protože není otevřený v editoru.
de: {0} kann nicht gespeichert werden, da sie nicht im Editor geöffnet ist.
es: No se puede guardar '{0}' mientras no esté abierto en el editor.
fr: Impossible d'enregistrer '{0}', car il n'est pas ouvert dans l'éditeur.
it: Non è possibile salvare '{0}' perché non è aperto nell'editor.
ja: '{0}' はエディターで開かれていないため、保存できません。
ko: '{0}'은(는) 편집기에 열려 있지 않으므로 저장할 수 없습니다.
pl: Nie można zapisać pliku „{0}”, ponieważ nie jest on otwarty w edytorze.
pt_br: Não é possível salvar '{0}' porque não está aberto no editor.
ru: Не удается сохранить "{0}": файл не открыт в редакторе.
tr: '{0}' düzenleyicide açık olmadığından kaydedilemedi.
zh_hans: 无法保存“{0}”，因为它未在编辑器中打开。
zh_hant: 因為 '{0}' 不是在編輯器中開啟的，所以無法儲存。

source: Content
cs: Obsah
de: Inhalt
es: Contenido
fr: Contenu
it: Contenuto
ja: コンテンツ
ko: 내용
pl: Zawartość
pt_br: Conteúdo
ru: Содержимое
tr: İçerik
zh_hans: 内容
zh_hant: 內容

# CopyToLocal
source: Copy Local
cs: Kopírovat místně
de: Lokale Kopie
es: Copia local
fr: Copie locale
it: Copia localmente
ja: ローカルにコピー
ko: 로컬 복사
pl: Kopia lokalna
pt_br: Copiar Local
ru: Копировать локально
tr: Yereli Kopyala
zh_hans: 复制本地
zh_hant: 複製到本機

# CopyToLocalDescription
source: Indicates whether the reference will be copied to the output directory.
cs: Určuje, jestli se odkaz zkopíruje do výstupního adresáře.
de: Gibt an, ob der Verweis in das Ausgabeverzeichnis kopiert wird.
es: Indica si la referencia se copiará en el directorio de salida.
fr: Indique si la référence sera copiée dans le répertoire de sortie.
it: Indica se il riferimento verrà copiato nella directory di output.
ja: 参照が出力ディレクトリにコピーされるかどうかを示します。
ko: 참조를 출력 디렉터리에 복사할지 여부를 나타냅니다.
pl: Wskazuje, czy odwołanie będzie kopiowane do katalogu wyjściowego.
pt_br: Indica se a referência será copiada para o diretório de saída.
ru: Указывает, что ссылка будет скопирована в папку вывода.
tr: Başvurunun çıkış dizinine kopyalanıp kopyalanmayacağını gösterir.
zh_hans: 指示是否将引用复制到输出目录。
zh_hant: 表示是否將參考複製到輸出目錄。

source: Detailed
cs: Podrobný
de: Detailliert
es: Detallado
fr: Détaillé
it: Con dettagli
ja: 詳細
ko: 자세히
pl: Szczegółowy
pt_br: Detalhado
ru: Подробные
tr: Ayrıntılı
zh_hans: 详细
zh_hant: 詳細

source: Diagnostic
cs: Diagnostický
de: Diagnose
es: Diagnóstico
it: Diagnostica
ja: 診断
ko: 진단
pl: Diagnostyka
pt_br: Diagnóstico
ru: Диагностика
tr: Tanılama
zh_hans: 诊断
zh_hant: 診斷

# DirectoryExistError
source: Directory already exists
cs: Adresář už existuje.
de: Das Verzeichnis ist bereits vorhanden.
es: El directorio ya existe.
fr: Le répertoire existe déjà
it: La directory esiste già
ja: ディレクトリは既に存在します
ko: 디렉터리가 이미 있습니다.
pl: Katalog już istnieje
pt_br: O diretório já existe
ru: Каталог с таким именем уже существует
tr: Dizin zaten var.
zh_hans: 目录已存在
zh_hant: 目錄已經存在

# EditorViewError
source: Error opening specified view '{0}' using editor '{1}'
cs: Chyba při otevírání zadaného zobrazení {0} pomocí editoru {1}
de: Fehler beim Öffnen der angegebenen Ansicht "{0}" unter Verwendung des Editors "{1}".
es: Error al abrir la vista '{0}' especificada con el editor '{1}'.
fr: Erreur lors de l'ouverture de la vue '{0}' spécifiée à l'aide de l'éditeur '{1}'
it: Errore durante l'apertura della visualizzazione specificata '{0}' utilizzando l'editor '{1}'
ja: 指定されたビュー '{0}' をエディター '{1}' で開くときにエラーが発生しました
ko: 편집기 '{1}'을(를) 사용하여 지정한 뷰 '{0}'을(를) 여는 동안 오류가 발생했습니다.
pl: Wystąpił błąd podczas otwierania określonego widoku „{0}” przy użyciu edytora „{1}”
pt_br: Erro ao abrir a exibição especificada '{0}' usando o editor '{1}'
ru: Обнаружена ошибка при открытии указанного представления "{0}" в редакторе "{1}"
tr: Belirtilen '{0}' görünümü '{1}' düzenleyicisiyle açılırken hata oluştu
zh_hans: 使用编辑器“{1}”打开指定视图“{0}”时出错
zh_hant: 使用編輯器 '{1}' 開啟指定的檢視 '{0}' 時發生錯誤

source: Embedded Resource
cs: Vložený prostředek
de: Eingebettete Ressource
es: Recurso incrustado
fr: Ressource incorporée
it: Risorsa incorporata
ja: 埋め込みリソース
ko: 포함 리소스
pl: Zasób osadzony
pt_br: Recurso Inserido
ru: Внедренный ресурс
tr: Eklenmiş Kaynak
zh_hans: 嵌入的资源
zh_hant: 內嵌資源

source: error
cs: Chyba
de: Fehler
fr: Erreur
it: errore
ja: エラー
ko: 오류
pl: błąd
pt_br: Erro
ru: Ошибка
tr: Hata
zh_hans: 错误
zh_hant: 錯誤

# ErrorInvalidFileName
source: Files and folders cannot be: - Empty strings - System reserved names, including 'CON', 'AUX', PRN', 'COM1' or 'LPT2' - contain only '.' - have any of the following characters: / ? : & \ * " < > | # %
cs: Soubory a složky nemůžou: – Být prázdnými řetězci – Být systémem rezervovanými názvy včetně CON, AUX, PRN, COM1 nebo LPT2 – Obsahovat jenom tečku (.) – Obsahovat kterýkoli z následujících znaků: / ? : & \ * " < > | # %
de: Für Dateien und Ordner gilt Folgendes: – Sie dürfen keine leeren Zeichenfolgen sein. – Sie dürfen keine für das System reservierten Namen aufweisen, einschließlich "CON", "AUX", PRN", "COM1" oder "LPT2". – Sie dürfen nicht ausschließlich "." enthalten. – Sie dürfen folgende Zeichen nicht aufweisen: / ? : & \ * " < > | # %
es: Los archivos y las carpetas no pueden: - Ser cadenas vacías - Ser nombres reservados del sistema, como "CON", "AUX", "PRN", "COM1" o "LPT2" - Contener solo "." - Tener cualquiera de los siguientes caracteres: / ? : & \ * " < > | # %
fr: Les noms de fichiers et de dossiers ne peuvent pas : - être des chaînes vides ; - être des noms réservés au système, notamment 'CON', 'AUX', PRN', 'COM1' ou 'LPT2' ; - contenir uniquement '.' - comporter les caractères suivants : / ? : & \ * " < > | # %
it: Un nome di file o cartella non può: - Essere una stringa vuota - Essere un nome riservato del sistema, ad esempio 'CON', 'AUX', PRN', 'COM1' o 'LPT2' - Contenere solo '.' - Contenere uno dei seguenti caratteri: / ? : & \ * " < > | # %
ja: ファイル名およびフォルダー名を次の形式にすることはできません: - 空の文字列 - システム予約名 ('CON'、'AUX'、'PRN'、'COM1'、'LPT2' など) - '.' のみ - 次の文字を含む: / ? : & \ * " < > | # %
ko: 파일 및 폴더에는 다음 문자를 사용할 수 없습니다. - 빈 문자열 - 'CON', 'AUX', PRN', 'COM1', 'LPT2' 등의 시스템 예약 이름 - '.'만 포함 - / ? : & \ * " < > | # % 문자 포함
pl: Pliki i foldery nie mogą: - być pustymi ciągami - być nazwami zarezerwowanymi przez system, w tym „CON”, „AUX”, „PRN”, „COM1” lub „LPT2” - zawierać samego znaku „.” - zawierać następujących znaków: / ? : & \ * " < > | # %
pt_br: Os arquivos e as pastas não podem ser: – Cadeias de caracteres vazias – Nomes reservados do sistema, incluindo 'CON', 'AUX', PRN', 'COM1' ou 'LPT2' – conter somente '.' – ter um destes caracteres: / ? : & \ * " < > | # %
ru: Файлы и папки не могут: – быть пустыми строками; – совпадать с именами, зарезервированными системой, например CON, AUX, PRN, COM1 или LPT2; – содержать только "."; – содержать символы / ? : & \ * " < > | # %.
tr: Dosya ve klasörler aşağıdaki özelliklere sahip olamaz: - Boş dize - 'CON', 'AUX', PRN', 'COM1' veya 'LPT2' gibi sistem tarafından ayrılmış adlar - yalnızca '.' içeren - şu karakterlerden herhangi birini içeren: / ? : & \ * " < > | # %
zh_hans: 文件和文件夹不能: - 为空字符串 - 为系统保留的名称，包括 "CON"、"AUX"、"PRN"、"COM1" 或 "LPT2" - 仅包含 "." - 具有以下任一字符: / ? : & \ * " < > | # %
zh_hant: 檔案與資料夾不可為: - 空字串 - 系統保留名稱，包括 'CON'、'AUX'、'PRN'、'COM1' 或 'LPT2' - 只有 '.' - 有下列任一字元: / ? : & \ * " < > | # %

# ErrorInvalidProjectName
source: The name you provided is not a valid project name.
cs: Poskytnutý název je neplatným názvem projektu.
de: Der angegebene Name ist kein gültiger Projektname.
es: El nombre proporcionado no es un nombre de proyecto válido.
fr: Le nom que vous avez fourni n'est pas un nom de projet valide.
it: Il nome specificato non è un nome di progetto valido.
ja: 指定された名前は有効なプロジェクト名ではありません。
ko: 지정한 이름이 올바른 프로젝트 이름이 아닙니다.
pl: Podana nazwa nie jest prawidłową nazwą projektu.
pt_br: O nome fornecido não é um nome de projeto válido.
ru: Указанное имя не является допустимым именем проекта.
tr: Sağladığınız ad geçerli bir proje adı değil.
zh_hans: 您提供的名称不是有效的项目名称。
zh_hant: 您提供的名稱不是有效的專案名稱。

# ErrorMsBuildRegistration
source: MSBuild path not found in registry. Please reinstall to fix the problem.
cs: Cesta k MSBuild se v registru nenašla. Tento problém odstraníte přeinstalací.
de: Der MSBuild-Pfad wurde nicht in der Registrierung gefunden. Führen Sie die Installation erneut durch, um das Problem zu beheben.
es: Ruta de acceso de MSBuild no encontrada en el Registro. Reinstálelo para corregir el problema.
fr: Chemin MSBuild introuvable dans le Registre. Réinstallez pour corriger le problème.
it: Percorso MSBuild non trovato nel Registro di sistema. Reinstallare per risolvere il problema.
ja: MSBuild パスがレジストリに見つかりませんでした。再インストールして問題を解決してください。
ko: 레지스트리에 MSBuild 경로가 없습니다. 문제를 해결하려면 다시 설치하세요.
pl: Nie odnaleziono ścieżki programu MSBuild w rejestrze. Zainstaluj go ponownie, aby rozwiązać ten problem.
pt_br: O caminho MSBuild não foi encontrado no registro. Reinstale para resolver o problema.
ru: Путь к MSBuild не найден в реестре. Чтобы устранить эту неполадку, повторите установку.
tr: MSBuild yolu kayıt defterinde bulunamadı. Sorunu çözmek için lütfen tekrar yükleyin.
zh_hans: 在注册表中未找到 MSBuild 路径。请重新安装以修复此问题。
zh_hant: 在登錄中找不到 MSBuild 路徑。請重新安裝以解決問題。

# ErrorSaving
source: Error Saving File
cs: Chyba při ukládání souboru
de: Fehler beim Speichern der Datei
es: Error al guardar el archivo
fr: Erreur lors de l'enregistrement du fichier
it: Errore durante il salvataggio del file
ja: ファイルの保存エラー
ko: 파일 저장 오류
pl: Błąd podczas zapisywania pliku
pt_br: Erro ao Salvar Arquivo
ru: Ошибка при сохранении файла
tr: Dosya Kaydedilirken Hata Oluştu
zh_hans: 保存文件时出错
zh_hant: 儲存檔案時發生錯誤

# Exe
source: Console Application
cs: Konzolová aplikace
de: Konsolenanwendung
es: Aplicación de consola
fr: Application console
it: Applicazione console
ja: コンソール アプリケーション
ko: 콘솔 애플리케이션
pl: Aplikacja konsolowa
pt_br: Aplicativo do Console
ru: Консольное приложение
tr: Konsol Uygulaması
zh_hans: 控制台应用程序
zh_hant: 主控台應用程式

# ExpectedObjectOfType
source: Expecting object of type {0}.
cs: Očekává se objekt typu {0}.
de: Erwarteter Objekttyp: {0}.
es: Se espera un objeto de tipo {0}.
fr: Objet attendu de type {0}.
it: Previsto oggetto di tipo {0}.
ja: 型 {0} のオブジェクトが必要です。
ko: 형식이 {0}인 개체가 필요합니다.
pl: Oczekiwano obiektu typu {0}.
pt_br: Esperando objeto do tipo {0}.
ru: Требуется объект типа {0}.
tr: {0} türünde nesne bekleniyor.
zh_hans: 对象类型应为 {0}。
zh_hant: 必須是類型 {0} 的物件。

# FailedToRetrieveProperties
source: Failed to retrieve msbuild property {0} from the project file.
cs: Chyba při získání vlastnosti msbuild {0} ze souboru projektu
de: Fehler beim Abrufen der msbuild-Eigenschaft "{0}" aus der Projektdatei.
es: No se pudo recuperar la propiedad {0} de msbuild del archivo de proyecto.
fr: Impossible de récupérer la propriété msbuild {0} du fichier projet.
it: Non è stato possibile recuperare la proprietà {0} di MSBuild dal file di progetto.
ja: msbuild プロパティ {0} をプロジェクト ファイルから取得できませんでした。
ko: 프로젝트 파일에서 msbuild 속성 {0}을(를) 검색하지 못했습니다.
pl: Nie można pobrać właściwości msbuild {0} z pliku projektu.
pt_br: Falha ao recuperar a propriedade {0} de msbuild do arquivo do projeto.
ru: Не удается загрузить свойство msbuild {0} из файла проекта.
tr: {0} msbuild özelliği proje dosyasından alınamadı.
zh_hans: 从项目文件检索 msbuild 属性 {0} 失败。
zh_hant: 無法從專案檔擷取 msbuild 屬性 {0}。
