Repository: dotnet/fsharp
Catalog: src/fsharp/fsi/xlf/FSIstrings.txt.*.xlf
Languages: ja, ru, tr, zh_hant

# fsiInternalAccess
source: Accessing the internal type, method or field '{0}' from a previous evaluation in F# Interactive is deprecated and may cause subsequent access errors. To enable the legacy generation of a single dynamic assembly that can access internals, use the '--multiemit-' option.
zh_hant: 從之前 F# 互動中的評估存取內部類型、方法或欄位 '{0}' 已過時，可能造成後續存取錯誤。若要啟用可存取內部之單一動態組件的舊版世代，請使用 '--multiemit-' 選項。

# fsiIntroPackageSourceUriInfo
source: Include package source uri when searching for packages
ja: パッケージの検索時にパッケージ ソースの URI を含める
ru: Включать исходный URI пакета при поиске пакетов
tr: Paketler aranırken paket kaynağı URI'si ekleyin
zh_hant: 搜尋套件時包含套件來源 URI

# fsiMultiAssemblyEmitOptionOffByDefault
source: Emit multiple assemblies (off by default for .NET Framework)
zh_hant: 發出多組件 (.NET Framework 預設為關閉)

# fsiOperationCouldNotBeCompleted
source: Operation could not be completed due to earlier error
ja: 以前のエラーが原因で操作を完了できませんでした
ru: Операция не может быть завершена из-за предыдущей ошибки
tr: Önceki hata nedeniyle işlem tamamlanamadı
zh_hant: 因為先前發生錯誤，所以無法完成作業

# fsiOperationFailed
source: Operation failed. The error text has been printed in the error stream. To return the corresponding FSharpDiagnostic use the EvalInteractionNonThrowing, EvalScriptNonThrowing or EvalExpressionNonThrowing
ja: 操作に失敗しました。エラー テキストがエラー ストリームに出力されました。対応する FSharpDiagnostic を戻すには、EvalInteractionNonThrowing、EvalScriptNonThrowing、または EvalExpressionNonThrowing を使用します
ru: Не удалось выполнить операцию. Текст ошибки был выведен в потоке ошибок. Чтобы вернуть соответствующие сведения FSharpDiagnostic, используйте EvalInteractionNonThrowing, EvalScriptNonThrowing или EvalExpressionNonThrowing
tr: İşlem başarısız oldu. Hata metni hata akışında yazdırıldı. İlgili FSharpDiagnostic'i döndürmek için EvalInteractionNonThrowing, EvalScriptNonThrowing veya EvalExpressionNonThrowing kullanın
zh_hant: 作業失敗。錯誤文字已列印在錯誤串流中。若要傳回相對應的 FSharpDiagnostic，請使用 EvalInteractionNonThrowing、EvalScriptNonThrowing 或 EvalExpressionNonThrowing

# fsiMultiAssemblyEmitOption
source: Emit multiple assemblies (on by default)
zh_hant: 發出多組件 (預設為開啟)

# stoppedDueToError
source: Stopped due to error\n
ja: エラーのため停止しました\n
ru: Остановлено из-за ошибки\n
tr: Hata nedeniyle durduruldu\n
zh_hant: 已因錯誤而停止\n

# fsiUsage
source: Usage: {0} <options> [script.fsx [<arguments>]]
ja: 使用状況: {0} <オプション> [script.fsx [<引数>]]
ru: Использование: {0} <параметры> [script.fsx [<аргументы>]]
tr: Kullanım: {0} <seçenekler> [script.fsx [<bağımsız değişkenler>]]
zh_hant: 用法: {0} <選項> [script.fsx [<引數>]]

# fsiInputFiles
source: - INPUT FILES -
ja: - 入力ファイル -
ru: - ВХОДНЫЕ ФАЙЛЫ -
tr: - GİRİŞ DOSYALARI -
zh_hant: - 輸入檔 -

# fsiCodeGeneration
source: - CODE GENERATION -
ja: - コード生成 -
ru: - ФОРМИРОВАНИЕ КОДА -
tr: - KOD ÜRETİMİ -
zh_hant: - 程式碼產生 -

# fsiErrorsAndWarnings
source: - ERRORS AND WARNINGS -
ja: - エラーと警告 -
ru: - ОШИБКИ И ПРЕДУПРЕЖДЕНИЯ -
tr: - HATALAR VE UYARILAR -
zh_hant: - 錯誤和警告 -

# fsiLanguage
source: - LANGUAGE -
ja: - 言語 -
ru: - ЯЗЫК -
tr: - DİL -
zh_hant: - 語言 -

# fsiMiscellaneous
source: - MISCELLANEOUS -
ja: - その他 -
ru: - ПРОЧЕЕ -
tr: - ÇEŞİTLİ -
zh_hant: - 其他 -

# fsiAdvanced
source: - ADVANCED -
ja: - 詳細 -
ru: - ДОПОЛНИТЕЛЬНО -
tr: - GELİŞMİŞ -
zh_hant: - 進階 -

# fsiExceptionRaisedStartingServer
source: Exception raised when starting remoting server.\n{0}
ja: サーバーのリモート処理の開始中に例外が発生しました。\n{0}
ru: При запуске удаленного сервера возникло исключение.\n{0}
tr: Uzaktan iletişim sunucusu başlatılırken özel durum tetiklendi.\n{0}
zh_hant: 啟動遠端處理伺服器時發生例外狀況。\n{0}

# fsiUse
source: Use the given file on startup as initial input
ja: 指定されたファイルをスタートアップ時の初期入力として使用します
ru: Использование данного файла при запуске в качестве начальных входных данных
tr: Verilen dosyayı başlangıçta ilk giriş olarak kullan
zh_hant: 啟動時使用所指定的檔案做為初始輸入

# fsiLoad
source: #load the given file on startup
ja: #load: 指定されたファイルをスタートアップ時に読み込みます
ru: #load: загружать данный файл при запуске
tr: #load verilen dosyayı başlangıçta
zh_hant: #load 啟動時指定的檔案

# fsiRemaining
source: Treat remaining arguments as command line arguments, accessed using fsi.CommandLineArgs
ja: 残りの引数は、fsi.CommandLineArgs を使用してアクセスするコマンド ライン引数として扱います
ru: Обрабатывать остальные аргументы как аргументы командной строки с использованием fsi.CommandLineArgs
tr: Kalan bağımsız değişkenlere fsi.CommandLineArgs kullanılarak erişilen komut satırı bağımsız değişkenleri gibi davran
zh_hant: 將其餘引數視為命令列引數，使用 fsi.CommandLineArgs 存取

# fsiHelp
source: Display this usage message (Short form: -?)
ja: この使用方法に関するメッセージを表示します (短い形式: -?)
ru: Вывод данного сообщения об использовании (краткая форма: -?)
tr: Bu kullanım iletisini görüntüle (Kısa biçimi: -?)
zh_hant: 顯示此訊息 (簡短形式: -?)

# fsiExec
source: Exit fsi after loading the files or running the .fsx script given on the command line
ja: コマンド ライン上で指定されたファイルの読み込みまたは .fsx スクリプトの実行後、fsi を終了します
ru: Выход из FSI после загрузки файлов или выполнение скрипта .fsx, указанного в командной строке
tr: Dosyaları yükledikten veya komut satırında verilen .fsx betiğini çalıştırdıktan sonra fsi'den çık
zh_hant: 載入檔案或執行命令列上指定的 .fsx 指令碼後結束 fsi

# fsiGui
source: Execute interactions on a Windows Forms event loop (on by default)
ja: Windows フォーム イベント ループでの対話の実行 (既定でオン)
ru: Выполнение взаимодействий при зацикливании события Windows Forms (включено по умолчанию)
tr: Etkileşimleri Windows Forms olay döngüsünde yürüt (varsayılan seçenek olarak açık)
zh_hant: 在 Windows Forms 事件迴圈上執行互動 (預設為開啟)

# fsiQuiet
source: Suppress fsi writing to stdout
ja: fsi の stdout への書き込みの抑止
ru: Запретить fsi запись в stdout
tr: stdout yazdırırken fsi'yi gizle
zh_hant: 禁止 fsi 寫入 stdout

# fsiReadline
source: Support TAB completion in console (on by default)
ja: コンソールでの TAB 補完のサポート (既定でオン)
ru: Поддержка заполнения нажатием клавиши TAB в консоли (включено по умолчанию)
tr: Konsolda SEKME ile tamamlamayı destekle (varsayılan seçenek olarak açık)
zh_hant: 支援主控台中的 TAB 鍵自動完成 (預設為開啟)

# fsiEmitDebugInfoInQuotations
source: Emit debug information in quotations
ja: デバッグ情報を引用符で囲んで生成します
ru: Вывод отладочной информации в кавычках
tr: Tırnak içindeki hata ayıklama bilgilerini yay
zh_hant: 發出在引號內的偵錯資訊

# fsiBanner3
source: For help type #help;;
ja: ヘルプを表示するには次を入力してください: #help;;
ru: Для получения справки введите #help;;
tr: Yardım için #help yazın;;
zh_hant: 如需說明，請輸入 #help;;

# fsiConsoleProblem
source: A problem occurred starting the F# Interactive process. This may be due to a known problem with background process console support for Unicode-enabled applications on some Windows systems. Try selecting Tools->Options->F# Interactive for Visual Studio and enter '--fsi-server-no-unicode'.
ja: F# 対話型プロセスの開始で問題が発生しました。これは、一部の Windows システムで Unicode 対応アプリケーションのバックグラウンド プロセス コンソールのサポートに関する既知の問題が原因である可能性があります。Visual Studio で ツール->オプション->F# インタラクティブを選択し、「-fsi-server-no-unicode」と入力します。
ru: Возникла проблема при запуске процесса F# Interactive. Это может быть связано с известной проблемой с поддержкой консоли в фоновых процессах для приложений с поддержкой Unicode на некоторых системах Windows. Выберите "Инструменты"->"Параметры"->"F# Interactive" для Visual Studio и введите '--fsi-server-no-unicode'.
tr: F# Interactive işlemi başlatılırken br sorun oluştu. Bu, bazı Windows sistemlerinde Unicode etkin uygulamalar için arka planda işleme konsol desteğiyle ilgili bilinen bir sorundan kaynaklanıyor olabilir. Araçlar->Seçenekler->Visual Studio için F# Interactive seçeneğini belirleyip '--fsi-server-no-unicode' komutunu girmeyi deneyin.
zh_hant: 啟動 F# Interactive 處理序時發生錯誤。這可能是某些 Windows 系統上可使用 Unicode 之應用程式的背景處理序主控台支援發生已知錯誤所致。請嘗試選取 [工具]->[選項]->[適用於 Visual Studio 的 F# Interactive] 並輸入 '--fsi-server-no-unicode’。

# fsiInvalidAssembly
source: '{0}' is not a valid assembly name
ja: '{0}' は有効なアセンブリ名ではありません
ru: {0} не является допустимым именем сборки
tr: '{0}' geçerli bir bütünleştirilmiş kod adı değil
zh_hant: '{0}' 不是有效的組件名稱

# fsiDirectoryDoesNotExist
source: Directory '{0}' doesn't exist
ja: ディレクトリ "{0}" は存在しません
ru: Каталог "{0}" не существует
tr: '{0}' dizini yok
zh_hant: 目錄 '{0}' 不存在

# fsiLineTooLong
source: Warning: line too long, ignoring some characters\n
ja: 警告: 行が長すぎます。一部の文字は無視されます\n
ru: Предупреждение: слишком длинная строка, некоторые знаки игнорируются\n
tr: Uyarı: satır çok uzun, bazı karakterler yok sayılıyor\n
zh_hant: 警告: 行太長，將忽略某些字元\n

# fsiTimeInfoMainString
source: Real: {0}, CPU: {1}, GC {2}
ja: リアル: {0}、CPU: {1}、GC {2}
ru: Real: {0}, ЦП: {1}, GC {2}
tr: Gerçek: {0}, CPU: {1}, GC {2}
zh_hant: 實際: {0}，CPU: {1}，GC {2}

# fsiExceptionDuringPrettyPrinting
source: \n\nException raised during pretty printing.\nPlease report this so it can be fixed.\nTrace: {0}\n
ja: \n\n再フォーマット中に例外が発生しました。\nこの問題を解決できるように報告してください。\nトレース: {0}\n
ru: \n\nВозникло исключение при автоматическом форматировании.\nОтправьте отчет об этой неполадке для ее устранения.\nТрассировка: {0}\n
tr: \n\nDüzgün yazdırma sırasında özel durum tetiklendi.\nDüzeltilebilmesi için lütfen bunu bildirin.\nİz: {0}\n
zh_hant: \n\n美化顯示期間發生例外狀況。\n請回報此問題以便修正。\n追蹤: {0}\n

# fsiIntroTextHeader1directives
source: F# Interactive directives:
ja: F# インタラクティブ ディレクティブ:
ru: Директивы F# Interactive:
tr: F# Etkileşimli yönergeleri:
zh_hant: F# 互動指示詞:

# fsiIntroTextHashrInfo
source: Reference (dynamically load) the given DLL
ja: 指定された DLL を参照します (動的読み込み)
ru: Ссылка на (динамическая загрузка) данную библиотеку DLL
tr: Verilen DLL'ye başvur (dinamik olarak yükle)
zh_hant: 參考 (以動態方式載入) 所指定的 DLL

# fsiIntroTextHashIInfo
source: Add the given search path for referenced DLLs
ja: 参照されている DLL に対し、指定された検索パスを追加します
ru: Добавление данного пути поиска для указанных библиотек DLL
tr: Başvurulan DLL'ler için verilen arama yolunu ekle
zh_hant: 加入所參考 DLL 的指定搜尋路徑

# fsiIntroTextHashloadInfo
source: Load the given file(s) as if compiled and referenced
ja: コンパイルおよび参照されているように、指定されたファイルを読み込みます
ru: Загрузка данных файлов как скомпилированных и указанных ссылками
tr: Verilen dosyaları derlenmiş ve başvurulmuş gibi yükle
zh_hant: 載入指定的檔案，視為已編譯及已參考

# fsiIntroTextHashtimeInfo
source: Toggle timing on/off
ja: タイミングのオンとオフを切り替えます
ru: Включение и отключение таймера
tr: Zamanlamayı aç/kapat
zh_hant: 切換計時開/關

# fsiIntroTextHashhelpInfo
source: Display help
ja: ヘルプの表示
ru: Отображать справку
tr: Yardımı göster
zh_hant: 顯示說明

# fsiIntroTextHashquitInfo
source: Exit
ja: 終了
ru: Выход
tr: Çıkış
zh_hant: 結束

# fsiIntroTextHeader2commandLine
source: F# Interactive command line options:
ja: F# インタラクティブ コマンド ライン オプション:
ru: Параметры командной строки F# Interactive:
tr: F# Etkileşimli komut satırı seçenekleri:
zh_hant: F# 互動命令列選項:

# fsiIntroTextHeader3
source: See '{0}' for options
ja: オプションについては '{0}' を参照してください
ru: Параметры см. в "{0}"
tr: Seçenekler için bkz. '{0}'
zh_hant: 相關選項請參閱 '{0}'

# fsiLoadingFilesPrefixText
source: Loading
ja: 読み込み中
ru: Загрузка
tr: Yükleniyor
zh_hant: 正在載入

# fsiInterrupt
source: \n- Interrupt\n
ja: \n- 割り込み\n
ru: \n- Прерывать\n
tr: \n- Kesme\n
zh_hant: \n- 中斷\n

# fsiExit
source: \n- Exit...\n
ja: \n- 終了...\n
ru: \n- Выход...\n
tr: \n- Çıkış...\n
zh_hant: \n- 結束...\n

# fsiAbortingMainThread
source: - Aborting main thread...
ja: - メイン スレッドを中止しています...
ru: — Отменяется главный поток...
tr: - Ana iş parçacığı iptal ediliyor...
zh_hant: - 正在中止主要執行緒...

# fsiCouldNotInstallCtrlCHandler
source: Failed to install ctrl-c handler - Ctrl-C handling will not be available. Error was:\n\t{0}
ja: ctrl-c ハンドラーをインストールできませんでした - Ctrl-C 処理を使用できるようになりません。エラー:\n\t{0}
ru: Не удалось установить обработчик ctrl-c - обработка Ctrl-C будет недоступна. Ошибка:\n\t{0}
tr: ctrl-c işleyicisi yüklenemedi - Ctrl-C işlemi kullanılamayacak. Hata:\n\t{0}
zh_hant: 無法安裝 ctrl-c 處理常式，Ctrl-C 處理將無法使用。錯誤為:\n\t{0}

# fsiDidAHashr
source: --> Referenced '{0}'
ja: --> 参照済み '{0}'
ru: --> Добавлена ссылка на "{0}"
tr: --> Başvurulan '{0}'
zh_hant: --> 已參考 '{0}’

# fsiDidAHashrWithLockWarning
source: --> Referenced '{0}' (file may be locked by F# Interactive process)
ja: --> 参照済み '{0}' (ファイルは F# 対話型プロセスによってロックされている可能性があります)
ru: --> Добавлена ссылка на "{0}" (файл может быть заблокирован процессом F# Interactive)
tr: --> Başvurulan '{0}' (dosya F# Interactive işlemi tarafından kilitlenmiş olabilir)
zh_hant: --> 已參考 '{0}' (F# Interactive 處理序可能鎖定了檔案)

# fsiDidAHashrWithStaleWarning
source: --> Referenced '{0}' (an assembly with a different timestamp has already been referenced from this location, reset fsi to load the updated assembly)
ja: --> 参照済み '{0}' (異なるタイムスタンプを持つアセンブリがこの場所から既に参照されています、更新されたアセンブリを読み込むには fsi をリセットします)
ru: --> Добавлена ссылка на "{0}" (из этого расположения уже указана ссылка на сборку с другой временной отметкой; чтобы загрузить обновленную сборку, сбросьте fsi)
tr: --> Başvurulan '{0}' (bu konumdan farklı bir zaman damgasına sahip bir derlemeye zaten başvurulmuş, güncelleştirilmiş derlemeyi yüklemek için fsi'yi sıfırlayın)
zh_hant: --> 已參考 '{0}' (已從此位置參考具有不同時間戳記的組件，請重設 fsi 以載入更新的組件)

# fsiDidAHashI
source: --> Added '{0}' to library include path
ja: --> ライブラリのインクルード パスに '{0}' を追加しました
ru: --> В путь включения библиотеки добавлен "{0}"
tr: --> '{0}', kitaplık ekleme yoluna eklendi
zh_hant: --> 已將 '{0}' 新增到程式庫 include 路徑

# fsiTurnedTimingOn
source: --> Timing now on
ja: --> 今すぐタイミング オン
ru: --> Синхронизация включена
tr: --> Zamanlama açıldı
zh_hant: --> 計時現在已開啟

# fsiTurnedTimingOff
source: --> Timing now off
ja: --> 今すぐタイミング オフ
ru: --> Синхронизация отключена
tr: --> Zamanlama kapatıldı
zh_hant: --> 計時現在已關閉

# fsiUnexpectedThreadAbortException
source: - Unexpected ThreadAbortException (Ctrl-C) during event handling: Trying to restart...
ja: - イベント処理中に予期しない ThreadAbortException (Ctrl-C) が発生しました: 再開を試行しています...
ru: - Непредвиденное ThreadAbortException (Ctrl-C) в ходе обработки события: Попытка перезапуска...
tr: - Olay işlenirken beklenmeyen ThreadAbortException (Ctrl-C): Yeniden başlatma deneniyor...
zh_hant: - 事件處理時發生未預期的 ThreadAbortException (Ctrl-C): 正嘗試重新啟動...

# fsiFailedToResolveAssembly
source: Failed to resolve assembly '{0}'
ja: アセンブリ '{0}' を解決できませんでした
ru: Не удалось выполнить разрешение сборки ''{0}''
tr: '{0}' bütünleştirilmiş kodu çözümlenemedi
zh_hant: 無法解析組件 '{0}'

# fsiBindingSessionTo
source: Binding session to '{0}'...
ja: セッションを '{0}' にバインドしています...
ru: Привязка сеанса к "{0}"...
tr: Oturum '{0}' öğesine bağlanıyor...
zh_hant: 正在將工作階段繫結到 '{0}'...

# fsiProductName
source: Microsoft (R) F# Interactive version {0}
ja: Microsoft (R) F# インタラクティブ バージョン {0}
ru: Microsoft (R) F# Interactive, версия {0}
tr: Microsoft (R) F# Etkileşimli sürüm {0}
zh_hant: Microsoft (R) F# 互動版本 {0}

# fsiProductNameCommunity
source: F# Interactive for F# {0}
ja: F# {0} の F# インタラクティブ
ru: F# Interactive для F# {0}
tr: F# {0} için F# Etkileşimli
zh_hant: 適用於 F# {0} 的 F# 互動

# shadowCopyReferences
source: Prevents references from being locked by the F# Interactive process
ja: 参照が F# インタラクティブ プロセスによってロックされないようにします。
ru: Предотвращает блокировку ссылок интерактивным процессом F#.
tr: Başvuruların F# Etkileşimli işlemi tarafından kilitlenmesini engeller
zh_hant: 避免參考遭 F# 互動處理序封鎖

# fsiTimeInfoGCGenerationLabelSomeShorthandForTheWordGeneration
source: gen
ja: 全般
tr: olş
