Repository: dotnet/fsharp
Catalog: src/FSharp.Core/xlf/FSCore.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# matchCasesIncomplete
source: The match cases were incomplete
cs: Případy výrazu match byly neúplné.
de: Die Übereinstimmungsfälle waren unvollständig.
es: Los casos de coincidencia estaban incompletos.
fr: La casse n'est pas complète
it: Case di corrispondenza incompleti
ja: 一致条件が不完全でした
ko: 일치하는 케이스가 완전하지 않습니다.
pl: Instrukcje „case” do porównania są niekompletne.
pt_br: Os casos compatíveis estavam incompletos
ru: Варианты сопоставления не были завершены
tr: Eşleşme durumları tam değildi
zh_hans: 大小写匹配不完整
zh_hant: 大小寫須相符不完整

# addressOpNotFirstClass
source: First class uses of address-of operators are not permitted.
cs: Použití operátorů address-of jako výrazů první třídy není povoleno.
de: Verwendungen der ersten Klasse von address-of-Operatoren sind nicht zulässig.
es: No se permite el uso de operadores address-of en la primera clase.
fr: L'utilisation d'opérateurs address-of par la première classe n'est pas autorisée.
it: Utilizzi di prima classe di operatori address-of non consentiti.
ja: アドレス演算子のファースト クラスの使用は許可されていません。
ko: address-of 연산자의 첫 번째 클래스 사용은 허용되지 않습니다.
pl: Używanie operatorów „address-of” w pierwszej klasie jest niedozwolone.
pt_br: Usos de operadores address-of de primeira classe não são permitidos.
ru: Использование операторов address-of в первом классе не допускается.
tr: Address-of işleçlerinin birinci sınıf kullanımlarına izin verilmiyor.
zh_hans: 不允许优先使用 address-of 运算符。
zh_hant: 不允許優先使用傳址運算子。

# arraysHadDifferentLengths
source: The arrays have different lengths.
cs: Pole mají rozdílné délky.
de: Die Länge der Arrays ist unterschiedlich.
es: Las matrices tienen una longitud diferente.
fr: Les tableaux ont des longueurs différentes.
it: Le matrici hanno lunghezza diversa.
ja: 配列の長さが異なります。
ko: 배열의 길이가 서로 다릅니다.
pl: Tablice mają różne długości.
pt_br: As matrizes possuem tamanhos diferentes.
ru: Массивы разной длины.
tr: Dizinlerin uzunlukları farklı.
zh_hans: 各个数组具有不同的长度。
zh_hant: 陣列有不同的長度。

# arrayWasEmpty
source: The input array was empty.
cs: Vstupní pole bylo prázdné.
de: Das Eingabearray war leer.
es: La matriz de entrada estaba vacía.
fr: Le tableau d'entrée était vide.
it: La matrice di input è vuota.
ja: 入力配列が空でした。
ko: 입력 배열이 비어 있습니다.
pl: Tablica wejściowa jest pusta.
pt_br: A matriz de entrada estava vazia.
ru: Входной массив был пуст.
tr: Giriş dizisi boştu.
zh_hans: 输入数组为空。
zh_hant: 輸入陣列是空的。

# badFormatString
source: Input string was not in a correct format.
cs: Vstupní řetězec nemá správný formát.
de: Die Eingabezeichenfolge hat das falsche Format.
es: La cadena de entrada no tiene el formato correcto.
fr: Le format de la chaîne d'entrée est incorrect.
it: Formato della stringa di input non corretto.
ja: 文字列の形式が正しくありません。
ko: 입력 문자열의 형식이 잘못되었습니다.
pl: Nieprawidłowy format ciągu wejściowego.
pt_br: A cadeia de caracteres de entrada não estava em um formato correto.
ru: Входная строка имела неверный формат.
tr: Giriş dizesi doğru biçimde değildi.
zh_hans: 输入字符串的格式不正确。
zh_hant: 輸入字串格式不正確。

# delegateExpected
source: Expecting delegate type.
cs: Je očekáván typ delegáta.
de: Es wird ein Delegattyp erwartet.
es: Se espera un tipo de delegado.
fr: Type délégué attendu.
it: Previsto tipo delegato.
ja: デリゲート型を必要としています。
ko: 대리자 형식이 필요합니다.
pl: Oczekiwano typu delegowanego.
pt_br: Esperando tipo delegate.
ru: Требуется делегатный тип.
tr: Temsilci türü bekleniyor.
zh_hans: 应为委托类型。
zh_hant: 必須是委派類型。

# dyInvDivByIntCoerce
source: Dynamic invocation of DivideByInt involving coercions is not supported.
cs: Dynamické vyvolání metody DivideByInt zahrnující převody není podporováno.
de: Der dynamische Aufruf von DivideByInt, der Koersionen umfasst, wird nicht unterstützt.
es: No se admite la invocación dinámica de DivideByInt que implique conversiones.
fr: L'appel dynamique de DivideByInt qui implique des contraintes n'est pas pris en charge.
it: Chiamata dinamica di DivideByInt con coercizioni non supportata.
ja: 強制型変換に関連する DivideByInt の動的な呼び出しはサポートされていません。
ko: 강제 변환과 관련된 DivideByInt의 동적 호출이 지원되지 않습니다.
pl: Dynamiczne wywołanie metody DivideByInt z wymuszeniami nie jest obsługiwane.
pt_br: Não há suporte para a invocação dinâmica de DivideByInt que envolve coerções.
ru: Динамические вызовы DivideByInt, затрагивающие приведение, не поддерживаются.
tr: Zorlamalar içeren dinamik DivideByInt çağrısı desteklenmiyor.
zh_hans: 不支持对涉及强制的 DivideByInt 进行动态调用。
zh_hant: 不支援與強制型轉相關的 DivideByInt 的動態引動過程。

# dyInvOpAddCoerce
source: Dynamic invocation of op_Addition involving coercions is not supported.
cs: Dynamické vyvolání metody op_Addition zahrnující převody není podporováno.
de: Der dynamische Aufruf von op_Addition, der Koersionen umfasst, wird nicht unterstützt.
es: No se admite la invocación dinámica de op_Addition que implique conversiones.
fr: L'appel dynamique de op_Addition qui implique des contraintes n'est pas pris en charge.
it: Chiamata dinamica di op_Addition con coercizioni non supportata.
ja: 強制型変換に関連する op_Addition の動的な呼び出しはサポートされていません。
ko: 강제 변환과 관련된 op_Addition의 동적 호출이 지원되지 않습니다.
pl: Dynamiczne wywołanie metody op_Addition z wymuszeniami nie jest obsługiwane.
pt_br: Não há suporte para a invocação dinâmica de op_Addition que envolve coerções.
ru: Динамические вызовы op_Addition, затрагивающие приведение, не поддерживаются.
tr: Zorlamalar içeren dinamik op_Addition çağrısı desteklenmiyor.
zh_hans: 不支持对涉及强制的 op_Addition 进行动态调用。
zh_hant: 不支援與強制型轉相關的 op_Addition 的動態引動過程。

# dyInvOpAddOverload
source: Dynamic invocation of op_Addition involving overloading is not supported.
cs: Dynamické vyvolání metody op_Addition zahrnující přetížení není podporováno.
de: Der dynamische Aufruf von op_Addition, der eine Überladung umfasst, wird nicht unterstützt.
es: No se admite la invocación dinámica de op_Addition que implique sobrecarga.
fr: L'appel dynamique de op_Addition qui implique des surcharges n'est pas pris en charge.
it: Chiamata dinamica di op_Addition con overload non supportata.
ja: オーバーロードに関連する op_Addition の動的な呼び出しはサポートされていません。
ko: 오버로드와 관련된 op_Addition의 동적 호출이 지원되지 않습니다.
pl: Dynamiczne wywołanie metody op_Addition z przeciążeniem nie jest obsługiwane.
pt_br: Não há suporte para a invocação dinâmica de op_Addition que envolve sobrecarga.
ru: Динамические вызовы op_Addition, затрагивающие перегрузку, не поддерживаются.
tr: Aşırı yükleme içeren dinamik op_Addition çağrısı desteklenmiyor.
zh_hans: 不支持对涉及重载的 op_Addition 进行动态调用。
zh_hant: 不支援與多載相關的 op_Addition 的動態引動過程。

# dyInvOpMultCoerce
source: Dynamic invocation of op_Multiply involving coercions is not supported.
cs: Dynamické vyvolání metody op_Multiply zahrnující převody není podporováno.
de: Der dynamische Aufruf von op_Multiply, der Koersionen umfasst, wird nicht unterstützt.
es: No se admite la invocación dinámica de op_Multiply que implique conversiones.
fr: L'appel dynamique de op_Multiply qui implique des contraintes n'est pas pris en charge.
it: Chiamata dinamica di op_Multiply con coercizioni non supportata.
ja: 強制型変換に関連する op_Multiply の動的な呼び出しはサポートされていません。
ko: 강제 변환과 관련된 op_Multiply의 동적 호출이 지원되지 않습니다.
pl: Dynamiczne wywołanie metody op_Multiply z wymuszeniami nie jest obsługiwane.
pt_br: Não há suporte para a invocação dinâmica de op_Multiply que envolve coerções.
ru: Динамические вызовы op_Multiply, затрагивающие приведение, не поддерживаются.
tr: Zorlamalar içeren dinamik op_Multiply çağrısı desteklenmiyor.
zh_hans: 不支持对涉及强制的 op_Multiply 进行动态调用。
zh_hant: 不支援與強制型轉相關的 op_Multiply 的動態引動過程。

# dyInvOpMultOverload
source: Dynamic invocation of op_Multiply involving overloading is not supported.
cs: Dynamické vyvolání metody op_Multiply zahrnující přetížení není podporováno.
de: Der dynamische Aufruf von op_Multiply, der eine Überladung umfasst, wird nicht unterstützt.
es: No se admite la invocación dinámica de op_Multiply que implique sobrecarga.
fr: L'appel dynamique de op_Multiply qui implique des surcharges n'est pas pris en charge.
it: Chiamata dinamica di op_Multiply con overload non supportata.
ja: オーバーロードに関連する op_Multiply の動的な呼び出しはサポートされていません。
ko: 오버로드와 관련된 op_Multiply의 동적 호출이 지원되지 않습니다.
pl: Dynamiczne wywołanie metody op_Multiply z przeciążeniem nie jest obsługiwane.
pt_br: Não há suporte para a invocação dinâmica de op_Multiply que envolve sobrecarga.
ru: Динамические вызовы op_Multiply, затрагивающие перегрузку, не поддерживаются.
tr: Aşırı yükleme içeren dinamik op_Multiply çağrısı desteklenmiyor.
zh_hans: 不支持对涉及重载的 op_Multiply 进行动态调用。
zh_hant: 不支援與多載相關的 op_Multiply 的動態引動過程。

# endCannotBeNaN
source: The end of a range cannot be NaN.
cs: Koncová hodnota rozsahu nemůže být NaN.
de: Das Ende des Bereichs kann nicht NaN sein.
es: El final de un intervalo no puede ser NaN.
fr: La fin d'une plage ne peut pas être NaN.
it: La fine di un intervallo deve essere un numero.
ja: 範囲の最後を NaN にすることはできません。
ko: 범위의 끝은 NaN일 수 없습니다.
pl: Końcową wartością zakresu nie może być NaN.
pt_br: O final de um intervalo não pode ser NaN.
ru: Окончанием диапазона не может быть NaN.
tr: Aralığın sonu NaN olamaz.
zh_hans: 范围的末尾不能为 NaN。
zh_hant: 範圍結尾不能是 NaN。

source: Enumeration already finished.
cs: Výčet byl již dokončen.
de: Die Enumeration wurde bereits beendet.
es: Enumeración finalizada.
fr: Énumération déjà terminée.
it: Enumerazione già terminata.
ja: 列挙は既に終了しています。
ko: 열거가 이미 완료되었습니다.
pl: Wyliczanie zostało już zakończone.
pt_br: Enumeração já concluída.
ru: Перечисление уже завершено.
tr: Sabit listesi zaten tamamlanmış.
zh_hans: 枚举已完成。
zh_hant: 列舉已完成。

# enumerationNotStarted
source: Enumeration has not started. Call MoveNext.
cs: Výčet nebyl zahájen. Volejte metodu MoveNext.
de: Die Enumeration wurde nicht gestartet. Rufen Sie "MoveNext" auf.
es: No se ha iniciado la enumeración. Llame a MoveNext.
fr: L'énumération n'a pas encore commencé. Appelez MoveNext.
it: L'enumerazione non è stata avviata. Chiamare MoveNext.
ja: 列挙は開始していません。MoveNext を呼び出してください。
ko: 열거가 시작되지 않았습니다. MoveNext를 호출하세요.
pl: Wyliczanie nie zostało uruchomione. Wywołaj element MoveNext.
pt_br: Enumeração não iniciada. Chame MoveNext.
ru: Перечисление не начато. Вызовите MoveNext.
tr: Sabit listesi işlemi başlamadı. MoveNext çağrısı yapın.
zh_hans: 枚举尚未开始。请调用 MoveNext。
zh_hant: 尚未開始列舉。呼叫 MoveNext。

source: Set contains no elements.
cs: Sada neobsahuje žádné prvky.
de: Die Gruppe enthält keine Elemente.
es: Set no contiene elementos.
fr: Set ne contient pas d'éléments.
it: Il set non contiene elementi.
ja: セットに要素がありません。
ko: 집합에 요소가 없습니다.
pl: Zestaw nie zawiera żadnych elementów.
pt_br: Set não contém elementos.
ru: Set не содержит элементов.
tr: Küme hiç öğe içermiyor.
zh_hans: 集未包含任何元素。
zh_hant: Set 未包含項目。

# enumerationPastIntMaxValue
source: Enumeration based on System.Int32 exceeded System.Int32.MaxValue.
cs: Výčet založený na typu System.Int32 překročil hodnotu System.Int32.MaxValue.
de: Bei der Enumeration basierend auf System.Int32 wurde System.Int32.MaxValue überschritten.
es: La enumeración basada en System.Int32 superaba el valor de System.Int32.MaxValue.
fr: L'énumération basée sur System.Int32 dépasse System.Int32.MaxValue.
it: L'enumerazione basata su System.Int32 supera System.Int32.MaxValue.
ja: System.Int32 に基づく列挙型が System.Int32.MaxValue を超えました。
ko: System.Int32를 기반으로 하는 열거형이 System.Int32.MaxValue를 초과했습니다.
pl: Wyliczenie oparte na obiekcie System.Int32 przekracza wartość określoną w polu System.Int32.MaxValue.
pt_br: A enumeração baseada em System.Int32 excedeu System.Int32.MaxValue.
ru: Перечисление, основанное на System.Int32, превысило значение System.Int32.MaxValue.
tr: System.Int32'yi temel alan numaralandırma System.Int32.MaxValue'yu aştı.
zh_hans: 基于 System.Int32 的枚举已超过 System.Int32.MaxValue。
zh_hant: 依 System.Int32 而定的列舉超過 System.Int32.MaxValue。

# failedReadEnoughBytes
source: Failed to read enough bytes from the stream.
cs: Nezdařilo se přečíst dostatek bajtů z datového proudu.
de: Fehler beim Lesen ausreichender Bytes aus dem Strom.
es: No se pudieron leer suficientes bytes del flujo.
fr: Échec de la lecture de suffisamment d'octets du flux.
it: Non è stato possibile leggere un numero sufficiente di byte dal flusso.
ja: ストリームから十分なバイト数を読み取ることができませんでした。
ko: 스트림에서 충분한 바이트를 읽지 못했습니다.
pl: Nie można odczytać wystarczającej liczby bajtów ze strumienia.
pt_br: Falha ao ler bytes suficientes do fluxo.
ru: Не удалось прочитать достаточное количество байтов из потока.
tr: Akıştan yeterli miktarda bayt okunamadı.
zh_hans: 未能从流中读取足够的字节。
zh_hant: 無法從資料流讀取足夠的位元組。

# genericCompareFail1
source: Failure during generic comparison: the type '{0}' does not implement the System.IComparable interface. This error may be arise from the use of a function such as 'compare', 'max' or 'min' or a data structure such as 'Set' or 'Map' whose keys contain instances of this type.
cs: Chyba během obecného srovnání: typ {0} neimplementuje rozhraní System.IComparable. Tato chyba může být způsobena použitím funkce jako například compare, max nebo min nebo datové struktury jako například Set nebo Map, jejichž klíče obsahují instance tohoto typu.
de: Fehler beim generischen Vergleich: Der Typ "{0}" implementiert die System.IComparable-Schnittstelle nicht. Dieser Fehler kann durch Verwendung einer Funktion wie "compare", "max" oder "min" oder einer Datenstruktur wie "Set" oder "Map" verursacht werden, deren Schlüssel Instanzen dieses Typs enthalten.
es: Error durante la comparación genérica: el tipo '{0}' no implementa la interfaz System.IComparable. Este error puede deberse al uso de una función como 'compare', 'max' o 'min', o una estructura de datos como 'Set' o 'Map' cuyas claves contienen instancias de este tipo.
fr: Échec lors de la comparaison générique : le type '{0}' n'implémente pas l'interface System.IComparable. Cette erreur peut se produire en raison de l'utilisation d'une fonction telle que 'compare', 'max' ou 'min' ou d'une structure de données telle que 'Set' ou 'Map' dont les clés contiennent des instances de ce type.
it: Errore durante il confronto generico: il tipo '{0}' non implementa l'interfaccia System.IComparable. Questo errore potrebbe essere dovuto all'utilizzo di una funzione quale 'compare', 'max' o 'min' o a una struttura di dati quale 'Set' o 'Map' le cui chiavi contengono istanze di questo tipo.
ja: 汎用的な比較中にエラーが発生しました: 型 '{0}' は System.IComparable インターフェイスを実装しません。このエラーは、'compare'、'max'、'min' などの関数、またはこの型のインスタンスを含むキーを持つ 'Set' や 'Map' などのデータ構造を使用した場合に発生することがあります。
ko: 제네릭 비교 중에 오류가 발생했습니다. '{0}' 형식은 System.IComparable 인터페이스를 구현하지 않습니다. 이 오류는 키에 이 형식의 인스턴스가 포함된 'Set' 또는 'Map' 등의 데이터 구조나 'compare', 'max' 또는 'min' 등의 함수 사용으로 인해 발생할 수 있습니다.
pl: Nie można wykonać standardowego porównania: typ „{0}” nie implementuje interfejsu System.IComparable. Błąd może być spowodowany użyciem funkcji takiej jak „compare”, „max” lub „min” albo struktury danych takiej jak „Set” lub „Map”, której klucze zawierają wystąpienia tego typu.
pt_br: Falha durante comparação genérica: o tipo '{0}' não implementa a interface System.IComparable. Este erro pode decorrer do uso de uma função, como 'compare', 'max' ou 'min', ou de uma estrutura de dados, como 'Set' ou 'Map', cujas chaves contêm instâncias desse tipo.
ru: Ошибка в ходе общего сравнения: тип "{0}" не реализует интерфейс System.IComparable. Эта ошибка может возникать из-за использования функции, такой как "compare", "max" или "min", либо структуры данных, такой как "Set" или "Map", ключи которой содержат экземпляры этого типа.
tr: Genel karşılaştırma sırasında hata: '{0}' türü System.IComparable arabirimini uygulamıyor. Bu hata 'compare', 'max' veya 'min' gibi bir işlevin ya da anahtarları bu türün örneklerini içeren 'Set' veya 'Map' gibi bir veri yapısının kullanılmasından kaynaklanabilir.
zh_hans: 泛型比较过程中出错: 类型“{0}”未实现 System.IComparable 接口。此错误可能是因使用的函数(如“compare”、“max”或“min”)或数据结构(如“Set”或“Map”)中的键包含此类型的实例而导致的。
zh_hant: 進行泛型比較期間失敗: 類型 '{0}' 未實作 System.IComparable 介面。這個錯誤可能是由使用的函式 (如 'compare'、'max' 或 'min') 或資料結構 (如 'Set' 或 'Map') 的索引鍵包含此類型的執行個體引起的。

# indexOutOfBounds
source: The index was outside the range of elements in the list.
cs: Index byl mimo rozsah prvků seznamu.
de: Der Index war außerhalb des Bereichs von Elementen in der Liste.
es: El índice estaba fuera del intervalo de elementos de la lista.
fr: L'index se trouve en dehors de la plage d'éléments de la liste.
it: Indice non compreso nell'intervallo di elementi in elenco.
ja: インデックスはリストの要素の範囲外にありました。
ko: 인덱스가 목록에서 요소의 범위를 벗어났습니다.
pl: Wartość indeksu jest spoza zakresu elementów na liście.
pt_br: O índice estava fora do intervalo de elementos na lista.
ru: Индекс вышел за границы диапазона элементов списка.
tr: Dizin listedeki öğeleri içeren aralığın dışındaydı.
zh_hans: 索引超出了列表中元素的范围。
zh_hant: 索引在清單的項目範圍之外。

# inputListWasEmpty
source: The input list was empty.
cs: Vstupní seznam byl prázdný.
de: Die Eingabeliste war leer.
es: La lista de entrada estaba vacía.
fr: La liste d'entrée était vide.
it: Elenco di input vuoto.
ja: 入力リストが空でした。
ko: 입력 목록이 비어 있습니다.
pl: Lista wejściowa jest pusta.
pt_br: A lista de entrada estava vazia.
ru: Входной список был пуст.
tr: Giriş listesi boştu.
zh_hans: 输入列表为空。
zh_hant: 輸入清單是空的。

# inputMustBeNonNegative
source: The input must be non-negative.
cs: Hodnota vstupu musí být nezáporná.
de: Die Eingabe darf nicht negativ sein.
es: La entrada no debe ser negativa.
fr: La saisie ne doit pas être négative.
it: L'input non può essere negativo.
ja: 入力は負以外である必要があります。
ko: 입력은 음수가 아니어야 합니다.
pl: Wartość wejściowa nie może być ujemna.
pt_br: A entrada deve ser não negativa.
ru: Входное значение должно быть неотрицательным.
tr: Giriş negatif olmayan bir sayı olmalıdır.
zh_hans: 输入必须为非负数。
zh_hant: 輸入必須是非負數。

# inputMustBePositive
source: The input must be positive.
cs: Hodnota vstupu musí být kladná.
de: Die Eingabe muss positiv sein.
es: El valor de entrada debe ser positivo.
fr: L'entrée doit être positive.
it: L'input deve essere positivo.
ja: 入力は正である必要があります。
ko: 입력은 양수여야 합니다.
pl: Wartość wejściowa musi być dodatnia.
pt_br: A entrada deve ser positiva.
ru: Входное значение должно быть положительным.
tr: Girdinin pozitif bir değer olması gerekir.
zh_hans: 输入值必须为正数。
zh_hant: 輸入必須是正數。

# inputSequenceEmpty
source: The input sequence was empty.
cs: Vstupní sekvence byla prázdná.
de: Die Eingabesequenz war leer.
es: La secuencia de entrada estaba vacía.
fr: La séquence d'entrée était vide.
it: Sequenza di input vuota.
ja: 入力シーケンスが空でした。
ko: 입력 시퀀스가 비어 있습니다.
pl: Sekwencja wejściowa jest pusta.
pt_br: A sequência de entrada estava vazia.
ru: Входная последовательность была пуста.
tr: Giriş dizisi boştu.
zh_hans: 输入序列为空。
zh_hant: 輸入序列是空的。

# invalidTupleTypes
source: This is not a valid tuple type for the F# reflection library.
cs: Toto není platný typ řazené kolekce členů pro knihovnu reflexe jazyka F#.
de: Dies ist kein gültiger Tupeltyp für die F#-Reflektionsbibliothek.
es: Este no es un tipo de tupla válido para la biblioteca de reflexión F#.
fr: Il ne s'agit pas d'un type tuple valide pour la bibliothèque Reflection F#.
it: Tipo di tupla non valido per la libreria di reflection F#.
ja: これは F# リフレクション ライブラリに対して有効なタプル型ではありません。
ko: F# 리플렉션 라이브러리에 대한 올바른 튜플 형식이 아닙니다.
pl: To nie jest prawidłowy typ krotki dla biblioteki odbić F#.
pt_br: Tipo de tupla inválido para a biblioteca de reflexão F#.
ru: Это недопустимый тип кортежа для библиотеки отражения F#.
tr: Bu, F# yansıma kitaplığı için geçerli bir demet türü değil.
zh_hans: 这不是 F# 反射库的有效元组类型。
zh_hant: 這不是 F# 反映庫的有效元組型別。

# keyNotFound
source: The item, key, or index was not found in the collection.
cs: V kolekci nebyla nalezena položka, klíč nebo index.
de: Das Element, der Schlüssel oder der Index wurde in der Auflistung nicht gefunden.
es: No se encontró el elemento, la clave o el índice en la colección.
fr: L'élément, la clé ou l'index est introuvable dans la collection.
it: Elemento, chiave o indice non trovato nella raccolta.
ja: 項目、キー、またはインデックスがコレクションに見つかりませんでした。
ko: 컬렉션에서 항목, 키 또는 인덱스를 찾을 수 없습니다.
pl: W kolekcji nie odnaleziono elementu, klucza lub indeksu.
pt_br: Item, chave ou índice não localizado na coleção.
ru: Элемент, ключ или индекс не найдены в коллекции.
tr: Belirtilen öğe, anahtar veya dizin koleksiyonda bulunamadı.
zh_hans: 未在集合中找到相应的项、键或索引。
zh_hant: 在集合中找不到項目、索引鍵或索引。

# listsHadDifferentLengths
source: The lists had different lengths.
cs: Seznamy měly rozdílné délky.
de: Die Längen der Listen waren unterschiedlich.
es: Las listas tenían longitudes diferentes.
fr: Les listes ont des longueurs différentes.
it: Gli elenchi hanno lunghezza diversa.
ja: リストの長さが異なります。
ko: 목록의 길이가 서로 다릅니다.
pl: Listy mają różne długości.
pt_br: As listas tinham tamanhos diferentes.
ru: Списки разной длины.
tr: Listelerin uzunlukları farklıydı.
zh_hans: 各个列表具有不同的长度。
zh_hant: 清單有不同的長度。

# mailboxProcessorAlreadyStarted
source: The MailboxProcessor has already been started.
cs: Agent MailboxProcessor již byl spuštěn.
de: Der MailboxProcessor wurde bereits gestartet.
es: Ya se inició MailboxProcessor.
fr: MailboxProcessor a déjà été démarré.
it: MailboxProcessor già avviato.
ja: MailboxProcessor は既に開始されています。
ko: MailboxProcessor가 이미 시작되었습니다.
pl: Kolejka MailboxProcessor została już uruchomiona.
pt_br: O MailboxProcessor já foi iniciado.
ru: MailboxProcessor уже запущен.
tr: MailboxProcessor zaten başlatılmış.
zh_hans: 已启动 MailboxProcessor。
zh_hant: 已經啟動 MailboxProcessor。

source: MailboxProcessor.PostAndAsyncReply timed out.
cs: Vypršel časový limit metody MailboxProcessor.PostAndAsyncReply.
de: Das Zeitlimit von MailboxProcessor.PostAndAsyncReply wurde überschritten.
es: Se agotó el tiempo de espera de MailboxProcessor.PostAndAsyncReply.
fr: MailboxProcessor.PostAndAsyncReply a dépassé le délai.
it: Timeout di MailboxProcessor.PostAndAsyncReply.
ja: MailboxProcessor.PostAndAsyncReply がタイムアウトしました。
ko: MailboxProcessor.PostAndAsyncReply 시간이 초과되었습니다.
pl: Upłynął limit czasu działania metody MailboxProcessor.PostAndAsyncReply.
pt_br: Tempo limite de MailboxProcessor.PostAndAsyncReply esgotado.
ru: Истекло время ожидания MailboxProcessor.PostAndAsyncReply.
tr: MailboxProcessor.PostAndAsyncReply zaman aşımına uğradı.
zh_hans: MailboxProcessor.PostAndAsyncReply 超时。
zh_hant: MailboxProcessor.PostAndAsyncReply 逾時。

source: MailboxProcessor.PostAndReply timed out.
cs: Vypršel časový limit metody MailboxProcessor.PostAndReply.
de: Das Zeitlimit von MailboxProcessor.PostAndReply wurde überschritten.
es: Se agotó el tiempo de espera de MailboxProcessor.PostAndReply.
fr: MailboxProcessor.PostAndReply a dépassé le délai.
it: Timeout di MailboxProcessor.PostAndReply.
ja: MailboxProcessor.PostAndReply がタイムアウトしました。
ko: MailboxProcessor.PostAndReply 시간이 초과되었습니다.
pl: Upłynął limit czasu działania metody MailboxProcessor.PostAndReply.
pt_br: Tempo limite de MailboxProcessor.PostAndReply esgotado.
ru: Истекло время ожидания MailboxProcessor.PostAndReply.
tr: MailboxProcessor.PostAndReply zaman aşımına uğradı.
zh_hans: MailboxProcessor.PostAndReply 超时。
zh_hant: MailboxProcessor.PostAndReply 逾時。

source: Mailbox.Receive timed out.
cs: Vypršel časový limit metody Mailbox.Receive.
de: Das Zeitlimit von Mailbox.Receive wurde überschritten.
es: Se agotó el tiempo de espera de Mailbox.Receive.
fr: Mailbox.Receive a dépassé le délai.
it: Timeout di Mailbox.Receive.
ja: Mailbox.Receive がタイムアウトしました。
ko: Mailbox.Receive 시간이 초과되었습니다.
pl: Upłynął limit czasu działania metody Mailbox.Receive.
pt_br: Tempo limite de Mailbox.Receive esgotado.
ru: Истекло время ожидания Mailbox.Receive.
tr: Mailbox.Receive zaman aşımına uğradı.
zh_hans: Mailbox.Receive 超时。
zh_hant: Mailbox.Receive 逾時。
