Repository: dotnet/fsharp
Catalog: src/FSharp.Core/xlf/FSCore.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Mailbox.Scan timed out.
cs: Vypršel časový limit metody Mailbox.Scan.
de: Das Zeitlimit von Mailbox.Scan wurde überschritten.
es: Se agotó el tiempo de espera de Mailbox.Scan.
fr: Mailbox.Scan a dépassé le délai.
it: Timeout di Mailbox.Scan.
ja: Mailbox.Scan がタイムアウトしました。
ko: Mailbox.Scan 시간이 초과되었습니다.
pl: Upłynął limit czasu działania metody Mailbox.Scan.
pt_br: Tempo limite de Mailbox.Scan esgotado.
ru: Истекло время ожидания Mailbox.Scan.
tr: Mailbox.Scan zaman aşımına uğradı.
zh_hans: Mailbox.Scan 超时。
zh_hant: Mailbox.Scan 逾時。

# mapCannotBeMutated
source: Map values cannot be mutated.
cs: Hodnoty mapy nemohou být mutovány.
de: Für Zuordnungswerte kann kein Mutating verwendet werden.
es: Los valores de Map no son mutables.
fr: Les valeurs Map ne peuvent pas être mutées.
it: Non è possibile modificare i valori di Map.
ja: マップ値は変換できません。
ko: 맵 값을 변경할 수 없습니다.
pl: Przyporządkowane wartości nie mogą ulegać mutacjom.
pt_br: Valores de mapa não podem ser modificados.
ru: Значения Map нельзя изменить.
tr: Eşleme değerleri değiştirilemez.
zh_hans: 无法转变映射值。
zh_hant: 不能變更對應值。

# mismatchIARCancel
source: The IAsyncResult object provided does not match this 'Cancel' operation.
cs: Poskytnutý objekt IAsyncResult neodpovídá této operaci Cancel.
de: Das bereitgestellte IAsyncResult-Objekt stimmt nicht mit diesem "Abbrechen"-Vorgang überein.
es: El objeto IAsyncResult proporcionado no coincide con esta operación 'Cancel'.
fr: L'objet IAsyncResult fournir ne correspond pas à cette opération 'Cancel'.
it: Oggetto IAsyncResult specificato non corrispondente all'operazione 'Cancel'.
ja: 提供された IAsyncResult オブジェクトはこの '取り消し' 操作と一致しません。
ko: 제공된 IAsyncResult 개체가 이 '취소' 작업과 일치하지 않습니다.
pl: Podany obiekt IAsyncResult nie pasuje do tej operacji „Cancel”.
pt_br: O objeto IAsyncResult fornecido não corresponde a esta operação 'Cancel'.
ru: Предоставленный объект IAsyncResult не соответствует этой операции Cancel.
tr: Sağlanan IAsyncResult nesnesi bu 'Cancel' işlemiyle eşleşmiyor.
zh_hans: 提供的 IAsyncResult 对象与此“取消”操作不匹配。
zh_hant: 提供的 IAsyncResult 物件不符合此 'Cancel' 作業。

# mismatchIAREnd
source: The IAsyncResult object provided does not match this 'End' operation.
cs: Poskytnutý objekt IAsyncResult neodpovídá této operaci End.
de: Das bereitgestellte IAsyncResult-Objekt stimmt nicht mit diesem "Beenden"-Vorgang überein.
es: El objeto IAsyncResult proporcionado no coincide con la operación 'End'.
fr: L'objet IAsyncResult ne correspond pas à cette opération 'End'.
it: Oggetto IAsyncResult specificato non corrispondente all'operazione 'End'.
ja: 提供された IAsyncResult オブジェクトはこの '終了' 操作と一致しません。
ko: 제공된 IAsyncResult 개체가 이 '종료' 작업과 일치하지 않습니다.
pl: Podany obiekt IAsyncResult nie pasuje do tej operacji „End”.
pt_br: O objeto IAsyncResult fornecido não corresponde a esta operação 'End'.
ru: Предоставленный объект IAsyncResult не соответствует этой операции End.
tr: Sağlanan IAsyncResult nesnesi bu 'End' işlemiyle eşleşmiyor.
zh_hans: 提供的 IAsyncResult 对象与此“结束”操作不匹配。
zh_hant: 提供的 IAsyncResult 物件不符合此 'End' 作業。

# noNegateMinValue
source: Negating the minimum value of a twos complement number is invalid.
cs: Negace minimální hodnoty čísla ve formátu dvojkového doplňku je neplatná.
de: Das Negieren des minimalen Wertes einer Ergänzungszahl ist unzulässig.
es: La negación del valor mínimo de un número complementario de dos no es válida.
fr: La mise en négatif de la valeur minimale du complément à deux d'un nombre n'est pas valide.
it: La negazione del valore minimo di un complemento a due non è valida.
ja: 2 の補数の最小値を無効にすることはできません。
ko: 2의 보수 중 최소값 부정이 잘못되었습니다.
pl: Negacja minimalnej wartości liczby zapisanej w notacji uzupełniania do dwóch jest nieprawidłowa.
pt_br: É inválido negar o valor mínimo de um número de dois complementos.
ru: Инвертировать минимальное значение двоичного дополнения невозможно.
tr: İkiye tamamlanmış bir sayının en küçük değerini eksi yapma geçersizdir.
zh_hans: 对 2 的补数的最小值求反的操作无效。
zh_hant: 對二進位補數的最小值取補數無效。

# checkInit
source: The initialization of an object or value resulted in an object or value being accessed recursively before it was fully initialized.
cs: Inicializace objektu nebo hodnoty způsobila rekurzivní přístup k objektu nebo hodnotě před úplným dokončením inicializace.
de: Aufgrund der Initialisierung eines Objekts oder Werts erfolgte ein rekursiver Zugriff auf ein Objekt bzw. einen Wert, bevor die Initialisierung abgeschlossen war.
es: La inicialización de un objeto o valor generó un objeto o valor al que se obtiene acceso recursivamente antes de haberse inicializado totalmente.
fr: L'initialisation d'un objet ou d'une valeur a provoqué l'accès récursif à un objet ou une valeur avant son initialisation complète.
it: In seguito all'inizializzazione di un oggetto o di un valore, è stato effettuato l'accesso in modo ricorsivo a un oggetto o a un valore prima che fosse completamente inizializzato.
ja: オブジェクトまたは値の初期化の結果、そのオブジェクトまたは値が、完全に初期化される前に再帰的にアクセスされました。
ko: 개체 또는 값을 초기화한 결과 해당 개체 또는 값이 완전히 초기화되기 전에 재귀적으로 액세스되고 있습니다.
pl: Zainicjowanie obiektu lub wartości spowodowało cykliczny dostęp do tego obiektu/wartości przed zakończeniem inicjowania.
pt_br: A inicialização de um objeto ou valor fez que um objeto ou valor fosse acessado recursivamente antes de ser totalmente inicializado.
ru: Инициализация объекта или значения привела к рекурсивному вызову объекта или значения перед его полной инициализацией.
tr: Bir nesnenin veya değerin başlatılması işlemi, tam olarak başlatılmadan önce nesneye veya değere özyinelemeli olarak erişilmesiyle sonuçlandı.
zh_hans: 对象或值的初始化导致对象或值正被按递归方式访问，而尚未完全初始化。
zh_hant: 物件或值的初始化造成物件或值未完全初始化之前就被遞迴存取。

# checkStaticInit
source: The static initialization of a file or type resulted in static data being accessed recursively before it was fully initialized.
cs: Statická inicializace souboru nebo typu způsobila rekurzivní přístup ke statickým datům před úplným dokončením inicializace.
de: Aufgrund der statischen Initialisierung einer Datei oder des Typs erfolgte ein rekursiver Zugriff auf die Daten, bevor diese vollständig initialisiert waren.
es: La inicialización estática de un archivo o tipo generó datos estáticos a los que se obtiene acceso recursivamente antes de haberse inicializado
fr: L'initialisation statique d'un fichier ou d'un type a provoqué l'accès récursif aux données statiques avant son initialisation complète.
it: In seguito all'inizializzazione statica di un file o di un tipo, è stato effettuato l'accesso in modo ricorsivo ai dati statici prima che fossero completamente inizializzati.
ja: ファイルまたは型の静的な初期化の結果、静的データが、完全に初期化される前に再帰的にアクセスされました。
ko: 파일 또는 유형을 정적으로 초기화한 결과 정적 데이터가 완전히 초기화되기 전에 재귀적으로 액세스되고 있습니다.
pl: Statyczne zainicjowanie pliku lub typu spowodowało cykliczny dostęp do statycznych danych przed zakończeniem inicjowania.
pt_br: A inicialização estática de um arquivo ou tipo fez que dados estáticos fossem acessados recursivamente antes de serem totalmente inicializados.
ru: Статическая инициализация файла или типа привела к рекурсивному обращению к статическим данным перед его полной инициализацией.
tr: Bir dosyanın veya türün statik başlatılması işlemi, tam olarak başlatılmadan önce statik verilere özyinelemeli olarak erişilmesiyle sonuçlandı.
zh_hans: 文件或类型的静态初始化导致静态数据正被按递归方式访问，而其尚未完全初始化。
zh_hant: 檔案或類型的靜態初始化造成靜態資料未完全初始化之前就被遞迴存取。

# nonZeroBasedDisallowed
source: Arrays with non-zero base cannot be created on this platform.
cs: Na této platformě nelze vytvářet pole, která nejsou počítána od nuly.
de: Auf dieser Plattform können keine Arrays mit einer Basis ungleich null erstellt werden.
es: No se pueden crear matrices con base distinta de cero en esta plataforma.
fr: Les tableaux avec une base différente de zéro ne peuvent pas être créés sur cette plateforme.
it: Non è possibile creare matrici con basi diverse da zero in questa piattaforma.
ja: このプラットフォームでは、ゼロ以外を基数とする配列を作成できません。
ko: 이 플랫폼에서는 0부터 시작하지 않는 배열을 만들 수 없습니다.
pl: Na tej platformie nie można tworzyć tablic o wartości początkowej zero.
pt_br: Matrizes com base diferente de zero não podem ser criadas nesta plataforma.
ru: На этой платформе невозможно создание массивов с ненулевой базой.
tr: Bu platformda sıfır tabanlı olmayan diziler oluşturulamaz.
zh_hans: 无法在此平台上创建不是从零数开始的数组。
zh_hant: 在這個平台上無法建立以非零為起始的陣列。

# notAFunctionType
source: Type '{0}' is not a function type.
cs: Typ {0} není typ funkce.
de: Der Typ "{0}" ist kein Funktionstyp.
es: El tipo '{0}' no es un tipo de función.
fr: Le type '{0}' n'est un type de fonction.
it: Il tipo '{0}' non è un tipo di funzione.
ja: 型 '{0}' は関数型ではありません。
ko: '{0}' 형식은 함수 형식이 아닙니다.
pl: Typ „{0}” nie jest typem funkcji.
pt_br: O tipo '{0}' não é um tipo de função.
ru: Тип "{0}" не является функциональным типом.
tr: '{0}' türü bir işlev türü değil.
zh_hans: 类型“{0}”不是函数类型。
zh_hant: 類型 '{0}' 不是函式類型。

# notAnExceptionType
source: Type '{0}' is not the representation of an F# exception declaration.
cs: Typ {0} není reprezentací deklarace výjimky jazyka F#.
de: Der Typ "{0}" ist keine Darstellung einer F#-Ausnahmedeklaration.
es: El tipo '{0}' no es la representación de una declaración de excepción F#.
fr: Le type '{0}' n'est pas la représentation d'une déclaration d'exception F#.
it: Il tipo '{0}' non è una rappresentazione di una dichiarazione di eccezione F#.
ja: 型 '{0}' は F# 例外宣言の表現ではありません。
ko: '{0}' 형식은 F# 예외 선언의 표현이 아닙니다.
pl: Typ „{0}” nie reprezentuje deklaracji wyjątku języka F#.
pt_br: O tipo '{0}' não é a representação de uma declaração de exceção F#.
ru: Тип "{0}" не является представлением объявления исключения F#.
tr: '{0}' türü bir F# özel durum bildirimini temsil etmiyor.
zh_hans: 类型“{0}”不是 F# 异常声明的表示形式。
zh_hant: 類型 '{0}' 不是 F# 例外狀況宣告的表示。

# notAPermutation
source: The function did not compute a permutation.
cs: Funkce nevypočítala permutaci.
de: Die Funktion hat keine Permutation berechnet.
es: La función no calculó una permutación.
fr: La fonction n'a pas calculé une permutation.
it: Permutazione non calcolata dalla funzione.
ja: 関数は順列をコンピューティングしませんでした。
ko: 함수가 순열을 계산하지 않습니다.
pl: Funkcja nie oblicza permutacji.
pt_br: A função não computou uma permuta.
ru: Функция не вычислила перестановку.
tr: İşlev bir permütasyon hesaplamadı.
zh_hans: 该函数不计算排列。
zh_hant: 這個函式未計算排列。

# notARecordType
source: Type '{0}' is not an F# record type.
cs: Typ {0} není typ záznamu jazyka F#.
de: Der Typ "{0}" ist kein F#-Datensatztyp.
es: El tipo '{0}' no es un tipo de registro F#.
fr: Le type '{0}' n'est pas un type d'enregistrement F#.
it: Il tipo '{0}' non è un tipo di record F#.
ja: 型 '{0}' は F# レコード型ではありません。
ko: '{0}' 형식은 F# 레코드 형식이 아닙니다.
pl: Typ „{0}” nie jest typem rekordu języka F#.
pt_br: O tipo '{0}' não é um tipo de registro F#.
ru: Тип "{0}" не является типом записи F#.
tr: '{0}' türü bir F# kayıt türü değil.
zh_hans: 类型“{0}”不是 F# 记录类型。
zh_hant: 類型 '{0}' 不是 F# 記錄類型。

# notATupleType
source: Type '{0}' is not a tuple type.
cs: Typ {0} není typ řazené kolekce členů.
de: Der Typ "{0}" ist kein Tupeltyp.
es: El tipo '{0}' no es un tipo de tupla.
fr: Le type '{0}' n'est pas un type tuple.
it: Il tipo '{0}' non è un tipo di tupla.
ja: 型 '{0}' はタプル型ではありません。
ko: '{0}' 형식은 튜플 형식이 아닙니다.
pl: Typ „{0}” nie jest typem krotki.
pt_br: O tipo '{0}' não é um tipo de tupla.
ru: Тип "{0}" не является кортежным типом.
tr: '{0}' türü bir demet türü değil.
zh_hans: 类型“{0}”不是元组类型。
zh_hant: 型別 '{0}' 不是元組型別。

# notAUnionType
source: Type '{0}' is not an F# union type.
cs: Typ {0} není typ union jazyka F#.
de: Der Typ "{0}" ist kein F#-Union-Typ.
es: El tipo '{0}' no es un tipo de unión F#.
fr: Le type '{0}' n'est pas un type union F#.
it: Il tipo '{0}' non è un tipo di unione F#.
ja: 型 '{0}' は F# 共用体型ではありません。
ko: '{0}' 형식은 F# 공용 구조체 형식이 아닙니다.
pl: Typ „{0}” nie jest typem unii języka F#.
pt_br: O tipo '{0}' não é um tipo de união F#.
ru: Тип "{0}" не является типом объединения F#.
tr: '{0}' türü bir F# birleşim türü değil.
zh_hans: 类型“{0}”不是 F# 联合类型。
zh_hant: 型別 '{0}' 不是 F# 等位型別。

# notComparable
source: The two objects have different types and are not comparable.
cs: Tyto dva objekty mají rozdílné typy a nelze je porovnat.
de: Die beiden Objekte haben verschiedene Typen und sind nicht vergleichbar.
es: Los dos objetos tienen tipos diferentes y no se pueden comparar.
fr: Les deux objets ont des types différents et ne sont pas comparables.
it: I due oggetti hanno tipi diversi e non sono confrontabili.
ja: 2 つのオブジェクトの型が異なり、比較できません。
ko: 두 개체의 형식이 다르므로 비교할 수 없습니다.
pl: Te dwa obiekty są różnego typu, dlatego nie można ich porównać.
pt_br: Os dois objetos possuem tipos diferentes e não são comparáveis.
ru: Эти два объекта имеют разные типы и не являются сравнимыми.
tr: İki nesne farklı türlere sahip ve karşılaştırılamaz.
zh_hans: 两个对象具有不同的类型，不可以进行比较。
zh_hant: 兩個物件有不同的類型，無法進行計算。

# notEnoughElements
source: The input sequence has an insufficient number of elements.
cs: Vstupní sekvence má nedostatečný počet prvků.
de: Die Eingabesequenz hat eine unzureichende Anzahl von Elementen.
es: La secuencia de entrada tiene un número insuficiente de elementos.
fr: La séquence d'entrée n'a pas un nombre d'éléments suffisant.
it: Numero insufficiente di elementi nella sequenza di input.
ja: 入力シーケンスには十分な数の要素がありません。
ko: 입력 시퀀스의 요소 수가 부족합니다.
pl: Sekwencja wejściowa zawiera niewystarczającą liczbę elementów.
pt_br: A sequência de entrada possui um número insuficiente de elementos.
ru: Входная последовательность содержит недостаточное число элементов.
tr: Giriş dizisinde yetersiz sayıda öğe var.
zh_hans: 输入序列具有的元素数目不足。
zh_hant: 輸入序列的項目數目不足。

# notUsedForHashing
source: This object is for recursive equality calls and cannot be used for hashing.
cs: Tento objekt je určen pro rekurzivní volání rovnosti a nelze jej použít pro algoritmus hash.
de: Dieses Objekt ist für rekursive Gleichheitsaufrufe vorgesehen und kann nicht für Hashing verwendet werden.
es: Este objeto es para llamadas de igualdad recursivas y no se puede usar para algoritmos hash.
fr: Cet objet est destiné aux appels d'égalité récursifs et ne peut pas être utilisé pour le hachage.
it: L'oggetto è destinato alle chiamate di uguaglianza ricorsive e non è possibile usarlo per l'hashing.
ja: このオブジェクトは再帰的な等値呼び出し用であり、ハッシュには使用できません。
ko: 이 개체는 재귀 동등 호출용이므로 해시용으로 사용할 수 없습니다.
pl: Ten obiekt jest przeznaczony dla cyklicznego wywoływania porównań i nie może służyć do tworzenia skrótów.
pt_br: Este objeto é para chamadas de igualdade recursivas e não pode ser usado para hash.
ru: Этот объект предназначен для рекурсивных вызовов равенства и не может использоваться для хеширования.
tr: Bu nesne özyinelemeli eşitlik çağrıları içindir ve karma işlevi için kullanılamaz.
zh_hans: 此对象用于递归相等调用，而不能用于哈希处理。
zh_hant: 這個物件用於遞迴等式呼叫，無法用於雜湊。

# nullsNotAllowedInArray
source: One of the elements in the array is null.
cs: Jeden z prvků v poli má hodnotu null.
de: Eines der Elemente im Array ist NULL.
es: Uno de los elementos de la matriz es nulo.
fr: L'un des éléments dans le tableau est null.
it: Uno degli elementi nella matrice è Null.
ja: 配列の要素の 1 つが null です。
ko: 배열에 있는 요소 중 하나가 null입니다.
pl: Jeden z elementów w tablicy ma wartość zerową.
pt_br: Um dos elementos na matriz é nulo.
ru: Один из элементов массива имеет неопределенное (null) значение.
tr: Dizideki öğelerden biri null.
zh_hans: 数组中的某个元素为 null。
zh_hant: 陣列中的其中一個元素為 null。

# objIsNotARecord
source: The object is not an F# record value.
cs: Objekt není hodnotou záznamu jazyka F#.
de: Das Objekt ist kein F#-Datensatzwert.
es: El objeto no es un valor de registro F#.
fr: L'objet n'est pas une valeur d'enregistrement F#.
it: L'oggetto non è un valore di record F#.
ja: オブジェクトは F# レコード値ではありません。
ko: 개체가 F# 레코드 값이 아닙니다.
pl: Obiekt nie jest wartością rekordu języka F#.
pt_br: O objeto não é um valor de registro F#.
ru: Объект не является типом записи F#.
tr: Nesne bir F# kayıt değeri değil.
zh_hans: 该对象不是 F# 记录值。
zh_hant: 這個物件不是 F# 記錄值。

# objIsNullAndNoType
source: The object is null and no type was given. Either pass a non-null object or a non-null type parameter.
cs: Objekt má hodnotu null a nebyl určen žádný typ. Buď předejte objekt, který nemá hodnotu null, nebo parametr typu, který nemá hodnotu null.
de: Das Objekt ist NULL und kein Typ wurde angegeben. Übergeben Sie entweder einen Nicht-NULL-Objektparameter oder einen Nicht-NULL-Typparameter.
es: El objeto es nulo y no se proporcionó ningún tipo. Pase un objeto o un parámetro de tipo que no sean nulos.
fr: L'objet est null et aucun type n'a été indiqué. Passez un objet qui n'est pas null ou un paramètre de type qui n'est pas null.
it: L'oggetto è Null e non è stato specificato alcun tipo. Passare un oggetto non Null o un parametro di tipo non Null.
ja: オブジェクトは null であり、型が指定されていません。null 以外のオブジェクトまたは null 以外の型パラメーターを渡してください。
ko: 개체가 null이며 형식이 지정되지 않았습니다. null이 아닌 개체 또는 null이 아닌 형식 매개 변수를 전달하세요.
pl: Obiekt ma wartość zerową oraz nie określono jego typu. Podaj obiekt niepusty albo parametr o zdefiniowanym typie.
pt_br: O objeto é nulo e nenhum tipo foi especificado. Passe um objeto não nulo ou um parâmetro de tipo não nulo.
ru: Объект имеет неопределенное (null) значение или тип не был задан. Передайте либо ненулевой (не null) объект, либо непустой (не null) параметр типа.
tr: Nesne null ve hiçbir tür verilmedi. Null olmayan bir nesne ya da null olmayan türde bir parametre geçirin.
zh_hans: 该对象为 null，并且未给定任何类型。 请传递一个非 null 对象，或者传递一个非 null 类型参数。
zh_hant: 這個物件為 null，而且未指定任何型別。請傳遞一個非 null 物件或一個非 null 型別參數。

# outOfRange
source: The index is outside the legal range.
cs: Index je mimo přípustný rozsah.
de: Der Index liegt außerhalb des zulässigen Bereichs.
es: El índice está fuera del intervalo correcto.
fr: L'index se trouve en dehors de la plage légale.
it: L'indice non è compreso nell'intervallo valido.
ja: インデックスは有効範囲外です。
ko: 인덱스가 올바른 범위를 벗어났습니다.
pl: Wartość indeksu leży poza dozwolonym zakresem.
pt_br: O índice está fora do intervalo válido.
ru: Индекс находится вне допустимого диапазона.
tr: Dizin geçerli aralığın dışında.
zh_hans: 索引超出了合法范围。
zh_hant: 索引在合法範圍之外。

# privateExceptionType
source: The type '{0}' is the representation of an F# exception declaration but its representation is private. You must specify BindingFlags.NonPublic to access private type representations.
cs: Typ {0} je reprezentací deklarace výjimky jazyka F#, ale jeho reprezentace je privátní. Aby bylo možné přistupovat k privátním reprezentacím typů, je nutné určit příznak BindingFlags.NonPublic.
de: Der Typ "{0}" ist die Darstellung einer F#-Ausnahmendeklaration, aber die Darstellung ist privat. Sie müssen BindingFlags.NonPublic angeben, um auf Darstellungen vom Typ "privat" zuzugreifen.
es: El tipo '{0}' es la representación de una declaración de excepción F# pero su representación es privada. Debe especificar BindingFlags.NonPublic para obtener acceso a representaciones de tipo privadas.
fr: Le type '{0}' est la représentation d'une déclaration d'exception F#, mais sa représentation est privée. Vous devez spécifier BindingFlags.NonPublic pour accéder à des représentations de type privé.
it: Il tipo '{0}' è la rappresentazione di una dichiarazione di eccezione F#, tuttavia la relativa rappresentazione è privata. Per accedere a rappresentazioni di tipo privato è necessario specificare BindingFlags.NonPublic.
ja: 型 '{0}' は F# 例外宣言の表現ですが、その表現はプライベートです。プライベート型表現にアクセスするには BindingFlags.NonPublic を指定する必要があります。
ko: '{0}' 형식은 F# 예외 선언의 표현인데 표현은 전용입니다. 전용 형식 표현에 액세스하려면 BindingFlags.NonPublic을 지정해야 합니다.
pl: Typ „{0}” reprezentuje deklarację wyjątku języka F#, jednak reprezentacja ta ma charakter prywatny. Aby mieć dostęp do reprezentacji prywatnych, należy ustawić flagę BindingFlags.NonPublic.
pt_br: O tipo '{0}' é a representação de uma declaração de exceção F#, mas sua representação é particular. É necessário especificar BindingFlags.NonPublic para acessar representações de tipo particular.
ru: Тип "{0}" является представлением объявления исключения F#, но его представление является частным. Необходимо указать BindingFlags.NonPublic для доступа к представления частных типов.
tr: '{0}' türü bir F# özel durum bildirimini temsil ediyor ancak temsili özel değil. Özel tür temsillerine erişmek için BindingFlags.NonPublic belirtmelisiniz.
zh_hans: 类型“{0}”是 F# 异常声明的表示形式，但其表示形式是私有的。您必须指定 BindingFlags.NonPublic，才能访问私有类型表示形式。
zh_hant: 類型 '{0}' 是 F# 例外狀況宣告的表示，但其表示是私用的。您必須指定 BindingFlags.NonPublic，才能存取私用類型表示。

# privateRecordType
source: The type '{0}' is an F# record type but its representation is private. You must specify BindingFlags.NonPublic to access private type representations.
cs: Typ {0} je reprezentací typu záznamu jazyka F#, ale jeho reprezentace je privátní. Aby bylo možné přistupovat k privátním reprezentacím typů, je nutné určit příznak BindingFlags.NonPublic.
de: Der Typ "{0}" ist ein F#-Datensatztyp, aber die Darstellung ist privat. Sie müssen BindingFlags.NonPublic angeben, um auf Darstellungen vom Typ "privat" zuzugreifen.
es: El tipo '{0}' es un tipo de registro F# pero su representación es privada. Debe especificar BindingFlags.NonPublic para obtener acceso a representaciones de tipo privadas.
fr: Le type '{0}' est un type d'enregistrement F#, mais sa représentation est privée. Vous devez spécifier BindingFlags.NonPublic pour accéder à des représentations de type privé.
it: Il tipo '{0}' è un tipo di record F#, tuttavia la relativa rappresentazione è privata. Per accedere a rappresentazioni di tipo privato è necessario specificare BindingFlags.NonPublic.
ja: 型 '{0}' は F# レコード型ですが、その表現はプライベートです。プライベート型表現にアクセスするには BindingFlags.NonPublic を指定する必要があります。
ko: '{0}' 형식은 F# 레코드 형식인데 표현은 전용입니다. 전용 형식 표현에 액세스하려면 BindingFlags.NonPublic을 지정해야 합니다.
pl: Typ „{0}” reprezentuje typ rekordu języka F#, jednak reprezentacja ta ma charakter prywatny. Aby mieć dostęp do reprezentacji prywatnych, należy ustawić flagę BindingFlags.NonPublic.
pt_br: O tipo '{0}' é um tipo de registro F#, mas sua representação é particular. É necessário especificar BindingFlags.NonPublic para acessar representações de tipo particular.
ru: Тип "{0}" является типом записи F#, но его представление является частным. Необходимо указать BindingFlags.NonPublic для доступа к представления частных типов.
tr: '{0}' türü bir F# kayıt türü ancak temsili özel değil. Özel tür temsillerine erişmek için BindingFlags.NonPublic belirtmelisiniz.
zh_hans: 类型“{0}”是 F# 记录类型，但其表示形式是私有的。您必须指定 BindingFlags.NonPublic，才能访问私有类型表示形式。
zh_hant: 類型 '{0}' 是 F# 記錄類型，但其表示是私用的。您必須指定 BindingFlags.NonPublic，才能存取私用類型表示。
