Repository: dotnet/fsharp
Catalog: src/FSharp.Core/xlf/FSCore.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# privateUnionType
source: The type '{0}' is an F# union type but its representation is private. You must specify BindingFlags.NonPublic to access private type representations.
cs: Typ {0} je reprezentací typu union jazyka F#, ale jeho reprezentace je privátní. Aby bylo možné přistupovat k privátním reprezentacím typů, je nutné určit příznak BindingFlags.NonPublic.
de: Der Typ "{0}" ist ein F#-Union-Typ, aber die Darstellung ist privat. Sie müssen BindingFlags.NonPublic angeben, um auf Darstellungen vom Typ "privat" zuzugreifen.
es: El tipo '{0}' es un tipo de unión F# pero su representación es privada. Debe especificar BindingFlags.NonPublic para obtener acceso a representaciones de tipo privadas.
fr: Le type '{0}' est un type union F#, mais sa représentation est privée. Vous devez spécifier BindingFlags.NonPublic pour accéder à des représentations de type privé.
it: Il tipo '{0}' è un tipo di unione F#, tuttavia la relativa rappresentazione è privata. Per accedere a rappresentazioni di tipo privato è necessario specificare BindingFlags.NonPublic.
ja: 型 '{0}' は F# 共用体型ですが、その表現はプライベートです。プライベート型表現にアクセスするには BindingFlags.NonPublic を指定する必要があります。
ko: '{0}' 형식은 F# 공용 구조체 형식인데 표현은 전용입니다. 전용 형식 표현에 액세스하려면 BindingFlags.NonPublic을 지정해야 합니다.
pl: Typ „{0}” reprezentuje typ unii języka F#, jednak reprezentacja ta ma charakter prywatny. Aby mieć dostęp do reprezentacji prywatnych, należy ustawić flagę BindingFlags.NonPublic.
pt_br: O tipo '{0}' é um tipo de união F#, mas sua representação é particular. É necessário especificar BindingFlags.NonPublic para acessar representações de tipo particular.
ru: Тип "{0}" является типом объединения F#, но его представление является частным. Необходимо указать BindingFlags.NonPublic для доступа к представления частных типов.
tr: '{0}' türü bir F# birleşim türü ancak temsili özel değil. Özel tür temsillerine erişmek için BindingFlags.NonPublic belirtmelisiniz.
zh_hans: 类型“{0}”是 F# 联合类型，但其表示形式是私有的。您必须指定 BindingFlags.NonPublic，才能访问私有类型表示形式。
zh_hant: 型別 '{0}' 是 F# 等位型別，但其表示為私用。您必須指定 BindingFlags.NonPublic，才能存取私用型別表示。

# QexpectedOneType
source: Expected exactly one type argument.
cs: Byl očekáván přesně jeden argument typu.
de: Es wurde genau ein Typargument erwartet.
es: Se esperaba exactamente un argumento de tipo.
fr: Un argument de type exactement attendu.
it: È previsto esattamente un solo argomento tipo.
ja: 型引数が 1 つだけ必要でした。
ko: 정확히 형식 인수 하나만 필요합니다.
pl: Oczekiwano dokładnie jednego argumentu typu.
pt_br: Exatamente um argumento de tipo esperado.
ru: Требуется ровно один аргумент типа.
tr: Tam olarak bir tür bağımsız değişkeni bekleniyor.
zh_hans: 应正好为一个类型参数。
zh_hant: 只能有一個型別引數。

# QexpectedTwoTypes
source: Expected exactly two type arguments.
cs: Byly očekávány přesně dva argumenty typu.
de: Es wurden genau zwei Typargumente erwartet.
es: Se esperaban exactamente dos argumentos de tipo.
fr: Deux arguments de type exactement attendus.
it: Sono previsti esattamente due argomenti tipo.
ja: 型引数が 2 つだけ必要でした。
ko: 정확히 형식 인수 두 개만 필요합니다.
pl: Oczekiwano dokładnie dwóch argumentów typu.
pt_br: Exatamente dois argumentos de tipo esperados.
ru: Требуется ровно два аргумента типа.
tr: Tam olarak iki tür bağımsız değişkeni bekleniyor.
zh_hans: 应正好为两个类型参数。
zh_hant: 只能有兩個類型引數。

# QinvalidCaseIndex
source: Not a valid F# union case index.
cs: Nejedená se o platný index případu typu union jazyka F#.
de: Kein gültiger F#-Union-Fallindex.
es: No es un índice de caso de unión F# válido.
fr: Index de cas d'union F# non valide.
it: Indice case di unione F# non valido.
ja: 有効な F# 共用体ケース インデックスではありません。
ko: 올바른 F# 공용 구조체 케이스 인덱스가 아닙니다.
pl: Nieprawidłowy indeks instrukcji „case” złożenia języka F#.
pt_br: Não é um índice de caso união F# válido.
ru: Не является допустимым индексом случая объединения F#.
tr: Geçerli bir F# birleşim durumu dizini değil.
zh_hans: 不是有效的 F# 联合用例索引。
zh_hant: 不是有效的 F# 聯集索引。

# QmissingRecordField
source: Type '{0}' did not have an F# record field named '{1}'.
cs: Typ {0} neobsahoval pole záznamu jazyka F# s názvem {1}.
de: Der Typ "{0}" wies kein F#-Datensatzfeld mit dem Namen "{1}" auf.
es: El tipo '{0}' no tenía un campo de registro F# denominado '{1}'.
fr: Le type '{0}' n'a pas de champ d'enregistrement F# nommé '{1}'.
it: Il tipo '{0}' non ha un campo di record F# denominato '{1}'.
ja: 型 '{0}' には '{1}' という名前の F# レコード フィールドがありませんでした。
ko: {0}' 형식에 이름이 '{1}'인 F# 레코드 필드가 없습니다.
pl: Typ „{0}” nie zawiera pola rekordu języka F# o nazwie „{1}”.
pt_br: O tipo '{0}' não tinha um campo de registro F# denominado '{1}'.
ru: Тип "{0}" не имеет поля записи F# с именем "{1}".
tr: {0}' türünde '{1}' adlı bir F# kayıt alanı yoktu.
zh_hans: 类型“{0}”不具有名为“{1}”的 F# 记录字段。
zh_hant: 類型 '{0}' 沒有名為 '{1}' 的 F# 記錄欄位。

# QmissingUnionCase
source: Type '{0}' did not have an F# union case named '{1}'.
cs: Typ {0} neobsahoval případ typu union jazyka F# s názvem {1}.
de: Der Typ "{0}" wies keinen F#-Union-Fall mit dem Namen "{1}" auf.
es: El tipo '{0}' no tenía un caso de unión F# denominado '{1}'.
fr: Le type '{0}' n'a pas de cas d'union F# nommé '{1}'.
it: Il tipo '{0}' non ha un case di unione F# denominato '{1}'.
ja: 型 '{0}' には '{1}' という名前の F# 共用体ケースがありませんでした。
ko: {0}' 형식에 이름이 '{1}'인 F# 공용 구조체 케이스가 없습니다.
pl: Typ „{0}” nie zawiera instrukcji „case” złożenia języka F# o nazwie „{1}”.
pt_br: O tipo '{0}' não tinha um caso união F# denominado '{1}'.
ru: Тип "{0}" не имеет случая объединения F# с именем "{1}".
tr: {0}' türünde '{1}' adlı bir F# birleşim durumu yoktu.
zh_hans: 类型“{0}”不具有名为“{1}”的 F# 联合用例。
zh_hant: 類型 '{0}' 沒有名為 '{1}' 的 F# 聯集。

# QtmmBadFieldType
source: Type mismatch when building '{0}': the type of the field was incorrect. Expected '{1}', but received type '{2}'.
cs: Neshoda typů při sestavování {0}: typ pole byl nesprávný. Očekávaný typ byl {1}, ale přijatý typ byl {2}.
de: Typenkonflikt beim Erstellen von "{0}": Der Typ des Felds war falsch. Erwartet wurde "{1}", aber der Typ "{2}" wurde empfangen.
es: Incoherencia de tipos al compilar '{0}': el tipo del campo era incorrecto. Se esperaba '{1}', pero se recibió el tipo '{2}'.
fr: Incompatibilité de type lors de la création de '{0}' : le type du champ était incorrect. '{1}' attendu, mais type '{2}' reçu.
it: Tipo non corrispondente durante la compilazione di '{0}': il tipo del campo non è corretto. Previsto '{1}', tipo ricevuto '{2}'.
ja: {0}' を構築するときの型の不一致: フィールドの型が正しくありませんでした。'{1}' が必要でしたが、型 '{2}' を受け取りました。
ko: {0}'을(를) 작성하는 동안 형식 불일치 문제가 발생했습니다. 필드의 형식이 잘못되었습니다. '{1}'이(가) 필요한데 '{2}' 형식을 수신했습니다.
pl: Niezgodność typów podczas kompilowania elementu „{0}”: błędny typ pola. Oczekiwano typu „{1}”, natomiast stwierdzono typ „{2}”.
pt_br: Tipos incompatíveis ao compilar '{0}': tipo de campo incorreto. '{1}' esperado, mas o tipo recebido foi '{2}'.
ru: Несоответствие типа при сборке "{0}": не верный тип поля. Требуется "{1}", но получен тип "{2}".
tr: {0}' oluşturulurken tür uyuşmazlığı oluştu: alanın türü yanlıştı. '{1}' bekleniyordu, ancak '{2}' türü alındı.
zh_hans: 在生成“{0}”时类型不匹配: 字段的类型不正确。应为“{1}”，但收到的类型为“{2}”。
zh_hant: 建置 '{0}' 時發生類型不符的情況: 欄位類型不正確。必須是 '{1}'，但卻收到類型 '{2}'。

# QtmmBodyMustBeUnit
source: Type mismatch when building '{0}': body must return unit. Expected '{1}', but received type '{2}'.
cs: Neshoda typů při sestavování {0}: tělo musí vracet výraz typu unit. Očekávaný typ byl {1}, ale přijatý typ byl {2}.
de: Typenkonflikt beim Erstellen von "{0}": Der Textkörper muss eine Einheit zurückgeben. Erwartet wurde "{1}", aber der Typ "{2}" wurde empfangen.
es: Incoherencia de tipos al compilar '{0}': el cuerpo debe devolver una unidad. Se esperaba '{1}', pero se recibió el tipo '{2}'.
fr: Incompatibilité de type lors de la création de '{0}' : le corps doit renvoyer l'unité. '{1}' attendu, mais type '{2}' reçu.
it: Tipo non corrispondente durante la compilazione di '{0}': il corpo deve restituire un'unità. Previsto '{1}', tipo ricevuto '{2}'.
ja: {0}' を構築するときの型の不一致: 本体はユニットを返す必要があります。'{1}' が必要でしたが、型 '{2}' を受け取りました。
ko: {0}'을(를) 작성하는 동안 형식 불일치 문제가 발생했습니다. 본문이 단위를 반환해야 합니다. '{1}'이(가) 필요한데 '{2}' 형식을 수신했습니다.
pl: Niezgodność typów podczas kompilowania elementu „{0}”: z treści musi być zwracana jednostka. Oczekiwano typu „{1}”, natomiast stwierdzono typ „{2}”.
pt_br: Tipos incompatíveis ao compilar '{0}': o corpo deve retornar unidade. '{1}' esperado, mas o tipo recebido foi '{2}'.
ru: Несоответствие типа при сборке "{0}": body должен возвращать значение типа unit. Требуется "{1}", но получен тип "{2}".
tr: {0}' oluşturulurken tür uyuşmazlığı oluştu: gövde birim döndürmelidir. '{1}' bekleniyordu, ancak '{2}' türü alındı.
zh_hans: 在生成“{0}”时类型不匹配: body 必须返回 unit。应为“{1}”，但收到的类型为“{2}”。
zh_hant: 建置 '{0}' 時發生類型不符的情況: 主體必須傳回單位。必須是 '{1}'，但卻收到類型 '{2}'。

# QtmmCondMustBeBool
source: Type mismatch when building '{0}': condition expression must be of type bool. Expected '{1}', but received type '{2}'.
cs: Neshoda typů při sestavování {0}: výraz podmínky musí být typu bool. Očekávaný typ byl {1}, ale přijatý typ byl {2}.
de: Typenkonflikt beim Erstellen von "{0}": Der Bedingungsausdruck muss vom Typ "boolesch" sein. Erwartet wurde "{1}", aber der Typ "{2}" wurde empfangen.
es: Incoherencia de tipos al compilar '{0}': la expresión de condición debe ser de tipo booleano. Se esperaba '{1}', pero se recibió el tipo '{2}'.
fr: Incompatibilité de type lors de la création de '{0}' : l'expression de condition doit être de type bool. '{1}' attendu, mais type '{2}' reçu.
it: Tipo non corrispondente durante la compilazione di '{0}': l'espressione della condizione deve essere di tipo booleano. Previsto '{1}', tipo ricevuto '{2}'.
ja: {0}' を構築するときの型の不一致: 条件式は bool 型である必要があります。'{1}' が必要でしたが、型 '{2}' を受け取りました。
ko: {0}'을(를) 작성하는 동안 형식 불일치 문제가 발생했습니다. 조건식이 부울 형식이어야 합니다. '{1}'이(가) 필요한데 '{2}' 형식을 수신했습니다.
pl: Niezgodność typów podczas kompilowania elementu „{0}”: wyrażenie warunku musi być wyrażeniem logicznym. Oczekiwano typu „{1}”, natomiast stwierdzono typ „{2}”.
pt_br: Tipos incompatíveis ao compilar '{0}': a expressão de condição deve ser do tipo booliana. '{1}' esperado, mas o tipo recebido foi '{2}'.
ru: Несоответствие типа при сборке "{0}": выражение условия должно иметь тип bool. Требуется "{1}", но получен тип "{2}".
tr: {0}' oluşturulurken tür uyuşmazlığı oluştu: koşul ifadesi bool türünde olmalıdır. '{1}' bekleniyordu, ancak '{2}' türü alındı.
zh_hans: 在生成“{0}”时类型不匹配: 条件表达式的类型必须为 bool。应为“{1}”，但收到的类型为“{2}”。
zh_hant: 建置 '{0}' 時發生類型不符的情況: 條件運算式的類型必須是布林。必須是 '{1}'，但卻收到類型 '{2}'。

# QtmmExpectedFunction
source: Type mismatch when building '{0}': expected function type in function application or let binding. Expected '{1}', but received type '{2}'.
cs: Neshoda typů při sestavování {0}: při použití funkce nebo vytvoření vazby přiřazení let byl očekáván typ funkce. Očekávaný typ byl {1}, ale přijatý typ byl {2}.
de: Typenkonflikt beim Erstellen von "{0}": Erwartet wurde ein Funktionstyp in der Anwendungs- oder Let-Bindung der Funktion. Erwartet wurde "{1}", aber der Typ "{2}" wurde empfangen.
es: Incoherencia de tipos al compilar '{0}': se esperaba un tipo de función en la aplicación de función o un enlace let. Se esperaba '{1}', pero se recibió el tipo '{2}'.
fr: Incompatibilité de type lors de la création de '{0}' : type de fonction attendu dans l'application de fonction ou liaison let. '{1}' attendu, mais type '{2}' reçu.
it: Tipo non corrispondente durante la compilazione di '{0}': è previsto il tipo di funzione nel binding let o nell'applicazione di funzione. È previsto '{1}', ma il tipo ricevuto è '{2}'.
ja: {0}' を構築するときの型の不一致: 関数アプリケーションまたは let 束縛では関数型が必要でした。'{1}' が必要でしたが、型 '{2}' を受け取りました。
ko: '{0}'을(를) 작성하는 동안 형식 불일치 문제가 발생했습니다. 함수 애플리케이션 또는 let 바인딩에 함수 형식이 필요합니다. '{1}'이(가) 필요한데 '{2}' 형식을 수신했습니다.
pl: Niezgodność typów podczas kompilowania elementu „{0}”: oczekiwano typu funkcji w zastosowaniu funkcji lub powiązaniu zezwolenia. Oczekiwano typu „{1}”, natomiast stwierdzono typ „{2}”.
pt_br: Tipos incompatíveis ao compilar '{0}': tipo de função esperado em aplicativo de função ou associação let. '{1}' esperado, mas o tipo recebido foi '{2}'.
ru: Несоответствие типа при сборке "{0}": ожидаемый тип функции в приложении функции или привязке присваивания. Требуется "{1}", но получен тип "{2}".
tr: {0}' oluşturulurken tür uyuşmazlığı oluştu: işlev uygulamasında veya let bağlamasında işlev türü bekleniyordu. '{1}' bekleniyordu, ancak '{2}' türü alındı.
zh_hans: 在生成“{0}”时类型不匹配: 应为函数应用程序或 let 绑定中的函数类型。应为“{1}”，但收到的类型为“{2}”。
zh_hant: 建置 '{0}' 時發生類型不符的情況: 必須是函式應用程式或 let 繫結中的函式類型。必須是 '{1}'，但卻收到類型 '{2}'。

# QtmmExprNotMatchTuple
source: Type mismatch when building '{0}': expression doesn't match the tuple type. Expected '{1}', but received type '{2}'.
cs: Neshoda typů při sestavování {0}: výraz neodpovídá typu řazené kolekce členů. Očekávaný typ byl {1}, ale přijatý typ byl {2}.
de: Typenkonflikt beim Erstellen von "{0}": Der Ausdruck stimmt nicht mit dem Tupeltyp überein. Erwartet wurde "{1}", aber der Typ "{2}" wurde empfangen.
es: Incoherencia de tipos al compilar '{0}': la expresión no coincide con el tipo de tupla. Se esperaba '{1}', pero se recibió el tipo '{2}'.
fr: Incompatibilité de type lors de la création de '{0}' : l'expression ne correspond pas au type tuple. '{1}' attendu, mais type '{2}' reçu.
it: Tipo non corrispondente durante la compilazione di '{0}': l'espressione non corrisponde al tipo di tupla. Previsto '{1}', tipo ricevuto '{2}'.
ja: {0}' を構築するときの型の不一致: 式がタプル型と一致しません。'{1}' が必要でしたが、型 '{2}' を受け取りました。
ko: {0}'을(를) 작성하는 동안 형식 불일치 문제가 발생했습니다. 식이 튜플 형식과 일치하지 않습니다. '{1}'이(가) 필요한데 '{2}' 형식을 수신했습니다.
pl: Niezgodność typów podczas kompilowania elementu „{0}”: wyrażenie nie pasuje do typu krotki. Oczekiwano typu „{1}”, natomiast stwierdzono typ „{2}”.
pt_br: Tipos incompatíveis ao compilar '{0}': expressão incompatível com tipo de tupla. '{1}' esperado, mas o tipo recebido foi '{2}'.
ru: Несоответствие типа при сборке "{0}": выражение не соответствует типу кортежа. Требуется "{1}", но получен тип "{2}".
tr: {0}' oluşturulurken tür uyuşmazlığı oluştu: ifade demet türüyle eşleşmiyor. '{1}' bekleniyordu, ancak '{2}' türü alındı.
zh_hans: 在生成“{0}”时类型不匹配: 表达式与元组类型不匹配。应为“{1}”，但收到的类型为“{2}”。
zh_hant: 建置 '{0}' 時發生型別不符的情況: 運算式與元組型別不相符。必須是 '{1}'，但卻收到型別 '{2}'。

# QtmmExprTypeMismatch
source: Type mismatch when building '{0}': types of expression does not match. Expected '{1}', but received type '{2}'.
cs: Neshoda typů při sestavování {0}: typy výrazů se neshodují. Očekávaný typ byl {1}, ale přijatý typ byl {2}.
de: Typenkonflikt beim Erstellen von "{0}": Die Typen des Ausdrucks stimmen nicht überein. Erwartet wurde "{1}", aber der Typ "{2}" wurde empfangen.
es: Incoherencia de tipos al compilar '{0}': los tipos de la expresión no coinciden. Se esperaba '{1}', pero se recibió el tipo '{2}'.
fr: Incompatibilité de type lors de la création de '{0}' : les types d'expression ne correspondent pas. '{1}' attendu, mais type '{2}' reçu.
it: Tipo non corrispondente durante la compilazione di '{0}': tipi di espressione non corrispondenti. Previsto '{1}', tipo ricevuto '{2}'.
ja: {0}' を構築するときの型の不一致: 式の型が一致しません。'{1}' が必要でしたが、型 '{2}' を受け取りました。
ko: {0}'을(를) 작성하는 동안 형식 불일치 문제가 발생했습니다. 식의 형식이 일치하지 않습니다. '{1}'이(가) 필요한데 '{2}' 형식을 수신했습니다.
pl: Niezgodność typów podczas kompilowania elementu „{0}”: niezgodne typy wyrażeń. Oczekiwano typu „{1}”, natomiast stwierdzono typ „{2}”.
pt_br: Tipos incompatíveis ao compilar '{0}': tipos de expressão incompatíveis. '{1}' esperado, mas o tipo recebido foi '{2}'.
ru: Несоответствие типа при сборке "{0}": типы выражения не совпадают. Требуется "{1}", но получен тип "{2}".
tr: {0}' oluşturulurken tür uyuşmazlığı oluştu: ifadenin türleri eşleşmiyor. '{1}' bekleniyordu, ancak '{2}' türü alındı.
zh_hans: 在生成“{0}”时类型不匹配: 表达式的类型不匹配。应为“{1}”，但收到的类型为“{2}”。
zh_hant: 建置 '{0}' 時發生類型不符的情況: 運算式的類型不相符。必須是 '{1}'，但卻收到類型 '{2}'。

# QtmmFunctionArgTypeMismatch
source: Type mismatch when building '{0}': function argument type doesn't match. Expected '{1}', but received type '{2}'.
cs: Neshoda typů při sestavování {0}: neodpovídá typ argumentu funkce. Očekávaný typ byl {1}, ale přijatý typ byl {2}.
de: Typenkonflikt beim Erstellen von "{0}": Der Funktionsargumenttyp stimmt nicht überein. Erwartet wurde "{1}", aber der Typ "{2}" wurde empfangen.
es: Incoherencia de tipos al compilar '{0}': el tipo de argumento de función no coincide. Se esperaba '{1}', pero se recibió el tipo '{2}'.
fr: Incompatibilité de type lors de la création de '{0}' : le type d'argument de fonction ne correspond pas. '{1}' attendu, mais type '{2}' reçu.
it: Tipo non corrispondente durante la compilazione di '{0}': tipo di argomento della funzione non corrispondente. Previsto '{1}', tipo ricevuto '{2}'.
ja: {0}' を構築するときの型の不一致: 関数引数型が一致しません。'{1}' が必要でしたが、型 '{2}' を受け取りました。
ko: {0}'을(를) 작성하는 동안 형식 불일치 문제가 발생했습니다. 함수 인수 형식이 일치하지 않습니다. '{1}'이(가) 필요한데 '{2}' 형식을 수신했습니다.
pl: Niezgodność typów podczas kompilowania elementu „{0}”: niezgodny typ argumentu funkcji. Oczekiwano typu „{1}”, natomiast stwierdzono typ „{2}”.
pt_br: Tipos incompatíveis ao compilar '{0}': tipo de argumento de função incompatível. '{1}' esperado, mas o tipo recebido foi '{2}'.
ru: Несоответствие типа при сборке "{0}": несоответствующий тип аргумента функции. Требуется "{1}", но получен тип "{2}".
tr: {0}' oluşturulurken tür uyuşmazlığı oluştu: işlev bağımsız değişkeni türü eşleşmiyor. '{1}' bekleniyordu, ancak '{2}' türü alındı.
zh_hans: 在生成“{0}”时类型不匹配: 函数参数类型不匹配。应为“{1}”，但收到的类型为“{2}”。
zh_hant: 建置 '{0}' 時發生類型不符的情況: 函式引數類型不相符。必須是 '{1}'，但卻收到類型 '{2}'。

# QtmmGuardMustBeBool
source: Type mismatch when building '{0}': guard must return boolean. Expected '{1}', but received type '{2}'.
cs: Neshoda typů při sestavování {0}: výraz guard musí vracet hodnotu typu boolean. Očekávaný typ byl {1}, ale přijatý typ byl {2}.
de: Typenkonflikt beim Erstellen von "{0}": Schutz muss einen booleschen Wert zurückgeben. Erwartet wurde "{1}", aber der Typ "{2}" wurde empfangen.
es: Incoherencia de tipos al compilar '{0}': la restricción debe devolver un tipo booleano. Se esperaba '{1}', pero se recibió el tipo '{2}'.
fr: Incompatibilité de type lors de la création de '{0}' : la garde doit retourner une valeur booléenne. '{1}' attendu, mais type '{2}' reçu.
it: Tipo non corrispondente durante la compilazione di '{0}': l'espressione guard deve restituire un valore booleano. Previsto '{1}', tipo ricevuto '{2}'.
ja: {0}' を構築するときの型の不一致: ガードはブール型を返す必要があります。'{1}' が必要でしたが、型 '{2}' を受け取りました。
ko: {0}'을(를) 작성하는 동안 형식 불일치 문제가 발생했습니다. 가드는 부울을 반환해야 합니다. '{1}'이(가) 필요한데 '{2}' 형식을 수신했습니다.
pl: Niezgodność typów podczas kompilowania elementu „{0}”: strażnik musi zwracać wartość logiczną. Oczekiwano typu „{1}”, natomiast stwierdzono typ „{2}”.
pt_br: Tipos incompatíveis ao compilar '{0}': a proteção deve retornar booliano. '{1}' esperado, mas o tipo recebido foi '{2}'.
ru: Несоответствие типа при сборке "{0}": условие должно возвращать логическое значение. Требуется "{1}", но получен тип "{2}".
tr: {0}' oluşturulurken tür uyuşmazlığı oluştu: koruma boole değeri döndürmelidir. '{1}' bekleniyordu, ancak '{2}' türü alındı.
zh_hans: 在生成“{0}”时类型不匹配: guard 必须返回 boolean。应为“{1}”，但收到的类型为“{2}”。
zh_hant: 建置 '{0}' 時發生類型不符的情況: 成立條件必須傳回布林值。必須是 '{1}'，但卻收到類型 '{2}'。

# QtmmIncorrectArgForRecord
source: Type mismatch when building '{0}': incorrect argument type for an F# record. Expected '{1}', but received type '{2}'.
cs: Neshoda typů při sestavování {0}: nesprávný typ argumentu pro záznam jazyka F#. Očekávaný typ byl {1}, ale přijatý typ byl {2}.
de: Typenkonflikt beim Erstellen von "{0}": Der Argumenttyp für einen F#-Datensatz ist falsch. Erwartet wurde "{1}", aber der Typ "{2}" wurde empfangen.
es: Incoherencia de tipos al compilar '{0}': tipo de argumento incorrecto para un registro F#. Se esperaba '{1}', pero se recibió el tipo '{2}'.
fr: Incompatibilité de type lors de la création de '{0}' : type d'argument incorrect pour un enregistrement F#. '{1}' attendu, mais type '{2}' reçu.
it: Tipo non corrispondente durante la compilazione di '{0}': tipo di argomento non corretto per un record F#. Previsto '{1}', tipo ricevuto '{2}'.
ja: {0}' を構築するときの型の不一致: F# レコードの引数型が正しくありません。'{1}' が必要でしたが、型 '{2}' を受け取りました。
ko: {0}'을(를) 작성하는 동안 형식 불일치 문제가 발생했습니다. F# 레코드에 대한 인수 형식이 잘못되었습니다. '{1}'이(가) 필요한데 '{2}' 형식을 수신했습니다.
pl: Niezgodność typów podczas kompilowania elementu „{0}”: błędny typ argumentu rekordu języka F#. Oczekiwano typu „{1}”, natomiast stwierdzono typ „{2}”.
pt_br: Tipos incompatíveis ao compilar '{0}': tipo de argumento incorreto para um registro F#. '{1}' esperado, mas o tipo recebido foi '{2}'.
ru: Несоответствие типа при сборке "{0}": Неправильный тип аргумента для записи F#. Требуется "{1}", но получен тип "{2}".
tr: {0}' oluşturulurken tür uyuşmazlığı oluştu: bir F# kaydı için geçersiz bağımsız değişken türü. '{1}' bekleniyordu, ancak '{2}' türü alındı.
zh_hans: 在生成“{0}”时类型不匹配: F# 记录的参数类型不正确。应为“{1}”，但收到的类型为“{2}”。
zh_hant: 建置 '{0}' 時發生類型不符的情況: F# 記錄的引數類型不正確。必須是 '{1}'，但卻收到類型 '{2}'。

# QtmmIncorrectArgForUnion
source: Type mismatch when building '{0}': incorrect argument type for an F# union. Expected '{1}', but received type '{2}'.
cs: Neshoda typů při sestavování {0}: nesprávný typ argumentu pro typ union jazyka F#. Očekávaný typ byl {1}, ale přijatý typ byl {2}.
de: Typenkonflikt beim Erstellen von "{0}": Der Argumenttyp für F#-Union ist falsch. Erwartet wurde "{1}", aber der Typ "{2}" wurde empfangen.
es: Incoherencia de tipos al compilar '{0}': tipo de argumento incorrecto para una unión F#. Se esperaba '{1}', pero se recibió el tipo '{2}'.
fr: Incompatibilité de type lors de la création de '{0}' : type d'argument incorrect pour une union F#. '{1}' attendu, mais type '{2}' reçu.
it: Tipo non corrispondente durante la compilazione di '{0}': tipo di argomento non corretto per un'unione F#. Previsto '{1}', tipo ricevuto '{2}'.
ja: {0}' を構築するときの型の不一致: F# 共用体の引数型が正しくありません。'{1}' が必要でしたが、型 '{2}' を受け取りました。
ko: {0}'을(를) 작성하는 동안 형식 불일치 문제가 발생했습니다. F# 공용 구조체에 대한 인수 형식이 잘못되었습니다. '{1}'이(가) 필요한데 '{2}' 형식을 수신했습니다.
pl: Niezgodność typów podczas kompilowania elementu „{0}”: błędny typ argumentu złożenia języka F#. Oczekiwano typu „{1}”, natomiast stwierdzono typ „{2}”.
pt_br: Tipos incompatíveis ao compilar '{0}': tipo de argumento incorreto para uma união F#. '{1}' esperado, mas o tipo recebido foi '{2}'.
ru: Несоответствие типа при сборке "{0}": Неправильный тип аргумента для объединения F#. Требуется "{1}", но получен тип "{2}".
tr: {0}' oluşturulurken tür uyuşmazlığı oluştu: bir F# birleşimi için geçersiz bağımsız değişken türü. '{1}' bekleniyordu, ancak '{2}' türü alındı.
zh_hans: 在生成“{0}”时类型不匹配: F# 联合的参数类型不正确。应为“{1}”，但收到的类型为“{2}”。
zh_hant: 建置 '{0}' 時發生類型不符的情況: F# 聯集的引數類型不正確。必須是 '{1}'，但卻收到類型 '{2}'。
