Repository: dotnet/fsharp
Catalog: src/FSharp.Core/xlf/FSCore.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# QnonStaticNoReceiverObject
source: The member is non-static (instance), but no receiver object was supplied
cs: Člen není statický (patří k instanci), ale nebyl poskytnut žádný objekt příjemce.
de: Das Member ist nicht statisch (Instanz), aber es wurde kein Empfängerobjekt bereitgestellt.
es: El miembro no es estático (instancia), pero no se proporcionó ningún objeto de receptor.
fr: Le membre n'est pas statique (instance), mais aucun objet récepteur n'était fourni
it: Il membro non è statico (istanza), tuttavia non è stato specificato alcun oggetto ricevitore
ja: メンバーは非静的 (インスタンス) ですが、レシーバー オブジェクトが指定されませんでした
ko: 멤버가 비정적(인스턴스)이지만 수신기 개체를 지정하지 않았습니다.
pl: Element członkowski jest (wystąpieniem) niestatycznym, jednak nie określono obiektu odbiornika.
pt_br: O membro é não estático (instância), mas nenhum objeto receptor foi fornecido
ru: Элемент не является статическим (экземпляр), однако объект приемника не указан
tr: Üye statik değil (örnek), ancak hiçbir alıcı nesne sağlanmadı
zh_hans: 该成员是非静态的(实例)，但未提供任何接收器对象
zh_hant: 成員為非靜態 (執行個體)，但未提供任何接收者物件

# QparentCannotBeNull
source: Parent type cannot be null
cs: Nadřazený typ nemůže mít hodnotu null.
de: Der übergeordnete Typ darf nicht NULL sein.
es: El tipo primario no puede ser nulo.
fr: Le type parent ne peut pas être null
it: Il tipo padre non può essere Null
ja: 親の型を null にすることはできません
ko: 부모 형식은 null일 수 없습니다.
pl: Typ nadrzędny nie może mieć wartości zerowej.
pt_br: O tipo pai não pode ser nulo
ru: Родительский тип не может быть нулевым
tr: Üst tür null olamaz
zh_hans: 父类型不能为 null
zh_hant: 父類型不能為 null

# QreadingSetOnly
source: Reading a set-only property
cs: Čtení vlastnosti, které podporuje pouze operaci set
de: Es wird eine Eigenschaft gelesen, die nur festlegbar ist
es: Leyendo una propiedad con solo establecedor.
fr: Lecture d'une propriété ne pouvant avoir un qu'une méthode setter
it: Lettura di una proprietà di sola impostazione
ja: 設定専用のプロパティを読み取っています
ko: set-only 속성을 읽고 있습니다.
pl: Odczytywanie właściwości ustawianej
pt_br: Lendo uma propriedade set-only
ru: Чтение свойства, доступного только для установки
tr: Yalnızca ayarlanabilen bir özellik okunuyor
zh_hans: 正在读取仅有 setter 的属性
zh_hant: 讀取 set-only 屬性

# QstaticWithReceiverObject
source: Receiver object was unexpected, as member is static
cs: Objekt příjemce nebyl očekáván, protože člen je statický.
de: Das Empfängerobjekt wurde nicht erwartet, da das Member statisch ist.
es: Objeto de receptor inesperado, ya que el miembro es estático.
fr: L'objet récepteur était inattendu, car le membre est statique
it: Oggetto ricevitore imprevisto perché il membro è statico
ja: メンバーは静的であるため、レシーバー オブジェクトは予期されていませんでした
ko: 멤버가 정적이므로 수신기 개체는 필요하지 않습니다.
pl: Obiekt odbiornika jest nieoczekiwany, ponieważ element członkowski ma charakter statyczny.
pt_br: O objeto receptor era inesperado, pois o membro é estático
ru: Объект приемника оказался неожиданным, так как элемент статический
tr: Üye statik olduğundan alıcı nesne beklenmiyordu
zh_hans: 由于成员是静态的，因此不应出现接收器对象
zh_hant: 不應有接收者物件，因為成員為靜態

# QtmmExprHasWrongType
source: Type mismatch when building '{0}': the expression has the wrong type. Expected '{1}', but received type '{2}'.
cs: Neshoda typů při sestavování {0}: výraz je chybného typu. Očekávaný typ byl {1}, ale přijatý typ byl {2}.
de: Typenkonflikt beim Erstellen von "{0}": Der Ausdruck weist den falschen Typ auf. Erwartet wurde "{1}", aber der Typ "{2}" wurde empfangen.
es: Incoherencia de tipos al compilar '{0}': la expresión tiene un tipo incorrecto. Se esperaba '{1}', pero se recibió el tipo '{2}'.
fr: Incompatibilité de type lors de la création de '{0}' : l'expression a un type incorrect. '{1}' attendu, mais type '{2}' reçu.
it: Tipo non corrispondente durante la compilazione di '{0}': l'espressione è di tipo non corretto. Previsto '{1}', tipo ricevuto '{2}'.
ja: {0}' を構築するときの型の不一致: 式に間違った型があります。'{1}' が必要でしたが、型 '{2}' を受け取りました。
ko: {0}'을(를) 작성하는 동안 형식 불일치 문제가 발생했습니다. 식에 잘못된 형식이 있습니다. '{1}'이(가) 필요한데 '{2}' 형식을 수신했습니다.
pl: Niezgodność typów podczas kompilowania elementu „{0}”: wyrażenie ma błędny typ. Oczekiwano typu „{1}”, natomiast stwierdzono typ „{2}”.
pt_br: Tipos incompatíveis ao compilar '{0}': a expressão tem o tipo errado. '{1}' esperado, mas o tipo recebido foi '{2}'.
ru: Несоответствие типа при сборке "{0}": выражение относится к неверному типу. Требуется "{1}", но получен тип "{2}".
tr: {0}' oluşturulurken tür uyuşmazlığı oluştu: ifadenin türü yanlış. '{1}' bekleniyordu, ancak '{2}' türü alındı.
zh_hans: 在生成“{0}”时类型不匹配: 表达式具有错误类型。应为“{1}”，但收到的类型为“{2}”。
zh_hant: 建置 '{0}' 時發生類型不符的情況: 運算式的類型錯誤。必須是 '{1}'，但卻收到類型 '{2}'。

# QtmmFunTypeNotMatchDelegate
source: Type mismatch when building '{0}': function type doesn't match delegate type. Expected '{1}', but received type '{2}'.
cs: Neshoda typů při sestavování {0}: typ funkce neodpovídá typu delegáta. Očekávaný typ byl {1}, ale přijatý typ byl {2}.
de: Typenkonflikt beim Erstellen von "{0}": Der Funktionstyp stimmt nicht mit dem Delegattyp überein. Erwartet wurde "{1}", aber der Typ "{2}" wurde empfangen.
es: Incoherencia de tipos al compilar '{0}': el tipo de función no coincide con el tipo de delegado. Se esperaba '{1}', pero se recibió el tipo '{2}'.
fr: Incompatibilité de type lors de la création de '{0}' : le type de fonction ne correspond pas au type délégué. '{1}' attendu, mais type '{2}' reçu.
it: Tipo non corrispondente durante la compilazione di '{0}': il tipo di funzione non corrisponde al tipo di delegato. Previsto '{1}', tipo ricevuto '{2}'.
ja: {0}' を構築するときの型の不一致: 関数型がデリゲート型と一致しません。'{1}' が必要でしたが、型 '{2}' を受け取りました。
ko: {0}'을(를) 작성하는 동안 형식 불일치 문제가 발생했습니다. 함수 형식이 대리자 형식과 일치하지 않습니다. '{1}'이(가) 필요한데 '{2}' 형식을 수신했습니다.
pl: Niezgodność typów podczas kompilowania elementu „{0}”: typ funkcji nie pasuje do typu delegowanego. Oczekiwano typu „{1}”, natomiast stwierdzono typ „{2}”.
pt_br: Tipos incompatíveis ao compilar '{0}': tipo de função incompatível com tipo delegate. '{1}' esperado, mas o tipo recebido foi '{2}'.
ru: Несоответствие типа при сборке "{0}": тип функции не соответствует типу делегата. Требуется "{1}", но получен тип "{2}".
tr: {0}' oluşturulurken tür uyuşmazlığı oluştu: işlev türü temsilci türüyle eşleşmiyor. '{1}' bekleniyordu, ancak '{2}' türü alındı.
zh_hans: 在生成“{0}”时类型不匹配: 函数类型与委托类型不匹配。应为“{1}”，但收到的类型为“{2}”。
zh_hant: 建置 '{0}' 時發生類型不符的情況: 函式類型與委派類型不相符。必須是 '{1}'，但卻收到類型 '{2}'。

# QtmmRaw
source: Type mismatch when splicing expression into quotation literal. The type of the expression tree being inserted doesn't match the type expected by the splicing operation. Expected '{0}', but received type '{1}'. Consider type-annotating with the expected expression type, e.g., (%% x : {0}) or (%x : {0}).
cs: Neshoda typů při spojování výrazu do literálu citace. Typ vkládaného stromu výrazů neodpovídá typu, který očekává operace spojení. Očekávaný typ byl {0}, ale přijatý typ byl {1}. Zvažte uvedení očekávaného typu výrazu, např. (%% x : {0}) nebo (%x : {0}).
de: Typenkonflikt beim Splicing des Ausdrucks in ein Quotation-Literal. Der Typ der eingefügten Ausdrucksbaumstruktur stimmt nicht mit dem Typ überein, der vom Splicing-Vorgang erwartet wurde. Typ '{0}' erwartet, '{1}' erhalten. Erwägen Sie Typanmerkungen mit dem erwarteten Ausdruckstyp, z. B. (%% x : {0}) oder (%x : {0}).
es: Incoherencia de tipos al insertar la expresión en el literal de expresión de código delimitada. El tipo de árbol de expresión que se va a insertar no coincide con el tipo esperado por la operación de inserción Se esperaba '{0}', pero se recibió el tipo '{1}'. Considere la anotación del tipo de expresión esperado, por ejemplo, (%% x: {0}) o (%x: {0}).
fr: Incompatibilité de type lors de l'ajout d'expression à un littéral de quotation. Le type de l'arborescence de l'expression insérée ne correspond pas au type attendu par l'opération d'ajout. '{0}' attendu, mais type '{1}' reçu. Envisagez l'annotation de type avec le type d'expression attendu, par exemple (%% x : {0}) ou (%x : {0}).
it: Tipo non corrispondente durante lo splicing dell'espressione in valori letterali di quotation. Il tipo dell'albero delle espressioni che viene inserito non corrisponde al tipo previsto dall'operazione di splicing. Tipo previsto '{0}'. Tipo ricevuto '{1}'. Eseguire l'annotazione del tipo con il tipo dell'espressione previsto, ossia (%% x : {0}) o (%x : {0}).
ja: 式を引用リテラルにスプライスするときの型が一致していません。挿入されている式ツリーの型が、スプライス操作に必要な型と一致しません。'{0}' が必要でしたが、型 '{1}' を受け取りました。(%% x : {0}) や (%x : {0}) など必要な式の型での型注釈付けを検討してください。
ko: 식을 따옴표로 묶인 리터럴로 스플라이스하는 동안 형식 불일치 문제가 발생했습니다. 삽입 중인 식 트리의 형식이 스플라이스 작업에 필요한 형식과 일치하지 않습니다. '{0}'이(가) 필요한데 '{1}'을(를) 수신했습니다. (%% x : {0}) 또는 (%x : {0})과 같이 필요한 식 형식으로 형식 주석 처리하세요.
pl: Niezgodność typów podczas łączenia wyrażenia w cytowany literał. Typ wstawianego drzewa wyrażenia jest niezgodny z typem oczekiwanym przez operację łączenia. Oczekiwano typu „{0}”, natomiast stwierdzono typ „{1}”. Rozważ adnotację typu przy użyciu oczekiwanego typu wyrażenia, np. (%% x : {0}) lub (%x : {0}).
pt_br: Inconsistência de tipos ao unir expressão em literal de cotação. O tipo da árvore de expressões inserida não corresponde ao tipo esperado pela operação de união. Esperado '{0}', mas o tipo recebido foi '{1}'. Considere a anotação de tipo com o tipo de expressão esperado, por exemplo, (%% x : {0}) ou (%x : {0}).
ru: Несоответствие типов при вставке выражения в литерал кавычек. Тип вставляемого дерева выражения не соответствует типу, ожидаемому операцией вставки. Ожидался тип "{0}", однако получен тип "{1}". Попробуйте аннотировать тип выражения ожидаемым типом, например (%% x : {0}) или (%x : {0}).
tr: İfade değişmez teklif değerine birleştirilirken tür uyuşmazlığı oluştu. Eklenen ifade ağacının türü birleştirme işlemi tarafından beklenen türle eşleşmiyor. '{0}' bekleniyordu, ancak '{1}' türü alındı. (%% x : {0}) veya (%x : {0}) gibi beklenen ifade türüyle tür eklemeyi düşünün.
zh_hans: 将表达式拼接到引用文本中时类型不匹配。要插入的表达式树的类型与拼接操作所需的类型不匹配。应为“{0}”，但收到的类型为“{1}”。请考虑使用预期表达式类型进行类型批准，例如，(%% x : {0})或(%x : {0})。
zh_hant: 將運算式接合成引號常值時發生類型不符的情況。所插入運算式樹狀結構的類型不符合接合運算預期的類型。必須是 '{0}'，但卻收到類型 '{1}'。請考慮以預期的運算式類型標註類型，例如 (%% x : {0}) 或 (%x : {0})。

# QtupleAccessOutOfRange
source: Tuple access out of range
cs: Přístup do řazené kolekce členů mimo rozsah
de: Der Tupelzugriff liegt außerhalb des zulässigen Bereichs.
es: Acceso de tupla fuera de intervalo.
fr: Accès tuple hors limites
it: Accesso tupla non compreso nell'intervallo
ja: タプルのアクセスが範囲外です
ko: 튜플 액세스가 범위를 벗어났습니다.
pl: Wartość krotki jest poza dostępnym zakresem.
pt_br: Acesso de tupla fora do intervalo
ru: Доступ кортежа вне диапазона
tr: Demet erişimi aralık dışında
zh_hans: 元组访问超出范围
zh_hant: 元組存取超出範圍

# QtupleLengthsDiffer
source: The tuple lengths are different
cs: Délky řazených kolekcí členů se liší.
de: Die Tupellängen sind unterschiedlich.
es: Las longitudes de tupla son diferentes.
fr: Les longueurs tuple sont différentes
it: Le tuple sono di lunghezza diversa
ja: タプルの長さが異なります
ko: 튜플 길이가 서로 다릅니다.
pl: Długości krotek różnią się od siebie.
pt_br: Os tamanhos de tupla são diferentes
ru: Длины кортежей различны
tr: Demet uzunlukları farklı
zh_hans: 各个元组长度不同
zh_hant: 元組長度不相同

# QunionNeedsDiffNumArgs
source: F# union type requires different number of arguments
cs: Typ union jazyka F# vyžaduje odlišný počet argumentů.
de: F#-Union-Typ erfordert eine unterschiedliche Anzahl von Argumenten.
es: El tipo de unión F# requiere un número diferente de argumentos.
fr: Un type union F# requiert plusieurs arguments
it: Il tipo di unione F# richiede un numero diverso di argomenti
ja: F# 共用体型には異なる数の引数が必要です
ko: F# 공용 구조체 형식에 다른 개수의 인수가 필요합니다.
pl: Typ unii języka F# wymaga innej liczby argumentów.
pt_br: O tipo de união F# requer um número diferente de argumentos
ru: Типу объединения F# требуется другое количество аргументов
tr: F# birleşim türü farklı sayıda bağımsız değişken gerektirir
zh_hans: F# 联合类型需要不同数目的参数
zh_hant: F# 等位型別需要不同的引數數目

# QwritingGetOnly
source: Writing a get-only property
cs: Zápis vlastnosti, která podporuje pouze operaci get
de: Es wird eine Eigenschaft geschrieben, die nur abrufbar ist
es: Escribiendo una propiedad con solo captador
fr: Lecture d'une propriété ne pouvant avoir qu'une méthode getter
it: Scrittura di una proprietà di solo richiamo
ja: 取得専用のプロパティを書き込んでいます
ko: get-only 속성을 쓰고 있습니다.
pl: Zapisywanie właściwości pobieranej
pt_br: Gravando uma propriedade get-only
ru: Запись свойства, доступного только для получения
tr: Yalnızca alınabilen bir özellik yazılıyor
zh_hans: 正在写入仅有 getter 的属性
zh_hant: 寫入 get-only 屬性

# QwrongNumOfTypeArgs
source: The method '{0}' expects {1} type arguments but {2} were provided
cs: Počet očekávaných argumentů typu metody {0} je {1}, ale počet poskytnutých argumentů je {2}.
de: Die Methode "{0}" erwartet {1} Typargumente, aber {2} wurden bereitgestellt.
es: El método '{0}' espera {1} argumentos de tipo, pero se proporcionaron {2}.
fr: La méthode '{0}' attend {1} arguments de type mais {2} ont été fournis
it: Il metodo '{0}' prevede {1} argomenti tipo, tuttavia ne sono stati specificati {2}
ja: メソッド '{0}' には {1} 個の型引数が必要ですが、{2} 個が指定されました
ko: {0}' 메서드에는 {1} 형식 인수가 필요한데 {2}이(가) 제공되었습니다.
pl: Metoda „{0}” oczekuje argumentów typu {1}, natomiast podano argumenty typu {2}.
pt_br: O método '{0}' espera argumentos de tipo {1}, mas {2} foram fornecidos
ru: Методу "{0}" требуются аргументы типа {1}, однако предоставлены аргументы типа {2}
tr: {0}' metodu {1} türünde bağımsız değişkenler bekliyor ancak {2} sağlandı
zh_hans: 方法“{0}”要求 {1} 个类型参数，但提供了 {2} 个类型参数
zh_hant: 方法 '{0}' 需要 {1} 型別引數，但提供的是 {2}

# keyNotFoundAlt
source: An index satisfying the predicate was not found in the collection.
cs: V kolekci nebyl nalezen index splňující predikát.
de: In der Auflistung wurde kein Index gefunden, der das Prädikat erfüllt.
es: No se encontró ningún índice que satisfaga el predicado en la colección.
fr: Un index répondant au prédicat est introuvable dans la collection.
it: Nella raccolta non è stato trovato alcun indice che soddisfi il predicato.
ja: 述語を満たすインデックスがコレクションに見つかりませんでした。
ko: 컬렉션에서 조건자를 만족하는 인덱스를 찾을 수 없습니다.
pl: W kolekcji nie odnaleziono indeksu pasującego do predykatu.
pt_br: Índice compatível com predicado não localizado na coleção.
ru: Не удалось обнаружить в коллекции индекс, удовлетворяющий предикату.
tr: Koşulu sağlayan bir dizin koleksiyonda bulunamadı.
zh_hans: 未在集合找到符合谓词的索引。
zh_hant: 在集合中找不到符合述詞的索引。

# constructorForUnionCaseNotFound
source: The constructor method '{0}' for the union case could not be found
cs: Metoda konstruktoru {0} pro případ typu union nebyla nalezena.
de: Die Konstruktormethode "{0}" für den Union-Fall wurde nicht gefunden.
es: No se encontró el método de constructor '{0}' para el caso de unión.
fr: La méthode constructor '{0}' pour le cas d'union est introuvable
it: Il metodo del costruttore '{0}' per il case di unione non è stato trovato
ja: 共用体ケースのコンストラクター メソッド '{0}' が見つかりませんでした
ko: 공용 구조체 케이스의 생성자 메서드 '{0}'을(를) 찾을 수 없습니다.
pl: Nie można odnaleźć metody „{0}” konstruktora dla instrukcji „case” złożenia.
pt_br: O método de construtor '{0}' para o caso união não foi encontrado
ru: Не удалось найти метод конструктора "{0}" для варианта объединения
tr: Birleşim durumunun '{0}' oluşturucu metodu bulunamadı
zh_hans: 找不到联合用例的构造函数方法“{0}”
zh_hant: 找不到聯集的建構函式方法 '{0}'

# firstClassUsesOfSplice
source: first class uses of '%' or '%%' are not permitted
cs: Použití % nebo %% jako výrazů první třídy není povoleno.
de: Verwendungen der ersten Klasse von "%" oder "%%" sind nicht erlaubt.
es: No se permite el uso de '%' o '%%' en la primera clase.
fr: L'utilisation de '%' ou '%%' par la première classe n'est pas autorisée
it: utilizzi di prima classe di '%' o '%%' non consentiti
ja: '%' または '%%' のファースト クラスの使用は許可されていません
ko: '%' 또는 '%%'의 첫 번째 클래스를 사용할 수 없습니다.
pl: Używanie „%” i „%%” w pierwszej klasie jest niedozwolone.
pt_br: usos de '%' ou '%%' de primeira classe não são permitidos
ru: использование "%" или "%%" в первом классе не разрешено
tr: birinci sınıf '%' veya '%%' kullanımına izin verilmiyor
zh_hans: 不允许优先使用“%”或“%%”
zh_hant: 不允許優先使用 '%' 或 '%%'

source: MoveNext not called, or finished
cs: Nebyla volána nebo dokončena metoda MoveNext.
de: MoveNext wurde nicht aufgerufen oder ist beendet.
es: No se llamó a MoveNext o finalizó.
fr: MoveNext n'est pas appelé ou n'est pas terminé
it: MoveNext non chiamato o terminato
ja: MoveNext は呼び出されていないか、終了しました
ko: MoveNext가 호출되지 않았거나 완료되었습니다.
pl: Metoda MoveNext nie została wywołana albo nie zakończyła działania.
pt_br: MoveNext não chamado, ou concluído
ru: MoveNext не вызвана или не завершена
tr: MoveNext çağrılmadı veya tamamlanmadı
zh_hans: 未调用 MoveNext 或已完成 MoveNext
zh_hant: MoveNext 未呼叫或完成

# multipleCompilationMappings
source: Multiple CompilationMappingAttributes, expected at most one
cs: Více atributů CompilationMappingAttributes, byl očekáván nejvýše jeden.
de: Mehrere CompilationMappingAttributes, aber maximal eins wurde erwartet.
es: Varios CompilationMappingAttributes. Se esperaba uno como máximo.
fr: Plusieurs CompilationMappingAttributes, un seul est attendu
it: Più CompilationMappingAttribute. Previsto massimo uno
ja: 複数の CompilationMappingAttribute がありますが、必要なのは最大 1 つです
ko: CompilationMappingAttributes가 여러 개입니다. 하나만 필요합니다.
pl: Wykryto kilka atrybutów CompilationMappingAttribute, podczas gdy oczekiwano najwyżej jednego.
pt_br: Vários CompilationMappingAttributes; no máximo um esperado
ru: Присутствует несколько атрибутов CompilationMappingAttributes; требуется не больше одного
tr: Birden fazla CompilationMappingAttributes var; bir tane bekleniyordu
zh_hans: 多个 CompilationMappingAttribute，最多只应有一个
zh_hant: 多個 CompilationMappingAttributes，但最多只允許一個

# printfBadFloatValue
source: Bad float value
cs: Chybná hodnota float
de: Ungültiger Floatwert
es: Valor float incorrecto.
fr: Valeur float incorrecte
it: Valore float non valido
ja: 浮動小数値が正しくありません
ko: float 값이 잘못되었습니다.
pl: Błędna wartość zmiennoprzecinkowa.
pt_br: Valor de flutuação incorreto
ru: Неверное значение с плавающей точкой
tr: Hatalı float değeri
zh_hans: 错误的浮点值
zh_hant: 不正確的浮點值

# printfBadFormatSpecifier
source: Bad format specifier:{0}
cs: Chybný specifikátor formátu: {0}
de: Ungültiger Formatbezeichner: {0}
es: Especificador de formato incorrecto: {0}
fr: Spécificateur de format incorrect :{0}
it: Identificatore di formato non valido: {0}
ja: 書式指定子が正しくありません: {0}
ko: 잘못된 형식 지정자: {0}
pl: Błędny specyfikator formatu:{0}
pt_br: Especificador de formato incorreto:{0}
ru: Неверный спецификатор формата:{0}
tr: Hatalı biçim belirticisi: {0}
zh_hans: 错误的格式说明符: {0}
zh_hant: 不正確的格式規範: {0}

# printfBadIntegerForDynamicFomatter
source: Bad integer supplied to dynamic formatter
cs: Dynamickému formátovacímu modulu byla předána chybná celočíselná hodnota.
de: Für den dynamischen Formatierer wurde ein ungültiger Integer bereitgestellt.
es: Se proporcionó un entero incorrecto a un formateador dinámico.
fr: Entier incorrect fourni au formateur dynamique
it: Intero non valido fornito al formattatore dinamico
ja: 動的フォーマッタに対して指定された整数が正しくありません
ko: 동적 포맷터에 제공된 정수가 잘못되었습니다.
pl: Do dynamicznego modułu formatującego została przekazana błędna liczba całkowita.
pt_br: Inteiro incorreto fornecido a formatador dinâmico
ru: Динамическому форматтеру передано неверное целое
tr: Dinamik biçimlendiriciye yanlış tamsayı sağlandı
zh_hans: 提供给动态格式化程序的整数错误
zh_hant: 提供給動態格式器的整數錯誤

# printfExpectedPrecision
source: Expected a precision argument
cs: Byl očekáván argument určující přesnost.
de: Es wurde ein precision-Argument erwartet.
es: Se esperaba un argumento de precisión.
fr: Argument de précision attendu
it: Previsto argomento precision
ja: 精度引数が必要でした
ko: 전체 자릿수 인수가 필요합니다.
pl: Oczekiwano argumentu dokładności.
pt_br: Argumento de precisão esperado
ru: Требуется аргумент точности
tr: Bir duyarlık bağımsız değişkeni bekleniyordu
zh_hans: 应为精度参数
zh_hant: 必須是精確度引數

# printfExpectedWidth
source: Expected a width argument
cs: Byl očekáván argument určující šířku.
de: Es wurde ein width-Argument erwartet.
es: Se esperaba un argumento de acho.
fr: Argument de largeur attendu
it: Previsto argomento width
ja: 幅引数が必要でした
ko: 너비 인수가 필요합니다.
pl: Oczekiwano argumentu szerokości.
pt_br: Argumento de largura esperado
ru: Требуется аргумент ширины
tr: Bir genişlik bağımsız değişkeni bekleniyordu
zh_hans: 应为宽度参数
zh_hant: 必須是寬度引數

# printfHashFormatSpecifierIllegal
source: The # formatting modifier is invalid in F#
cs: Modifikátor formátu # je v jazyce F# neplatný.
de: Der #-Formatierungsmodifizierer ist in F# ungültig.
es: El modificador de formato # no es válido en F#.
fr: Le modificateur de mise en forme # n'est pas valide en F#
it: Il modificatore di formattazione # non è valido in F#
ja: # 書式修飾子は F# では無効です
ko: F#에서는 # 서식 지정 한정자를 사용할 수 없습니다.
pl: Modyfikator formatu # jest nieprawidłowy w języku F#
pt_br: O modificador de formatação # é inválido em F#
ru: Модификатор форматирования # в F# недопустим.
tr: # biçimlendirme değiştiricisi F# içinde geçersizdir
zh_hans: # 格式修饰符在 F# 中无效
zh_hant: # 格式修飾詞在 F# 中無效

# printfMissingFormatSpecifier
source: Missing format specifier
cs: Chybí specifikátor formátu.
de: Der Formatbezeichner fehlt.
es: Falta un especificador de formato.
fr: Spécificateur de format manquant
it: Identificatore di formato mancante
ja: 書式指定子がありません
ko: 서식 지정자가 없습니다.
pl: Brak specyfikatora formatu
pt_br: Especificador de formato ausente
ru: Отсутствует указатель формата
tr: Biçim belirticisi eksik
zh_hans: 缺少格式说明符
zh_hant: 遺漏格式修飾詞

# printfNotAFunType
source: Not a function type
cs: Nejedná se o typ funkce.
de: Kein Funktionstyp.
es: No es un tipo de función.
fr: N'est pas un type de fonction
it: Non è un tipo di funzione
ja: 関数型ではありません
ko: 함수 형식이 아닙니다.
pl: To nie jest typ funkcji.
pt_br: Não é um tipo de função
ru: Не является типом функции
tr: Bir işlev türü değil
zh_hans: 不是函数类型
zh_hant: 不是函式類型

# printfPrecisonSpecifierIllegal
source: Bad format specifier (precision)
cs: Chybný specifikátor formátu (přesnost)
de: Ungültiger Formatbezeichner (precision)
es: Especificador de formato incorrecto (precisión).
fr: Spécificateur de format incorrect (précision)
it: Identificatore di formato non valido (precision)
ja: 書式指定子 (精度) が正しくありません
ko: 잘못된 형식 지정자(전체 자릿수)
pl: Błędny specyfikator formatu (dokładności).
pt_br: Especificador de formato incorreto (precisão)
ru: Неверный спецификатор формата (точность)
tr: Hatalı biçim belirticisi (duyarlık)
zh_hans: 错误的格式说明符(精度)
zh_hant: 不正確的格式修飾詞 (精確度)

# printfSpecifierAfterIllegal
source: Bad format specifier (after {0})
cs: Chybný specifikátor formátu (za {0})
de: Ungültiger Formatbezeichner (nach {0})
es: Especificador de formato incorrecto (después de {0}).
fr: Spécificateur de format incorrect (après {0})
it: Identificatore di formato non valido (dopo {0})
ja: 書式指定子 ({0} の後) が正しくありません
ko: 잘못된 형식 지정자({0} 이후)
pl: Błędny specyfikator formatu (po elemencie {0}).
pt_br: Especificador de formato incorreto (após {0})
ru: Неверный спецификатор формата (после {0})
tr: Hatalı biçim belirticisi ({0} sonrasında)
zh_hans: 错误的格式说明符(在 {0} 之后)
zh_hant: 不正確的格式修飾詞 (在 {0} 之後)

# printfWidthSpecifierIllegal
source: Bad format specifier (width)
cs: Chybný specifikátor formátu (šířka)
de: Ungültiger Formatbezeichner (width)
es: Especificador de formato incorrecto (ancho).
fr: Spécificateur de format incorrect (largeur)
it: Identificatore di formato non valido (width)
ja: 書式指定子 (幅) が正しくありません
ko: 잘못된 형식 지정자(너비)
pl: Błędny specyfikator formatu (szerokości).
pt_br: Especificador de formato incorreto (largura)
ru: Неверный спецификатор формата (ширина)
tr: Hatalı biçim belirticisi (genişlik)
zh_hans: 错误的格式说明符(宽度)
zh_hant: 不正確的格式規範 (寬度)
