Repository: dotnet/fsharp
Catalog: src/FSharp.Core/xlf/FSCore.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# QcannotBindFunction
source: Could not bind function {0} in type {1}
cs: Nebylo možné vytvořit vazbu funkce {0} v typu {1}.
de: Die Funktion "{0}" in Typ "{1}" konnte nicht gebunden werden.
es: No se pudo enlazar la función {0} en el tipo {1}.
fr: Impossible de lier la fonction {0} dans le type {1}
it: Non è stato possibile eseguire il binding della funzione {0} nel tipo {1}
ja: 型 {1} で関数 {0} をバインドできませんでした
ko: {1} 형식의 {0} 함수를 바인딩할 수 없습니다.
pl: Nie można powiązać funkcji {0} w typie {1}.
pt_br: Não foi possível associar a função {0} ao tipo {1}
ru: Не удалось выполнить привязку функции {0} в типе {1}
tr: {1} türünde {0} işlevi bağlanamadı
zh_hans: 未能绑定类型 {1} 中的函数 {0}
zh_hant: 無法繫結類型 {1} 中的函式 {0}

# QcannotBindProperty
source: Could not bind property {0} in type {1}
cs: Nebylo možné vytvořit vazbu vlastnosti {0} v typu {1}.
de: Die Eigenschaft "{0}" in Typ "{1}" konnte nicht gebunden werden.
es: No se pudo enlazar la propiedad {0} en el tipo {1}
fr: Impossible de lier la propriété {0} dans le type {1}
it: Non è stato possibile eseguire il binding della proprietà {0} nel tipo {1}
ja: 型 {1} でプロパティ {0} をバインドできませんでした
ko: {1} 형식의 {0} 속성을 바인딩할 수 없습니다.
pl: Nie można powiązać właściwości {0} w typie {1}.
pt_br: Não foi possível associar a propriedade {0} ao tipo {1}
ru: Не удалось выполнить привязку свойства {0} в типе {1}
tr: {1} türündeki {0} özelliği bağlanamadı
zh_hans: 未能绑定类型 {1} 中的属性 {0}
zh_hant: 無法繫結類型 {1} 中的屬性 {0}

# QcannotBindToMethod
source: Could not bind to method
cs: Nebylo možné vytvořit vazbu na metodu.
de: Die Bindung an Methode war nicht möglich.
es: No se pudo enlazar al método.
fr: Liaison à la méthode impossible
it: Non è stato possibile eseguire il binding al metodo
ja: メソッドにバインドできませんでした
ko: 메서드에 바인딩할 수 없습니다.
pl: Nie można powiązać z metodą.
pt_br: Não foi possível associar ao método
ru: Не удалось выполнить привязку к методу
tr: Metot bağlanamadı
zh_hans: 未能绑定到方法
zh_hant: 無法繫結至方法

# QcannotTakeAddress
source: Cannot take the address of this quotation
cs: Nelze získat adresu této citace.
de: Die Adresse dieser Quotation kann nicht verwendet werden.
es: No puede tomar la dirección de esta citación.
fr: Impossible de lire l'adresse de cette quotation
it: L'indirizzo di questa quotation non è accettato
ja: この引用のアドレスを取得できません
ko: 이 인용의 주소를 가져올 수 없습니다.
pl: Nie można przyjąć adresu tego cytatu.
pt_br: Não é possível obter o endereço desta cotação
ru: Не удается получить адрес этой цитаты
tr: Bu tırnağın adresi alınamıyor
zh_hans: 无法获取此引用的地址
zh_hant: 無法取得此引號的位址

# QfailedToBindAssembly
source: Failed to bind assembly '{0}' while processing quotation data
cs: Při zpracování dat citace se nezdařilo vytvořit vazbu sestavení {0}.
de: Fehler beim Binden der Assembly "{0}" während der Verarbeitung der Quotation-Daten.
es: No se pudo enlazar el ensamblado '{0}' mientras se procesaban los datos de citación.
fr: Impossible de lier l'assembly '{0}' lors du traitement des données de quotation
it: Non è stato possibile eseguire il binding dell'assembly '{0}' durante l'elaborazione dei dati di quotation
ja: 引用データの処理中にアセンブリ '{0}' をバインドできませんでした
ko: 인용 데이터를 처리하는 동안 '{0}' 어셈블리를 바인딩하지 못했습니다.
pl: Nie można powiązać zestawu „{0}” w trakcie przetwarzania danych cytatu.
pt_br: Falha ao associar o assembly '{0}' ao processar dados de cotação
ru: Не удалось привязать сборку ""{0}"" во время обработки данных цитирования
tr: Tırnak verileri işlenirken '{0}' bütünleştirilmiş kodu bağlanamadı
zh_hans: 在处理引用数据时未能绑定程序集“{0}”
zh_hant: 處理引號資料時無法繫結到組件 '{0}'

# QillFormedAppOrLet
source: ill formed expression: AppOp or LetOp
cs: Chybně vytvořený výraz: AppOp nebo LetOp
de: Unzulässig geformter Ausdruck: AppOp oder LetOp
es: Expresión con formato incorrecto: AppOp o LetOp
fr: expression incorrecte : AppOp ou LetOp
it: espressione in formato non valido: AppOp o LetOp
ja: 正しくない形式の式: AppOp または LetOp
ko: 잘못된 형식의 식: AppOp 또는 LetOp
pl: błędnie skonstruowane wyrażenie: AppOp lub LetOp
pt_br: expressão malformada: AppOp ou LetOp
ru: Неверно сформированное выражение: AppOp или LetOp
tr: hatalı biçimlendirilmiş ifade: AppOp veya LetOp
zh_hans: 格式错误的表达式: AppOp 或 LetOp
zh_hant: 格式不正確的運算式: AppOp 或 LetOp

# QtypeArgumentOutOfRange
source: type argument out of range
cs: Argument typu je mimo rozsah.
de: Das Typargument liegt außerhalb des zulässigen Bereichs.
es: argumento de tipo fuera de intervalo
fr: argument de type hors limites
it: argomento tipo non compreso nell'intervallo
ja: 型引数が範囲外です
ko: 형식 인수가 범위를 벗어났습니다.
pl: wartość argumentu typu poza zakresem
pt_br: argumento de tipo fora do intervalo
ru: аргумент типа вне диапазона
tr: tür bağımsız değişkeni aralık dışında
zh_hans: 类型参数超出范围
zh_hant: 型別引數超出範圍

source: This value cannot be mutated
cs: Tato hodnota nemůže být mutována.
de: Für diesen Wert darf kein Mutating verwendet werden.
es: Este valor no es mutable.
fr: Cette valeur ne peut pas être mutée
it: Non è possibile modificare questo valore
ja: この値は変換できません
ko: 이 값을 변경할 수 없습니다.
pl: Ta wartość nie może ulegać mutacjom.
pt_br: Este valor não pode ser modificado
ru: Это значение нельзя изменить.
tr: Bu değer değiştirilemez
zh_hans: 无法转变此值
zh_hant: 不能變更這個值

# optionValueWasNone
source: The option value was None
cs: Hodnota možnosti byla None.
de: Der Optionswert war "Kein".
es: El valor de la opción era None.
fr: La valeur de l'option est Aucun
it: Il valore dell'opzione è None
ja: オプション値は None でした
ko: 옵션 값이 None입니다.
pl: Opcja ma wartość Brak.
pt_br: O valor da opção era None
ru: Значением параметра было Нет
tr: Seçenek değeri None idi
zh_hans: 选项值为“None”
zh_hant: 選項值為 None

# controlContinuationInvokedMultipleTimes
source: A continuation provided by Async.FromContinuations was invoked multiple times
cs: Pokračování poskytované metodou Async.FromContinuations bylo vyvoláno vícekrát.
de: Eine von "Async.FromContinuations" bereitgestellte Fortsetzung wurde mehrfach aufgerufen.
es: Se invocó varias veces una continuación proporcionada por Async.FromContinuations.
fr: Une continuation fournie par Async.FromContinuations a été appelée plusieurs fois
it: È stata richiamata più volte una continuazione fornita da Async.FromContinuations
ja: Async.FromContinuations で提供される継続が複数回呼び出されました
ko: Async.FromContinuations에 의해 제공된 연속 작업이 여러 번 호출되었습니다.
pl: Kontynuacja realizowana przez metodę Async.FromContinuations została wywołana kilka razy.
pt_br: Uma continuação fornecida por Async.FromContinuations foi invocada várias vezes
ru: Продолжение, предоставленное Async.FromContinuations, было вызвано несколько раз
tr: Async.FromContinuations tarafından sağlanan bir devamlılık birden fazla kez çağrıldı
zh_hans: Async.FromContinuations 提供的延续被调用了多次
zh_hant: Async.FromContinuations 提供的接續部分已被多次叫用。

# invalidRecordTypeConstructorNotDefined
source: The record type '{0}' is invalid. Required constructor is not defined.
cs: Záznam typu {0} je neplatný. Požadovaný konstruktor není definován.
de: Der Datensatztyp "{0} " ist ungültig. Erforderlicher Konstruktor ist nicht definiert.
es: El tipo de registro '{0}' no es válido. El constructor requerido no está definido.
fr: Le type enregistrement '{0}' n'est pas valide. Un constructeur requis n'est pas défini.
it: Tipo di record '{0}' non valido. Un costruttore necessario non è definito.
ja: レコード型 '{0}' は無効です。必要なコンストラクターが定義されていません。
ko: 레코드 형식 '{0}'이(가) 잘못되었습니다. 필요한 생성자가 정의되지 않았습니다.
pl: Typ rekordu „{0}” jest nieprawidłowy. Nie zdefiniowano wymaganego konstruktora.
pt_br: O tipo de registro '{0}' é inválido. O construtor necessário não foi definido.
ru: Тип записи "{0}" является недопустимым. Не определен обязательный конструктор.
tr: '{0}' kayıt türü geçersiz. Gerekli oluşturucu tanımlanmadı.
zh_hans: 记录类型“{0}”无效。未定义所需的构造函数。
zh_hant: 記錄類型 '{0}' 無效。未定義必要的建構函式。

# invalidTupleTypeConstructorNotDefined
source: The tuple type '{0}' is invalid. Required constructor is not defined.
cs: Řazená kolekce členů typu {0} je neplatná. Požadovaný konstruktor není definován.
de: Der Tupeltyp "{0}" ist ungültig. Erforderlicher Konstruktor ist nicht definiert.
es: El tipo de tupla '{0}' no es válido. El constructor requerido no está definido.
fr: Le type tuple '{0}' n'est pas valide. Un constructeur requis n'est pas défini.
it: Tipo di tupla '{0}' non valido. Un costruttore necessario non è definito.
ja: タプル型 '{0}' は無効です。必要なコンストラクターが定義されていません。
ko: 튜플 형식 '{0}'이(가) 잘못되었습니다. 필요한 생성자가 정의되지 않았습니다.
pl: Typ krotki „{0}” jest nieprawidłowy. Nie zdefiniowano wymaganego konstruktora.
pt_br: O tipo de tupla '{0}' é inválido. O construtor necessário não foi definido.
ru: Тип кортежа "{0}" является недопустимым. Не определен обязательный конструктор.
tr: '{0}' demet türü geçersiz. Gerekli oluşturucu tanımlanmadı.
zh_hans: 元组类型“{0}”无效。未定义所需的构造函数。
zh_hant: 元組型別 '{0}' 無效。未定義必要的建構函式。

# inputSequenceTooLong
source: The input sequence contains more than one element.
cs: Vstupní sekvence obsahuje více než jeden element.
de: Die Eingabesequenz enthält mehr als ein Element.
es: La secuencia de entrada contiene más de un elemento.
fr: La séquence d'entrée contient plusieurs éléments.
it: La sequenza di input contiene più elementi.
ja: 入力シーケンスに複数の要素が含まれています。
ko: 입력 시퀀스에 요소가 두 개 이상 있습니다.
pl: Sekwencja wejściowa zawiera więcej niż jeden element.
pt_br: A sequência de entrada contém mais de um elemento.
ru: Входная последовательность содержит более одного элемента.
tr: Giriş dizisi birden fazla öğe içeriyor.
zh_hans: 输入序列包含多个元素。
zh_hant: 輸入序列包含一個以上的項目。

# thenByError
source: 'thenBy' and 'thenByDescending' may only be used with an ordered input
cs: Operátory thenBy a thenByDescending lze použít pouze pro uspořádaný vstup.
de: thenBy und "thenByDescending" dürfen nur mit einer sortierten Eingabe verwendet werden.
es: 'thenBy' y 'thenByDescending' solo se pueden usar con una entrada ordenada
fr: 'thenBy' et 'thenByDescending' peuvent seulement être utilisés avec une entrée ordonnée
it: 'thenBy' e 'thenByDescending' possono essere utilizzati solo con un input ordinato
ja: 'thenBy' および 'thenByDescending' は、順序付けされた入力だけで使用できます
ko: 'thenBy' 및 'thenByDescending'은 순서가 지정된 입력에서만 사용할 수 있습니다.
pl: Operatorów „thenBy” i „thenByDescending” można używać tylko wobec sortowanych danych wejściowych.
pt_br: 'thenBy' e 'thenByDescending' só podem ser usados com uma entrada ordenada
ru: thenBy и thenByDescending можно использовать только в случае упорядоченных входных данных
tr: 'thenBy' ve 'thenByDescending' yalnızca sıralanmış bir girişle kullanılabilir
zh_hans: “thenBy”和“thenByDescending”只能用于有序输入
zh_hant: 'thenBy' 和 'thenByDescending' 只能搭配已排序的輸入一起使用

# failDueToUnsupportedInputTypeInSumByOrAverageBy
source: Unrecognized use of a 'sumBy' or 'averageBy' operator in a query. In queries whose original data is of static type IQueryable, these operators may only be used with result type int32, int64, single, double or decimal
cs: Nerozpoznané použití operátoru sumBy nebo averageBy v dotazu. V dotazech, jejichž původní data jsou statického typu IQueryable, je tyto operátory možné použít pouze s typem výsledku int32, int64, single, double nebo decimal.
de: Nicht erkannte Verwendung eines "sumBy"- oder "averageBy"-Operators in einer Abfrage. Bei Abfragen mit ursprünglichen Daten des statischen IQueryable-Typs dürfen diese Operatoren nur mit den Ergebnistypen int32, int64, single, double oder decimal verwendet werden.
es: Uso no reconocido de un operador 'sumBy' o 'averageBy' en una consulta. En las consultas cuyos datos originales son de tipo estático IQueryable, estos operadores solo se pueden usar con el tipo de resultado int32, int64, single, double o decimal.
fr: Utilisation non reconnue d'un opérateur 'sumBy' ou 'averageBy' dans une requête. Dans les requêtes dont les données d'origine est de type statique IQueryable, ces opérateurs peuvent seulement être utilisés avec le type de résultat int32, int64, single, double ou decimal
it: Uso non riconosciuto di un operatore 'sumBy' o 'averageBy' in una query. Nelle query i cui dati originali sono del tipo statico IQueryable, questi operatori possono essere utilizzati solo con tipo di risultato int32, int64, single, double o decimal
ja: クエリ内で 'sumBy' または 'averageBy' 演算子が認識されない使われ方をしています。元のデータがスタティック型 IQueryable であるクエリでは、これらの演算子は結果の型が int32、int64、single、double、または decimal である場合にだけ使用できます。
ko: 쿼리에서 'sumBy' 또는 'averageBy' 연산자 사용을 인식할 수 없습니다. 원본 데이터가 정적 형식 IQueryable인 쿼리의 경우 결과 형식 int32, int64, single, double 또는 decimal에만 이러한 연산자를 사용할 수 있습니다.
pl: Nierozpoznane użycie operatora „sumBy” lub „averageBy” w zapytaniu. W zapytaniach, których oryginalne dane są statycznego typu IQueryable, obu operatorów można używać tylko do typów wyników int32, int64, single, double lub decimal.
pt_br: Uso não reconhecido de um operador 'sumBy' ou 'averageBy' em uma consulta. Em consultas cujos dados originais são do tipo estático IQueryable, esses operadores só podem ser usados com o tipo de resultado int32, int64, single, double ou decimal
ru: Нераспознаваемое использование в запросе оператора sumBy или averageBy. В запросах, исходным типом данных которых является статический тип IQueryable, эти операторы можно использовать только с типом результата int32, int64, single, double или decimal
tr: Sorguda 'sumBy' veya 'averageBy' işlecinin tanınmayan kullanımı. Özgün verileri statik IQueryable türünde olan sorgularda, bu işleçler yalnızca int32, int64, single, double veya decimal sonuç türüyle kullanılabilir
zh_hans: 查询中无法识别的“sumBy”或“averageBy”运算符用法。在其原始数据属于静态类型 IQueryable 的查询中，这些运算符只能用于结果类型 int32、int64、single、double 或 decimal
zh_hant: 查詢中無法辨認的 'sumBy' 或 'averageBy' 運算子使用方式。在原始資料屬於靜態類型 IQueryable 的查詢中，這些運算子只能搭配結果類型 int32、int64、single、double 或 decimal 一起使用

# unsupportedIfThenElse
source: An if/then/else conditional or pattern matching expression with multiple branches is not permitted in a query. An if/then/else conditional may be used.
cs: V dotazu není povolen podmíněný výraz if/then/else nebo výraz porovnávání vzorů s více větvemi. Je možné použít podmíněný výraz if/then/else.
de: In einer Abfrage sind die bedingten Ausdrücke if/then/else oder der Musterabgleichausdruck mit mehrfachen Verzweigungen nicht zulässig. Eine if/then/else-Bedingung kann verwendet werden.
es: No se permite una expresión de detección de patrones o condicional if/then/else con varias bifurcaciones en una consulta. Puede usarse una expresión condicional if/then/else.
fr: Une expression if/then/else conditionnelle ou contenant des critères spéciaux avec plusieurs branches n'est pas autorisée dans une requête. Une conditionnelle if/then/else peut être utilisée.
it: Una condizione if/then/else o un'espressione di criteri di ricerca con più rami non è consentita in una query. È possibile usare una condizione if/then/else.
ja: if/then/else 条件節、または分岐のあるパターン一致式は、クエリで使用できません。if/then/else 条件節が使用されている可能性があります。
ko: 여러 분기가 포함된 if/then/else 조건식 또는 패턴 일치 식은 쿼리에 사용할 수 없습니다. if/then/else 조건문을 사용할 수 있습니다.
pl: W zapytaniu nie można używać wyrażenia warunkowego if/then/else ani wyrażenia porównującego wielogałęziowe wzorce. Dozwolone są proste wyrażenia warunkowe if/then/else.
pt_br: Uma expressão de correspondência de padrões ou condicional if/then/else com várias ramificações não é permitida em uma consulta. Uma condicional if/then/else pode ser usada.
ru: В запросах не допускается использовать условные выражения if/then/else или проверку на соответствие шаблонам с несколькими ветвями. Можно использовать обычные условные выражения if/then/else.
tr: Sorguda, birden fazla dalı bulunan if/then/else koşullu veya desen eşleştirme ifadesine izin verilmez. Bir if/then/else koşulu kullanılabilir.
zh_hans: 查询中不允许出现拥有多个分支的 if/then/else 条件或模式匹配表达式。可以使用 if/then/else 条件。
zh_hant: 不允許在查詢中使用具有多個分支的 if/then/else 條件式或模式比對運算式。您可以使用 if/then/else 條件式。

# unsupportedQueryConstruct
source: This is not a valid query expression. The following construct was used in a query but is not recognized by the F#-to-LINQ query translator:\n{0}\nCheck the specification of permitted queries and consider moving some of the operations out of the query expression.
cs: Toto není platný výraz dotazu. V dotazu byla použita následující konstrukce, která není rozpoznána překladačem dotazu z jazyka F# do jazyka LINQ:\n{0}\nProstudujte si specifikace povolených dotazů a zvažte přesunutí některých operací mimo výraz dotazu.
de: Dies ist kein gültiger Abfrageausdruck. Das folgende Konstrukt wurde in einer Abfrage verwendet, wird jedoch vom F#-to-LINQ-Abfragekonvertierungsprogramm nicht erkannt:\n{0}\nÜberprüfen Sie die Spezifikation von zulässigen Abfragen, und entfernen Sie unter Umständen einige Operationen aus dem Abfrageausdruck.
es: Esta no es una expresión de consulta válida. La siguiente construcción se usó en una consulta, pero el traductor de consultas F#-to-LINQ no la reconoce:\n{0}\nCompruebe la especificación de consultas permitidas y considere mover algunas de las operaciones fuera de la expresión de consulta.
fr: Cette expression de requête n'est pas valide. La construction suivante a été utilisée dans une requête, mais n'est pas reconnue par le traducteur de requête F#-to-LINQ :\n{0}\nVérifiez la spécification des requêtes autorisées et envisagez de retirer certaines opérations de l'expression de requête.
it: Espressione di query non valida. Il costrutto seguente è stato utilizzato in una query, tuttavia non è riconosciuto dal traduttore di query da F# a LINQ:\n{0}\nVerificare le specifiche delle query consentite e provare a spostare alcune operazioni all'esterno dell'espressione di query.
ja: これは有効なクエリ式ではありません。クエリで次の構造が使用されていますが、F# から LINQ へのクエリ トランスレーターに認識されません:\n{0}\n許可されたクエリの仕様を確認し、一部の操作をクエリ式の外に移動することを検討してください。
ko: 올바른 쿼리 식이 아닙니다. 다음 생성자가 쿼리에 사용되었지만 F#-to-LINQ 쿼리 변환기에서 인식할 수 없습니다.\n{0}\n허용되는 쿼리의 사양을 확인하고 일부 연산을 쿼리 식 외부로 이동하세요.
pl: To nie jest prawidłowe wyrażenie zapytania. Poniższa konstrukcja została użyta w zapytaniu, ale nie rozpoznaje jej translator zapytań z języka F# na język LINQ:\n{0}\nSprawdź specyfikacje dozwolonych zapytań i rozważ przeniesienie niektórych operacji poza wyrażenie zapytania.
pt_br: Expressão de consulta inválida. A construção a seguir foi usada em uma consulta, mas não é reconhecida pelo conversor de consultas F#-to-LINQ:\n{0}\nVerifique a especificação de consultas permitidas e considere remover algumas das operações da expressão de consulta.
ru: Недопустимое выражение запроса. Следующая конструкция использовалась в запросе, но не была распознана транслятором запросов из F# в LINQ:\n{0}\nПроверьте спецификацию разрешенных запросов и попробуйте вынести часть операций за пределы запроса.
tr: Bu geçerli bir sorgu ifadesi değil. Aşağıdaki yapı sorguda kullanıldı, ancak F#-to-LINQ çevirmeni tarafından tanınmıyor:\n{0}\nİzin verilen soruların belirtimini denetleyin ve işlemlerden bazılarını sorgu ifadesinin dışına taşımayı düşünün.
zh_hans: 这不是有效的查询表达式。查询中使用了下面的构造，但 F#-LINQ 查询转换器无法识别该构造:\n{0}\n请查看有效查询的规范，考虑是否将部分运算移到查询表达式之外。
zh_hant: 這不是有效的查詢運算式。查詢中使用了下列建構，但 F#-to-LINQ 查詢翻譯工具無法加以辨認:\n{0}\n請檢查所允許之查詢的規格，並考慮將一些運算移出查詢運算式。

# unsupportedQueryCall
source: This is not a valid query expression. The method '{0}' was used in a query but is not recognized by the F#-to-LINQ query translator. Check the specification of permitted queries and consider moving some of the operations out of the query expression
cs: Toto není platný výraz dotazu. V dotazu byla použita metoda {0}, která není rozpoznána překladačem dotazu z jazyka F# do jazyka LINQ. Prostudujte si specifikace povolených dotazů a zvažte přesunutí některých operací mimo výraz dotazu.
de: Dies ist kein gültiger Abfrageausdruck. Die Methode "{0}" wurde in einer Abfrage verwendet, wird aber vom F#-to-LINQ-Abfragekonvertierungsprogramm nicht erkannt. Überprüfen Sie die Spezifikation von zulässigen Abfragen, und entfernen Sie unter Umständen einige Operationen aus dem Abfrageausdruck.
es: Esta no es una expresión de consulta válida. El método '{0}' se usó en una consulta, pero el traductor de consultas F#-to-LINQ no lo reconoce. Compruebe la especificación de consultas permitidas y considere mover algunas de las operaciones fuera de la expresión de consulta.
fr: Cette expression de requête n'est pas valide. La méthode '{0}' a été utilisée dans une requête, mais n'est pas reconnue par le traducteur de requête F#-to-LINQ. Vérifiez la spécification des requêtes autorisées et envisagez de retirer certaines opérations de l'expression de requête
it: Espressione di query non valida. Il metodo '{0}' è stato utilizzato in una query ma non è stato riconosciuto dal traduttore di query da F# a LINQ. Verificare le specifiche delle query consentite e provare a spostare alcune operazioni all'esterno dell'espressione di query
ja: これは有効なクエリ式ではありません。クエリでメソッド '{0}' が使用されていますが、F# から LINQ へのクエリ トランスレーターに認識されません。許可されたクエリの仕様を確認し、一部の操作をクエリ式の外に移動することを検討してください
ko: 올바른 쿼리 식이 아닙니다. '{0}' 메서드가 쿼리에 사용되었지만 F#-to-LINQ 쿼리 변환기에서 인식할 수 없습니다. 허용되는 쿼리의 사양을 확인하고 일부 연산을 쿼리 식 외부로 이동하세요.
pl: To nie jest prawidłowe wyrażenie zapytania. Metoda „{0}” została użyta w zapytaniu, ale nie rozpoznaje jej translator zapytań z języka F# na język LINQ. Sprawdź specyfikacje dozwolonych zapytań i rozważ przeniesienie niektórych operacji poza wyrażenie zapytania.
pt_br: Expressão de consulta inválida. O método '{0}' foi usado em uma consulta, mas não é reconhecido pelo conversor de consultas F#-to-LINQ. Verifique a especificação de consultas permitidas e considere remover algumas das operações da expressão de consulta
ru: Недопустимое выражение запроса. Метод "{0}" использовался в запросе, но не был распознан транслятором запросов из F# в LINQ. Проверьте спецификацию разрешенных запросов и попробуйте вынести часть операций за пределы выражения запроса
tr: Bu geçerli bir sorgu ifadesi değil. '{0}' metodu sorguda kullanıldı, ancak F#-to-LINQ çevirmeni tarafından tanınmıyor. İzin verilen soruların belirtimini denetleyin ve işlemlerden bazılarını sorgu ifadesinin dışına taşımayı düşünün
zh_hans: 这不是有效的查询表达式。查询中使用了方法“{0}”，但 F#-LINQ 查询转换器无法识别该方法。请查看有效查询的规范，考虑是否将部分运算移到查询表达式之外
zh_hant: 這不是有效的查詢運算式。查詢中使用了方法 '{0}'，但 F#-to-LINQ 查詢翻譯工具無法加以辨認。請檢查所允許之查詢的規格，並考慮將一些運算移出查詢運算式
