Repository: dotnet/fsharp
Catalog: src/FSharp.Core/xlf/FSCore.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# QtmmInitArray
source: Type mismatch when building '{0}': initializer doesn't match array type. Expected '{1}', but received type '{2}'.
cs: Neshoda typů při sestavování {0}: inicializátor neodpovídá typu pole. Očekávaný typ byl {1}, ale přijatý typ byl {2}.
de: Typenkonflikt beim Erstellen von "{0}": Der Initialisierer stimmt nicht mit dem Arraytyp überein. Erwartet wurde "{1}", aber der Typ "{2}" wurde empfangen.
es: Incoherencia de tipos al compilar '{0}': el inicializador no coincide con el tipo de matriz. Se esperaba '{1}', pero se recibió el tipo '{2}'.
fr: Incompatibilité de type durant la création de '{0}' : l'initialiseur ne correspond pas au type tableau. '{1}' attendu, mais type '{2}' reçu.
it: Tipo non corrispondente durante la compilazione di '{0}': l'inizializzatore non corrisponde al tipo di matrice. Previsto '{1}', tipo ricevuto '{2}'.
ja: {0}' を構築するときの型の不一致: 初期化子が配列型と一致しません。'{1}' が必要でしたが、型 '{2}' を受け取りました。
ko: {0}'을(를) 작성하는 동안 형식 불일치 문제가 발생했습니다. 이니셜라이저가 배열 형식과 일치하지 않습니다. '{1}'이(가) 필요한데 '{2}' 형식을 수신했습니다.
pl: Niezgodność typów podczas kompilowania elementu „{0}”: inicjator nie pasuje do typu tablicy. Oczekiwano typu „{1}”, natomiast stwierdzono typ „{2}”.
pt_br: Tipos incompatíveis ao compilar '{0}': inicializador incompatível com tipo de matriz. '{1}' esperado, mas o tipo recebido foi '{2}'.
ru: Несоответствие типа при сборке "{0}": инициализатор не соответствует типу массива. Требуется "{1}", но получен тип "{2}".
tr: {0}' oluşturulurken tür uyuşmazlığı oluştu: başlatıcı dizi türüyle eşleşmiyor. '{1}' bekleniyordu, ancak '{2}' türü alındı.
zh_hans: 在生成“{0}”时类型不匹配: 初始化表达式与数组类型不匹配。应为“{1}”，但收到的类型为“{2}”。
zh_hant: 建置 '{0}' 時發生類型不符的情況: 初始設定式與陣列類型不相符。必須是 '{1}'，但卻收到類型 '{2}'。

# QtmmInvalidParam
source: Type mismatch when building '{0}': invalid parameter for a method or indexer property. Expected '{1}', but received type '{2}'.
cs: Neshoda typů při sestavování {0}: neplatný parametr metody nebo vlastnosti indexeru. Očekávaný typ byl {1}, ale přijatý typ byl {2}.
de: Typenkonflikt beim Erstellen von "{0}": Der Parameter für eine Methode oder Indexereigenschaft ist falsch. Erwartet wurde "{1}", aber der Typ "{2}" wurde empfangen.
es: Incoherencia de tipos al compilar '{0}': parámetro no válido para una propiedad de método o de indizador. Se esperaba '{1}', pero se recibió el tipo '{2}'.
fr: Incompatibilité de type lors de la création de '{0}' : paramètre incorrect pour une méthode ou une propriété indexer. '{1}' attendu, mais type '{2}' reçu.
it: Tipo non corrispondente durante la compilazione di '{0}': parametro non valido per un metodo o una proprietà di indicizzatore. Previsto '{1}', tipo ricevuto '{2}'.
ja: {0}' を構築するときの型の不一致:メソッドまたはインデクサー プロパティのパラメーターが無効です。'{1}' が必要でしたが、型 '{2}' を受け取りました。
ko: {0}'을(를) 작성하는 동안 형식 불일치 문제가 발생했습니다. 메서드 또는 인덱서 속성에 대한 매개 변수가 잘못되었습니다. '{1}'이(가) 필요한데 '{2}' 형식을 수신했습니다.
pl: Niezgodność typów podczas kompilowania elementu „{0}”: nieprawidłowy parametr metody lub właściwości indeksatora. Oczekiwano typu „{1}”, natomiast stwierdzono typ „{2}”.
pt_br: Tipos incompatíveis ao compilar '{0}': parâmetro inválido para uma propriedade de indexador ou método. '{1}' esperado, mas o tipo recebido foi '{2}'.
ru: Несоответствие типа при сборке "{0}": недопустимый параметр для метода или свойства индексатора. Требуется "{1}", но получен тип "{2}".
tr: {0}' oluşturulurken tür uyuşmazlığı oluştu: bir metot veya dizin oluşturucu özelliği için geçersiz parametre. '{1}' bekleniyordu, ancak '{2}' türü alındı.
zh_hans: 在生成“{0}”时类型不匹配: 方法或索引器属性的参数无效。应为“{1}”，但收到的类型为“{2}”。
zh_hant: 建置 '{0}' 時發生類型不符的情況: 方法或索引子屬性的參數無效。必須是 '{1}'，但卻收到類型 '{2}'。

# QtmmLoopBodyMustBeLambdaTakingInteger
source: Type mismatch when building '{0}': body of the for loop must be lambda taking integer as an argument. Expected '{1}', but received type '{2}'.
cs: Neshoda typů při sestavování {0}: tělo cyklu for musí být výraz lambda, který jako argument přijímá celé číslo. Očekávaný typ byl {1}, ale přijatý typ byl {2}.
de: Typenkonflikt beim Erstellen von "{0}": Der Textkörper der for-Schleife muss ein Lambda-Ausdruck sein, der einen Integer als Argument annimmt. Erwartet wurde "{1}", aber der Typ "{2}" wurde empfangen.
es: Incoherencia de tipos al compilar '{0}': el cuerpo del bucle For debe ser una expresión lambda que tome un entero como argumento. Se esperaba '{1}', pero se recibió el tipo '{2}'.
fr: Incompatibilité de type lors de la création de '{0}' : le corps de la boucle for doit être lambda avec un entier comme argument. '{1}' attendu, mais type '{2}' reçu.
it: Tipo non corrispondente durante la compilazione di '{0}': il corpo del ciclo deve essere un'espressione lambda che usa un intero come argomento. È previsto '{1}', ma il tipo ricevuto è '{2}'.
ja: {0}' を構築するときの型の不一致: for loop の本体は整数を引数として受け取るラムダである必要があります。'{1}' が必要でしたが、型 '{2}' を受け取りました。
ko: {0}'을(를) 작성하는 동안 형식 불일치 문제가 발생했습니다. For 루프의 본문은 정수를 인수로 사용하는 람다여야 합니다. '{1}'이(가) 필요한데 '{2}' 형식을 수신했습니다.
pl: Niezgodność typów podczas kompilowania elementu „{0}”: treścią pętli „for” musi być wyrażenie lambda, którego argumentem jest liczba całkowita. Oczekiwano typu „{1}”, natomiast stwierdzono typ „{2}”.
pt_br: Tipos incompatíveis ao compilar '{0}': o corpo do loop for deve ser lambda com um inteiro como argumento. '{1}' esperado, mas o tipo recebido foi '{2}'.
ru: Несоответствие типа при сборке "{0}": тело цикла "for" должно представлять собой лямбду, принимающую в качестве аргумента целочисленное значение. Требуется "{1}", но получен тип "{2}".
tr: {0}' oluşturulurken tür uyuşmazlığı oluştu: for döngüsünün gövdesi bağımsız değişken olarak tamsayı alan lambda olmalıdır. '{1}' bekleniyordu, ancak '{2}' türü alındı.
zh_hans: 在生成“{0}”时类型不匹配: for 循环的主体必须是采用整数作为参数的 lambda。应为“{1}”，但收到的类型为“{2}”。
zh_hant: 建置 '{0}' 時發生類型不符的情況: 迴圈主體必須是可接受整數當做引數的 Lambda。必須是 '{1}'，但卻收到類型 '{2}'。

# QtmmLowerUpperBoundMustBeInt
source: Type mismatch when building '{0}': lower and upper bounds must be integers. Expected '{1}', but received type '{2}'.
cs: Neshoda typů při sestavování {0}: dolní a horní hranice musejí být celá čísla. Očekávaný typ byl {1}, ale přijatý typ byl {2}.
de: Typenkonflikt beim Erstellen von "{0}": Die unteren und oberen Grenzwerte müssen Integer sein. Erwartet wurde "{1}", aber der Typ "{2}" wurde empfangen.
es: Incoherencia de tipos al compilar '{0}': los límites superior e inferior deben ser números enteros. Se esperaba '{1}', pero se recibió el tipo '{2}'.
fr: Incompatibilité de type lors de la création de '{0}' : les limites inférieures et supérieures doivent être des entiers. '{1}' attendu, mais type '{2}' reçu.
it: Tipo non corrispondente durante la compilazione di '{0}': i limiti inferiore e superiore devono essere un intero. È previsto '{1}', ma il tipo ricevuto è '{2}'.
ja: {0}' を構築するときの型の不一致: 下限と上限は整数である必要があります。'{1}' が必要でしたが、型 '{2}' を受け取りました。
ko: {0}'을(를) 작성하는 동안 형식 불일치 문제가 발생했습니다. 하한 및 상한은 정수여야 합니다. '{1}'이(가) 필요한데 '{2}' 형식을 수신했습니다.
pl: Niezgodność typów podczas kompilowania elementu „{0}”: wartości graniczne dolna i górna muszą być liczbami całkowitymi. Oczekiwano typu „{1}”, natomiast stwierdzono typ „{2}”.
pt_br: Tipos incompatíveis ao compilar '{0}': os limites inferior e superior devem ser inteiros. '{1}' esperado, mas o tipo recebido foi '{2}'.
ru: Несоответствие типа при сборке "{0}": нижняя и верхняя границы должны быть целыми числами. Требуется "{1}", но получен тип "{2}".
tr: {0}' oluşturulurken tür uyuşmazlığı oluştu: alt ve üst sınırlar tamsayı olmalıdır. '{1}' bekleniyordu, ancak '{2}' türü alındı.
zh_hans: 在生成“{0}”时类型不匹配: 下限或上限必须为整数。应为“{1}”，但收到的类型为“{2}”。
zh_hant: 建置 '{0}' 時發生類型不符的情況: 上下限必須是整數。必須是 '{1}'，但卻收到類型 '{2}'。

# QtmmTrueAndFalseMustMatch
source: Type mismatch when building '{0}': types of true and false branches differ. Expected '{1}', but received type '{2}'.
cs: Neshoda typů při sestavování {0}: typy ve větvích true a false se liší. Očekávaný typ byl {1}, ale přijatý typ byl {2}.
de: Typenkonflikt beim Erstellen von "{0}": Die Typen der Wahr- und Falsch-Verzweigungen stimmen nicht überein. Erwartet wurde "{1}", aber der Typ "{2}" wurde empfangen.
es: Incoherencia de tipos al compilar '{0}': los tipos de las bifurcaciones true y false son diferentes. Se esperaba '{1}', pero se recibió el tipo '{2}'.
fr: Incompatibilité de type lors de la création de '{0}' : les types des branches true et false ne sont pas identiques. '{1}' attendu, mais type '{2}' reçu.
it: Tipo non corrispondente durante la compilazione di '{0}': i tipi di rami true e false sono diversi. È previsto '{1}', ma è stato ricevuto il tipo '{2}'.
ja: {0}' を構築するときの型の不一致: true と false の分岐の型が異なります。'{1}' が必要でしたが、型 '{2}' を受け取りました。
ko: {0}'을(를) 작성하는 동안 형식 불일치 문제가 발생했습니다. True 및 False 분기의 형식이 서로 다릅니다. '{1}'이(가) 필요한데 '{2}' 형식을 수신했습니다.
pl: Niezgodność typów podczas kompilowania elementu „{0}”: typy gałęzi prawdy i fałszu różnią się od siebie. Oczekiwano typu „{1}”, natomiast stwierdzono typ „{2}”.
pt_br: Tipos incompatíveis ao compilar '{0}': tipos de ramificações true e false diferem. '{1}' esperado, mas o tipo recebido foi '{2}'.
ru: Несоответствие типа при сборке "{0}": типы ветвей true и false различны. Требуется "{1}", но получен тип "{2}".
tr: {0}' oluşturulurken tür uyuşmazlığı oluştu: true ve false dallarının türleri farklı. '{1}' bekleniyordu, ancak '{2}' türü alındı.
zh_hans: 在生成“{0}”时类型不匹配: 类型为 true 和 false 的分支不同。应为“{1}”，但收到的类型为“{2}”。
zh_hant: 建置 '{0}' 時發生類型不符的情況: true 和 false 分支的類型不相同。必須是 '{1}'，但卻收到類型 '{2}'。

# QtmmTuple
source: Type mismatch when building '{0}': mismatched type of argument and tuple element. Expected '{1}', but received type '{2}'.
cs: Neshoda typů při sestavování {0}: typ argumentu a prvku řazené kolekce členů se neshodují. Očekávaný typ byl {1}, ale přijatý typ byl {2}.
de: Typenkonflikt beim Erstellen von "{0}": Der Typ des Arguments und des Tupelelements stimmen nicht überein. Erwartet wurde "{1}", aber der Typ "{2}" wurde empfangen.
es: Incoherencia de tipos al compilar '{0}': el tipo del argumento y del elemento de tupla no coinciden. Se esperaba '{1}', pero se recibió el tipo '{2}'.
fr: Incompatibilité de type lors de la création de '{0}' : incompatibilité de type de l'argument et de l'élément tuple. '{1}' attendu, mais type '{2}' reçu.
it: Tipo non corrispondente durante la compilazione di '{0}': tipo di argomento ed elemento di tupla non corrispondenti. Previsto '{1}', tipo ricevuto '{2}'.
ja: {0}' を構築するときの型の不一致: 引数とタプル要素の型が一致しませんでした。'{1}' が必要でしたが、型 '{2}' を受け取りました。
ko: {0}'을(를) 작성하는 동안 형식 불일치 문제가 발생했습니다. 인수와 튜플 요소의 형식이 일치하지 않습니다. '{1}'이(가) 필요한데 '{2}' 형식을 수신했습니다.
pl: Niezgodność typów podczas kompilowania elementu „{0}”: niezgodne typy argumentu i elementu krotki. Oczekiwano typu „{1}”, natomiast stwierdzono typ „{2}”.
pt_br: Tipos incompatíveis ao compilar '{0}': tipo de argumento e elemento de tupla incompatíveis. '{1}' esperado, mas o tipo recebido foi '{2}'.
ru: Несоответствие типа при сборке "{0}": несоответствие типа аргумента и элемента кортежа. Требуется "{1}", но получен тип "{2}".
tr: {0}' oluşturulurken tür uyuşmazlığı oluştu: bağımsız değişken ile demet öğesinin türü eşleşmiyor. '{1}' bekleniyordu, ancak '{2}' türü alındı.
zh_hans: 在生成“{0}”时类型不匹配: 参数和元组元素的类型不匹配。应为“{1}”，但收到的类型为“{2}”。
zh_hant: 建置 '{0}' 時發生型別不符的情況: 引數和元組項目的型別不相符。必須是 '{1}'，但卻收到型別 '{2}'。

# QtmmVarTypeNotMatchRHS
source: Type mismatch when building '{0}': the variable type doesn't match the type of the right-hand-side of a let binding. Expected '{1}', but received type '{2}'.
cs: Neshoda typů při sestavování {0}: typ proměnné se neshoduje s typem výrazu na pravé straně vazby let. Očekávaný typ byl {1}, ale přijatý typ byl {2}.
de: Typenkonflikt beim Erstellen von "{0}": Der Variablentyp stimmt nicht mit dem Typ der rechten Seite einer Let-Bindung überein. Erwartet wurde "{1}", aber der Typ "{2}" wurde empfangen.
es: Incoherencia de tipos al compilar '{0}': el tipo de variable no coincide con el tipo del lado derecho de un enlace let. Se esperaba '{1}', pero se recibió el tipo '{2}'.
fr: Incompatibilité de type lors de la création de '{0}' : le type de variable ne correspond pas au type du côté droit d'une liaison let. '{1}' attendu, mais type '{2}' reçu.
it: Tipo non corrispondente durante la compilazione di '{0}': il tipo di variabile non corrisponde al tipo della parte destra di un binding let. È previsto '{1}', ma il tipo ricevuto è '{2}'.
ja: {0}' を構築するときの型の不一致: 変数型が let 束縛の右側の型と一致しません。'{1}' が必要でしたが、型 '{2}' を受け取りました。
ko: {0}'을(를) 작성하는 동안 형식 불일치 문제가 발생했습니다. 변수 형식이 let 바인딩의 오른쪽 형식과 일치하지 않습니다. '{1}'이(가) 필요한데 '{2}' 형식을 수신했습니다.
pl: Niezgodność typów podczas kompilowania elementu „{0}”: typ zmiennej nie pasuje do typu prawej części powiązania zezwolenia. Oczekiwano typu „{1}”, natomiast stwierdzono typ „{2}”.
pt_br: Tipos incompatíveis ao compilar '{0}': tipo de variável incompatível com tipo do lado direito de uma associação let. '{1}' esperado, mas o tipo recebido foi '{2}'.
ru: Несоответствие типа при сборке "{0}": Тип переменной не соответствует типу правой части let-привязки. Требуется "{1}", но получен тип "{2}".
tr: {0}' oluşturulurken tür uyuşmazlığı oluştu: değişken türü bir let bağlamasının sağ tarafının türüyle eşleşmiyor. '{1}' bekleniyordu, ancak '{2}' türü alındı.
zh_hans: 在生成“{0}”时类型不匹配: 变量类型与 let 绑定右侧的类型不匹配。应为“{1}”，但收到的类型为“{2}”。
zh_hant: 建置 '{0}' 時發生類型不符的情況: 變數類型與 let 繫結右手邊的類型不相符。必須是 '{1}'，但卻收到類型 '{2}'。

# QunexpectedHole
source: Unexpected quotation hole in expression.
cs: Výraz obsahuje neočekávanou konstrukci quotation hole.
de: Unerwartes Quotation Hole in Ausdruck.
es: Espacio de citación inesperado en una expresión.
fr: Espace de quotation inattendu dans l'expression.
it: Hole nella quotation imprevisto nell'espressione.
ja: 式に予期しない引用のホールがあります。
ko: 식에 예기치 않은 인용 오류가 있습니다.
pl: Nieoczekiwana przerwa w cytacie w wyrażeniu.
pt_br: Lacuna de cotação inesperada na expressão.
ru: Непредвиденный шаблон цитирования в выражении.
tr: İfadede beklenmeyen tırnak boşluğu var.
zh_hans: 表达式中存在意外的引用漏洞。
zh_hant: 運算式中有未預期的引號漏洞。

# QunrecognizedMethodCall
source: The parameter is not a recognized method name.
cs: Parametr není rozpoznaný název metody.
de: Der Parameter ist kein bekannter Methodenname.
es: El parámetro no es un nombre de método reconocido.
fr: Le paramètre n'est pas un nom de méthode reconnu.
it: Il parametro non è un nome di metodo riconosciuto.
ja: パラメーターは認識されているメソッド名ではありません。
ko: 매개 변수는 인식할 수 없는 메서드 이름입니다.
pl: Parametr nie jest rozpoznawaną nazwą metody.
pt_br: O parâmetro não é um nome de método reconhecido.
ru: Параметр не является распознанным именем метода.
tr: Parametre tanınan bir metot adı değil.
zh_hans: 该参数不是可识别的方法名称。
zh_hant: 這個參數不是可辨識的方法名稱。

# resetNotSupported
source: Reset is not supported on this enumerator.
cs: Tento enumerátor nepodporuje operaci resetování.
de: Das Zurücksetzen wird für diesen Enumerator nicht unterstützt.
es: No se admite restablecer en este enumerador.
fr: La réinitialisation n'est pas prise en charge sur cet énumérateur.
it: Reimpostazione non supportata in questo enumeratore.
ja: この列挙型ではリセットがサポートされていません。
ko: 다시 설정은 이 열거자에서 지원되지 않습니다.
pl: Ten moduł wyliczający nie obsługuje resetowania.
pt_br: Não há suporte para Reset neste enumerador.
ru: Сброс не поддерживается в этом перечислителе.
tr: Bu numaralayıcı üzerinde sıfırlama işlemi desteklenmiyor.
zh_hans: 此枚举器不支持重置。
zh_hant: 此列舉程式不支援重設動作。

# startCannotBeNaN
source: The start of a range cannot be NaN.
cs: Počáteční hodnota rozsahu nemůže být NaN.
de: Der Start des Bereichs darf nicht NaN sein.
es: El inicio de un intervalo no puede ser NaN.
fr: Le début d'une plage ne peut pas être NaN.
it: L'inizio di un intervallo deve essere un numero.
ja: 範囲の開始を NaN にすることはできません。
ko: 범위의 시작은 NaN일 수 없습니다.
pl: Początkową wartością zakresu nie może być NaN.
pt_br: O início de um intervalo não pode ser NaN.
ru: Началом диапазона не может быть NaN.
tr: Aralığın başlangıcı NaN olamaz.
zh_hans: 范围的开头不能为 NaN。
zh_hant: 範圍開頭不能是 NaN。

# stepCannotBeNaN
source: The step of a range cannot be NaN.
cs: Krok rozsahu nemůže být NaN.
de: Der Schritt eines Bereichs darf nicht NaN sein.
es: El paso de un intervalo no puede ser NaN.
fr: Une étape d'une plage ne peut pas être NaN.
it: Il passaggio di un intervallo deve essere un numero.
ja: 範囲のステップを NaN にすることはできません。
ko: 범위의 단계는 NaN일 수 없습니다.
pl: Wartością kroku w zakresie nie może być NaN.
pt_br: A etapa de um intervalo não pode ser NaN.
ru: Шагом диапазона не может быть NaN.
tr: Aralığın adımı NaN olamaz.
zh_hans: 范围的跨距不能为 NaN。
zh_hant: 範圍步驟不能是 NaN。

# stepCannotBeZero
source: The step of a range cannot be zero.
cs: Krok rozsahu nemůže být nula.
de: Der Schritt eines Bereichs darf nicht null sein.
es: El paso de un intervalo no puede ser cero.
fr: Une étape d'une plage ne peut pas être zéro.
it: Il passaggio di un intervallo non può essere zero.
ja: 範囲のステップをゼロにすることはできません。
ko: 범위의 단계는 0일 수 없습니다.
pl: Wartością kroku w zakresie nie może być zero.
pt_br: A etapa de um intervalo não pode ser zero.
ru: Шагом диапазона не может быть ноль.
tr: Aralığın adımı sıfır olamaz.
zh_hans: 范围的跨距不能为零。
zh_hant: 範圍步驟不能為零。

# syncContextNull
source: The System.Threading.SynchronizationContext.Current of the calling thread is null.
cs: Vlastnost System.Threading.SynchronizationContext.Current volajícího vlákna má hodnotu null.
de: System.Threading.SynchronizationContext.Current des aufrufenden Threads ist NULL.
es: El elemento System.Threading.SynchronizationContext.Current del subproceso que llama es nulo.
fr: System.Threading.SynchronizationContext.Current du thread appelant est null.
it: System.Threading.SynchronizationContext.Current del thread chiamante Null.
ja: 呼び出しスレッドの System.Threading.SynchronizationContext.Current が null です。
ko: 호출 스레드의 System.Threading.SynchronizationContext.Current가 null입니다.
pl: Właściwość System.Threading.SynchronizationContext.Current w wątku wywołującym ma wartość zerową.
pt_br: O System.Threading.SynchronizationContext.Current do thread de chamada é nulo.
ru: System.Threading.SynchronizationContext.Current вызывающего потока имеет неопределенное (null) значение.
tr: Çağıran iş parçacığının System.Threading.SynchronizationContext.Current'ı null.
zh_hans: 调用线程的 System.Threading.SynchronizationContext.Current 为 null。
zh_hant: 呼叫執行緒的 System.Threading.SynchronizationContext.Current 為 null。

# tupleIndexOutOfRange
source: The tuple index '{1}' was out of range for tuple type '{0}'.
cs: Index {1} řazené kolekce členů byl mimo rozsah řazené kolekce členů typu {0}.
de: Der Tupelindex "{1}" war für Tupeltyp "{0}" außerhalb des gültigen Bereichs.
es: El índice de tupla '{1}' estaba fuera de intervalo para el tipo de tupla '{0}'.
fr: L'index tuple '{1}' est hors limites pour le type tuple '{0}'.
it: L'indice della tupla '{1}' non è compreso nell'intervallo per il tipo di tupla '{0}'.
ja: タプル インデックス '{1}' はタプル型 '{0}' の範囲外でした。
ko: 튜플 인덱스 '{1}'이(가) 튜플 형식 '{0}'에 대한 범위를 벗어났습니다.
pl: Indeks „{1}” jest poza zakresem typu krotki „{0}”.
pt_br: O índice de tupla '{1}' estava fora do intervalo do tipo de tupla '{0}'.
ru: Индекс кортежа "{1}" находился вне диапазона для кортежного типа "{0}".
tr: {0}' demet türü için '{1}' demet dizini aralık dışındaydı.
zh_hans: 元组索引“{1}”超出元组类型“{0}”的范围。
zh_hant: 元組索引 '{1}' 超出元組型別 '{0}' 的範圍。

# QfailedToBindConstructor
source: Failed to bind constructor
cs: Nezdařilo se vytvořit vazbu konstruktoru.
de: Fehler beim Binden des Konstruktors.
es: No se pudo enlazar el constructor.
fr: Liaison au constructeur impossible
it: Non è stato possibile eseguire il binding del costruttore
ja: コンストラクターをバインドできませんでした
ko: 생성자를 바인딩하지 못했습니다.
pl: Nie można powiązać konstruktora.
pt_br: Falha ao associar construtor
ru: Не удалось задать привязку конструктора
tr: Oluşturucu bağlanamadı
zh_hans: 未能绑定构造函数
zh_hant: 無法繫結建構函式

# QfailedToBindField
source: Failed to bind field '{0}'
cs: Nezdařilo se vytvořit vazbu pole {0}.
de: Fehler beim Binden des Felds "{0}".
es: No se pudo enlazar el campo '{0}'.
fr: Liaison au champ '{0}' impossible
it: Non è stato possibile eseguire il binding del campo '{0}'
ja: フィールド '{0}' をバインドできませんでした
ko: '{0}' 필드를 바인딩하지 못했습니다.
pl: Nie można powiązać pola „{0}”.
pt_br: Falha ao associar o campo '{0}'
ru: Не удалось задать привязку поля "{0}"
tr: '{0}' alanı bağlanamadı
zh_hans: 未能绑定字段“{0}”
zh_hant: 無法繫結欄位 '{0}'

# QfailedToBindProperty
source: Failed to bind property '{0}'
cs: Nezdařilo se vytvořit vazbu vlastnosti {0}.
de: Fehler beim Binden der Eigenschaft "{0}".
es: No se pudo enlazar la propiedad '{0}'.
fr: Liaison à la propriété '{0}' impossible
it: Non è stato possibile eseguire il binding della proprietà '{0}'
ja: プロパティ '{0}' をバインドできませんでした
ko: '{0}' 속성을 바인딩하지 못했습니다.
pl: Nie można powiązać właściwości „{0}”.
pt_br: Falha ao associar a propriedade '{0}'
ru: Не удалось задать привязку свойства "{0}"
tr: '{0}' özelliği bağlanamadı
zh_hans: 未能绑定属性“{0}”
zh_hant: 無法繫結屬性 '{0}'

# QfailedToBindTypeInAssembly
source: Failed to bind type '{0}' in assembly '{1}'
cs: Nezdařilo se vytvořit vazbu typu {0} v sestavení {1}.
de: Fehler beim Binden des Typs "{0}" in Assembly "{1}".
es: No se pudo enlazar el tipo '{0}' en el ensamblado '{1}'.
fr: Impossible de lier le type '{0}' dans l'assembly '{1}'
it: Non è stato possibile eseguire il binding del tipo '{0}' nell'assembly '{1}'
ja: アセンブリ '{1}' の型 '{0}' をバインドできませんでした
ko: {1}' 어셈블리의 '{0}' 형식을 바인딩하지 못했습니다.
pl: Nie można powiązać typu „{0}” w zestawie „{1}”.
pt_br: Falha ao associar o tipo '{0}' ao assembly '{1}'
ru: Не удалось задать привязку типа "{0}" в сборке "{1}"
tr: {1}' bütünleştirilmiş kodundaki '{0}' türü bağlanamadı
zh_hans: 未能绑定程序集“{1}”中的类型“{0}”
zh_hant: 無法繫結組件 '{1}' 中的類型 '{0}'

# QincompatibleRecordLength
source: Incompatible record length
cs: Nekompatibilní délka záznamu
de: Die Datensatzlänge ist nicht kompatibel.
es: Longitud de registro incompatible.
fr: Longueur d'enregistrement incompatible
it: Lunghezza record non compatibile
ja: 互換性のないレコード長
ko: 호환되지 않는 레코드 길이입니다.
pl: Niezgodna długość rekordu.
pt_br: Tamanho de registro incompatível
ru: Несовместимая длина записи
tr: Uyumsuz kayıt uzunluğu
zh_hans: 记录长度不兼容
zh_hant: 不完整的記錄長度

# QincorrectInstanceType
source: Incorrect instance type
cs: Nesprávný typ instance
de: Der Instanztyp ist falsch.
es: Tipo de instancia incorrecto.
fr: Type d'instance incorrect
it: Tipi di istanza non corretto
ja: インスタンス型が正しくありません
ko: 인스턴스 형식이 잘못되었습니다.
pl: Błędny typ wystąpienia.
pt_br: Tipo de instância incorreto
ru: Неправильный тип экземпляра
tr: Yanlış örnek türü
zh_hans: 实例类型不正确
zh_hant: 不正確的執行個體類型

# QincorrectNumArgs
source: Incorrect number of arguments
cs: Nesprávný počet argumentů
de: Die Anzahl der Argumente ist falsch.
es: Número de argumentos incorrecto.
fr: Nombre d'arguments incorrect
it: Numero di argomenti non corretto
ja: 引数の数が正しくありません
ko: 인수 개수가 잘못되었습니다.
pl: Błędna liczba argumentów.
pt_br: Número de argumentos incorreto
ru: Неправильное число аргументов
tr: Yanlış sayıda bağımsız değişken
zh_hans: 参数数目不正确
zh_hant: 不正確的引數數目

# QincorrectType
source: Incorrect type
cs: Nesprávný typ
de: Falscher Typ
es: Tipo incorrecto.
fr: Type incorrect
it: Tipo non corretto
ja: 型が正しくありません
ko: 형식이 잘못되었습니다.
pl: Błędny typ.
pt_br: Tipo incorreto
ru: Неправильный тип
tr: Yanlış tür
zh_hans: 类型不正确
zh_hant: 不正確的類型

# QinvalidFuncType
source: Invalid function type
cs: Neplatný typ funkce
de: Ungültiger Funktionstyp.
es: Tipo de función no válido.
fr: Type de fonction non valide
it: Tipo di funzione non valido
ja: 無効な関数型
ko: 함수 형식이 잘못되었습니다.
pl: Nieprawidłowy typ funkcji.
pt_br: Tipo de função inválido
ru: Недопустимый тип функции
tr: Geçersiz işlev türü
zh_hans: 函数类型无效
zh_hant: 無效的函式類型
