Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# csTypeDoesNotSupportEquality2
source: The type '{0}' does not support the 'equality' constraint because it is a function type
cs: Typ {0} nepodporuje omezení equality, protože je to typ funkce.
de: Der Typ "{0}" unterstützt die equality-Einschränkung nicht, weil es sich um einen Funktionstyp handelt.
es: El tipo '{0}' no admite la restricción 'equality' porque es un tipo de función.
fr: Le type '{0}' ne prend pas en charge la contrainte 'equality', car il s'agit d'un type de fonction
it: Il tipo '{0}' non supporta il vincolo 'equality' perché si tratta di un tipo di funzione
ja: 型 '{0}' は関数型なので、'equality' 制約をサポートしません
ko: '{0}' 형식은 함수 형식이므로 'equality' 제약 조건을 지원하지 않습니다.
pl: Typ „{0}” nie obsługuje ograniczenia „equality”, ponieważ ma on typ funkcji
pt_br: O tipo '{0}' não suporta a restrição 'equality' porque ele é um tipo de função
ru: Тип "{0}" не поддерживает ограничение "equality", поскольку он является типом функции
tr: '{0}' türünün bir işlev türü olduğu için 'equality' kısıtlamasını desteklemez
zh_hans: 类型“{0}”不支持“equality”约束，因为它是函数类型
zh_hant: 類型 '{0}' 不支援 'equality' 條件約束，因為它是函式類型

# csTypeDoesNotSupportEquality3
source: The type '{0}' does not support the 'equality' constraint because it is a record, union or struct with one or more structural element types which do not support the 'equality' constraint. Either avoid the use of equality with this type, or add the 'StructuralEquality' attribute to the type to determine which field type does not support equality
cs: Typ {0} nepodporuje omezení equality, protože je to záznam, sjednocení nebo struktura aspoň s jedním strukturálním typem prvků, který nepodporuje omezení equality. Buď se u tohoto typu vyhněte použití equality, nebo k němu přidejte atribut StructuralEquality a s jeho pomocí určete, který typ pole nepodporuje equality.
de: Der Typ "{0}" unterstützt die equality-Einschränkung nicht, weil es sich um einen Datensatz, eine Union oder Struktur mit mindestens einem Strukturelementtyp handelt, der die equality-Einschränkung nicht unterstützt. Verwenden Sie entweder keine Gleichheit in Verbindung mit diesem Typ, oder fügen Sie dem Typ das StructuralEquality-Attribut hinzu, um festzustellen, von welchem Feldtyp die Gleichheit nicht unterstützt wird.
es: El tipo '{0}' no admite la restricción 'equality' porque es un registro, una unión o un struct con uno o varios tipos de elemento estructural que no admiten la restricción 'equality'. Evite el uso de igualdad con este tipo o agregue el atributo 'StructuralEquality' al tipo para determinar el tipo de campo que no admite igualdad.
fr: Le type '{0}' ne prend pas en charge la contrainte 'equality', car il s'agit d'un enregistrement, d'une union ou d'une structure avec un ou plusieurs types d'éléments structurels qui ne prennent pas en charge la contrainte 'equality'. Vous devez soit éviter d'utiliser l'égalité avec ce type, soit ajouter l'attribut 'StructuralEquality' au type pour identifier le type de champ qui ne prend pas en charge l'égalité
it: Il tipo '{0}' non supporta il vincolo 'equality' perché è un record, un'unione o uno struct con uno o più tipi di elementi strutturali che non supportano il vincolo 'equality'. Evitare l'uso dell'uguaglianza con questo tipo oppure aggiungere l'attributo 'StructuralEquality' al tipo per determinare quale tipo di campo non supporta l'uguaglianza
ja: 型 '{0}' は、'equality' 制約をサポートしない 1 個または複数の構造体の要素型を持つレコード、共用体、または構造体なので、'equality' 制約をサポートしません。この型を持つ equality を使用しないでください。または、equality をサポートしないフィールド型を決定するために、'StructuralEquality' 属性を型に追加してください。
ko: '{0}' 형식은 'equality' 제약 조건을 지원하지 않는 하나 이상의 구조적 요소 형식을 포함하는 레코드, 공용 구조체 또는 구조체이므로 'equality' 제약 조건을 지원하지 않습니다. 이 형식의 경우 같음 조건을 사용하지 말거나 형식에 'StructuralEquality' 특성을 추가하여 같음 조건을 지원하지 않는 필드 형식을 확인하세요.
pl: Typ „{0}” nie obsługuje ograniczenia „equality”, ponieważ jest rekordem, unią lub strukturą z co najmniej jednym typem elementu strukturalnego, który nie obsługuje ograniczenia „equality”. Unikaj używania równości z tym typem lub dodaj atrybut „StructuralEquality” do typu w celu ustalenia, jaki typ pola nie obsługuje równości
pt_br: O tipo '{0}' não suporta a restrição 'equality' porque é um registro, união ou struct com um ou mais tipos de elementos estruturais que não suportam a restrição 'equality'. Evite usar igualdade com este tipo, a não ser que você adicione o atributo 'StructuralEquality' ao tipo para determinar qual tipo de campo não suportará a igualdade
ru: Тип "{0}" не поддерживает ограничение "equality", поскольку он является записью, объединением или структурой с одним или несколькими типами структурных элементов, которые не поддерживают ограничение "equality". Исключите ограничение "equality" из типа или добавьте в него атрибут "StructuralEquality", определяющий типы полей, которые не поддерживают ограничение "equality"
tr: '{0}' türü, 'equality' kısıtlamasını desteklemeyen bir veya daha fazla yapısal öğe türünün olduğu bir record, union veya struct olduğu için 'equality' kısıtlamasını desteklemez. Bu türde eşitlik kullanmayın veya hangi alan türünün eşitliği desteklemediğini belirlemek için 'StructuralEquality' özniteliğini türe ekleyin
zh_hans: 类型“{0}”不支持“equality”约束，因为它是一个记录、联合或结构，其中的一个或多个结构化元素类型不支持“equality”约束。请避免对此类型使用相等运算，或将“StructuralEquality”特性添加到此类型以确定哪些字段类型不支持相等运算
zh_hant: 類型 '{0}' 不支援 'equality' 條件約束，因為它是記錄、等位或結構，且具有一個或多個不支援 'equality' 條件約束的結構化項目類型。請避免使用這種類型的相等，或將 'StructuralEquality' 屬性加入類型，以判斷哪個欄位類型不支援相等

# csTypeIsNotEnumType
source: The type '{0}' is not a CLI enum type
cs: Typ {0} není typu výčtu CLI.
de: Der Typ "{0}" ist kein CLI-Enumerationstyp.
es: “{0}” no es un tipo de enumeración CLI.
fr: Le type '{0}' n'est pas un type enum CLI
it: Il tipo '{0}' non è un tipo enumerazione CLI
ja: 型 '{0}' は CLI の列挙型ではありません
ko: '{0}' 형식은 CLI 열거형 형식이 아닙니다.
pl: Typ „{0}” nie jest typem wyliczeniowym infrastruktury CLI
pt_br: O tipo '{0}' não é um tipo enum CLI
ru: Тип "{0}" не является перечисляемым типом CLI
tr: '{0}' türü bir CLI enum türü değil
zh_hans: 类型“{0}”不是 CLI 枚举类型
zh_hant: 類型 '{0}' 不是 CLI 列舉類型

# csTypeHasNonStandardDelegateType
source: The type '{0}' has a non-standard delegate type
cs: Typ {0} má nestandardní typ delegáta.
de: Der Typ "{0}" hat einen nicht standardmäßigen Delegattyp.
es: El tipo '{0}' tiene un tipo de delegado no estándar.
fr: Le type '{0}' a un type délégué non standard
it: Il tipo '{0}' dispone di un tipo delegato non standard
ja: 型 '{0}' には標準ではないデリゲート型があります
ko: '{0}' 형식은 비표준 대리자 형식을 가집니다.
pl: Typ „{0}” ma niestandardowy typ delegata.
pt_br: O tipo '{0}' tem um tipo delegado não padrão
ru: Тип "{0}" имеет нестандартный тип делегата
tr: '{0}' türünün standart olmayan temsilci türü var
zh_hans: 类型“{0}”具有非标准委托类型
zh_hant: 類型 '{0}' 有非標準的委派類型

# csTypeIsNotDelegateType
source: The type '{0}' is not a CLI delegate type
cs: Typ {0} není delegátem CLI.
de: Der Typ "{0}" ist kein CLI-Delegattyp.
es: El tipo '{0}' no es un tipo de delegado CLI.
fr: Le type '{0}' n'est pas un type délégué CLI
it: Il tipo '{0}' non è un tipo delegato CLI
ja: 型 '{0}' は CLI のデリゲート型ではありません
ko: '{0}' 형식은 CLI 대리자 형식이 아닙니다.
pl: Typ „{0}” nie jest typem delegata infrastruktury CLI.
pt_br: O tipo '{0}' não é um tipo delegado CLI
ru: Тип "{0}" не является делегатным типом CLI
tr: '{0}' türü bir CLI temsilci türü değil
zh_hans: 类型“{0}”不是 CLI 委托类型
zh_hant: 類型 '{0}' 不是 CLI 委派類型

# csTypeParameterCannotBeNullable
source: This type parameter cannot be instantiated to 'Nullable'. This is a restriction imposed in order to ensure the meaning of 'null' in some CLI languages is not confusing when used in conjunction with 'Nullable' values.
cs: U tohoto parametru typu se nedá vytvořit instance Nullable. Toto omezení má zabránit situaci, ve které by byl význam null v některých jazycích CLI zavádějící v případě, že se použije ve spojení s hodnotami Nullable.
de: Dieser Typparameter kann nicht auf "Nullable" instanziiert werden. Diese Einschränkung soll sicherstellen, dass die Bedeutung von NULL in manchen CLI-Sprachen in Verbindung mit Nullable-Werten nicht verwirrend ist.
es: No se puede crear una instancia de este parámetro de tipo como 'Nullable'. El motivo de esta restricción es garantizar que el significado de 'null' en algunos lenguajes CLI no sea confuso cuando se use junto con valores 'Nullable'.
fr: Impossible d'instancier ce paramètre de type en 'Nullable'. Il s'agit d'une restriction imposée pour garantir que la signification de 'null' dans certains langages CLI n'entraîne pas de confusion lors de l'utilisation conjointe de valeurs 'Nullable'.
it: Non è possibile creare un'istanza di questo parametro di tipo come 'Nullable'. Si tratta di una limitazione imposta per assicurare che il significato di 'null' in alcuni linguaggi CLI non venga confuso se usato in combinazione con valori 'Nullable'.
ja: の型パラメーターは 'Nullable' にインスタンス化できません。別の CLI 言語などでも 'Nullable' の値との関係で、'null' の意味があいまいにならないように、この制限があります。
ko: 이 형식 매개 변수는 'Nullable'로 인스턴스화할 수 없습니다. 이는 'Nullable' 값과 함께 사용할 때 일부 CLI 언어에서 'null'의 의미가 혼동되지 않도록 하기 위한 제한입니다.
pl: Dla tego parametru typu nie można utworzyć wystąpienia jako „Nullable”. Jest to ograniczenie nałożone w celu zapewnienia, że znaczenie wartości „null” w niektórych językach infrastruktury CLI nie zostanie niewłaściwie określone podczas używania w połączeniu z wartościami „Nullable”.
pt_br: Esse parâmetro de tipo não pode ser instanciado como 'Nullable'. Esta é uma restrição imposta para assegurar que o significado de 'null' em algumas linguagens CLI não seja confuso quando usado em conjunto com valores 'Nullable'.
ru: Не удается создать экземпляр "Nullable" для этого параметра типа. Это ограничение позволяет отличить значение "null" в некоторых языках CLI от используемых совместно с ним значений "Nullable".
tr: Bu tür parametresi 'Nullable' olarak örneklenemez. Bu, bazı CLI dillerinde 'null' ifadesinin anlamının 'Nullable' değerlerle birlikte kullanıldığında karışıklık yaratmamasını sağlamak amacıyla getirilmiş bir kısıtlamadır.
zh_hans: 无法将此类型参数实例化为“Nullable”。此限制是强制实施的，旨在确保在某些 CLI 语言中将“null”与“Nullable”值一起使用时，不会混淆二者的含义。
zh_hant: 這個型別參數無法具現化成 'Nullable'。施加這個限制的原因是為了確保在某些 CLI 中，將 'null' 搭配 'Nullable' 值一起使用時意義不會混淆。

# csGenericConstructRequiresStructType
source: A generic construct requires that the type '{0}' is a CLI or F# struct type
cs: Obecný konstruktor vyžaduje, aby byl typ {0} typem struktura CLI nebo F#.
de: Für ein generisches Konstrukt muss der Typ "{0}" ein CLI- oder F#-Strukturtyp sein.
es: Una construcción genérica requiere que el tipo '{0}' sea un tipo struct de CLI o F#.
fr: Une construction générique requiert que le type '{0}' soit un type struct CLI ou F#
it: Per i costrutti generici è necessario che il tipo '{0}' sia un tipo di struct CLI o F#
ja: ジェネリック コンストラクトの型 '{0}' は、CLI または F# の構造体型にする必要があります
ko: 제네릭 구문을 사용하려면 '{0}' 형식이 CLI 또는 F# 구조체 형식이어야 합니다.
pl: Ogólna konstrukcja wymaga, aby typ „{0}” był typem struktury infrastruktury CLI lub języka F#
pt_br: Uma construção genérica requer que o tipo '{0}' seja um CLI ou tipo struct F#
ru: В универсальной конструкции требуется использовать тип "{0}", являющийся типом структуры CLI или F#
tr: Genel bir yapı, '{0}' türünün bir CLI veya F# struct türü olmasını gerektirir
zh_hans: 泛型构造要求类型“{0}”是 CLI 或 F# 结构类型
zh_hant: 泛型建構要求類型 '{0}' 必須是 CLI 或 F# 結構類型

# csGenericConstructRequiresUnmanagedType
source: A generic construct requires that the type '{0}' is an unmanaged type
cs: Obecný konstruktor vyžaduje, aby byl typ {0} nespravovaným typem.
de: Für ein generisches Konstrukt muss es sich beim Typ "{0}" um einen nicht verwalteten Typ handeln.
es: Una construcción genérica requiere que '{0}' sea un tipo no administrado.
fr: Une construction générique requiert que le type '{0}' soit de type non managé
it: Un costruttore generico richiede che il tipo '{0}' sia un tipo non gestito
ja: ジェネリック コンストラクターの型 '{0}' はアンマネージ型にする必要があります
ko: 제네릭 구문을 사용하려면 '{0}' 형식이 관리되지 않은 형식이어야 합니다.
pl: Ogólna konstrukcja wymaga, aby typ „{0}” był typem niezarządzanym
pt_br: Uma construção genérica requer que o tipo '{0}' seja um tipo não gerenciado
ru: В универсальной конструкции тип "{0}" должен быть неуправляемым
tr: Genel bir yapı, '{0}' türünün yönetilmeyen bir tür olmasını gerektirir
zh_hans: 泛型构造要求类型“{0}”是非托管类型
zh_hant: 泛型建構要求類型 '{0}' 必須是非受控類型

# csTypeNotCompatibleBecauseOfPrintf
source: The type '{0}' is not compatible with any of the types {1}, arising from the use of a printf-style format string
cs: Typ {0} není v důsledku použití formátovacího řetězce ve stylu printf kompatibilní s žádným z typů {1}.
de: Der Typ "{0}" ist mit keinem der Typen "{1}" kompatibel; dies ist die Folge der Verwendung einer printf-Formatzeichenfolge.
es: El tipo '{0}' no es compatible con ninguno de los tipos {1}, producidos por el uso de una cadena de formato de tipo printf.
fr: Le type '{0}' n'est pas compatible avec les types {1}, qui résultent de l'utilisation d'une chaîne de format de style printf
it: Il tipo '{0}' non è compatibile con alcuno dei tipi {1}, derivanti dall'utilizzo di una stringa di formato printf-style
ja: 型 '{0}' は、printf 形式の書式指定文字列の使用によって生じる型 {1} のいずれとも互換性がありません
ko: ’{0}' 형식은 printf 스타일의 서식 문자열을 사용함으로 인해 발생하는 어떤 {1} 형식과도 호환되지 않습니다.
pl: Typ „{0}” nie jest zgodny z żadnym z typów {1}, co wynika z użycia ciągu formatu w stylu funkcji printf
pt_br: O tipo '{0}' não é compatível com qualquer um dos tipos {1}, decorrentes da utilização de uma cadeia de caracteres do formato estilo printf
ru: Тип "{0}" несовместим с любыми типами {1}, возникающими при использовании строки формата printf-style
tr: {0}' türü, printf tarzı biçim dizesinin kullanımından kaynaklanan {1} türlerinden herhangi biriyle uyumlu değil
zh_hans: 类型“{0}”与类型 {1} 中的任何类型都不兼容，因为使用了 printf 样式的格式字符串
zh_hant: 類型 '{0}' 與任何類型 {1} 都不相容，原因是使用了 printf 樣式的格式字串

# csGenericConstructRequiresReferenceSemantics
source: A generic construct requires that the type '{0}' have reference semantics, but it does not, i.e. it is a struct
cs: Obecný konstruktor vyžaduje, aby měl typ {0} sémantiku odkazu. To ale nemá: je to struktura.
de: Für ein generisches Konstrukt muss der Typ "{0}" Verweissemantik aufweisen; dies ist aber nicht der Fall, es handelt sich also um eine Struktur.
es: Una construcción genérica requiere que el tipo '{0}' tenga semántica de referencia, pero no la tiene, es decir, es un struct.
fr: Une construction générique requiert que le type '{0}' ait une sémantique de référence, mais ce n'est pas le cas, car il s'agit par exemple d'un struct
it: Per i costrutti generici è necessario che il tipo '{0}' disponga di semantica di riferimento, la quale è in questo caso assente, ovvero si tratta di uno struct
ja: ジェネリック コンストラクトの型 '{0}' には参照のセマンティクスが必要ですが、存在しません (つまり構造体です)
ko: 제네릭 구문을 사용하려면 '{0}' 형식에 참조 의미 체계가 있어야 하지만 없습니다. 즉, 형식이 구조체입니다.
pl: Konstrukcja ogólna wymaga, aby typ „{0}” miał semantykę odwołania, ale tak nie jest, ponieważ jest on strukturą
pt_br: Uma construção genérica requer que o tipo '{0}' tenha semânticas de referência, mas ele não tem, ou seja, é um struct
ru: В универсальной конструкции требуется использовать тип "{0}", содержащий семантику ссылки, однако заданный тип эту семантику не содержит, т. е. является структурой
tr: Genel bir yapı, '{0}' türünde başvuru semantiği olmasını gerektirir ancak bu söz konusu değil, yani bu bir struct
zh_hans: 泛型构造要求类型“{0}”具有引用语义，而该类型没有引用语义，也就是说，该类型是一个结构
zh_hant: 泛型建構要求類型 '{0}' 必須有參考語意，但它卻沒有，也就是說它是結構

# csGenericConstructRequiresNonAbstract
source: A generic construct requires that the type '{0}' be non-abstract
cs: Obecný konstruktor vyžaduje, aby byl typ {0} neabstraktní.
de: Für ein generisches Konstrukt muss der Typ "{0}" nicht abstrakt sein.
es: Una construcción genérica requiere que el tipo '{0}' no sea abstracto.
fr: Une construction générique requiert que le type '{0}' soit non abstrait
it: Per i costrutti generici è necessario che il tipo '{0}' non sia astratto
ja: ジェネリック コンストラクトの型 '{0}' は、非抽象にする必要があります
ko: 제네릭 구문을 사용하려면 '{0}' 형식이 비추상 형식이어야 합니다.
pl: Ogólna konstrukcja wymaga, aby typ „{0}” nie był typem abstrakcyjnym
pt_br: Uma construção genérica requer que o tipo '{0}' não seja abstrato
ru: В универсальной конструкции требуется использовать неабстрактный тип "{0}"
tr: Genel bir yapı, '{0}' türünün soyut olmamasını gerektirir
zh_hans: 泛型构造要求类型“{0}”是非抽象的
zh_hant: 泛型建構要求類型 '{0}' 必須是非抽象的

# csGenericConstructRequiresPublicDefaultConstructor
source: A generic construct requires that the type '{0}' have a public default constructor
cs: Obecný konstruktor vyžaduje, aby měl typ {0} veřejný výchozí konstruktor.
de: Für ein generisches Konstrukt muss der Typ "{0}" einen öffentlichen Standardkonstruktor aufweisen.
es: Una construcción genérica requiere que el tipo '{0}' tenga un constructor predeterminado público.
fr: Une construction générique requiert que le type '{0}' ait un constructeur par défaut public
it: Per i costrutti generici è necessario che il tipo '{0}' disponga di un costruttore predefinito pubblico
ja: ジェネリック コンストラクトの型 '{0}' には、パブリック既定コンストラクターが必要です
ko: 제네릭 구문을 사용하려면 '{0}' 형식에 public 기본 생성자가 있어야 합니다.
pl: Ogólna konstrukcja wymaga, aby typ „{0}” miał publiczny konstruktor domyślny
pt_br: Uma construção genérica requer que o tipo '{0}' tenha um construtor padrão público
ru: В универсальной конструкции требуется использовать тип "{0}", содержащий открытый конструктор по умолчанию
tr: Genel bir yapı, '{0}' türünde ortak varsayılan oluşturucu olmasını gerektirir
zh_hans: 泛型构造要求类型“{0}”具有公共的默认构造函数
zh_hant: 泛型建構要求類型 '{0}' 必須有公用預設建構函式

# csTypeInstantiationLengthMismatch
source: Type instantiation length mismatch
cs: Neshoda v délce instance typu
de: Typinstanziierungslänge stimmt nicht überein.
es: Incoherencia de longitud de creación de instancia de tipo.
fr: Incompatibilité de longueur de l'instanciation de type
it: Lunghezza creazione dell'istanza del tipo non corrispondente
ja: 型のインスタンス化の長さが一致しません
ko: 형식 인스턴스 길이가 일치하지 않습니다.
pl: Niezgodność długości tworzenia wystąpienia typu
pt_br: Incompatibilidade de comprimento de instanciação de tipo
ru: Несоответствие длины создаваемого экземпляра типа
tr: Tür örnekleme uzunluğu uyuşmazlığı
zh_hans: 类型实例化长度不匹配
zh_hant: 類型具現化長度不符

# csOptionalArgumentNotPermittedHere
source: Optional arguments not permitted here
cs: Nepovinné argumenty tady nejsou povolené.
de: Optionale Argumente sind hier nicht zulässig.
es: Aquí no se permiten argumentos opcionales.
fr: Arguments facultatifs non autorisés ici
it: In questa posizione non sono consentiti argomenti facoltativi
ja: オプションの引数は使用できません
ko: 선택적 인수는 여기에 허용되지 않습니다.
pl: Argumenty opcjonalne nie są tutaj dozwolone
pt_br: Argumentos opcionais não são permitidos aqui
ru: Использование дополнительных аргументов не допускается
tr: İsteğe bağlı bağımsız değişkenler burada kullanılamaz
zh_hans: 此处不允许可选参数
zh_hant: 此處不允許選擇性引數

# csMemberIsNotStatic
source: {0} is not a static member
cs: {0} není statický člen.
de: {0} ist kein statischer Member.
es: {0} no es un miembro estático.
fr: {0} n'est pas un membre statique
it: {0} non è un membro statico
ja: {0} は静的メンバーではありません
ko: {0}은(는) 정적 멤버가 아닙니다.
pl: Element {0} nie jest statycznym elementem członkowskim
pt_br: {0} não é um membro estático
ru: {0} не является статическим элементом
tr: {0} bir statik üye değil
zh_hans: {0} 不是静态成员
zh_hant: {0} 不是靜態成員

# csMemberIsNotInstance
source: {0} is not an instance member
cs: {0} není člen instance.
de: {0} ist kein Instanzmember.
es: {0} no es un miembro de instancia.
fr: {0} n'est pas un membre d'instance
it: {0} non è un membro di istanza
ja: {0} はインスタンス メンバーではありません
ko: {0}은(는) 인스턴스 멤버가 아닙니다.
pl: Element {0} nie jest elementem członkowskim wystąpienia
pt_br: {0} não é um membro de instância
ru: {0} не является экземплярным элементом
tr: {0} bir örnek üyesi değil
zh_hans: {0} 不是实例成员
zh_hant: {0} 不是執行個體成員

# csArgumentLengthMismatch
source: Argument length mismatch
cs: Neshoda v délce argumentů
de: Argumentlänge stimmt nicht überein.
es: Incoherencia de longitud de argumentos.
fr: Incompatibilité de longueur des arguments
it: Lunghezza argomenti non corrispondente
ja: 引数の長さが一致しません
ko: 인수 길이가 일치하지 않습니다.
pl: Niezgodność długości argumentów
pt_br: Incompatibilidade de comprimento do argumento
ru: Несоответствие длин аргументов
tr: Bağımsız değişken uzunluğu mismatch uyuşmazlığı
zh_hans: 参数长度不匹配
zh_hant: 引數長度不符

# csArgumentTypesDoNotMatch
source: The argument types don't match
cs: Typy argumentů se neshodují.
de: Argumenttypen stimmen nicht überein.
es: Los tipos de argumento no coinciden.
fr: Les types des arguments ne correspondent pas
it: Tipi di argomento non corrispondenti
ja: 引数の型が一致しません
ko: 인수 형식이 일치하지 않습니다.
pl: Typy argumentu są niezgodne
pt_br: Os tipos de argumento não coincidem
ru: Типы аргументов не совпадают
tr: Bağımsız değişken türleri eşleşmiyor
zh_hans: 参数类型不匹配
zh_hant: 引數類型不符

# csMethodExpectsParams
source: This method expects a CLI 'params' parameter in this position. 'params' is a way of passing a variable number of arguments to a method in languages such as C#. Consider passing an array for this argument
cs: Tato metoda očekává na této pozici parametr CLI params. Použití parametru params umožňuje předat proměnlivý počet argumentů metodě v jazycích, jako je C#. Zvažte možnost předat tomuto argumentu pole.
de: Diese Methode erwartet an dieser Position den CLI-Parameter "params". Mit "params" kann in Programmiersprachen wie C# eine variable Zahl von Argumenten an eine Methode übergeben werden. Übergeben Sie ein Array für dieses Argument.
es: Este método espera un parámetro CLI 'params' en esta posición. 'params' es una forma de pasar un número variable de argumentos a un método en lenguajes como C#. Considere pasar una matriz para este argumento.
fr: Cette méthode attend un paramètre CLI 'params' à cet emplacement. 'params' permet de passer un nombre variable d'arguments à une méthode dans les langages tels que C#. Passez un tableau pour cet argument
it: Questo metodo prevede un parametro CLI 'params' in questa posizione. Il parametro 'params' rappresenta un modo per passare un numero di argomenti variabile a un metodo in linguaggi quali C#. Provare a passare una matrice per questo argomento
ja: このメソッドのこの位置には、CLI 'params' パラメーターが必要です。'params' は、可変個数の引数を C# などの言語のメソッドに渡すときに使用されます。この引数には配列を渡してください。
ko: 이 메서드에서는 이 위치에 CLI 'params' 매개 변수가 필요합니다. 'params'는 다양한 수의 인수를 C#과 같은 언어의 메서드에 전달하는 방법입니다. 이 인수에 대한 배열을 전달하세요.
pl: Ta metoda oczekuje parametru „params” infrastruktury CLI na tej pozycji. Parametr „params” umożliwia przekazywanie zmiennej liczby argumentów metodzie w językach takich jak C#. Rozważ przekazanie tablicy dla tego argumentu
pt_br: Este método espera um parâmetro CLI 'params' nesta posição. 'params' é uma forma de transmitir um número de variável de argumentos para um método em linguagens como C#. Considere transmitir uma matriz para este argumento
ru: В этой позиции метода требуется параметр CLI "params". В таких языках, как C#, параметр "params" используется для передачи переменного числа аргументов в метод. Рекомендуется передавать в качестве аргумента массив
tr: Bu metot bu konumda CLI 'params' parametresini bekler. 'params', C# gibi dillerde değişken sayıda bağımsız değişkeni bir metoda geçirme yoludur. Bu bağımsız değişken için bir dizi geçirmeyi düşünün
zh_hans: 此方法需要在此位置提供有 CLI“params”参数。“params”是一种用于在 C# 等语言中向某个方法传递数量可变的参数的方式。请考虑为此参数传递一个数组
zh_hant: 這個方法預期這個位置是一個 CLI 'params' 參數。'params' 是一種傳遞變數的方法，可將可變數目的引數傳遞給 C# 一類語這的方法。請考慮傳遞這個引數的陣列
