Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# typrelExplicitImplementationOfGetHashCode
source: The struct, record or union type '{0}' has an explicit implementation of 'Object.GetHashCode'. Consider implementing a matching override for 'Object.Equals(obj)'
cs: Typ struktura, záznam nebo sjednocení {0} explicitně implementuje Object.GetHashCode. Zvažte implementaci odpovídajícího přepsání pro Object.Equals(obj).
de: Der Struktur-, Datensatz- oder Union-Typ "{0}" umfasst eine explizite Implementierung von "Object.GetHashCode". Implementieren Sie eine entsprechende Überschreibung für "Object.Equals(obj)".
es: El tipo de struct, registro o unión '{0}' tiene una implementación explícita de 'Object.GetHashCode'. Considere implementar una invalidación coincidente para 'Object.Equals(obj)'.
fr: Le type struct, enregistrement ou union '{0}' a une implémentation explicite de 'Object.GetHashCode'. Implémentez une substitution correspondante pour 'Object.Equals(obj)'
it: Il tipo di unione, struct o record '{0}' ha un'implementazione esplicita di 'Object.GetHashCode'. Provare a implementare un override corrispondente per 'Object.Equals(obj)'
ja: 構造体型、レコード型、または共用体型 '{0}' には 'Object.GetHashCode' の明示的な実装があります。'Object.Equals(obj)' に対応するオーバーライドを実装してください。
ko: 구조체, 레코드 또는 공용 구조체 형식 '{0}'에 'Object.GetHashCode'의 명시적 구현이 있습니다. 'Object.Equals(obj)'에 대해 일치하는 재정의를 구현하세요.
pl: Typ struktury, rekordu lub unii „{0}” ma jawną implementację elementu „Object.GetHashCode”. Rozważ zaimplementowanie zgodnego przesłonięcia dla elementu „Object.Equals(obiekt)”
pt_br: O tipo struct, registro ou união '{0}' tem uma implementação explícita de 'Object.GetHashCode'. Considere implementar uma substituição correspondente para 'Object.Equals(obj)'
ru: Тип структуры, записи или объединения "{0}" содержит явную реализацию "Object.GetHashCode". Попробуйте реализовать соответствующее переопределение для "Object.Equals(obj)"
tr: '{0}' yapı, kayıt veya birleşim türünde açık 'Object.GetHashCode' uygulaması var. 'Object.Equals(obj)' için bununla eşleşen bir geçersiz kılma uygulamayı düşünün
zh_hans: 结构、记录或联合类型“{0}”具有 "Object.GetHashCode" 的显式实现。请考虑为 "Object.Equals(obj)" 实现匹配的重写
zh_hant: 結構、記錄或等位型別 '{0}' 有 'Object.GetHashCode' 的明確實作。請考慮為 'Object.Equals(obj)' 實作對應的覆寫

# typrelExplicitImplementationOfEquals
source: The struct, record or union type '{0}' has an explicit implementation of 'Object.Equals'. Consider implementing a matching override for 'Object.GetHashCode()'
cs: Typ struktura, záznam nebo sjednocení {0} explicitně implementuje Object.Equals. Zvažte možnost implementace odpovídajícího přepsání pro Object.GetHashCode().
de: Der Struktur-, Datensatz- oder Union-Typ "{0}" umfasst eine explizite Implementierung von "Object.Equals". Implementieren Sie eine entsprechende Überschreibung für "Object.GetHashCode()".
es: El tipo de struct, registro o unión '{0}' tiene una implementación explícita de 'Object.Equals'. Considere implementar una invalidación coincidente para 'Object.GetHashCode()'.
fr: Le type struct, enregistrement ou union '{0}' a une implémentation explicite de 'Object.Equals'. Implémentez une substitution correspondante pour 'Object.GetHashCode()'
it: Il tipo di unione, struct o record '{0}' ha un'implementazione esplicita di 'Object.Equals'. Provare a implementare un override corrispondente per 'Object.GetHashCode()'
ja: 構造体型、レコード型、または共用体型 '{0}' には 'Object.Equals' の明示的な実装があります。'Object.GetHashCode()' に対応するオーバーライドを実装してください。
ko: 구조체, 레코드 또는 공용 구조체 형식 '{0}'에 'Object.Equals'의 명시적 구현이 있습니다. 'Object.GetHashCode()'에 대해 일치하는 재정의를 구현하세요.
pl: Typ struktury, rekordu lub unii „{0}” ma jawną implementację elementu „Object.Equals”. Rozważ zaimplementowanie zgodnego przesłonięcia dla elementu „Object.GetHashCode()”
pt_br: O tipo struct, registro ou união '{0}' tem uma implementação explícita de 'Object.Equals'. Considere implementar uma substituição correspondente para 'Object.GetHashCode()'
ru: Тип структуры, записи или объединения "{0}" содержит явную реализацию "Object.Equals". Попробуйте реализовать соответствующее переопределение для "Object.GetHashCode()"
tr: '{0}' yapı, kayıt veya birleşim türünde açık 'Object.Equals' uygulaması var. 'Object.GetHashCode()' için bununla eşleşen bir geçersiz kılma uygulamayı düşünün
zh_hans: 结构、记录或联合类型“{0}”具有 "Object.Equals" 的显式实现。请考虑为 "Object.GetHashCode()" 实现匹配的重写
zh_hant: 結構、記錄或等位型別 '{0}' 有 'Object.Equals' 的明確實作。請考慮為 'Object.GetHashCode()' 實作對應的覆寫

# ExceptionDefsNotCompatibleHiddenBySignature
source: The exception definitions are not compatible because a CLI exception mapping is being hidden by a signature. The exception mapping must be visible to other modules. The module contains the exception definition\n {0} \nbut its signature specifies\n\t{1}
cs: Definice výjimek nejsou kompatibilní, protože signatura skrývá mapování výjimky CLI. Mapování výjimky musí být viditelné pro ostatní moduly. Modul obsahuje definici výjimky\n {0}, \nale jeho signatura definuje\n\t{1}.
de: Die Ausnahmedefinitionen sind nicht kompatibel, weil eine CLI-Ausnahmezuordnung von einer Signatur verdeckt wird. Die Ausnahmezuordnung muss für andere Module sichtbar sein. Das Modul enthält die Ausnahmedefinition\n {0} \nDie Signatur gibt aber Folgendes an:\n\t{1}.
es: Las definiciones de excepción no son compatibles porque una signatura oculta una asignación de excepción de CLI. La asignación de excepción debe estar visible para otros módulos. El módulo contiene la definición de excepción\n {0} \npero su signatura especifica\n\t{1}.
fr: Les définitions de l'exception ne sont pas compatibles, car le mappage d'une exception CLI est masqué par une signature. Le mappage de l'exception doit être visible par les autres modules. Le module contient la définition de l'exception\n {0} \nmais sa signature spécifie\n\t{1}
it: Le definizioni di eccezione non sono compatibili perché un mapping delle eccezioni CLI è nascosto da una firma. Il mapping delle eccezioni deve essere visibile ad altri moduli. Il modulo contiene la definizione di eccezione\n {0} \ntuttavia la relativa firma specifica\n\t{1}
ja: CLI の例外のマッピングがシグネチャによって隠ぺいされているため、例外の定義に互換性がありません。例外のマッピングは他のモジュールから参照できるようにする必要があります。モジュールには例外の定義\n {0} \nが含まれますが、シグネチャでは\n\t{1}\nを指定しています。
ko: 시그니처에 의해 CLI 예외 매핑이 숨겨져 있으므로 예외 정의가 호환되지 않습니다. 예외 매핑은 다른 모듈에 표시되어야 합니다. 모듈에 예외 정의\n {0}이(가) 포함되어 있지만 \n해당 시그니처는\n\t{1}을(를) 지정합니다.
pl: Definicje wyjątku są niezgodne, ponieważ mapowanie wyjątków infrastruktury CLI jest ukrywane przez sygnaturę. Mapowanie wyjątków musi być widoczne dla innych modułów. Moduł zawiera definicję wyjątku\n {0}, \nale jego sygnatura określa\n\t{1}
pt_br: As definições de exceções não são compatíveis, pois um mapeamento de exceção CLI está sendo ocultado pela assinatura. O mapeamento de exceção deve ser visível a outros módulos. O módulo contém a definição da exceção\n {0} \n, mas sua assinatura especifica\n\t{1}
ru: Определения исключений несовместимы, поскольку сопоставление исключений CLI скрыто сигнатурой. Сопоставление исключений должно быть видимо в других модулях. Модуль содержит определение исключения\n {0} \nоднако его сигнатура задает\n\t{1}
tr: CLI özel durum eşlemesi imza aracılığıyla gizlendiği için özel durum tanımları uyumlu değil. Özel durum eşlemesi diğer modüllere görünmelidir. Modül,\n {0} \nözel durum tanımını içeriyor ancak imzasında\n\t{1} belirtiliyor.
zh_hans: 异常定义不兼容，因为签名将隐藏 CLI 异常映射。此异常映射必须对其他模块可见。该模块包含异常定义\n {0} \n而其签名指定\n\t{1}
zh_hant: 例外狀況定義不相容，因為簽章隱藏了 CLI 例外狀況對應。例外狀況對應必須是其他模組可見的。模組包含例外狀況定義\n {0} \n但它的簽章卻指定\n\t{1}

# ExceptionDefsNotCompatibleDotNetRepresentationsDiffer
source: The exception definitions are not compatible because the CLI representations differ. The module contains the exception definition\n {0} \nbut its signature specifies\n\t{1}
cs: Definice výjimek nejsou kompatibilní, protože se liší reprezentace CLI. Modul obsahuje definici výjimky\n {0}, \nale jeho signatura definuje\n\t{1}.
de: Die Ausnahmedefinitionen sind nicht kompatibel, weil die CLI-Darstellungen unterschiedlich sind. Das Modul enthält die Ausnahmedefinition\n {0} \nDie Signatur gibt aber Folgendes an:\n\t{1}.
es: Las definiciones de excepción no son compatibles porque las representaciones de CLI difieren. El módulo contiene la definición de excepción\n {0} \npero su signatura especifica\n\t{1}.
fr: Les définitions de l'exception ne sont pas compatibles, car les représentations CLI sont différentes. Le module contient la définition de l'exception\n {0} \nmais sa signature spécifie\n\t{1}
it: Le definizioni di eccezione non sono compatibili perché le rappresentazioni CLI sono diverse. Il modulo contiene la definizione di eccezione\n {0} \ntuttavia la relativa firma specifica\n\t{1}
ja: CLI 表現が異なるため、例外の定義に互換性がありません。モジュールには例外の定義\n {0} \nが含まれますが、シグネチャでは\n\t{1}\nを指定しています。
ko: CLI 표현이 서로 다르므로 예외 정의가 호환되지 않습니다. 모듈에 예외 정의\n {0}이(가) 포함되어 있지만 \n해당 시그니처는\n\t{1}을(를) 지정합니다.
pl: Definicje wyjątku są niezgodne, ponieważ reprezentacje infrastruktury CLI są różne. Moduł zawiera definicję wyjątku\n {0}, \nale jego sygnatura określa\n\t{1}
pt_br: As definições de exceções não são compatíveis, pois as representações CLI são diferentes. O módulo contém a definição da exceção\n {0} \n, mas a sua assinatura especifica\n\t{1}
ru: Определения исключений несовместимы из-за различий в представлениях CLI. Модуль содержит определение исключения\n {0} \nоднако его сигнатура задает\n\t{1}
tr: CLI temsilleri farklı olduğu için özel durum tanımları uyumlu değil. Modül,\n {0} \nözel durum tanımını içeriyor ancak imzasında\n\t{1} belirtiliyor
zh_hans: 异常定义不兼容，因为 CLI 表示形式不同。该模块包含异常定义\n {0} \n而其签名指定\n\t{1}
zh_hant: 例外狀況定義不相容，因為 CLI 表示不同。模組包含例外狀況定義\n {0} \n但它的簽章卻指定\n\t{1}

# ExceptionDefsNotCompatibleAbbreviationHiddenBySignature
source: The exception definitions are not compatible because the exception abbreviation is being hidden by the signature. The abbreviation must be visible to other CLI languages. Consider making the abbreviation visible in the signature. The module contains the exception definition\n {0} \nbut its signature specifies\n\t{1}.
cs: Definice výjimek nejsou kompatibilní, protože signatura skrývá zkratku výjimky. Zkratka musí být viditelná pro ostatní jazyky CLI. Zvažte zviditelnění zkratky v signatuře. Modul obsahuje definici výjimky\n {0}, \nale jeho signatura definuje\n\t{1}.
de: Die Ausnahmedefinitionen sind nicht kompatibel, weil die Ausnahmeabkürzung von der Signatur verdeckt wird. Die Abkürzung muss für andere CLI-Sprachen sichtbar sein. Sorgen Sie dafür, dass die Abkürzung in der Signatur sichtbar ist. Das Modul enthält die Ausnahmedefinition\n {0} \nDie Signatur gibt aber Folgendes an:\n\t{1}.
es: Las definiciones de excepción no son compatibles porque la signatura oculta la abreviación de la excepción. La abreviación debe estar visible para otros lenguajes CLI. Considere hacer que la abreviación esté visible en la signatura. El módulo contiene la definición de excepción\n {0} \npero su signatura especifica\n\t{1}.
fr: Les définitions de l'exception ne sont pas compatibles, car l'abréviation de l'exception est masquée par la signature. L'abréviation doit être visible par les autres langages CLI. Rendez l'abréviation visible dans la signature. Le module contient la définition de l'exception\n {0} \nmais sa signature spécifie\n\t{1}.
it: Le definizioni di eccezione non sono compatibili perché l'abbreviazione dell'eccezione è nascosta dalla firma. L'abbreviazione deve essere visibile ad altri linguaggi CLI. Provare a rendere visibile l'abbreviazione nella firma. Il modulo contiene la definizione di eccezione \n {0} \ntuttavia la relativa firma specifica\n\t{1}.
ja: 例外の省略形がシグネチャによって隠ぺいされているため、例外の定義に互換性がありません。省略形は他の CLI 言語から参照できるようにする必要があります。シグネチャ内の省略形を参照できるようにしてください。モジュールには例外の定義\n {0} \nがありますが、シグネチャでは\n\t{1}\nを指定しています。
ko: 시그니처에 의해 예외 약어가 숨겨져 있으므로 예외 정의가 호환되지 않습니다. 약어는 다른 CLI 언어에 표시되어야 합니다. 시그니처에서 약어를 표시하세요. 모듈에 예외 정의\n {0}이(가) 포함되어 있지만 \n해당 시그니처는\n\t{1}을(를) 지정합니다.
pl: Definicje wyjątku są niezgodne, ponieważ skrót wyjątku jest ukrywany przez sygnaturę. Skrót musi być widoczny dla innych języków infrastruktury CLI. Rozważ zapewnienie widoczności skrótu w sygnaturze. Moduł zawiera definicję wyjątku\n {0}, \nale jego sygnatura określa\n\t{1}.
pt_br: As definições de exceções não são compatíveis, pois a abreviação de exceção está ocultada pela assinatura. A abreviação deve ser visível a outras linguagens CLI. Considere deixar a abreviação visível na assinatura. O módulo contém a definição de assinatura\n {0} \nmas sua assinatura especifica\n\t{1}.
ru: Определения исключений несовместимы, поскольку сокращенная форма исключения скрыта сигнатурой. Сокращение должно быть видимым для других языков CLI. Попробуйте сделать сокращение видимым в сигнатуре. Модуль содержит определение исключения\n {0} \nоднако его сигнатура задает\n\t{1}.
tr: Özel durum kısaltması imza tarafından gizlendiği için özel durum tanımları uyumlu değil. Kısaltmanın diğer CLI dillerine görünmesi gerekir. Bu kısaltmayı imzada görünür yapmayı düşünün. Modül,\n {0} \nözel durum tanımını içeriyor ancak imzasında\n\t{1} belirtiliyor.
zh_hans: 异常定义不兼容，因为签名将隐藏异常缩写词。缩写词必须对其他 CLI 语言可见。请考虑使缩写词在签名中可见。该模块包含异常定义\n {0} \n而其签名指定\n\t{1}。
zh_hant: 例外狀況定義不相容，因為簽章隱藏了例外狀況縮寫。這個縮寫必須是其他 CLI 語言可見的。請考慮使縮寫在簽章中可見。模組包含例外狀況定義\n {0} \n但它的簽章卻指定\n\t{1}。

# ExceptionDefsNotCompatibleSignaturesDiffer
source: The exception definitions are not compatible because the exception abbreviations in the signature and implementation differ. The module contains the exception definition\n {0} \nbut its signature specifies\n\t{1}.
cs: Definice výjimek nejsou kompatibilní, protože zkratky výjimek v signatuře a implementaci se liší. Modul obsahuje definici výjimky\n {0}, \nale jeho signatura definuje\n\t{1}.
de: Die Ausnahmedefinitionen sind nicht kompatibel, weil die Ausnahmeabkürzungen in der Signatur und in der Implementierung unterschiedlich sind. Das Modul enthält die Ausnahmedefinition\n {0} \nDie Signatur gibt aber Folgendes an:\n\t{1}.
es: Las definiciones de excepción no son compatibles porque las abreviaciones de excepción de la signatura y la implementación difieren. El módulo contiene la definición de excepción\n {0} \npero su signatura especifica\n\t{1}.
fr: Les définitions de l'exception ne sont pas compatibles, car les abréviations de l'exception sont différentes entre la signature et l'implémentation. Le module contient la définition de l'exception\n {0} \nmais sa signature spécifie\n\t{1}.
it: Le definizioni di eccezione non sono compatibili perché le abbreviazioni delle eccezioni nella firma e nell'implementazione sono diverse. Il modulo contiene la definizione di eccezione\n {0} \ntuttavia la relativa firma specifica\n\t{1}.
ja: 例外の省略形がシグネチャと実装とで異なるため、例外の定義に互換性がありません。モジュールには例外の定義\n {0} \nが含まれますが、シグネチャでは\n\t{1}\nを指定しています。
ko: 시그니처와 구현에서 예외 약어가 서로 다르므로 예외 정의가 호환되지 않습니다. 모듈에 예외 정의\n {0}이(가) 포함되어 있지만 \n해당 시그니처는\n\t{1}을(를) 지정합니다.
pl: Definicje wyjątków są niezgodne, ponieważ różnią się skróty wyjątków w sygnaturze i implementacji. Moduł zawiera definicję wyjątku\n {0}, \nale jego sygnatura określa\n\t{1}.
pt_br: As definições de exceções não são compatíveis, pois as abreviações de exceções na assinatura e implementação são diferentes. O módulo contém a definição da exceção\n {0} \n, mas sua assinatura especifica\n\t{1}.
ru: Определения исключений несовместимы, поскольку их сокращенные формы в сигнатуре и реализации различаются. Модуль содержит определение исключения\n {0} \nоднако его сигнатура задает\n\t{1}.
tr: Özel durum kısaltmaları imza ve uygulamada farklı olduğu için özel durum tanımları uyumlu değil. Modül,\n {0} \nözel durum tanımını içeriyor ancak imzasında\n\t{1} belirtiliyor.
zh_hans: 异常定义不兼容，因为签名和实现中的异常缩写词不同。该模块包含异常定义\n {0} \n而其签名指定\n\t{1}。
zh_hant: 例外狀況定義不相容，因為簽章與實作中的例外狀況縮寫不同。模組包含例外狀況定義\n {0} \n但它的簽章卻指定\n\t{1}。

# ExceptionDefsNotCompatibleExceptionDeclarationsDiffer
source: The exception definitions are not compatible because the exception declarations differ. The module contains the exception definition\n {0} \nbut its signature specifies\n\t{1}.
cs: Definice výjimek nejsou kompatibilní, protože se liší deklarace výjimek. Modul obsahuje definici výjimky\n {0}, \nale jeho signatura definuje\n\t{1}.
de: Die Ausnahmedefinitionen sind nicht kompatibel, weil die Ausnahmedeklarationen unterschiedlich sind. Das Modul enthält die Ausnahmedefinition\n {0} \nDie Signatur gibt aber Folgendes an:\n\t{1}.
es: Las definiciones de excepción no son compatibles porque las declaraciones de excepción difieren. El módulo contiene la definición de excepción\n {0} \npero su signatura especifica\n\t{1}.
fr: Les définitions de l'exception ne sont pas compatibles, car les déclarations de l'exception sont différentes. Le module contient la définition de l'exception\n {0} \nmais sa signature spécifie\n\t{1}.
it: Le definizioni di eccezione non sono compatibili perché le dichiarazioni di eccezione sono diverse. Il modulo contiene la definizione di eccezione\n {0} \ntuttavia la relativa firma specifica\n\t{1}.
ja: 例外の宣言が異なるため、例外の定義に互換性がありません。モジュールには例外の定義\n {0} \nが含まれますが、シグネチャでは\n\t{1}\nを指定しています。
ko: 예외 선언이 서로 다르므로 예외 정의가 호환되지 않습니다. 모듈에 예외 정의\n {0}이(가) 포함되어 있지만 \n해당 시그니처는\n\t{1}을(를) 지정합니다.
pl: Definicje wyjątku są niezgodne, ponieważ deklaracje wyjątku są różne. Moduł zawiera definicję wyjątku\n {0}, \nale jego sygnatura określa\n\t{1}.
pt_br: As definições de exceções não são compatíveis, pois as declarações de exceções diferem. O módulo contém a definição da exceção\n {0} \n, mas sua assinatura especifica\n\t{1}.
ru: Определения исключений несовместимы из-за различий в объявлениях исключений. Модуль содержит определение исключения\n {0} \nоднако его сигнатура задает\n\t{1}.
tr: Özel durum bildirimleri farklı olduğu için özel durum tanımları uyumlu değil. Modül,\n {0} \nözel durum tanımını içeriyor ancak imzasında\n\t{1} belirtiliyor.
zh_hans: 异常定义不兼容，因为异常声明不同。该模块包含异常定义\n {0} \n而其签名指定\n\t{1}。
zh_hant: 例外狀況定義不相容，因為例外狀況宣告不同。模組包含例外狀況定義\n {0} \n但它的簽章卻指定\n\t{1}。

# ExceptionDefsNotCompatibleFieldInSigButNotImpl
source: The exception definitions are not compatible because the field '{0}' was required by the signature but was not specified by the implementation. The module contains the exception definition\n {1} \nbut its signature specifies\n\t{2}.
cs: Definice výjimek nejsou kompatibilní, protože signatura vyžadovala pole {0}, které ale implementace nedefinuje. Modul obsahuje definici výjimky\n {1}, \nale jeho signatura definuje \n\t{2}.
de: Die Ausnahmedefinitionen sind nicht kompatibel, weil das Feld "{0}" für die Signatur erforderlich war, in der Implementierung aber nicht angegeben wurde. Das Modul enthält die Ausnahmedefinition\n {1} \nDie Signatur gibt aber Folgendes an:\n\t{2}.
es: Las definiciones de excepción no son compatibles porque la signatura requería el campo '{0}' pero la implementación no lo especificó. El módulo contiene la definición de excepción\n {1} \npero su signatura especifica\n\t{2}.
fr: Les définitions de l'exception ne sont pas compatibles, car le champ '{0}' était requis par la signature mais n'était pas spécifiée par l'implémentation. Le module contient la définition de l'exception\n {1} \nmais sa signature spécifie\n\t{2}.
it: Le definizioni di eccezione non sono compatibili perché il campo '{0}' è necessario per la firma ma non è stato specificato dall'implementazione. Il modulo contiene la definizione di eccezione\n {1} \ntuttavia la relativa firma specifica\n\t{2}.
ja: シグネチャにはフィールド '{0}' が必要ですが、実装では指定されなかったため、例外の定義に互換性がありません。モジュールには例外の定義\n {1} \nが含まれますが、シグネチャでは\n\t{2}\nを指定しています。
ko: {0}' 필드가 시그니처에 필요했지만 구현에 의해 지정되지 않았으므로 예외 정의가 호환되지 않습니다. 모듈에 예외 정의\n {1}이(가) 포함되어 있지만 \n해당 시그니처는\n\t{2}을(를) 지정합니다.
pl: Definicje wyjątku są niezgodne, ponieważ pole „{0}” było wymagane przez sygnaturę, ale nie zostało określone przez implementację. Moduł zawiera definicję wyjątku\n {1}, \nale jego sygnatura określa\n\t{2}.
pt_br: As definições de exceções não são compatíveis, pois o campo '{0}' foi requerido pela assinatura, mas não foi especificado na implementação. O módulo contém a definição da exceção\n {1} \n, mas sua assinatura especifica\n\t{2}.
ru: Определения исключений несовместимы, поскольку поле "{0}" требуется в сигнатуре, но не задано в реализации. Модуль содержит определение исключения\n {1} \nоднако его сигнатура задает\n\t{2}.
tr: {0}' alanı imza için gerekmesine karşın uygulama tarafından belirtilmediği için özel durum tanımları uyumlu değil. Modül,\n {1} \nözel durum tanımını içeriyor ancak imzasında\n\t{2} belirtiliyor.
zh_hans: 异常定义不兼容，因为签名需要字段“{0}”，而实现未指定该字段。该模块包含异常定义\n {1} \n而其签名指定\n\t{2}。
zh_hant: 例外狀況定義不相容，因為簽章需要欄位'{0}'，但實作卻未指定。模組包含例外狀況定義\n {1} \n但它的簽章卻指定\n\t{2}。

# ExceptionDefsNotCompatibleFieldInImplButNotSig
source: The exception definitions are not compatible because the field '{0}' was present in the implementation but not in the signature. The module contains the exception definition\n {1} \nbut its signature specifies\n\t{2}.
cs: Definice výjimek nejsou kompatibilní, protože pole {0} se nacházelo v implementaci, ale v signatuře ne. Modul obsahuje definici výjimky\n {1}, \nale jeho signatura definuje\n\t{2}.
de: Die Ausnahmedefinitionen sind nicht kompatibel, weil das Feld "{0}" in der Implementierung vorhanden war, aber nicht in der Signatur. Das Modul enthält die Ausnahmedefinition\n {1} \nDie Signatur gibt aber Folgendes an:\n\t{2}.
es: Las definiciones de excepción no son compatibles porque el campo '{0}' estaba presente en la implementación pero no en la signatura. El módulo contiene la definición de excepción\n {1} \npero su signatura especifica\n\t{2}.
fr: Les définitions de l'exception ne sont pas compatibles, car le champ '{0}' était présent dans l'implémentation mais pas dans la signature. Le module contient la définition de l'exception\n {1} \nmais sa signature spécifie\n\t{2}.
it: Le definizioni di eccezione non sono compatibili perché il campo '{0}' è presente nell'implementazione ma non nella firma. Il modulo contiene la definizione di eccezione\n {1} \ntuttavia la relativa firma specifica\n\t{2}.
ja: 実装にはフィールド '{0}' がありますが、シグネチャにはないため、例外の定義に互換性がありません。モジュールには例外の定義\n {1} \nが含まれますが、シグネチャでは\n\t{2}\nを指定しています。
ko: {0}' 필드가 구현에 있었지만 시그니처에는 없었으므로 예외 정의가 호환되지 않습니다. 모듈에 예외 정의\n {1}이(가) 포함되어 있지만 \n해당 시그니처는\n\t{2}을(를) 지정합니다.
pl: Definicje wyjątku są niezgodne, ponieważ pole „{0}” było obecne w implementacji, ale nie w sygnaturze. Moduł zawiera definicję wyjątku\n {1}, \nale jego sygnatura określa\n\t{2}.
pt_br: As definições de exceções não são compatíveis, pois o campo '{0}' estava presente na implementação, mas não na assinatura. O módulo contém a definição da exceção\n {1} \n, mas sua assinatura especifica\n\t{2}.
ru: Определения исключений несовместимы, поскольку поле "{0}" присутствует в реализации, но не в сигнатуре. Модуль содержит определение исключения\n {1} \nоднако его сигнатура задает\n\t{2}.
tr: {0}' alanı uygulamada olup imzada olmadığı için özel durum tanımları uyumlu değil. Modül,\n {1} \nözel durum tanımını içeriyor ancak imzasında\n\t{2} belirtiliyor.
zh_hans: 异常定义不兼容，因为实现中具有字段“{0}”，而签名中没有该字段。该模块包含异常定义\n {1} \n而其签名指定\n\t{2}。
zh_hant: 例外狀況定義不相容，因為實作中有欄位 '{0}'，但簽章中沒有。模組包含例外狀況定義\n {1} \n但它的簽章卻指定\n\t{2}。
