Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# tcLessGenericBecauseOfAnnotation
source: This code is less generic than required by its annotations because the explicit type variable '{0}' could not be generalized. It was constrained to be '{1}'.
cs: Tento kód je míň obecný, než požadují jeho poznámky, protože proměnná explicitního typu {0} se nedá zobecnit. Kód se omezil na {1}.
de: Dieser Code ist weniger generisch, als dies laut Anmerkungen erforderlich ist, weil die explizite Typvariable "{0}" nicht generalisiert werden konnte. Einschränkung auf "{1}".
es: Este código es menos genérico que lo que requieren sus anotaciones, porque la variable de tipo explícito '{0}' no se pudo generalizar. Estaba restringida a ser '{1}'.
fr: Ce code est moins générique que ne l'exigent ses annotations, car il est impossible de généraliser la variable de type explicite '{0}'. Il a été contraint à être '{1}'.
it: Il codice è meno generico di quanto richiesto dalle relative annotazioni perché non è possibile generalizzare la variabile di tipo esplicito '{0}'. Sono presenti vincoli per i quali essa deve essere '{1}'.
ja: 明示的な型変数 '{0}' をジェネリック化できないため、このコードは、注釈に必要な総称性よりも低くなります。このコードは '{1}' に制限されました。
ko: 명시적 형식 변수 '{0}'을(를) 일반화할 수 없으므로 이 코드는 해당 주석에 필요한 것보다 일반적이지 않습니다. 해당 변수는 '{1}'(으)로 제한되었습니다.
pl: Ten kod jest mniej ogólny niż jest to wymagane przez jego adnotacje, ponieważ nie można uogólnić jawnej zmiennej typu „{0}”. Została ona ograniczona do postaci „{1}”.
pt_br: Este código é menos genérico que o requerido por suas anotações porque não foi possível gerar a variável de tipo explícito '{0}'. Ela foi restrita para ser '{1}'.
ru: Данный код является менее базовым, чем требуется его аннотациями, так как переменная явного типа "{0}" не может быть обобщена. Она была ограничена до "{1}".
tr: Açık tür değişkeni '{0}' oluşturulamadığı için bu kod ek açıklamalarının gerektirdiğinden daha az genel. '{1}' olacak şekilde kısıtlanmıştı.
zh_hans: 此代码并不像其批注要求的那样通用，因为未能对显式类型变量“{0}”进行一般化。它已被约束为“{1}”。
zh_hant: 這個程式碼的一般程度小於其註釋要求的程度，因為無法一般化明確類型變數 '{0}'。它受限於必須是 '{1}'。

# tcConstrainedTypeVariableCannotBeGeneralized
source: One or more of the explicit class or function type variables for this binding could not be generalized, because they were constrained to other types
cs: Jedna nebo víc proměnných explicitní třídy nebo typu funkce pro tuto vazbu se nedala zobecnit, protože má omezení na jiné typy.
de: Mindestens eine der expliziten Klassen- oder Funktionstypvariablen für diese Bindung konnte nicht generalisiert werden, weil eine Einschränkung für andere Typen vorlag.
es: No se pudieron generalizar una o varias de las variables de clase explícita o de tipo de función para este enlace, porque estaban restringidas a otros tipos.
fr: Impossible de généraliser une ou plusieurs variables de type classe ou fonction explicite pour cette liaison, car elles sont contraintes par d'autres types
it: Non è stato possibile generalizzare una o più variabili di tipi di funzione o classi esplicite per questo binding perché sono state vincolate ad altri tipi
ja: この束縛に関する 1 つまたは複数の明示的クラスまたは関数型の変数は、他の型に制限されているため、ジェネリック化できませんでした。
ko: 이 바인딩에 대한 하나 이상의 명시적 클래스 또는 함수 형식 변수가 다른 형식의 제약을 받으므로 해당 변수를 일반화할 수 없습니다.
pl: Nie można uogólnić co najmniej jednej zmiennej jawnej klasy lub typu funkcji dla tego powiązania, ponieważ są one ograniczone do innych typów
pt_br: Uma ou mais classes explícitas ou variáveis de tipo função explícita para essa associação não puderam ser geradas, porque foram restritas a outros tipos
ru: Один или несколько явных классов или переменных типов функций для данной привязки не могут быть обобщены, так как они были ограничены на другие типы.
tr: Bu bağlamanın bir veya daha fazla açık sınıf veya işlev türü değişkeni diğer türlerle kısıtlandığı için oluşturulamadı
zh_hans: 未能对此绑定的一个或多个显式类或函数类型变量进行一般化，因为它们已被约束为其他类型
zh_hant: 無法一般化這個繫結的一個或多個明確類別或函式類型變數，因為它們受限於其他類型

# tcGenericParameterHasBeenConstrained
source: A generic type parameter has been used in a way that constrains it to always be '{0}'
cs: Parametr obecného typu se použil tak, že ho to omezuje, aby vždycky byl {0}.
de: Ein generischer Typparameter wurde auf eine Weise verwendet, durch die er immer "{0}" sein muss.
es: Se ha usado un parámetro de tipo genérico que lo restringe a ser siempre '{0}'.
fr: Un paramètre de type générique a été utilisé d'une façon qui le contraint à être toujours '{0}'
it: Un parametro di tipo generico è utilizzato in modo da dovere essere sempre '{0}'
ja: 常に '{0}' であるという制約があるジェネリック型パラメーターが使用されました
ko: 제네릭 형식 매개 변수가 항상 '{0}'이(가) 되도록 제한하는 방식으로 해당 매개 변수가 사용되었습니다.
pl: Parametr typu ogólnego został użyty w sposób ograniczający go tak, aby zawsze miał postać „{0}”
pt_br: Um parâmetro de tipo genérico foi usado de modo que ficou restrito a ser sempre '{0}'
ru: Был использован базовый параметр типа таким образом, что он всегда ограничен до "{0}"
tr: Genel bir tür parametresi, her zaman '{0}' olarak kısıtlanacak şekilde kullanılmış
zh_hans: 使用泛型类型参数的方式已将其限定为始终为“{0}”
zh_hant: 泛型型別參數的使用方式導致它始終受限為 '{0}'

# tcTypeParameterHasBeenConstrained
source: This type parameter has been used in a way that constrains it to always be '{0}'
cs: Tento parametr typu se použil způsobem, který ho omezuje v tom smyslu, že musí být vždycky {0}.
de: Dieser Typparameter wurde auf eine Weise verwendet, durch die er immer "{0}" sein muss.
es: Este parámetro de tipo se ha usado de forma que lo restringe a ser siempre '{0}'.
fr: Ce paramètre de type a été utilisé d'une façon qui le contraint à être toujours '{0}'
it: Questo parametro di tipo è stato utilizzato in modo da dover essere sempre '{0}'
ja: 常に '{0}' であるという制約がある型パラメーターが使用されました
ko: 이 형식 매개 변수가 항상 '{0}'이(가) 되도록 제한하는 방식으로 해당 매개 변수가 사용되었습니다.
pl: Ten parametr typu został użyty w sposób ograniczający go tak, aby zawsze miał postać „{0}”
pt_br: Este parâmetro de tipo foi usado de forma que fique restrito a ser sempre '{0}'
ru: Данный параметр типа был использован так, что был ограничен до постоянного значения "{0}"
tr: Bu tür parametresi, her zaman '{0}' olarak kısıtlanacak şekilde kullanılmış
zh_hans: 使用此类型参数的方式已将其限定为始终为“{0}”
zh_hant: 這個型別參數的使用方式導致它始終受限為 '{0}'

# tcTypeParametersInferredAreNotStable
source: The type parameters inferred for this value are not stable under the erasure of type abbreviations. This is due to the use of type abbreviations which drop or reorder type parameters, e.g. \n\ttype taggedInt<'a> = int or\n\ttype swap<'a,'b> = 'b * 'a.\nConsider declaring the type parameters for this value explicitly, e.g.\n\tlet f<'a,'b> ((x,y) : swap<'b,'a>) : swap<'a,'b> = (y,x).
cs: Parametry typu odvozené pro tuto hodnotu nejsou v případě vymazání zkratek typů stabilní. Způsobuje to použití zkratek typu, které vypouštějí nebo mění pořadí parametrů typu, třeba pomocí notace\n\ttype taggedInt<'a> = int nebo\n\ttype swap<'a,'b> = 'b * 'a.\nZvažte možnost deklarování parametrů typu pro tuto hodnotu explicitně, třeba pomocí notace\n\tlet f<'a,'b> ((x,y) : swap<'b,'a>) : swap<'a,'b> = (y,x).
de: Die für diesen Wert per Rückschluss abgeleiteten Typparameter sind beim Löschen von Typabkürzungen nicht stabil. Dies ist auf die Verwendung von Typabkürzungen zurückzuführen, die Typparameter löschen oder neu anordnen, z.B. "\n\ttype taggedInt<'a> = int" oder "\n\ttype swap<'a,'b> = 'b * 'a".\nDeklarieren Sie die Typparameter für diesen Wert explizit, z.B. "\n\tlet f<'a,'b> ((x,y) : swap<'b,'a>) : swap<'a,'b> = (y,x)".
es: Los parámetros de tipo inferidos para este valor no son estables en la eliminación de las abreviaturas de tipo. Esto se debe al uso de abreviaturas de tipo que eliminan o reordenan los parámetros de tipo, por ejemplo,\n\ttype taggedInt<'a> = int or\n\ttype swap<'a,'b> = 'b * 'a.\nConsidere declarar explícitamente los parámetros de tipo para este valor, por ejemplo, \n\tlet f<'a,'b> ((x,y) : swap<'b,'a>) : swap<'a,'b> = (y,x).
fr: Les paramètres de type déduits pour cette valeur ne sont pas stables après l'effacement des abréviation de type. C'est parce que l'utilisation des abréviations de type supprime ou réorganise les paramètres de type, par ex. \n\ttype taggedInt<'a> = int ou\n\ttype swap<'a,'b> = 'b * 'a.\nDéclarez les paramètres de type explicitement pour cette valeur, par ex.\n\tlet f<'a,'b> ((x,y) : swap<'b,'a>) : swap<'a,'b> = (y,x).
it: I parametri di tipo dedotti per il valore non sono stabili nell'ambito della cancellazione di abbreviazioni di tipo. Questa condizione è dovuta all'uso di abbreviazioni di tipo che eliminano o riordinano i parametri di tipo, ad esempio \n\ttype taggedInt<'a> = int or\n\ttype swap<'a,'b> = 'b * 'a.\nProvare a dichiarare i parametri di tipo per questo valore in modo esplicito, ad esempio \n\tlet f<'a,'b> ((x,y) : swap<'b,'a>) : swap<'a,'b> = (y,x).
ja: この値に推論される型パラメーターは、型の省略形を無効にすると安定しません。型パラメーターをドロップまたは並び替える型の省略形を使用していることが原因です (例: \n\ttype taggedInt<'a> = int または\n\ttype swap<'a,'b> = 'b * 'a)。\nこの値の型パラメーターを明示的に宣言してください (例: \n\tlet f<'a,'b> ((x,y) : swap<'b,'a>) : swap<'a,'b> = (y,x))。
ko: 이 값에 대해 유추된 형식 매개 변수는 형식 약어를 지울 경우 불안정한 상태가 됩니다. 이는 형식 매개 변수를 삭제 또는 다시 정렬하는 형식 약어를 사용했기 때문입니다(예: \n\ttype taggedInt<'a> = int or\n\ttype swap<'a,'b> = 'b * 'a).\n이 값에 대한 형식 매개 변수를 명시적으로 선언하세요(예: \n\tlet f<'a,'b> ((x,y) : swap<'b,'a>) : swap<'a,'b> = (y,x)).
pl: Parametry typu wywnioskowane dla tej wartości nie są stabilne po wymazaniu skrótów typu. Jest to spowodowane przez użycie skrótów typu, które porzucają parametry typu lub zmieniają ich kolejność, na przykład \n\ttype taggedInt<'a> = int lub\n\ttype swap<'a,'b> = 'b * 'a.\nRozważ jawne zadeklarowanie parametrów typu dla tej wartości, na przykład\n\tlet f<'a,'b> ((x,y) : swap<'b,'a>) : swap<'a,'b> = (y,x).
pt_br: Os parâmetros de tipo inferidos para este valor não são estáveis sob o apagamento das abreviações de tipo. Isto é devido ao uso de abreviações de tipo que soltam ou reordenem parâmetros de tipo, ex.: \n\ttype taggedInt<'a> = int or\n\ttype swap<'a,'b> = 'b * 'a.\nDeclare os parâmetros de tipo para este valor explicitamente, ex.:\n\tlet f<'a,'b> ((x,y) : swap<'b,'a>) : swap<'a,'b> = (y,x).
ru: Параметры типа, полученные для этого значения, не являются стабильными в случае удаления сокращенных обозначений типа. Это вызвано использованием сокращенных обозначений типа, которые удаляются или вызывают изменение порядка параметров типа, например, \n\ttype taggedInt<'a> = int или\n\ttype swap<'a,'b> = 'b * 'a.\nОбъявите параметры типа для этого значения явным образом, например, \n\tlet f<'a,'b> ((x,y) : swap<'b,'a>) : swap<'a,'b> = (y,x).
tr: Bu değer için çıkarsanan tür parametreleri, tür kısaltmalarının silinmesi halinde kararlı değildir. Bunun nedeni, tür parametrelerini bırakan veya yeniden sıralayan tür kısaltmalarının kullanımıdır, ör. \n\ttype taggedInt<'a> = int or\n\ttype swap<'a,'b> = 'b * 'a.\nBu değer için tür parametrelerini açıkça bildirmeyi deneyin, ör.\n\tlet f<'a,'b> ((x,y) : swap<'b,'a>) : swap<'a,'b> = (y,x).
zh_hans: 在清除类型缩写词的情况下，为此值推理出的类型参数不稳定。这是因为使用了将删除或记录类型参数的类型缩写词，例如\n\ttype taggedInt<'a> = int 或\n\ttype swap<'a,'b> = 'b * 'a.\n请考虑显式声明此值的类型参数，例如\n\tlet f<'a,'b> ((x,y) : swap<'b,'a>) : swap<'a,'b> = (y,x)。
zh_hant: 為這個值推斷的類型參數在清除類型縮寫後會不穩定。這是因為使用了會卸除或重新排序類型參數的類型縮寫，例如 \n\ttype taggedInt<'a> = int or\n\ttype swap<'a,'b> = 'b * 'a。\n請考慮明確宣告類型參數，例如\n\tlet f<'a,'b> ((x,y) : swap<'b,'a>) : swap<'a,'b> = (y,x)。

# tcExplicitTypeParameterInvalid
source: Explicit type parameters may only be used on module or member bindings
cs: Explicitní parametry typu se dají použít jenom u vazeb modulu nebo člena.
de: Explizite Typparameter dürfen nur für Modul- oder Memberbindungen verwendet werden.
es: Los parámetros de tipo explícitos se pueden usar solo en enlaces de módulo o miembro.
fr: Les paramètres de type explicite ne peuvent être utilisés que sur les liaisons de module ou de membre
it: I parametri di tipo esplicito possono essere usati solo in binding di membri o moduli
ja: 明示的な型パラメーターを使用できるのは、モジュールまたはメンバーの束縛のみです
ko: 명시적 형식 매개 변수는 모듈 또는 멤버 바인딩에 대해서만 사용할 수 있습니다.
pl: Jawne parametry typu mogą być używane tylko w powiązaniach modułów lub elementów członkowskich
pt_br: Parâmetros de tipo explícitos só podem ser usados em associações de módulo ou membro
ru: Явные параметры типа могут быть использованы только в модуле или привязках элемента
tr: Açık tür parametreleri yalnızca modülde veya üye bağlamalarında kullanılabilir
zh_hans: 显式类型参数只能用于模块或成员绑定
zh_hant: 明確的類型參數只能用在模組或成員繫結上

# tcOverridingMethodRequiresAllOrNoTypeParameters
source: You must explicitly declare either all or no type parameters when overriding a generic abstract method
cs: Při přepisování obecné abstraktní metody musíte explicitně deklarovat buď všechny, nebo žádné parametry typu.
de: Sie müssen entweder alle Typparameter oder keinen Typparameter explizit deklarieren, wenn Sie eine generische abstrakte Methode überschreiben.
es: Debe declarar de forma explícita todos o ninguno de los parámetros de tipo cuando se invalide un método abstracto genérico.
fr: Vous devez déclarer explicitement tous les paramètres de type, ou aucun d'entre eux, lors de la substitution d'une méthode abstraite générique
it: È necessario dichiarare in modo esplicito tutti o nessuno dei parametri di tipo quando si esegue l'override di un metodo astratto generico
ja: ジェネリック抽象メソッドをオーバーライドする場合、明示的にすべての型パラメーターを宣言するか、まったく宣言しないでください
ko: 제네릭 추상 메서드를 재정의할 때는 모든 형식 매개 변수를 명시적으로 선언하거나 형식 매개 변수를 선언하지 않아야 합니다.
pl: W przypadku przesłaniania ogólnej metody abstrakcyjnej musisz jawnie zadeklarować wszystkie parametry typu lub brak parametrów typu
pt_br: Você deve declarar explicitamente todos ou nenhum parâmetro de tipo quando for substituir um método abstrato genérico
ru: Необходимо явно объявить либо все параметры типа, либо не объявлять их вообще при переопределении базового абстрактного метода
tr: Genel soyut metodu geçersiz kılarken tür parametrelerinin ya tümünü açık olarak tanımlamanız ya da hiçbirini açık olarak tanımlamamanız gerekir
zh_hans: 在重写泛型抽象方法时，必须显式声明所有类型参数或不声明任何类型参数
zh_hant: 覆寫泛型抽象方法時，必須明確宣告所有類型參數或不宣告任何類型參數

# tcFieldsDoNotDetermineUniqueRecordType
source: The field labels and expected type of this record expression or pattern do not uniquely determine a corresponding record type
cs: Tyto popisky pole a očekávaný typ tohoto výrazu záznamu nebo vzoru neurčují jednoznačně odpovídající typ záznamu.
de: Anhand der Feldbezeichnungen und des erwarteten Typs dieses Datensatzausdrucks oder Musters lässt sich kein eindeutiger Datensatztyp bestimmen.
es: Las etiquetas de campo y el tipo esperado de este patrón o expresión de registro no determinan de forma única un tipo de registro correspondiente.
fr: Les étiquettes et le type attendu du champ de cette expression d'enregistrement ou ce modèle d'enregistrement ne déterminent pas de manière unique un type enregistrement correspondant
it: Le etichette di campo e il tipo previsto di questo criterio o espressione del record non determinano in modo univoco un tipo di record corrispondente
ja: フィールド ラベルとこのレコード式またはパターンの型だけでは、対応するレコード型を一意に決定できません
ko: 이 레코드 식 또는 패턴의 필요한 형식 및 필드 레이블이 해당하는 레코드 형식을 고유하게 확인하지 않습니다.
pl: Etykiety pól i oczekiwany typ tego wyrażenia rekordu lub wzorca nie określają jednoznacznie odpowiedniego typu rekordu
pt_br: Os rótulos de campo e tipo esperado desta expressão ou padrão de registro não determinam exclusivamente um tipo de registro correspondente
ru: Метки поля и требуемый тип данного выражения записи или шаблона не определяют уникально соответствующий тип записи
tr: Bu kayıt ifadesinin veya deseninin alan etiketleri ve beklenen türü, karşılık gelen bir kayıt türünü benzersiz olarak belirlemiyor
zh_hans: 此记录表达式或模式的字段标签和预期类型没有唯一确定相应的记录类型
zh_hant: 這個記錄運算式或模式的欄位標籤和預期類型無法唯一決定對應的記錄類型

# tcFieldAppearsTwiceInRecord
source: The field '{0}' appears twice in this record expression or pattern
cs: Pole {0} se v tomto výrazu záznamu nebo vzoru vyskytuje dvakrát.
de: Das Feld "{0}" ist in diesem Datensatzausdruck oder Muster zweimal vorhanden.
es: El campo '{0}' aparece dos veces en este patrón o expresión de registro.
fr: Le champ '{0}' apparaît à deux reprises dans cette expression ou ce modèle d'enregistrement
it: Il campo '{0}' è presente due volte nei criteri o nell'espressione del record
ja: のレコード式またはパターンに、フィールド '{0}' が 2 回出現します
ko: '{0}' 필드가 이 레코드 식 또는 패턴에 두 번 나타납니다.
pl: Pole „{0}” występuje dwa razy w tym wyrażeniu rekordu lub wzorcu
pt_br: O campo '{0}' aparece duas vezes nesta expressão de registro ou padrão
ru: Поле "{0}" появляется дважды в данном выражении записи или шаблоне
tr: '{0}' alanı bu kayıt ifadesinde veya deseninde iki kez görünüyor
zh_hans: 字段“{0}”在此记录表达式或模式中出现了两次
zh_hant: 欄位 '{0}' 在這個記錄運算式或模式中出現兩次

# tcUnknownUnion
source: Unknown union case
cs: Neznámý případ typu union
de: Unbekannter Union-Fall.
es: Caso de unión desconocido.
fr: Cas d'union inconnu
it: Case di unione sconosciuto
ja: 不明な共用体ケースです
ko: 알 수 없는 공용 구조체 케이스입니다.
pl: Nieznany przypadek unii
pt_br: Caso união desconhecido
ru: Неизвестная ветвь объединения
tr: Bilinmeyen birleşim durumu
zh_hans: 未知的联合用例
zh_hant: 未知的聯集

# tcNotSufficientlyGenericBecauseOfScope
source: This code is not sufficiently generic. The type variable {0} could not be generalized because it would escape its scope.
cs: Tento kód není dostatečně obecný. Proměnná typu {0} se nedá zobecnit, protože by se tak dostala mimo svůj definiční obor.
de: Dieser Code ist nicht generisch genug. Die Typvariable "{0}" konnte nicht generalisiert werden, weil sie sonst aus dem Bereich fallen würde.
es: Este código no es lo suficientemente genérico. La variable de tipo {0} no se pudo generalizar porque escaparía de su ámbito.
fr: Ce code n'est pas suffisamment générique. Impossible de généraliser la variable de type {0}, car elle sort de sa portée.
it: Questo codice non è sufficientemente generico. Non è stato possibile generalizzare la variabile di tipo {0} perché non sarebbe compresa nel relativo ambito.
ja: このコードの総称性が十分ではありません。スコープが回避されるため、型変数 {0} をジェネリック化することはできません。
ko: 이 코드는 충분히 일반적이지 않습니다. 형식 변수 {0}을(를) 일반화하면 범위를 벗어나게 되므로 일반화할 수 없습니다.
pl: Ten kod nie jest wystarczająco ogólny. Nie można uogólnić zmiennej typu {0}, ponieważ wykroczy ona poza swój zakres.
pt_br: Este código não é suficientemente genérico. A variável de tipo {0} não pode ser gerada porque ela escaparia de seu escopo.
ru: Этот код является недостаточно базовым Переменная типа {0} не может быть обобщена, так как тогда она выйдет за пределы области.
tr: Bu kod yeterince genel değil. Tür değişkeni {0}, kapsamını kaçıracağı için genelleştirilemedi.
zh_hans: 此代码的通用程度不够。未能对类型变量 {0} 进行一般化，因为它会超出其范围。
zh_hant: 這個程式碼的一般程度不足。無法一般化類型變數 {0}，因為它會逸出其範圍。

# tcPropertyRequiresExplicitTypeParameters
source: A property cannot have explicit type parameters. Consider using a method instead.
cs: Vlastnost nemůže mít explicitní parametry typu. Zvažte místo toho možnost použití metody.
de: Eine Eigenschaft darf keine expliziten Typparameter aufweisen. Verwenden Sie stattdessen eine Methode.
es: Una propiedad no puede tener parámetros de tipo explícitos. Considere el uso de un método en su lugar.
fr: Une propriété ne peut pas avoir de paramètres de type explicite. Utilisez une méthode à la place.
it: Una proprietà non può avere parametri di tipo esplicito. Provare a utilizzare invece un metodo.
ja: プロパティには明示的な型パラメーターを使用できません。代わりにメソッドを使用してください。
ko: 속성에는 명시적 형식 매개 변수를 지정할 수 없습니다. 대신 메서드를 사용하세요.
pl: Właściwość nie może zawierać jawnych parametrów typu. Zamiast tego rozważ użycie metody.
pt_br: Uma propriedade não pode ter parâmetros de tipo explícito. Considere usar um método.
ru: Свойство не может иметь явных параметров типа. Вместо этого рекомендуется использовать метод.
tr: Bir özelliğin açık tür parametreleri olamaz. Onun yerine metot kullanmayı düşünün.
zh_hans: 属性不能具有显式类型参数。请考虑改用方法。
zh_hant: 屬性不能有明確的類型參數。請考慮改用方法。

# tcConstructorCannotHaveTypeParameters
source: A constructor cannot have explicit type parameters. Consider using a static construction method instead.
cs: Konstruktor nemůže mít parametry explicitního typu. Zvažte možnost použít místo toho metodu statické konstrukce.
de: Ein Konstruktor darf keine expliziten Typparameter aufweisen. Verwenden Sie stattdessen eine statische Konstruktionsmethode.
es: Un constructor no puede tener parámetros de tipo explícitos. Considere el uso de un método de construcción estático en su lugar.
fr: Un constructeur ne peut pas avoir de paramètres de type explicite. Utilisez une méthode de construction statique à la place.
it: Un costruttore non può avere parametri di tipo esplicito. Provare a utilizzare invece un metodo di costruzione statico.
ja: コンストラクターには明示的な型パラメーターを使用できません。代わりに静的構築のメソッドを使用してください。
ko: 생성자에는 명시적 형식 매개 변수를 지정할 수 없습니다. 대신 정적 생성 메서드를 사용하세요.
pl: Konstruktor nie może zawierać jawnych parametrów typu. Zamiast tego rozważ użycie statycznej metody konstrukcji.
pt_br: Um construtor não pode ter parâmetros de tipo explícitos. Considere usar um método de construção estática.
ru: Конструктор не может иметь явных параметров типа. Возможно, требуется использовать статический метод.
tr: Bir oluşturucunun açık tür parametreleri olamaz. Onun yerine statik oluşturma metodu kullanmayı düşünün.
zh_hans: 构造函数不能具有显式类型参数。请考虑改用静态构造方法。
zh_hant: 建構函式不能有明確的類型參數。請考慮改用靜態建構方法。

# tcInstanceMemberRequiresTarget
source: This instance member needs a parameter to represent the object being invoked. Make the member static or use the notation 'member x.Member(args) = ...'.
cs: Tento člen instance vyžaduje, aby parametr představoval objekt, který se vyvolává. Upravte člena tak, aby byl statický, nebo použijte notaci member x.Member(args) =
de: Dieser Instanzmember erfordert einen Parameter, der das aufgerufene Objekt darstellt. Definieren Sie den Member als statisch, oder verwenden Sie die Notation "member x.Member(args) = ...".
es: Este miembro de instancia necesita un parámetro para representar el objeto que se va a invocar. Convierta el miembro en estático o use la notación 'member x.Member(args) = ...'.
fr: Ce membre d'instance nécessite un paramètre pour représenter l'objet appelé. Rendez le membre statique ou utilisez la notation 'member x.Member(args) = ...'.
it: In questo membro di istanza è necessario un parametro per rappresentare l'oggetto richiamato. Rendere il membro statico oppure utilizzare la notazione 'member x.Member(args) = ...'.
ja: このインスタンス メンバーには、呼び出されるオブジェクトを表すパラメーターが必要です。メンバーを静的にするか、'member x.Member(args) = ...' という表記を使用してください。
ko: 이 인스턴스 멤버에는 호출하는 개체를 나타내는 매개 변수가 필요합니다. 멤버를 정적 요소로 만들거나 'member x.Member(args) = ...' 표기법을 사용하세요.
pl: Ten element członkowski wystąpienia wymaga parametru, aby mógł reprezentować wywoływany obiekt. Ustaw element członkowski jako element statyczny lub użyj notacji „member x.Member(args) = ...”.
pt_br: Este membro de instância precisa de um parâmetro para representar um objeto a ser chamado. Deixe o membro estático ou use a notação 'membro x.Membro(argumentos) = ...'.
ru: Для данного элемента экземпляра требуется параметр для представления вызываемого объекта. Сделайте элемент статическим, или же используйте нотацию "member x.Member(args) = ...".
tr: Bu örnek üyesinin çağrılan nesneyi temsil etmek için parametreye ihtiyacı var. Üyeyi statik yapın veya 'member x.Member(args) = ...' gösterimini kullanın.
zh_hans: 此实例成员需要一个用于表示被调用的对象的参数。使此成员成为静态成员，或使用表示法“member x.Member(args) = ...”。
zh_hant: 這個執行個體成員需要參數來代表所叫用的物件。請將成員設為靜態成員，或使用 'member x.Member(args) = ...' 標記法。
