Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# parsEofInIfOcaml
source: End of file in IF-OCAML section begun at or before here
cs: Konec souboru začal v oddílu IF-OCAML na této pozici nebo před ní.
de: Dateiende in einem IF-OCAML-Abschnitt, der an oder vor dieser Stelle begonnen wurde.
es: El final del archivo en la sección IF-OCAML comenzaba aquí o antes.
fr: Fin de fichier dans la section IF-OCAML ayant débuté à cet emplacement ou avant
it: La fine del file nella sezione IF-OCAML inizia in questa posizione o prima di essa
ja: この位置以前に始まった IF-OCAML セクションの途中でファイルの終わりが見つかりました
ko: IF-OCAML 섹션의 파일 끝이 여기에서 또는 여기 앞에서 시작되었습니다.
pl: Koniec pliku w sekcji IF-OCAML rozpoczętej w tym miejscu lub przed nim
pt_br: Fim de arquivo na seção de IF-OCAML iniciada aqui ou anteriormente
ru: Конец файла в разделе IF-OCAML начался в этой позиции или до нее
tr: IF-OCAML bölümünde dosya sonu burada veya daha önce başlatıldı
zh_hans: 文件尾在此处或之前开始的 IF-OCAML 节中
zh_hant: IF-OCAML 區段中的檔案結尾於此處或之前開始

# parsEofInDirective
source: End of file in directive begun at or before here
cs: Konec souboru začal v direktivě na této pozici nebo před ní.
de: Dateiende in einer Direktive, die an oder vor dieser Stelle begonnen wurde.
es: El final del archivo en la directiva comenzaba aquí o antes.
fr: Fin de fichier dans la directive ayant débuté à cet emplacement ou avant
it: La fine del file nella direttiva inizia in questa posizione o prima di essa
ja: この位置以前に始まったディレクティブの途中でファイルの終わりが見つかりました
ko: 지시문의 파일 끝이 여기에서 또는 여기 앞에서 시작되었습니다.
pl: Koniec pliku w dyrektywie rozpoczętej w tym miejscu lub przed nim
pt_br: Fim de arquivo na diretiva iniciada aqui ou anteriormente
ru: Конец файла в директиве начался в этой позиции или до нее
tr: Yönergede dosya sonu burada veya daha önce başlatıldı
zh_hans: 文件尾在此处或之前开始的指令中
zh_hant: 指示詞中的檔案結尾於此處或之前開始

# parsNoHashEndIfFound
source: No #endif found for #if or #else
cs: Pro direktivu #if nebo #else se nenašla žádná direktiva #endif.
de: Kein #endif für #if oder #else gefunden.
es: No se encontró #endif para #if o #else.
fr: #endif introuvable pour #if ou #else
it: Nessun #endif trovato per #if o #else
ja: #if または #else の #endif が見つかりません
ko: #if 또는 #else에 대한 #endif를 찾을 수 없습니다.
pl: Nie znaleziono dyrektywy #endif dla dyrektywy #if lub #else
pt_br: Nenhum #endif encontrado para #if ou #else
ru: Отсутствует директива #endif для директивы #if или #else
tr: #if veya #else için bir #endif bulunamadı
zh_hans: 未找到与 #if 或 #else 对应的 #endif
zh_hant: 找不到 #if 或 #else 的 #endif

# parsAttributesIgnored
source: Attributes have been ignored in this construct
cs: Atributy v tomto konstruktoru se ignorovaly.
de: Attribute wurden in diesem Konstrukt ignoriert.
es: Se han omitido los atributos en esta construcción.
fr: Les attributs ont été ignorés dans cette construction
it: Attributi ignorati nel costrutto
ja: このコンストラクトの属性は無視されました
ko: 특성은 이 구문에서 무시되었습니다.
pl: Atrybuty zostały zignorowane w tej konstrukcji
pt_br: Os atributos foram ignorados neste constructo
ru: Атрибуты в этой конструкции пропущены
tr: Bu yapıda öznitelikler yok sayıldı
zh_hans: 此构造中已忽略特性
zh_hant: 已忽略這個建構中的屬性

# parsUseBindingsIllegalInImplicitClassConstructors
source: 'use' bindings are not permitted in primary constructors
cs: U primárních konstruktorů nejsou vazby use povolené.
de: use-Bindungen sind in primären Konstruktoren unzulässig.
es: No se permiten enlaces 'use' en constructores principales.
fr: Les liaisons 'use' ne sont pas autorisées dans les constructeurs principaux
it: Binding 'use' non consentiti in costruttori primari
ja: プライマリ コンストラクターに 'use' 束縛は使用できません
ko: 'use' 바인딩은 기본 생성자에서 허용되지 않습니다.
pl: Powiązania „use” nie są dozwolone w konstruktorach podstawowych
pt_br: As associações 'use' não são permitidas em construtores primários
ru: Использование привязок use в первичных конструкторах не допускается
tr: birincil oluşturucularda 'use' bağlamalarına izin verilmez
zh_hans: 主构造函数中不允许使用“use”绑定
zh_hant: 不允許在主要建構函式中使用 'use' 繫結

# parsUseBindingsIllegalInModules
source: 'use' bindings are not permitted in modules and are treated as 'let' bindings
cs: V modulech nejsou vazby use povolené. Zpracují se jako vazby let.
de: use-Bindungen sind in Modulen nicht zulässig und werden als let-Bindungen behandelt.
es: No se permiten enlaces 'use' en módulos y se tratan como enlaces 'let'.
fr: Les liaisons 'use' ne sont pas autorisées dans les modules et sont considérées comme des liaisons 'let'
it: Binding 'use' non consentiti nei moduli e considerati come binding 'let'
ja: モジュールに 'use' 束縛は使用できません。この束縛は 'let' 束縛として扱われます。
ko: 'use' 바인딩은 모듈에서 허용되지 않으며 'let' 바인딩으로 처리됩니다.
pl: Powiązania „use” nie są dozwolone w modułach i są traktowane jak powiązania „let”
pt_br: Não são permitidas associações 'use' em módulos e são tratadas como ligações 'let'
ru: привязки "use" недопустимы в модулях и обрабатываются как привязки "let"
tr: modüllerde 'use' bağlamalarına izin verilmez ve 'let' bağlamaları gibi işlem yapılır
zh_hans: “use”绑定不允许在模块中使用并且将被视为“let”绑定
zh_hant: 不允許在模組中使用 'use' 繫結，將當做 'let' 繫結處理

# parsIntegerForLoopRequiresSimpleIdentifier
source: An integer for loop must use a simple identifier
cs: Celočíselná smyčka for musí používat jednoduchý identifikátor.
de: Eine Integer-for-Schleife muss einen einfachen Bezeichner verwenden.
es: Un bucle for de entero debe usar un identificador simple.
fr: Un entier d'une boucle doit utiliser un identificateur simple
it: Un Integer per un ciclo deve usare un identificatore semplice
ja: ループの整数には単純な識別子を使用する必要があります
ko: 루프의 정수에는 단순 식별자를 사용해야 합니다.
pl: Pętla for z liczbami całkowitymi musi używać prostego identyfikatora
pt_br: Um inteiro para um loop precisa usar um identificador simples
ru: В целочисленном цикле for необходимо использовать простой идентификатор
tr: Döngü tamsayısı basit tanımlayıcı kullanmalıdır
zh_hans: 用于循环的整数必须使用简单的标识符
zh_hant: 用於迴圈的整數必須使用簡單識別碼

# parsOnlyOneWithAugmentationAllowed
source: At most one 'with' augmentation is permitted
cs: Povoluje se nanejvýš jedno rozšíření with.
de: Es ist maximal eine with-Augmentation zulässig.
es: Solo se permite un aumento 'with' como máximo.
fr: Une seule augmentation 'with' est autorisée
it: È consentito al massimo un aumento 'with'
ja: 使用できる 'with' の拡張の数は 1 以下です
ko: 최대 하나의 'with' 확대가 허용됩니다.
pl: Dozwolone jest najwyżej jedno rozszerzenie „with”
pt_br: No máximo um aumento 'with' é permitido
ru: Допускается использование не более одного приращения "with"
tr: En çok bir 'with' genişletmesine izin verilir
zh_hans: 最多允许一个“with”扩大
zh_hant: 最多只允許一個 'with' 增強指定

# parsUnexpectedSemicolon
source: A semicolon is not expected at this point
cs: Středník se na této pozici neočekává.
de: An dieser Stelle wird kein Semikolon erwartet.
es: No se espera un punto y coma en este punto.
fr: Point-virgule inattendu à cet emplacement
it: Punto e virgola non previsto in questo punto
ja: この位置にセミコロンは使用できません
ko: 여기서는 세미콜론이 필요하지 않습니다.
pl: Średnik nie jest oczekiwany w tym miejscu
pt_br: Não é esperado ponto-e-vírgula neste ponto
ru: В этой точке кода не требуется точка с запятой
tr: Bu aşamada noktalı virgül beklenmiyor
zh_hans: 此时不应有分号
zh_hant: 目前不需要分號

# parsUnexpectedEndOfFile
source: Unexpected end of input
cs: Neočekávaný konec vstupu
de: Unerwartetes Ende der Eingabe
es: Final de entrada inesperado.
fr: Fin d'entrée inattendue
it: Fine di input non prevista
ja: 予期しない入力の終わりです:
ko: 예기치 않은 입력의 끝입니다.
pl: Nieoczekiwany koniec danych wejściowych
pt_br: Final da entrada inesperado
ru: Непредвиденный конец входных данных
tr: Beklenmeyen giriş sonu
zh_hans: 意外的输入结束
zh_hant: 未預期的輸入結束

# parsUnexpectedVisibilityDeclaration
source: Accessibility modifiers are not permitted here, but '{0}' was given.
cs: Modifikátory dostupnosti tady nejsou povolené, ale předal se modifikátor {0}.
de: Zugriffsmodifizierer sind an dieser Stelle nicht zulässig, "{0}" wurde jedoch angegeben.
es: No se permiten modificadores de accesibilidad aquí, pero se proporcionó "{0}".
fr: Les modificateurs d'accessibilité ne sont pas autorisés ici mais '{0}' a été spécifié.
it: I modificatori di accessibilità non sono consentiti in questa posizione, ma è stato specificato '{0}'.
ja: ここではアクセシビリティ修飾子を使用できませんが、'{0}' が指定されました。
ko: 액세스 가능성 한정자는 여기에 허용되지 않지만, '{0}'이(가) 지정되었습니다.
pl: Modyfikatory dostępności nie są tutaj dozwolone, ale podano element „{0}”.
pt_br: Os modificadores de acessibilidade não são permitidos aqui, mas '{0}' foi fornecido.
ru: Использование модификаторов доступности не допускается, но указан "{0}".
tr: Erişilebilirlik değiştiricilerine burada izin verilmez, ancak '{0}' belirtildi.
zh_hans: 此处不允许使用可访问性修饰符，但却给出了“{0}”。
zh_hant: 此處不得使用存取範圍修飾詞，但卻提供了 '{0}'。

# parsOnlyHashDirectivesAllowed
source: Only '#' compiler directives may occur prior to the first 'namespace' declaration
cs: Před první deklarací namespace se dají použít jenom direktivy kompilátoru #.
de: Nur #-Compilerdirektiven dürfen vor der ersten namespace-Deklaration auftreten.
es: Solo las directivas de compilador '#' pueden tener lugar antes de la primera declaración 'namespace'.
fr: Seules les directives du compilateur '#' peuvent être présentes avant la première déclaration 'namespace'
it: Prima della prima dichiarazione 'namespace' possono essere presenti solo direttive '#' del compilatore
ja: 最初の 'namespace' 宣言の前に指定できるのは、'#' コンパイラ ディレクティブのみです
ko: '#' 컴파일러 지시문만 첫 번째 'namespace' 선언 앞에 발생할 수 있습니다.
pl: Tylko dyrektywy kompilatora „#” mogą występować przed pierwszą deklaracją „namespace”
pt_br: Apenas diretivas de compilador '#' podem ficar antes da primeira declaração de 'namespace'
ru: Перед первым объявлением "namespace" можно указывать только директивы компилятора "#"
tr: İlk 'namespace' bildiriminden önce yalnızca '#' derleyici yönergeleri gerçekleşebilir
zh_hans: 只有“#”编译器指令可以在第一个“namespace”声明之前出现
zh_hant: 在第一個 'namespace' 宣告前只能出現 '#' 編譯器指示詞

# parsVisibilityDeclarationsShouldComePriorToIdentifier
source: Accessibility modifiers should come immediately prior to the identifier naming a construct
cs: Modifikátory dostupnosti by se měly umístit bezprostředně před identifikátor, který pojmenovává konstruktor.
de: Zugriffsmodifizierer sollten unmittelbar vor dem Bezeichner eines Konstrukts aufgeführt sein.
es: Los modificadores de accesibilidad deben ir inmediatamente delante del identificador que da nombre a una construcción.
fr: Les modificateurs d'accessibilité doivent être placés immédiatement avant l'identificateur qui nomme une construction
it: I modificatori di accessibilità devono trovarsi immediatamente prima dell'identificatore di denominazione di un costrutto
ja: アクセシビリティ修飾子は、コンストラクトを示す識別子の直前に指定する必要があります
ko: 액세스 가능성 한정자는 구문의 이름을 지정하는 식별자 바로 앞에 와야 합니다.
pl: Modyfikatory dostępności powinny występować bezpośrednio przed identyfikatorem konstrukcji
pt_br: Modificadores de acessibilidade devem vir imediatamente antes do identificador na nomeação de um constructo
ru: Модификаторы доступности следует указывать непосредственно перед идентификатором, определяющим имя конструкции
tr: Erişilebilirlik değiştiricileri bir yapıyı adlandıran tanımlayıcıdan hemen önce gelmelidir
zh_hans: 可访问性修饰符应紧接在用于命名构造函数的标识符的前面
zh_hant: 存取範圍修飾詞應該放在為建構命名的識別碼正前方

# parsNamespaceOrModuleNotBoth
source: Files should begin with either a namespace or module declaration, e.g. 'namespace SomeNamespace.SubNamespace' or 'module SomeNamespace.SomeModule', but not both. To define a module within a namespace use 'module SomeModule = ...'
cs: Soubory by měly začínat buď oborem názvů, nebo deklarací modulu, třeba namespace SomeNamespace.SubNamespace nebo module SomeNamespace.SomeModule, nejde ale použít obojí. Pokud chcete definovat modul uvnitř oboru názvů, použijte syntaxi module SomeModule = ...
de: Dateien sollten mit einer Namespace- oder einer Moduldeklaration beginnen, z.B. "namespace SomeNamespace.SubNamespace" oder "module SomeNamespace.SomeModule", aber nicht mit beidem. Verwenden Sie "module SomeModule = ...", um ein Modul in einem Namespace zu definieren.
es: Los archivos deben comenzar con una declaración de espacio de nombres o de módulo; por ejemplo, 'namespace SomeNamespace.SubNamespace' o 'module SomeNamespace.SomeModule', pero no ambas. Para definir un módulo en un espacio de nombres, use 'module SomeModule = ...'.
fr: Les fichiers doivent commencer par un espace de noms ou une déclaration de module, par exemple 'namespace SomeNamespace.SubNamespace' ou 'module SomeNamespace.SomeModule', mais pas les deux. Pour définir un module dans un espace de noms, utilisez 'module SomeModule = ...'
it: I file devono iniziare con una dichiarazione di modulo o di spazio dei nomi, ad esempio 'namespace SpazioNomi.SottoSpazioNomi' oppure 'module SpazioNomi.Modulo', ma non con entrambe. Per definire un modulo all'interno di uno spazio dei nomi utilizzare 'module Modulo = ...'
ja: ファイルは名前空間またはモジュールの宣言から開始する必要があります。たとえば、'namespace SomeNamespace.SubNamespace'、'module SomeNamespace.SomeModule' などです。ただし、両方は指定しません。名前空間内でモジュールを定義するには、'module SomeModule = ...' を使用してください。
ko: 파일은 네임스페이스 또는 모듈 선언으로 시작해야 하지만(예: 'namespace SomeNamespace.SubNamespace' 또는 'module SomeNamespace.SomeModule') 둘 다로 시작할 수는 없습니다. 네임스페이스 내에 모듈을 정의하려면 'module SomeModule = ...'을 사용하세요.
pl: Pliki powinny rozpoczynać się od deklaracji przestrzeni nazw lub modułu (np. „namespace PrzestrzeńNazw.PodrzędnaPrzestrzeńNazw” lub „module PrzestrzeńNazw.Moduł”), ale nie od obu. Aby zdefiniować moduł w przestrzeni nazw, użyj konstrukcji „module Moduł = ...”
pt_br: Os arquivos devem começar com a declaração de um namespace ou de um módulo, como 'namespace SomeNamespace.SubNamespace' ou 'module SomeNamespace.SomeModule', mas não ambos. Para definir um módulo dentro de um namespace, use 'module SomeModule =...'
ru: В начале файла необходимо указывать либо пространство имен либо объявление модуля, например "namespace SomeNamespace.SubNamespace" или "module SomeNamespace.SomeModule". Чтобы определить модуль внутри пространства имен, используйте синтаксис "module SomeModule = ..."
tr: Dosyalar ad alanıyla veya modül bildirimiyle başlamalıdır, örn. 'namespace SomeNamespace.SubNamespace' veya 'module SomeNamespace.SomeModule', ikisiyle birden değil. Ad alanı içinde bir modül tanımlamak için 'module SomeModule = ...' kullanın
zh_hans: 文件应以命名空间或模块声明(例如“namespace SomeNamespace.SubNamespace”或“module SomeNamespace.SomeModule”)开头，而不是同时以二者开头。若要定义命名空间中的模块，请使用“module SomeModule = ...”
zh_hant: 檔案應該以命名空間或模組宣告開始，例如 'namespace SomeNamespace.SubNamespace' 或 'module SomeNamespace.SomeModule'，但不能兩者都有。若要在命名空間中定義模組，請使用 'module SomeModule = ...'

# parsModuleAbbreviationMustBeSimpleName
source: A module abbreviation must be a simple name, not a path
cs: Jako zkratku modulu musíte zadat jednoduchý název, ne cestu.
de: Eine Modulabkürzung muss ein einfacher Name sein, kein Pfad.
es: Una abreviación de módulo debe ser un nombre simple, no una ruta de acceso.
fr: Une abréviation de module doit être un nom simple et non un chemin d'accès
it: L'abbreviazione di un modulo deve essere un nome semplice, non un percorso
ja: モジュールの省略形はパスではなく簡易名にする必要があります
ko: 모듈 약어는 경로가 아니라 단순 이름이어야 합니다.
pl: Skrót modułu musi być prostą nazwą, a nie ścieżką
pt_br: Uma abreviação de módulo precisa ser um nome simples, não um caminho
ru: Сокращенная форма модуля может быть простым именем, но не путем
tr: Modül kısaltması yol değil, basit ad olmalıdır
zh_hans: 模块缩写词必须是简单名称，而非路径
zh_hant: 模組縮寫必須是簡單名稱，不是路徑

# parsIgnoreAttributesOnModuleAbbreviation
source: Ignoring attributes on module abbreviation
cs: Atributy u zkratky modulu se ignorují.
de: Attribute für Modulabkürzung werden ignoriert.
es: Omitiendo los atributos en la abreviación de módulo.
fr: Attributs ignorés pour l'abréviation du module
it: Gli attributi nell'abbreviazione del modulo verranno ignorati
ja: モジュールの省略形にある属性を無視します
ko: 모듈 약어의 특성을 무시합니다.
pl: Ignorowanie atrybutów w skrócie modułu
pt_br: Ignorando atributos em abreviação de módulo
ru: Пропуск атрибутов в сокращенной форме модуля
tr: Modül kısaltmasındaki öznitelikler yoksayılıyor
zh_hans: 在模块缩写词中忽略特性
zh_hant: 即將忽略模組縮寫的屬性

# parsIgnoreAttributesOnModuleAbbreviationAlwaysPrivate
source: The '{0}' accessibility attribute is not allowed on module abbreviation. Module abbreviations are always private.
cs: Atribut přístupu {0} se u zkratky modulu nepovoluje. Zkratky modulu jsou vždycky privátní.
de: Das Zugriffsattribut "{0}" ist für die Modulabkürzung nicht zulässig. Modulabkürzungen sind immer privat.
es: El atributo de accesibilidad "{0}" no se permite en la abreviación de módulo. Las abreviaciones de módulo son siempre privadas.
fr: L'attribut d'accessibilité '{0}' n'est pas autorisé pour l'abréviation du module. Les abréviations de module sont toujours privées.
it: L'attributo di accessibilità '{0}' non è consentito nell'abbreviazione del modulo. Le abbreviazioni dei moduli sono sempre private.
ja: モジュールの省略形には '{0}' アクセシビリティ属性を使用できません。モジュールの省略形は常にプライベートです。
ko: '{0}' 액세스 가능성 특성이 모듈 약어에서 허용되지 않습니다. 모듈 약어는 항상 Private입니다.
pl: Atrybut dostępności „{0}” nie jest dozwolony w skrócie modułu. Skróty modułu zawsze są prywatne.
pt_br: O atributo de acessibilidade '{0}' não é permitido na abreviação de módulo. As abreviações de módulo são sempre particulares.
ru: Атрибут доступности "{0}" запрещен в сокращенной форме модуля. В сокращенных формах модуля всегда используются закрытые атрибуты.
tr: Modül kısaltmasında '{0}' erişilebilirlik özniteliğine izin verilmez. Modül kısaltmaları her zaman özeldir.
zh_hans: 模块缩写词中不允许“{0}”可访问性特性。模块缩写词总是私有的。
zh_hant: 模組縮寫不得包含 '{0}' 存取範圍屬性。模組縮寫一律為私用。

# parsIgnoreVisibilityOnModuleAbbreviationAlwaysPrivate
source: The '{0}' visibility attribute is not allowed on module abbreviation. Module abbreviations are always private.
cs: Atribut viditelnosti {0} se u zkratky modulu nepovoluje. Zkratky modulu jsou vždycky privátní.
de: Das Sichtbarkeitsattribut "{0}" ist für die Modulabkürzung nicht zulässig. Modulabkürzungen sind immer privat.
es: El atributo de visibilidad "{0}" no se permite en la abreviación de módulo. Las abreviaciones de módulo son siempre privadas.
fr: L'attribut de visibilité '{0}' n'est pas autorisé pour l'abréviation du module. Les abréviations de module sont toujours privées.
it: L'attributo di visibilità '{0}' non è consentito nell'abbreviazione del modulo. Le abbreviazioni dei moduli sono sempre private.
ja: モジュールの省略形には '{0}' 表示範囲属性を使用できません。モジュールの省略形は常にプライベートです。
ko: '{0}' 표시 유형 특성이 모듈 약어에서 허용되지 않습니다. 모듈 약어는 항상 Private입니다.
pl: Atrybut widoczności „{0}” nie jest dozwolony w skrócie modułu. Skróty modułu zawsze są prywatne.
pt_br: O atributo de visibilidade '{0}' não é permitido na abreviação de módulo. As abreviações de módulo são sempre particulares.
ru: Атрибут видимости "{0}" запрещен в сокращенной форме модуля. В сокращенных формах модуля всегда используются закрытые атрибуты.
tr: Modül kısaltmasında '{0}' görünürlük özniteliğine izin verilmez. Modül kısaltmaları her zaman özeldir.
zh_hans: 模块缩写词中不允许“{0}”可见性特性。模块缩写词总是私有的。
zh_hant: 模組縮寫不得包含 '{0}' 可見度屬性。模組縮寫一律為私用。

# parsUnClosedBlockInHashLight
source: Unclosed block
cs: Neuzavřený blok
de: Nicht geschlossener Block.
es: Bloque sin cerrar.
fr: Bloc non fermé
it: Blocco non risolto
ja: ブロックが閉じられていません
ko: 블록이 닫히지 않았습니다.
pl: Niezamknięty blok
pt_br: Bloco não foi fechado
ru: Незакрытый блок
tr: Kapatılmamış blok
zh_hans: 未封闭的块
zh_hant: 未封閉的區塊

# parsUnmatchedBeginOrStruct
source: Unmatched 'begin' or 'struct'
cs: Nespárované klíčové slovo begin nebo struct
de: Keine Entsprechung für "begin" oder "struct".
es: 'begin' o 'struct' desemparejado.
fr: 'begin' ou 'struct' non apparié
it: 'begin' o 'struct' senza corrispondenza
ja: 'begin' または 'struct' が対応しません
ko: 'begin' 또는 'struct'의 짝이 맞지 않습니다.
pl: Niedopasowany element „begin” lub „struct”
pt_br: 'begin' ou 'struct' incompatível
ru: Несогласованный "begin" или "struct"
tr: Eşleşmeyen 'begin' veya 'struct'
zh_hans: 不匹配的“begin”或“struct”
zh_hant: 無對應的 'begin' 或 'struct'

# parsModuleDefnMustBeSimpleName
source: A module name must be a simple name, not a path
cs: Jako název modulu musíte zadat jednoduchý název, ne cestu.
de: Ein Modulname muss ein einfacher Name sein, kein Pfad.
es: Un nombre de módulo debe ser un nombre simple, no una ruta de acceso.
fr: Un nom de module doit être un nom simple et non un chemin d'accès
it: Il nome di un modulo deve essere un nome semplice, non un percorso
ja: モジュール名はパスではなく簡易名にする必要があります
ko: 모듈 이름은 경로가 아니라 단순 이름이어야 합니다.
pl: Nazwa modułu musi być prostą nazwą, a nie ścieżką
pt_br: Um nome de módulo precisa ser um nome simples, não um caminho
ru: Имя модуля может быть простым именем, но не путем
tr: Modül adı yol değil, basit ad olmalıdır
zh_hans: 模块名称必须是简单名称，而非路径
zh_hant: 模組名稱必須是簡單名稱，不是路徑

# parsUnexpectedEmptyModuleDefn
source: Unexpected empty type moduleDefn list
cs: Neočekávaný prázdný seznam typu moduleDefn
de: Unerwartete moduleDefn-Liste mit leerem Typ.
es: Lista inesperada de moduleDefn de tipos vacía.
fr: Liste moduleDefn de type vide inattendue
it: Elenco moduleDefn di tipo vuoto non previsto
ja: 予期しない空の型の moduleDefn リストです:
ko: 예기치 않은 빈 형식 moduleDefn 목록입니다.
pl: Nieoczekiwana pusta lista typu moduleDefn
pt_br: Lista de moduleDefn do tipo vazio inesperada
ru: Недопустимый пустой список типа moduleDefn
tr: Beklenmeyen boş tür moduleDefn listesi
zh_hans: 意外的空类型 moduleDefn 列表
zh_hant: 未預期的空白類型 moduleDefn 清單

# parsAttributesMustComeBeforeVal
source: Attributes should be placed before 'val'
cs: Správné umístění atributů je před val.
de: Attribute sollten vor "val" platziert werden.
es: Los atributos deben ponerse delante de 'val'.
fr: Les attributs doivent être placés avant 'val'
it: Gli attributi devono trovarsi prima di 'val'
ja: 属性は 'val' の前に配置してください
ko: 특성은 'val' 앞에 배치해야 합니다.
pl: Atrybuty powinny być umieszczone przed elementem „val”
pt_br: Atributos devem ser localizados antes de 'val'
ru: Атрибуты не должны располагаться перед выражением "val"
tr: Öznitelikler 'val' öğesinin önüne konulmalıdır
zh_hans: 特性应置于“val”之前
zh_hant: 屬性應該放在 'val' 之前

# parsAttributesAreNotPermittedOnInterfaceImplementations
source: Attributes are not permitted on interface implementations
cs: Atributy nejsou u implementací rozhraní povolené.
de: Attribute sind für Schnittstellenimplementierungen nicht zulässig.
es: No se permiten atributos en implementaciones de interfaz.
fr: Les attributs ne sont pas autorisés dans les implémentations d'interfaces
it: Attributi non consentiti in implementazioni di interfaccia
ja: インターフェイスの実装に属性は使用できません
ko: 특성은 인터페이스 구현에서 허용되지 않습니다.
pl: Atrybuty są niedozwolone w implementacjach interfejsu
pt_br: Os atributos não são permitidos em implementações de interface
ru: Использование атрибутов в реализациях интерфейса не допускается
tr: Arabirim uygulamalarında özniteliklere izin verilmez
zh_hans: 不允许对接口实现使用特性
zh_hant: 不允許在介面實作上使用屬性

# parsSyntaxError
source: Syntax error
cs: chyba syntaxe
de: Syntaxfehler
es: error de sintaxis
fr: erreur de syntaxe
it: Errore di sintassi
ja: 構文エラーです
ko: 구문 오류입니다.
pl: błąd składni
pt_br: Erro de sintaxe
ru: синтаксическая ошибка
tr: Söz dizimi hatası
zh_hans: 语法错误
zh_hant: 語法錯誤

# parsAugmentationsIllegalOnDelegateType
source: Augmentations are not permitted on delegate type moduleDefns
cs: Rozšíření nejsou u typu delegáta moduleDefns povolená.
de: Augmentationen sind für den Delegattyp "moduleDefns" nicht zulässig.
es: No se permiten aumentos en moduleDefns de tipo de delegado.
fr: Les augmentations ne sont pas autorisées sur le type délégué moduleDefns
it: Aumenti non consentiti in elementi moduleDefns di tipo delegato
ja: デリゲート型 moduleDefns では拡張が許可されていません
ko: 확대는 대리자 형식 moduleDefns에서 허용되지 않습니다.
pl: Rozszerzenia są niedozwolone w typie delegata moduleDefns.
pt_br: Aumentos não são permitidos no tipo delegado moduleDefns
ru: Использование приращений для типа делегата moduleDefns не допускается
tr: moduleDefns temsilci türünde genişletmelere izin verilmiyor
zh_hans: 不允许对委托类型 moduleDefns 使用扩大
zh_hant: 不允許在委派類型 moduleDefns 上使用增強指定
