Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# keywordDescriptionStruct
source: Used to declare a structure type. Also used in generic parameter constraints. Used for OCaml compatibility in module definitions.
cs: Slouží k deklaraci typu struktury. Používá se také v omezeních obecných parametrů. V definicích modulů se používá kvůli kompatibilitě s OCaml.
de: Wird verwendet, um einen Strukturtyp zu deklarieren. Wird auch in generischen Parameterbeschränkungen verwendet. Wird für die OCaml-Kompatibilität in Moduldefinitionen verwendet.
es: Se usa para declarar un tipo de estructura y también en las restricciones de parámetro genérico. Además, se usa en las definiciones de módulo por motivos de compatibilidad con OCaml.
fr: Permet de déclarer un type structure. Utilisé également dans les contraintes de paramètre générique. Utilisé pour la compatibilité OCaml dans les définitions de module.
it: Usata per dichiarare un tipo di struttura. Usata anche nei vincoli di parametri generici. Usata per garantire la compatibilità con OCaml nelle definizioni di moduli.
ja: 構造体型の宣言に使用します。ジェネリック パラメーターの制約にも使用します。モジュール定義の OCaml の互換性を保つために使用します。
ko: 구조체 형식을 선언하는 데 사용됩니다. 제네릭 매개 변수 제약 조건에서도 사용됩니다. 모듈 정의에서 OCaml 호환성에 대해 사용됩니다.
pl: Używane do deklarowania typu struktury, w ograniczeniach parametrów ogólnych oraz na potrzeby zgodności OCami w definicjach modułu.
pt_br: Usado para declarar um tipo de estrutura. Também usado nas restrições de parâmetro genérico. Usado para compatibilidade OCaml nas definições do módulo.
ru: Используется для объявления типа структуры. Также используется в ограничениях универсальных параметров. Используется для обеспечения совместимости с OCaml в определениях модулей.
tr: Yapı türü bildirmek için kullanılır. Ayrıca genel parametre kısıtlamaları içinde kullanılır. Modül tanımlarında OCaml uyumluluğu için kullanılır.
zh_hans: 用于声明结构类型。另外，也用于泛型参数约束。用于模块定义中的 OCaml 兼容性。
zh_hant: 用以宣告結構類型。也會用在泛型參數條件約束中。用於模組定義中的 OCaml 相容性。

# keywordDescriptionThen
source: Used in conditional expressions. Also used to perform side effects after object construction.
cs: Používá se podmíněných výrazech. Slouží rovněž k provedení vedlejších efektů po konstrukci objektu.
de: Wird in Bedingungsausdrücken verwendet. Wird auch verwendet, um nach der Objektkonstruktion Nebeneffekte auszuführen.
es: Se usa en las expresiones condicionales y también para generar efectos secundarios después de la construcción de objetos.
fr: Utilisé dans les expressions conditionnelles. Utilisé également pour provoquer des effets secondaires après une construction d'objet.
it: Usata nelle espressioni condizionali. Usata anche per ottenere effetti collaterali dopo la costruzione di oggetti.
ja: 条件分岐で使用します。オブジェクトの構築後の副作用の実行にも使用します。
ko: 조건식에 사용됩니다. 또한 개체 생성 후 파생 작업을 수행하는 데 사용됩니다.
pl: Używane w wyrażeniach warunkowych oraz do wykonywania efektów ubocznych po skonstruowaniu obiektu.
pt_br: Usado em expressões condicionais. Também usado para desempenhar efeitos colaterais depois de construção de objeto.
ru: Используется в условных выражениях. Также используется для выполнения побочных эффектов после создания объекта.
tr: Koşullu ifadelerde kullanılır. Ayrıca nesne oluşturmadan sonra yan etkileri gerçekleştirmek için kullanılır.
zh_hans: 用于条件表达式。另外，也用于处理构造对象后的意外结果。
zh_hant: 用於條件運算式。也可在物件建構後用來執行副作用。

# keywordDescriptionTo
source: Used in for loops to indicate a range.
cs: Slouží k označení rozsahu v cyklech.
de: Wird in for-Schleifen zum Angeben eines Bereichs verwendet.
es: Se usa en los bucles for para indicar un intervalo.
fr: Utilisé dans les boucles for pour indiquer une portée.
it: Usata nei cicli for per indicare un intervallo.
ja: for ループで範囲を示します。
ko: 범위를 나타내기 위해 루프에 사용됩니다.
pl: Używane w pętlach do wskazywania zakresu.
pt_br: Usado em loops para indicar um intervalo.
ru: Используется в циклах for для обозначения диапазона.
tr: For döngülerinde aralık belirtmek için kullanılır.
zh_hans: 在 for 循环中用于表示范围。
zh_hant: 用於 for 迴圈以指出範圍。

# keywordDescriptionTry
source: Used to introduce a block of code that might generate an exception. Used together with with or finally.
cs: Slouží k uvození bloku kódu, který může vygenerovat výjimku. Používá se společně s with nebo finally.
de: Wird verwendet, um einen Codeblock einzuführen, der unter Umständen eine Ausnahme generiert. Wird zusammen mit "with" oder "finally" verwendet.
es: Se usa para incluir un bloque de código que puede generar una excepción. Se usa junto con with o finally.
fr: Permet d'introduire un bloc de code pouvant générer une exception. Utilisé avec with ou finally.
it: Usata per introdurre un blocco di codice che potrebbe generare un'eccezione. Usata insieme a with o finally.
ja: 例外を生成する可能性があるコード ブロックを開始するために使用します。with または finally と一緒に使用します。
ko: 예외를 생성할 수 있는 코드 블록을 지정하는 데 사용됩니다. with 또는 finally와 함께 사용됩니다.
pl: Używane do wprowadzania bloku kodu, który może generować wyjątek. Używane razem ze słowem kluczowym with lub finally.
pt_br: Usado para introduzir um bloco de código que pode gerar uma exceção. Usado junto com with ou finally.
ru: Используется для введения блока кода, который может создать исключение. Используется вместе с with или finally.
tr: Özel durum oluşturabilen bir kod bloğunu tanıtmak için kullanılır. with veya finally ile birlikte kullanılır.
zh_hans: 用于引入可能产生异常的代码块。与 with 或 finally 配合使用。
zh_hant: 用於引入可能會產生例外狀況的程式碼區塊。這會與 with 或 finally 並用。

# keywordDescriptionType
source: Used to declare a class, record, structure, discriminated union, enumeration type, unit of measure, or type abbreviation.
cs: Slouží k deklaraci třídy, záznamu, struktury, rozlišeného sjednocení, výčtového typu, měrné jednotky nebo zkratky typu.
de: Wird verwendet, um Klassen, Datensätze, Strukturen, Unterscheidungs-Unions, Enumerationstypen, Maßeinheiten oder Typenabkürzungen zu deklarieren.
es: Se usa para declarar una clase, un registro, una estructura, una unión discriminada, un tipo de enumeración, una unidad de medida o una abreviatura de tipo.
fr: Permet de déclarer une classe, un enregistrement, une structure, une union discriminée, un type énumération, une unité de mesure ou une abréviation de type.
it: Usata per dichiarare una classe, un record, una struttura, un'unione discriminata, un tipo di enumerazione, un'unità di misura o un'abbreviazione di un tipo.
ja: クラス、レコード、構造体、判別された共同体、列挙型、数量単位、型の省略形の宣言に使用します。
ko: 클래스, 레코드, 구조체, 구분된 공용 구조체, 열거형 형식, 측정 단위 또는 형식 약어를 선언하는 데 사용됩니다.
pl: Używane do deklarowania klasy, rekordu, struktury, unii rozłącznej, typu wyliczeniowego, jednostki miary lub skrótu typu.
pt_br: Usado para declarar uma classe, registro, estrutura, união discriminada, tipo de enumeração, unidade de medida ou abreviação de tipo.
ru: Используется для объявления класса, записи, структуры, размеченного объединения, типа перечисления, единицы измерения или аббревиатуры типа.
tr: Bir sınıf, kayıt, yapı, ayırt edici birleşim, sabit listesi türü, ölçü birimi veya tür kısaltması bildirmek için kullanılır.
zh_hans: 用于声明类、记录、结构、可区分的联合、枚举类型、度量单位或类型缩写。
zh_hant: 用以宣告類別、記錄、結構、差別聯集、列舉類型、測量單位或類型縮寫。

# keywordDescriptionUpcast
source: Used to convert to a type that is higher in the inheritance chain.
cs: Slouží k převodu na typ, který je na vyšší pozici v řetězu dědičnosti.
de: Wird zum Konvertieren in einen Typ verwendet, der in Vererbungskette niedriger ist.
es: Se usa para realizar la conversión a un tipo situado en un nivel superior de la cadena de herencia.
fr: Permet de convertir en un type supérieur dans la chaîne d'héritage.
it: Usata per eseguire la conversione in un tipo che occupa una posizione più alta nella catena di ereditarietà.
ja: 継承チェーン内の上位の型に変換するために使用します。
ko: 상속 체인에서 더 높은 형식으로 변환하는 데 사용됩니다.
pl: Używane do konwertowania na typ znajdujący się wyżej w łańcuchu dziedziczenia.
pt_br: Usada para converter para um tipo que é superior na cadeia de herança.
ru: Используется для преобразования в тип, который находится выше в цепочке наследования.
tr: Devralma zincirinde daha yukarıda bulunan bir türe dönüştürmek için kullanılır.
zh_hans: 用于转换为较高继承链中的类型。
zh_hant: 用以將類型轉換為繼承鏈結中較高的類型。

# keywordDescriptionUse
source: Used instead of let for values that implement IDisposable
cs: Používá se místo let pro hodnoty, které implementují IDisposable.
de: Wird anstelle von "let" für Werte verwendet, die die IDisposable-Schnittstelle implementieren
es: Utilizado en lugar de let para valores que implementan IDisposable
fr: Utilisé au lieu de let pour les valeurs qui implémentent IDisposable
it: Usata al posto di let per valori che implementano IDisposable
ja: IDisposable を実装する値に対して let の代わりに使用します
ko: IDisposable을 구현하는 값에 let 대신 사용되었습니다.
pl: Używane zamiast powiązania let dla wartości implementujących interfejs IDisposable
pt_br: Used em vez de let para valores que implementam IDisposable
ru: Используется вместо let для значений, которые реализуют IDisposable
tr: IDisposable uygulayan değerler için let yerine kullanılır
zh_hans: 代替 let 用于实现 IDisposable 的值
zh_hant: 對於實作 IDisposable 的值，會使用此項而非 let

# keywordDescriptionUseBang
source: Used instead of let! in computation expressions for computation expression results that implement IDisposable.
cs: Používá se místo let! ve výpočetních výrazech pro výsledky výpočetních výrazů, které implementují IDisposable.
de: Wird anstelle von "let!" in Berechnungsausdrücken für Ergebnisse von Berechnungsausdrücken verwendet, die "IDisposable" verwenden.
es: Utilizado en lugar de let! en expresiones de cálculo para resultados de expresiones de cálculo que implementan IDisposable.
fr: Utilisé au lieu de let! dans les expressions de calcul pour des résultats d'expression de calcul qui implémentent IDisposable.
it: Usata al posto di let! in espressioni di calcolo per risultati di espressioni di calcolo che implementano IDisposable.
ja: IDisposable を実装する計算式の結果に、計算式で let! の代わりに使用されます。
ko: IDisposable을 구현하는 계산 식 결과를 위해 계산 식에서 let! 대신 사용됩니다.
pl: Używane zamiast powiązania let! w wyrażeniach obliczeń, aby uzyskać wyniki wyrażenia obliczeń implementujące interfejs IDisposable.
pt_br: Usado em vez de let! em expressões de computação para resultados de expressão de computação que implementam IDisposable.
ru: Используется вместо let! в вычислительных выражениях для вычисления результатов выражения, которые реализуют интерфейс IDisposable.
tr: IDisposable uygulayan hesaplama ifadesi sonuçları için hesaplama ifadelerinde let! yerine kullanılır.
zh_hans: 用于替代计算表达式中的 let! 来处理实现 IDisposable 的计算表达式结果。
zh_hant: 在計算運算式中用來取代 let!，以得出會實作 IDisposable 的計算運算式結果。

# keywordDescriptionVal
source: Used in a signature to indicate a value, or in a type to declare a member, in limited situations.
cs: Slouží k označení hodnoty v signatuře nebo v určitých situacích k deklarování člena v daném typu.
de: Wird in einer Signatur verwendet, um einen Wert anzugeben, oder in wenigen Situationen in einem Typ, um einen Member zu deklarieren.
es: Se usa en una signatura para indicar un valor o en un tipo para declarar un miembro, en situaciones muy concretas.
fr: Utilisé dans une signature pour indiquer une valeur, ou dans un type pour déclarer un membre, dans des situations limitées.
it: Usata in una firma per indicare un valore oppure in un tipo per dichiarare un membro, in situazioni limitate.
ja: 限定された状態において、シグネチャで値を示したり、型でメンバーを宣言したりするために使用されます。
ko: 시그니처에 사용되어 값을 나타내거나 형식에 사용되어 제한된 상황에서 멤버를 선언합니다.
pl: Używane w podpisie do wskazywania wartości lub w typie do deklarowania elementu członkowskiego w pewnych określonych sytuacjach.
pt_br: Usado em uma assinatura para indicar um valor ou em um tipo para declarar um membro em situações limitadas.
ru: Используется в сигнатуре для обозначения значения или в типе для объявления члена (в ограниченных ситуациях).
tr: Değer belirtmek için imzada veya sınırlı durumlarda üye bildirmek için türde kullanılır.
zh_hans: 在签名中用于表示值，或在类型中用于声明成员，但情况有限。
zh_hant: 在有限的情形下用於簽章中以指出值，或於類型中以宣告成員。

# keywordDescriptionVoid
source: Indicates the .NET void type. Used when interoperating with other .NET languages.
cs: Označuje prázdný typ .NET. Používá se při vzájemné spolupráci s jinými jazyky .NET.
de: Gibt den .NET-void-Typ an. Wird bei der Interaktion mit anderen .NET-Sprachen verwendet.
es: Indica el tipo void de .NET. Se usa al interoperar con otros lenguajes .NET.
fr: Indique le type void .NET. Utilisé durant l'interaction avec d'autres langages .NET.
it: Indica il tipo void .NET. Usata in caso di interoperatività con altri linguaggi .NET.
ja: .NET の void 型を示します。他の .NET 言語と相互運用するときに使用します。
ko: .NET void 형식을 나타냅니다. 다른 .NET 언어와 상호 운용할 때 사용됩니다.
pl: Wskazuje typ void technologii .NET. Używane w przypadku współdziałania z innymi językami .NET.
pt_br: Indica o tipo void .NET. Usado ao interoperar com outras linguagens .NET.
ru: Обозначает тип void .NET. Используется при взаимодействии с другими языками .NET.
tr: .NET void türünü belirtir. Diğer .NET dilleriyle birlikte çalışırken kullanılır.
zh_hans: 表示 .NET void 类型。在与其他 .NET 语言交互操作时使用。
zh_hant: 指出 .NET void 類型。在與其他 .NET 語言交互操作時使用。

# keywordDescriptionWhen
source: Used for Boolean conditions (when guards) on pattern matches and to introduce a constraint clause for a generic type parameter.
cs: Používá se pro logické podmínky (klauzule when) u porovnávání vzorů a k uvození klauzule omezení parametru obecného typu.
de: Wird für boolesche Bedingungen (when-Klausel) bei Musterabgleichen sowie zum Einführen einer Einschränkungsklausel für einen generischen Typparameterparameter verwendet.
es: Se usa para condiciones booleanas (restricciones when) en coincidencias de patrones y para introducir una cláusula de restricción de un parámetro de tipo genérico.
fr: Utilisé pour les conditions booléennes (when guards) sur des critères spéciaux et pour introduire une clause de contrainte d'un paramètre de type générique.
it: Usata per le condizioni booleane (when guards) nei criteri di ricerca e per introdurre una clausola di vincolo per un parametro di tipo generico.
ja: パターン マッチでのブール条件 (when ガード) で、ジェネリック型パラメーターの制約句を開始するために使用します。
ko: 패턴 일치의 부울 조건(가드 시)으로 사용되며, 제네릭 형식 매개 변수에 대한 제약 조건 절을 지정하는 데 사용됩니다.
pl: Używane na potrzeby warunków wartości logicznych (strażników when) w dopasowaniach wzorca oraz w celu wprowadzenia klauzuli ograniczenia dla parametru typu ogólnego.
pt_br: Usado para condições boolianas (when guards) em correspondências de padrão e para introduzir uma cláusula de restrição para um parâmetro de tipo genérico.
ru: Используется для логических условий (условий when) для сопоставлений шаблонов и для введения предложения ограничения для параметра универсального типа.
tr: Desen eşleştirmelerde ve genel türde bir parametreye yönelik olarak bir kısıtlama yan tümcesi eklemek amacıyla Boolean koşulları (when korumaları) için kullanılır.
zh_hans: 用于模式匹配的布尔条件(临界时)以及用于引入泛型类型参数的约束子句。
zh_hant: 用於模式比對時的布林值條件 (when 成立條件)，以及為泛型型別參數引入條件約束時用。

# keywordDescriptionWhile
source: Introduces a looping construct.
cs: Uvozuje konstruktor cyklu.
de: Führt ein Schleifenkonstrukt ein.
es: Incluye una construcción de bucle.
fr: Introduit une construction de boucle.
it: Introduce un costrutto di ciclo.
ja: ループ コンストラクトを導入します。
ko: 루프 구문을 지정합니다.
pl: Wprowadza konstrukcję zapętlenia.
pt_br: Apresenta um constructo de looping.
ru: Вводит циклическую конструкцию.
tr: Döngü yapısını tanıtır.
zh_hans: 引入循环构造。
zh_hant: 引進重複的條件約束。

# keywordDescriptionWith
source: Used together with the match keyword in pattern matching expressions. Also used in object expressions, record copying expressions, and type extensions to introduce member definitions, and to introduce exception handlers.
cs: Používá se společně s klíčovým slovem match ve výrazech porovnávání vzorů. Ve výrazech objektů, výrazech kopírování záznamů a rozšířeních typů slouží také k uvození definice člena a obslužných rutin výjimek.
de: Wird zusammen mit dem Vergleichsschlüsselwort in Musterabgleichsausdrücken verwendet. Wird auch in Objektausdrücken, Datensatzkopierausdrücken und Typerweiterungen verwendet, um Memberdefinitionen und Ausnahmehandler bereitzustellen.
es: Se usa junto con la palabra clave match en las expresiones de coincidencia de patrones. También se usa en las expresiones de objeto, expresiones de copia de registros y extensiones de tipo para incluir las definiciones de miembro y los controladores de excepciones.
fr: Utilisé avec le mot clé match dans les expressions de critères spéciaux. Également utilisé dans les expressions d'objet, les expressions de copie d'enregistrement et les extensions de type pour introduire des définitions de membre et des gestionnaires d'exceptions.
it: Usata insieme alla parola chiave match nelle espressioni di criteri di ricerca. Usata anche in espressioni di oggetti, espressioni di copia di record e in estensioni dei tipi per introdurre definizioni di membro, nonché per introdurre gestori di eccezioni.
ja: パターン マッチング式で match キーワードを指定して使用します。メンバー定義と例外ハンドラーを導入するため、オブジェクト式、レコード コピー式、および型拡張でも使用します。
ko: 패턴 일치 식에서 일치 키워드와 함께 사용됩니다. 또한 개체 식, 레코드 복사 식, 형식 확장에 사용되어 멤버 정의를 지정하고 예외 처리기를 지정합니다.
pl: Używane razem ze słowem kluczowym match w wyrażeniach dopasowania wzorca. Używane również w wyrażeniach obiektu, wyrażeniach kopiowania rekordu oraz wyrażeniach typu do wprowadzania definicji elementów członkowskich i obsługi wyjątków.
pt_br: Usado em conjunto com a palavra-chave correspondente em expressões de correspondência de padrão. Também usado em expressões de objeto, expressões de cópia de registros e extensões de tipo para apresentar as definições de membro e introduzir os manipuladores de exceção.
ru: Используется с ключевым словом match в выражениях сопоставления шаблонов. Также используется в выражениях объектов, выражениях копирования записей и расширениях типов для введения определений членов и обработчиков исключений.
tr: Desen eşleştirme ifadelerinde match anahtar sözcüğü ile birlikte kullanılır. Ayrıca nesne ifadelerinde, kayıt kopyalama ifadelerinde ve tür uzantılarında üye tanımlarını ve özel durum işleyicilerini tanıtmak için kullanılır.
zh_hans: 在模式匹配表达式中与 match 关键字配合使用。此外，也用于在对象表达式、记录复制表达式和类型扩展，以引入成员定义和异常处理程序。
zh_hant: 在模式比對運算式中搭配 match 關鍵字使用。也用在物件運算式、記錄複製運算式及類型運算時，以引入成員定義，並用以引入例外狀況處理常式。

# keywordDescriptionYield
source: Used in a sequence expression to produce a value for a sequence.
cs: Používá se ve výrazu pořadí k vytvoření hodnoty pořadí.
de: Wird in einem Sequenzausdruck zum Generieren eines Werts für eine Sequenz verwendet.
es: Se usa en una expresión de secuencia a fin de generar un valor para una secuencia.
fr: Utilisé dans une expression de séquence pour produire une valeur pour une séquence.
it: Usata in un'espressione di sequenza per produrre un valore per una sequenza.
ja: シーケンス式でシーケンスの値を生成します。
ko: 시퀀스에 대한 값을 생성하기 위해 시퀀스 식에 사용됩니다.
pl: Używane w wyrażeniu sekwencji do tworzenia wartości sekwencji.
pt_br: Usado em uma expressão de sequência para produzir um valor de uma sequência.
ru: Используется в выражении последовательности для получения значения для последовательности.
tr: Diziye ait bir değer üretmek için dizi ifadesinde kullanılır.
zh_hans: 在序列表达式中用于产生序列的值。
zh_hant: 用於順序運算式中，以產生順序的值。

# keywordDescriptionYieldBang
source: Used in a computation expression to append the result of a given computation expression to a collection of results for the containing computation expression.
cs: Používá se ve výrazu výpočtu k připojení výsledku daného výpočetního výrazu ke kolekci výsledků obsahujícího výrazu výpočtu.
de: Wird in einem Berechnungsausdruck zum Anhängen des Ergebnisses eines bestimmten Berechnungsausdrucks für eine Ergebnissammlung für den enthaltenden Berechnungsausdruck verwendet.
es: Se usa en una expresión de cálculo para anexar el resultado de una expresión de cálculo determinada a una colección de resultados para la expresión de cálculo que contiene.
fr: Utilisé dans une expression de calcul pour ajouter le résultat d'une expression de calcul donnée à une collection de résultats pour l'expression de calcul conteneur.
it: Usata in un'espressione di calcolo per aggiungere il risultato di un'espressione di calcolo specificata a una raccolta di risultati per l'espressione di calcolo contenitore.
ja: コンピュテーション式で、コンピュテーション式を含む結果のコレクションにそのコンピュテーション式の結果を追加します。
ko: 포함하는 계산 식의 결과 모음에 제공된 계산 식의 결과를 추가하기 위해, 계산 식에 사용됩니다.
pl: Używane w wyrażeniach obliczenia do dołączania wyniku danego wyrażenia obliczenia do kolekcji wyników dla zawartego wyrażenia obliczenia.
pt_br: Usado em uma expressão de computação para acrescentar ao resultado de uma expressão de computação fornecida a uma coleção de resultados para a expressão de computação que a contém.
ru: Используется в вычислительном выражении для добавления результата данного вычислительного выражения в набор результатов для содержащего его вычислительного выражения.
tr: Verilen bir hesaplama ifadesinin sonucunu, bu hesaplama ifadesinin içerdiği sonuç koleksiyonuna eklemek için hesaplama ifadelerinde kullanılır.
zh_hans: 在计算表达式中用于将给定计算表达式的结果追加到包含计算表达式的结果集合。
zh_hant: 用於計算運算式中，以將指定計算運算式的結果附加到內含計算運算式的結果集合。

# keywordDescriptionRightArrow
source: In function types, delimits arguments and return values. Yields an expression (in sequence expressions); equivalent to the yield keyword. Used in match expressions
cs: Odděluje argumenty a návratové hodnoty v typech funkcí. Nabývá výrazu (ve výrazech pořadí); ekvivalent klíčového slova yield. Používá se v porovnávacích výrazech.
de: Begrenzt Argumente und Rückgabewerte in Funktionstypen. Ergibt einen Ausdruck (in Sequenzausdrücken); entspricht dem Yield-Schlüsselwort. Wird in Vergleichsausdrücken verwendet.
es: En los tipos de función, delimita los argumentos y los valores devueltos. Genera una expresión (en expresiones de secuencia); es equivalente a la palabra clave yield. Se usa en expresiones de coincidencia.
fr: Dans les types de fonction, délimite les arguments et les valeurs renvoyées. Produit une expression (dans les expressions de séquence). Équivaut au mot clé yield. Utilisé dans les expressions match
it: Nei tipi di funzione delimita argomenti e valori restituiti. Produce un'espressione (nelle espressioni di sequenza); equivalente alla parola chiave yield. Usata nelle espressioni match
ja: 関数型で、引数と戻り値を区切ります。式 (シーケンス式) が得られ、yield キーワードに相当します。match 式に使用されます
ko: 함수 형식에서 인수와 반환 값을 구분합니다. 시퀀스 식에서 식을 만들며, yield 키워드와 동일합니다. 일치 식에서 사용됩니다.
pl: W typach funkcji ogranicza argumenty i wartości zwracane. Implikuje wyrażenie (w wyrażeniach sekwencji); odpowiednik słowa kluczowego yield. Używane w wyrażeniach dopasowania
pt_br: Em tipos de função, delimita argumentos e valores retornados. Produz uma expressão (em expressões de sequência); equivalente à palavra-chave de rendimento. Usado em expressões de correspondência
ru: В типах функций разделяет аргументы и возвращаемые значения. Выдает выражение (в выражениях последовательности); эквивалентно ключевому слову yield. Используется в выражениях сопоставления.
tr: İşlev türlerinde, bağımsız değişkenleri ve dönüş değerlerini ayırır. Bir ifade verir (dizi ifadelerinde); yield anahtar sözcüğüne eşdeğerdir. Eşleştirme ifadelerinde kullanılır
zh_hans: 在函数类型中，分隔参数并返回值。生成表达式(在序列表达式中)；相当于 yield 关键字。用于匹配表达式中。
zh_hant: 在函式類型中，分隔引數並傳回值。產生運算式 (循序運算式); 相當於 yield 關鍵字。用於比對運算式

# keywordDescriptionLeftArrow
source: Assigns a value to a variable.
cs: Přiřadí hodnotu k proměnné.
de: Weist einen Wert einer Variablen zu.
es: Asigna un valor a una variable.
fr: Assigne une valeur à une variable.
it: Assegna un valore a una variabile.
ja: 変数に値を割り当てます。
ko: 변수에 값을 할당합니다.
pl: Przydziela wartość do zmiennej.
pt_br: Atribui um valor a uma variável.
ru: Назначает значение переменной.
tr: Değişkene değer atar.
zh_hans: 将一个值赋予变量。
zh_hant: 將值指派給變數。
