Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# chkDuplicateMethodCurried
source: The method '{0}' has curried arguments but has the same name as another method in type '{1}'. Methods with curried arguments cannot be overloaded. Consider using a method taking tupled arguments.
cs: Metoda {0} má curryfikované argumenty, ale má stejný název jako jiná metoda v typu {1}. Metody s curryfikovanými argumenty se nedají přetěžovat. Zvažte použití metody, která přebírá argumenty s řazenou kolekcí členů.
de: Die Methode "{0}" enthält Curryargumente, hat aber denselben Namen wie eine andere Methode im Typ "{1}". Methoden mit Curryargumenten dürfen nicht überladen werden. Verwenden Sie ggf. eine Methode, die Tupelargumente akzeptiert.
es: El método "{0}" tiene argumentos currificados, pero tiene el mismo nombre que otro método del tipo "{1}". Los métodos con argumentos currificados no se pueden sobrecargar. Considere la posibilidad de usar un método que tome argumentos en tuplas.
fr: La méthode '{0}' a des arguments curryfiés mais elle comporte le même nom qu'une autre méthode dans le type '{1}'. Impossible de surcharger les méthodes ayant des arguments curryfiés. Utilisez une méthode qui accepte des arguments basés sur des tuples.
it: Il nome del metodo '{0}' con argomenti sottoposti a currying corrisponde a quello di un altro metodo nel tipo '{1}'. Non è possibile eseguire l'overload di metodi con argomenti sottoposti a currying. Provare a usare un metodo che usa argomenti di tupla.
ja: メソッド '{0}' にはカリー化された引数が使用されていますが、型 '{1}' の別のメソッドと名前が同じです。カリー化された引数を使用したメソッドはオーバーロードできません。メソッドにはタプル化された引数を使用することをご検討ください。
ko: {0}' 메서드에 커리된 인수가 있지만 '{1}' 형식의 다른 메서드와 이름이 같습니다. 커리된 인수가 있는 메서드를 오버로드할 수 없습니다. 튜플된 인수를 포함하는 메서드를 사용하세요.
pl: Metoda „{0}” ma argumenty curried i taką samą nazwę co inna metoda w typie „{1}”. Nie można przeciążać metod z argumentami curried. Rozważ użycie metody pobierającej argumenty w postaci krotki.
pt_br: O método '{0}' tem argumentos na forma curried, mas tem o mesmo nome que outro método no tipo '{1}'. Os métodos com argumentos na forma curried não podem estar sobrecarregados. Considere usar um método que tenha argumentos na forma de tupla.
ru: Метод "{0}" содержит каррированные аргументы, но его имя и сигнатура аналогичны другому методу в типе "{1}". Перегрузка методов с каррированными аргументами не допускается. Рекомендуется использовать метод, принимающий аргументы в форме кортежа.
tr: {0}' metodunda Curry biçimli bağımsız değişkenler var ancak metodun adı, '{1}' türündeki başka bir metodun adıyla aynı. Curry biçimli bağımsız değişkenleri olan metotlar aşırı yüklenemez. Demet olarak tanımlanmış bağımsız değişkenler alan bir metot kullanmanız önerilir.
zh_hans: 方法“{0}”具有扩充参数，并且与类型“{1}”中的另一个方法具有相同的名称。无法重载具有扩充参数的方法。请考虑使用采用元组化参数的方法。
zh_hant: 方法 '{0}' 有局部調用引數，與類型 '{1}' 中另一個方法同名。具有局部調用引數的方法無法多載。請考慮使用接受元組引數的方法。

# chkCurriedMethodsCantHaveOutParams
source: Methods with curried arguments cannot declare 'out', 'ParamArray', 'optional', 'ReflectedDefinition', 'byref', 'CallerLineNumber', 'CallerMemberName', or 'CallerFilePath' arguments
cs: Metody s curryfikovanými argumenty nemůžou deklarovat argumenty out, ParamArray, optional, ReflectedDefiniton, byref, CallerLineNumber, CallerMemberName a CallerFilePath.
de: Methoden mit Curry-Argumenten dürfen keine out-, ParamArray-, optional-, ReflectedDefinition-, byref-, CallerLineNumber-, CallerMemberName- oder CallerFilePath-Argumente deklarieren.
es: Los métodos con argumentos currificados no pueden declarar argumentos 'out', 'ParamArray', 'optional', 'ReflectedDefinition', 'byref', 'CallerLineNumber', 'CallerMemberName' o 'CallerFilePath'
fr: Les méthodes avec des arguments curryfiés ne peuvent pas déclarer d'arguments 'out', 'ParamArray', 'optional', 'ReflectedDefinition', 'byref', 'CallerLineNumber', 'CallerMemberName' ou 'CallerFilePath'
it: I metodi con argomenti sottoposti a currying non possono dichiarare argomenti 'out', 'ParamArray', 'optional', 'ReflectedDefinition', 'byref', 'CallerLineNumber', 'CallerMemberName' o 'CallerFilePath'
ja: カリー化された引数を使用したメソッドでは、'out'、'ParamArray'、'optional'、'ReflectedDefinition'、'byref'、'CallerLineNumber'、'CallerMemberName'、または 'CallerFilePath' の各引数を宣言できません
ko: 커리된 인수가 있는 메서드는 'out', 'ParamArray', 'optional', 'ReflectedDefinition', 'byref', 'CallerLineNumber', 'CallerMemberName' 또는 'CallerFilePath' 인수를 선언할 수 없습니다.
pl: Metody z argumentami curried nie mogą deklarować argumentu „out”, „ParamArray”, „optional”, „ReflectedDefinition”, „byref”, „CallerLineNumber”, „CallerMemberName” lub „CallerFilePath”
pt_br: Os métodos com argumentos via currying não podem declarar os argumentos 'out', 'ParamArray', 'optional', 'ReflectedDefinition', 'byref', 'CallerLineNumber', 'CallerMemberName' ou 'CallerFilePath'
ru: В методах с каррированными аргументами не допускается объявление аргументов "out", "ParamArray", "optional", "ReflectedDefinition", "byref", "CallerLineNumber", "CallerMemberName" или "CallerFilePath"
tr: Curry bağımsız değişkenlerine sahip metotlar 'out', 'ParamArray', 'optional', 'ReflectedDefinition', 'byref', 'CallerLineNumber', 'CallerMemberName' veya 'CallerFilePath' bağımsız değişkenlerini bildiremez
zh_hans: 具有扩充参数的方法不能声明 "out"、"ParamArray"、"optional"、"ReflectedDefinition"、"byref"、"CallerLineNumber"、"CallerMemberName" 或 "CallerFilePath" 参数
zh_hant: 具有局部調用引數的方法不得宣告 'out'、'ParamArray'、'optional'、'ReflectedDefinition'、'byref'、'CallerLineNumber'、'CallerMemberName' 或 'CallerFilePath' 引數

# chkDuplicateProperty
source: Duplicate property. The property '{0}' has the same name and signature as another property in type '{1}'.
cs: Duplicitní vlastnost. Vlastnost {0} má stejný název a signaturu jako jiná vlastnost v typu {1}.
de: Doppelte Eigenschaft. Die Eigenschaft "{0}" hat denselben Namen und dieselbe Signatur wie eine andere Eigenschaft im Typ "{1}".
es: Propiedad duplicada. La propiedad "{0}" tiene el mismo nombre y la misma signatura que otra propiedad del tipo "{1}".
fr: Propriété dupliquée. La propriété '{0}' a le même nom et la même signature qu'une autre propriété dans le type '{1}'.
it: Proprietà duplicata. Il nome e la firma della proprietà '{0}' corrispondono a quelli di un'altra proprietà nel tipo '{1}'.
ja: 重複したプロパティ。プロパティ '{0}' は、名前とシグネチャが型 '{1}' の別のプロパティと同じです。
ko: 속성이 중복되었습니다. '{0}' 속성의 이름 및 시그니처가 '{1}' 형식의 다른 속성과 같습니다.
pl: Zduplikowana właściwość. Właściwość „{0}” ma taką samą nazwę i sygnaturę co inna właściwość w typie „{1}”.
pt_br: Propriedade duplicada. A propriedade '{0}' tem o mesmo nome e assinatura que outra propriedade no tipo '{1}'.
ru: Повторяющееся свойство. Имя и сигнатура свойства "{0}" аналогичны другому свойству в типе "{1}".
tr: Yinelenen özellik. '{0}' özelliği, '{1}' türündeki başka bir özellikle aynı ada ve imzaya sahip.
zh_hans: 重复属性。属性“{0}”与类型“{1}”中的另一个属性具有相同的名称和签名。
zh_hant: 屬性重複。屬性 '{0}' 與類型 '{1}' 中另一個屬性同名，且簽章也相同。

# chkDuplicatePropertyWithSuffix
source: Duplicate property. The property '{0}' has the same name and signature as another property in type '{1}' once tuples, functions, units of measure and/or provided types are erased.
cs: Duplicitní vlastnost. Vlastnost {0} má po vymazání řazených kolekcí členů, funkcí, měrných jednotek a poskytnutých typů stejný název a signaturu jako jiná vlastnost v typu {1}.
de: Doppelte Eigenschaft. Die Eigenschaft "{0}" hat denselben Namen und dieselbe Signatur wie in eine andere Eigenschaft im Typ "{1}", nachdem Tupel, Funktionen, Maßeinheiten und/oder angegebene Typen gelöscht wurden.
es: Propiedad duplicada. La propiedad "{0}" tiene el mismo nombre y la misma signatura que otra propiedad del tipo "{1}" una vez borradas las tuplas, funciones, unidades de medida o tipos proporcionados.
fr: Propriété dupliquée. La propriété '{0}' a le même nom et la même signature qu'une autre propriété dans le type '{1}', une fois les tuples, fonctions, unités de mesure et/ou types fournis effacés.
it: Proprietà duplicata. Il nome e la firma della proprietà '{0}' corrispondono a quelli di un'altra proprietà nel tipo '{1}' dopo la cancellazione di tuple, funzioni, unità di misura e/o tipi forniti.
ja: 重複したプロパティ。プロパティ '{0}' は、タプル、関数、測定単位、指定された型が消去されると、名前とシグネチャが型 '{1}' の別のプロパティと同じになります。
ko: 속성이 중복되었습니다. '{0}' 속성의 이름 및 시그니처가 '{1}' 형식의 다른 속성과 같습니다(튜플, 함수, 측정 단위 및/또는 제공된 형식을 지울 경우).
pl: Zduplikowana właściwość. Właściwość „{0}” ma taką samą nazwę i sygnaturę co inna właściwość w typie „{1}” po wymazaniu krotek, funkcji, jednostek miary i/lub udostępnionych typów.
pt_br: Propriedade duplicada. A propriedade '{0}' tem o mesmo nome e assinatura que outra propriedade no tipo '{1}' assim que tuplas, funções, unidades de medida e/ou tipos fornecidos são apagados.
ru: Повторяющееся свойство. Имя и сигнатура свойства "{0}" аналогичны другому свойству в типе "{1}" после удаления кортежей, функций, единиц измерения и предоставляемых типов.
tr: Yinelenen özellik. Demetler, işlevler, ölçü birimleri ve/veya sağlanan türler silindikten sonra '{0}' özelliği, '{1}' türündeki başka bir özellikle aynı ada ve imzaya sahip oluyor.
zh_hans: 重复属性。清除元组、函数、度量单位和/或提供的类型后，属性“{0}”与类型“{1}”中的另一个属性具有相同的名称和签名。
zh_hant: 屬性重複。當元組、函式、測量單位及 (或) 提供的類型清除之後，屬性 '{0}' 與類型 '{1}' 中另一個屬性同名，且簽章也相同。

# chkDuplicateMethodInheritedType
source: Duplicate method. The abstract method '{0}' has the same name and signature as an abstract method in an inherited type.
cs: Duplicitní metoda. Abstraktní metoda {0} má stejný název a signaturu jako abstraktní metoda ve zděděném typu.
de: Doppelte Methode. Die abstrakte {0}-Methode hat denselben Namen und dieselbe Signatur wie eine abstrakte Methode in einem geerbten Typ.
es: Método duplicado. El método abstracto '{0}' tiene el mismo nombre y la misma signatura que un método abstracto en un tipo heredado.
fr: Méthode dupliquée. La méthode abstract '{0}' a le même nom et la même signature qu'une méthode abstract d'un type hérité.
it: Metodo duplicato. Il nome e la firma del metodo astratto '{0}' corrispondono a quelli di un metodo astratto in un tipo ereditato.
ja: 重複したメソッド。抽象メソッド '{0}' は、名前とシグネチャが継承型の抽象メソッドと同じです。
ko: 메서드가 중복되었습니다. 추상 메서드 '{0}'의 이름 및 시그니처가 상속된 형식의 추상 메서드와 같습니다.
pl: Zduplikowana metoda. Metoda abstrakcyjna „{0}” ma taką samą nazwę i sygnaturę co metoda abstrakcyjna w typie dziedziczonym.
pt_br: Método duplicado. O método abstrato '{0}' possui o mesmo nome e assinatura que um método abstrato em um tipo herdado.
ru: Повторяющийся метод. Имя и сигнатура абстрактного метода "{0}" аналогичны абстрактному методу унаследованного типа.
tr: Yinelenen metot. Soyut '{0}' metodu, devralınan türdeki soyut metotla aynı ada ve imzaya sahip.
zh_hans: 重复方法。抽象方法“{0}”与继承类型中的某个抽象方法具有相同的名称和签名。
zh_hant: 重複的方法。抽象方法 '{0}' 與繼承類型中的某抽象方法具有相同的名稱和簽章。

# chkDuplicateMethodInheritedTypeWithSuffix
source: Duplicate method. The abstract method '{0}' has the same name and signature as an abstract method in an inherited type once tuples, functions, units of measure and/or provided types are erased.
cs: Duplicitní metoda. Abstraktní metoda {0} má po vymazání řazených kolekcí členů, funkcí, měrných jednotek a poskytnutých typů stejný název a signaturu jako abstraktní metoda ve zděděném typu.
de: Doppelte Methode. Die abstrakte {0}-Methode hat denselben Namen und dieselbe Signatur wie in eine abstrakte Methode in einem geerbten Typ, nachdem Tupel, Funktionen, Maßeinheiten und/oder angegebene Typen gelöscht wurden.
es: Método duplicado. El método abstracto '{0}' tiene el mismo nombre y la misma signatura que un método abstracto en un tipo heredado una vez borradas las tuplas, funciones, unidades de medida y/o los tipos proporcionados.
fr: Méthode dupliquée. La méthode abstract '{0}' a le même nom et la même signature qu'une méthode abstract d'un type hérité, une fois les tuples, fonctions, unités de mesure et/ou types fournis effacés.
it: Metodo duplicato. Il nome e la firma del metodo astratto '{0}' corrispondono a quelli di un metodo astratto in un tipo ereditato dopo la cancellazione di tuple, funzioni, unità di misura e/o tipi forniti.
ja: 重複したメソッド。抽象メソッド '{0}' は、タプル、関数、測定単位、または指定された型が消去されると、名前とシグネチャが継承型の抽象メソッドと同じになります。
ko: 메서드가 중복되었습니다. 추상 메서드 '{0}'의 이름 및 시그니처가 상속된 형식의 추상 메서드와 같습니다(튜플, 함수, 측정 단위 및/또는 제공된 형식을 지울 경우).
pl: Zduplikowana metoda. Metoda abstrakcyjna „{0}” ma taką samą nazwę i sygnaturę co metoda abstrakcyjna w typie dziedziczonym po wymazaniu krotek, funkcji, jednostek miary i/lub udostępnionych typów.
pt_br: Método duplicado. O método abstrato '{0}' possui mesmo nome e assinatura que um método abstrato em um tipo herdado assim que tuplas, funções, unidades de medida e/ou tipos fornecidos são apagados.
ru: Повторяющийся метод. Имя и сигнатура абстрактного метода "{0}" аналогичны абстрактному методу унаследованного типа после удаления кортежей, функций, единиц измерения и предоставляемых типов.
tr: Yinelenen metot. Demetler, işlevler, ölçü birimleri ve/veya sağlanan türler silindikten sonra, soyut '{0}' metodu, devralınan türdeki soyut metotla aynı ada ve imzaya sahip.
zh_hans: 重复方法。在清除元组、函数、度量单位和/或所提供类型后，抽象方法“{0}”与继承类型中的某个抽象方法具有相同的名称和签名。
zh_hant: 重複的方法。抽象方法 '{0}' 在清除元組、函式、測量單位和/或提供的類型後，會與繼承類型中的某抽象方法具有相同的名稱和簽章。

# chkMultipleGenericInterfaceInstantiations
source: This type implements the same interface at different generic instantiations '{0}' and '{1}'. This is not permitted in this version of F#.
cs: Tento typ implementuje stejné rozhraní u různých obecných instancí {0} a {1}. To není v této verzi F# povolené.
de: Dieser Typ implementiert dieselbe Schnittstelle mit den unterschiedlichen generischen Instanziierungen "{0}" und "{1}". Dies ist in dieser Version von F# nicht zulässig.
es: Este tipo implementa la misma interfaz en diferentes creaciones de instancia genéricas: "{0}" y "{1}". Esta operación no se permite en esta versión de F#.
fr: Ce type implémente la même interface à des instanciations génériques différentes '{0}' et '{1}'. Cela n'est pas autorisé dans cette version de F#.
it: Questo tipo implementa la stessa interfaccia in creazioni di istanze generiche diverse '{0}' e '{1}'. Ciò non è consentito in questa versione di F#.
ja: この型は、異なるジェネリックのインスタンス化 '{0}' と '{1}' で同じインターフェイスを実装しています。これは、このバージョンの F# で許可されていません。
ko: 이 형식은 서로 다른 제네릭 인스턴스 '{0}' 및 '{1}'에서 같은 인터페이스를 구현합니다. 이는 이 버전의 F#에서 허용되지 않습니다.
pl: Ten typ implementuje ten sam interfejs w różnych ogólnych utworzonych wystąpieniach „{0}” i „{1}”. Nie jest to dozwolone w tej wersji języka F#.
pt_br: Este tipo implementa a mesma interface em instanciações genéricas diferentes '{0}' e '{1}'. Isto não é permitido nesta versão de F#.
ru: В этом типе реализуется один и тот же интерфейс в различных универсальных установках "{0}" и "{1}". В данной версии F# это не допускается.
tr: Bu tür, farklı '{0}' ve '{1}' genel örneklemelerinde aynı arabirimi uyguluyor. F# dilinin bu sürümünde buna izin verilmez.
zh_hans: 此类型在不同的泛型实例化“{0}”和“{1}”实现了同样的接口。这在该版本 F# 中是不允许的。
zh_hant: 此類型會在不同的泛型具現化 '{0}' 及 '{1}' 中實作相同的介面。本版 F# 不允許此作法。

# chkValueWithDefaultValueMustHaveDefaultValue
source: The type of a field using the 'DefaultValue' attribute must admit default initialization, i.e. have 'null' as a proper value or be a struct type whose fields all admit default initialization. You can use 'DefaultValue(false)' to disable this check
cs: Typ pole, které používá atribut DefaultValue, musí připouštět výchozí inicializaci, tj. mít null jako správnou hodnotu nebo být typu struktura, jejíž všechna pole připouštějí výchozí inicializaci. Tuto kontrolu můžete vypnout pomocí DefaultValue(false).
de: Der Typ eines Felds mit dem DefaultValue-Attribut muss die Standardinitialisierung zulassen, also NULL als eigenen Wert aufweisen oder ein Strukturtyp sein, dessen Felder alle die Standardinitialisierung zulassen. Mit "DefaultValue(false)" können Sie diese Prüfung deaktivieren.
es: El tipo de un campo que usa el atributo 'DefaultValue' debe admitir inicialización predeterminada, es decir, tener 'null' como un valor adecuado o ser un tipo struct cuyos campos admitan todos inicialización predeterminada. Puede usar 'DefaultValue(false)' para deshabilitar esta comprobación.
fr: Le type d'un champ qui utilise l'attribut 'DefaultValue' doit admettre l'initialisation par défaut, c'est-à-dire qu'il doit avoir la valeur 'null' comme valeur appropriée ou être un type struct dont les champs admettent tous l'initialisation par défaut. Vous pouvez utiliser 'DefaultValue(false)' pour désactiver cette vérification
it: Il tipo di un campo che utilizza l'attributo 'DefaultValue' deve accettare l'inizializzazione predefinita, ovvero deve prevedere 'null' come valore valido oppure essere un tipo di struct i cui campi accettano tutti l'inizializzazione predefinita. È possibile utilizzare 'DefaultValue(false)' per disabilitare questa verifica
ja: 'DefaultValue' 属性を使用するフィールドの型は、既定の初期化を許可する必要があります。つまり、'null' が正規の値として含まれるか、すべてのフィールドが既定の初期化を許可する構造体型です。このチェックを無効にするには、'DefaultValue(false)' を使用します。
ko: 'DefaultValue' 특성을 사용하는 필드의 형식은 기본 초기화를 허용해야 합니다. 즉, 이러한 형식은 적절한 값으로 'null'을 가지거나 필드가 모두 기본 초기화를 허용하는 구조체 형식이어야 합니다. 'DefaultValue(false)'를 사용하여 이 검사를 사용하지 않을 수 있습니다.
pl: Typ pola używający atrybutu „DefaultValue” musi przyjąć domyślne inicjowanie (np. mieć wartość „null” jako poprawną wartość lub być typem struktury, którego wszystkie pola przyjmują domyślne inicjowanie). Aby wyłączyć to sprawdzenie, można użyć atrybutu „DefaultValue(false)”
pt_br: O tipo de um campo que usa o atributo 'DefaultValue' deve admitir inicialização padrão, ou seja, possuir 'null' como valor adequado, ou ser um tipo struct cujos todos campos admitem inicialização padrão. Você pode usar 'DefaultValue(false)' para desabilitar esta verificação
ru: Тип поля, использующего атрибут "DefaultValue", должен поддерживать инициализацию по умолчанию, т. е. должен содержать собственное значение "null" или являться типом структуры, все поля которого поддерживают инициализацию по умолчанию. Чтобы отключить эту проверку, используйте "DefaultValue(false)"
tr: 'DefaultValue' özniteliğini kullanan alanın türü varsayılan başlatmayı kabul etmelidir, yani uygun değer olarak 'null' değerli olmalı veya alanlarının tümü varsayılan başlatmayı kabul eden yapı türünde olmalıdır. Bu denetimi devre dışı bırakmak için 'DefaultValue(false)' kullanabilirsiniz
zh_hans: 使用 "DefaultValue" 特性的字段的类型必须承认默认初始化，也就是说，此类型将 "null" 用作适当的值，或者此类型是一个结构类型，其中的所有字段均承认默认初始化。可以使用 "DefaultValue(false)" 禁用此检查
zh_hant: 使用 'DefaultValue' 屬性之欄位的類型必須允許預設初始化，即使用 'null' 做為適當的值或做為所有欄位都允許預設初始化的結構類型。您可以使用 'DefaultValue(false)' 停用這個檢查

# chkNoByrefInTypeAbbrev
source: The type abbreviation contains byrefs. This is not permitted by F#.
cs: Zkratka typu obsahuje parametry Byref. To F# nepovoluje.
de: Die Typabkürzung enthält Byrefs. Dies ist in F# nicht zulässig.
es: La abreviación de tipo contiene byrefs. Esto no se permite en F#.
fr: L'abréviation de type contient des types byref. Cela n'est pas autorisé en F#.
it: L'abbreviazione del tipo contiene byref. Ciò non è consentito da F#.
ja: 型略称に byref が含まれます。この操作は F# で許可されていません。
ko: 형식 약어에 byref가 포함되어 있습니다. 이는 F#에서 허용되지 않습니다.
pl: Skrót typu zawiera typy byref. Jest to niedozwolone w języku F#.
pt_br: A abreviação de tipo contém byrefs. Isto não é permitido por F#.
ru: Сокращенная форма типа содержит параметры типа byref. В языке F# это не допускается.
tr: Tür kısaltması byref değerleri içeriyor. F# dilinde buna izin verilmez.
zh_hans: 类型缩写词包含 byref。F# 不允许这样做。
zh_hant: 類型縮寫包含 ByRef。F# 不允許這種作法。

# crefBoundVarUsedInSplice
source: The variable '{0}' is bound in a quotation but is used as part of a spliced expression. This is not permitted since it may escape its scope.
cs: Proměnná {0} je vázaná v citaci, ale používá se jako součást spojeného výrazu. To není povolené, protože se tak proměnná může dostat mimo definiční obor.
de: Die Variable "{0}" ist in Anführungszeichen gebunden, wird aber in einem Splice-Ausdruck verwendet. Dies ist nicht zulässig, da dadurch der Bereich mittels Escapevorgängen außer Kraft gesetzt werden kann.
es: La variable '{0}' está enlazada en una expresión de código delimitada, pero se usa como parte de una expresión insertada. Esto no se permite porque puede escaparse del ámbito.
fr: La variable '{0}' est liée dans une quotation mais est utilisée dans le cadre d'une expression ajoutée. Cela n'est pas autorisé, car elle peut sortir de sa portée.
it: La variabile '{0}' è associata in una quotation ma viene usata come parte di un'espressione sottoposta a splicing. Ciò non è consentito perché la variabile potrebbe uscire dal relativo ambito.
ja: 変数 '{0}' は引用符内でバインドされていますが、スプライスされた式の一部として使用されています。スコープが回避される可能性があるため、この操作は許可されていません。
ko: '{0}' 변수가 인용구 내에 바인딩되어 있지만 스플라이스된 식의 일부로 사용되었습니다. 범위를 벗어날 수 있으므로 이는 허용되지 않습니다.
pl: Zmienna „{0}” jest powiązana w wyrażeniu cytowanym, ale jest używana jako część połączonego wyrażenia. Jest to niedozwolone, ponieważ może spowodować wykroczenie zmiennej poza jej zakres.
pt_br: A variável '{0}' está associada a uma cotação, mas é usada como parte de uma expressão de união. Isso não é permitido, pois pode sair do escopo.
ru: Переменная "{0}" заключена в кавычки, однако используется в составе соединенного выражения. Это не допускается, поскольку может привести к выходу за пределы области видимости.
tr: '{0}' değişkeni bir alıntı içine bağlanmış ancak eklenmiş ifadenin parçası olarak kullanılmış. Kapsamından kaçabileceği için buna izin verilmez.
zh_hans: 虽然变量“{0}”在某个引用内容中进行了绑定，但它用作拼接表达式的一部分。不允许这样做，因为该变量可能会超出其范围。
zh_hant: 變數 '{0}' 雖括在引號中，卻做為接合運算式的一部分使用。這是不允許的作法，因為這樣可能會逸出其範圍。

# crefQuotationsCantContainGenericExprs
source: Quotations cannot contain uses of generic expressions
cs: Citace nemůžou obsahovat použití obecných výrazů.
de: Anführungszeichen dürfen keine generischen Ausdrücke enthalten.
es: Las expresiones de código delimitadas no pueden contener usos de expresiones genéricas.
fr: Les quotations ne peuvent pas contenir d'utilisations d'expressions génériques
it: Le quotation non possono contenere utilizzi di espressioni generiche
ja: 引用符内にはジェネリック式の使用を含めることはできません
ko: 인용구에는 제네릭 식을 포함할 수 없습니다.
pl: Wyrażenia cytowane nie mogą używać wyrażeń ogólnych
pt_br: Cotações não podem conter utilizações de expressões genéricas
ru: В кавычки нельзя заключать универсальные выражения
tr: Alıntılar, genel ifade kullanımları içeremez
zh_hans: 引用内容中不能使用泛型表达式
zh_hant: 引號內不能使用泛型運算式
