Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# parsUnmatchedClassInterfaceOrStruct
source: Unmatched 'class', 'interface' or 'struct'
cs: Nespárované klíčové slovo class, interface nebo struct
de: Keine Entsprechung für "class", "interface" oder "struct".
es: 'class', 'interface' o 'struct' desemparejado.
fr: 'class', 'interface' ou 'struct' non apparié
it: 'class', 'interface' o 'struct' senza corrispondenza
ja: 'class'、'interface'、または 'struct' が対応しません
ko: 'class', 'interface' 또는 'struct'의 짝이 맞지 않습니다.
pl: Niedopasowany element „class”, „interface” lub „struct”
pt_br: 'class', 'interface' ou 'struct' incompatível
ru: Несогласованный "class", "interface" или "struct"
tr: Eşleşmeyen 'class', 'interface' veya 'struct'
zh_hans: 不匹配的“class”、“interface”或“struct”
zh_hant: 無對應的 'class'、'interface' 或 'struct'

# parsEmptyTypeDefinition
source: A type definition requires one or more members or other declarations. If you intend to define an empty class, struct or interface, then use 'type ... = class end', 'interface end' or 'struct end'.
cs: Definice typu vyžaduje jeden nebo víc členů nebo jiné deklarace. Pokud máte v úmyslu definovat prázdnou třídu, strukturu nebo rozhraní, použijte formulaci type ... = class end, interface end nebo struct end.
de: Eine Typdefinition erfordert mindestens eine Member- oder andere Deklaration. Wenn Sie eine leere Klasse, Struktur oder Schnittstelle definieren möchten, sollten Sie stattdessen "type ... = class end", "interface end" oder "struct end" verwenden.
es: Una definición de tipo requiere uno o varios miembros, u otras declaraciones. Si su intención es definir una clase, un struct o una interfaz vacía, use 'type ... = class end', 'interface end' o 'struct end'.
fr: Une définition de type requiert un ou plusieurs membres ou d'autres déclarations. Si vous envisagez de définir une classe, un struct ou une interface vide, utilisez 'type ... = class end', 'interface end' ou 'struct end'.
it: In una definizione di tipo sono necessari uno o più membri oppure altre dichiarazioni. Se si vuole definire una classe, un'interfaccia o uno struct vuoto, usare 'type ... = class end', 'interface end' o 'struct end'.
ja: 型定義には、1 つまたは複数のメンバーまたは他の宣言が必要です。空のクラス、構造体、またはインターフェイスを定義する場合、'type ... = class end'、'interface end'、または 'struct end' を使用してください。
ko: 형식 정의에는 하나 이상의 멤버 또는 기타 선언이 필요합니다. 빈 클래스, 구조체 또는 인터페이스를 정의하려는 경우에는 'type ... = class end', 'interface end' 또는 'struct end'를 사용하세요.
pl: Definicja typu wymaga co najmniej jednego elementu członkowskiego lub innych deklaracji. Jeśli zamierzasz zdefiniować pustą klasę, strukturę lub interfejs, użyj konstrukcji „type ... = class end”, „interface end” lub „struct end”.
pt_br: Uma definição de tipo requer um ou mais membros ou outras declarações. Se você pretende definir uma classe vazia, struct ou interface, então use 'type ... = class end', 'interface end' ou 'struct end'.
ru: В определении типа требуются один или несколько элементов или других объявлений. Если предполагается определение пустых класса, структуры или объединения, используйте выражения "type ... = class end", "interface end" или "struct end".
tr: Tür tanımı, bir veya daha fazla üyeyi ya da diğer tanımlamaları gerektirir. Boş bir class, struct veya interface tanımlamayı planlıyorsanız 'type ... = class end', 'interface end' veya 'struct end' kullanın.
zh_hans: 类型定义需要一个或多个成员或者其他声明。如果您打算定义一个空的类、结构或接口，请使用“type ... = class end”、“interface end”或“struct end”。
zh_hant: 類型定義需要一個或多個成員或其他宣告。如果您打算定義空的類別、結構或介面，請使用 'type ... = class end'、'interface end' 或 'struct end'。

# parsUnmatchedWith
source: Unmatched 'with' or badly formatted 'with' block
cs: Nespárovaný nebo špatně formátovaný blok with
de: Keine Entsprechung für "with" oder fehlerhaft formatierter with-Block.
es: 'with' desemparejado o bloque 'with' mal formado.
fr: 'with' non apparié ou format incorrect du bloc 'with'
it: 'with' senza corrispondenza o blocco 'with' in formato non valido
ja: with' が対応しないか、'with' ブロックの形式に誤りがあります
ko: 'with'의 짝이 맞지 않거나 'with' 블록의 형식이 잘못되었습니다.
pl: Niedopasowany blok „with” lub niepoprawnie sformatowany blok „with”
pt_br: 'with' incompatível ou bloco 'with' mal formatado
ru: Несоответствующий или неправильно отформатированный блок "with"
tr: Eşleşmeyen 'with' veya hatalı biçimlendirilmiş 'with' bloğu
zh_hans: 不匹配的“with”或“with”块的格式不正确
zh_hant: 無對應的 'with'，或 'with' 區塊的格式錯誤

# parsGetOrSetRequired
source: 'get', 'set' or 'get,set' required
cs: Vyžaduje se metoda get, set nebo get,set.
de: get, "set" oder "get,set" erforderlich.
es: Se requiere 'get', 'set' o 'get,set'.
fr: 'get', 'set' ou 'get,set' requis
it: Necessari 'get', 'set' o 'get,set'
ja: 'get'、'set'、または 'get,set' が必要です
ko: 'get', 'set' 또는 'get,set'이 필요합니다.
pl: Wymagana instrukcja „get”, „set” lub „get,set”
pt_br: 'get', 'set' ou 'get,set' necessários
ru: Требуется "get", "set" и (или) "get,set"
tr: 'get', 'set' veya 'get,set' gerekiyor
zh_hans: 需要“get”、“set”或“get,set”
zh_hant: 需要 'get'、'set' 或 'get,set'

# parsOnlyClassCanTakeValueArguments
source: Only class types may take value arguments
cs: Argumenty hodnoty můžou přebírat jenom typy třídy.
de: Nur Klassentypen können Wertargumente akzeptieren.
es: Solo los tipos de clase pueden tomar argumentos de valor.
fr: Seuls les types classe peuvent accepter des arguments de valeur
it: Gli argomenti value possono essere usati solo da tipi di classe
ja: 値の引数を使用できるのはクラス型のみです
ko: 클래스 형식만 값 인수를 사용할 수 있습니다.
pl: Tylko typy klasy mogą pobierać argumenty wartości
pt_br: Apenas tipos de classe podem ter argumentos de valor
ru: Только типы класса могут принимать аргументы "значение"
tr: Yalnızca sınıf türleri değer bağımsız değişkenleri alabilir
zh_hans: 只有类类型可以采用值参数
zh_hant: 只有類別類型可接受數值引數

# parsUnmatchedBegin
source: Unmatched 'begin'
cs: Nespárované klíčové slovo begin
de: Keine Entsprechung für "begin".
es: 'begin' desemparejado.
fr: 'begin' non apparié
it: 'begin' senza corrispondenza
ja: 'begin' が対応しません
ko: 'begin'의 짝이 맞지 않습니다.
pl: Niedopasowany element „begin”
pt_br: 'begin' incompatível
ru: Несогласованный "begin"
tr: Eşleşmeyen 'begin'
zh_hans: 不匹配的“begin”
zh_hant: 無對應的 'begin'

# parsInvalidDeclarationSyntax
source: Invalid declaration syntax
cs: Neplatná syntaxe deklarace
de: Ungültige Deklarationssyntax.
es: Sintaxis de declaración no válida.
fr: Syntaxe de déclaration non valide
it: Sintassi di dichiarazione non valida
ja: 宣言の構文が無効です
ko: 선언 구문이 잘못되었습니다.
pl: Nieprawidłowa składnia deklaracji
pt_br: Declaração de sintaxe inválida
ru: Недопустимый синтаксис объявления
tr: Geçersiz bildirim sözdizimi
zh_hans: 声明语法无效
zh_hant: 無效的宣告語法

# parsGetAndOrSetRequired
source: 'get' and/or 'set' required
cs: Vyžaduje se metoda get nebo set.
de: get und/oder "set" erforderlich.
es: Se requiere 'get' y/o 'set'.
fr: 'get' et/ou 'set' requis
it: Necessari 'get' e/o 'set'
ja: 'get'、'set'、またはその両方が必要です
ko: 'get' 및/또는 'set'이 필요합니다.
pl: wymagane słowa „get” i/lub „set”
pt_br: 'get' e/ou 'set' necessários
ru: Требуется "get" и (или) "set"
tr: 'get' ve/veya 'set' gerekiyor
zh_hans: 需要“get”和/或“set”
zh_hant: 需要 'get' 和/或 'set'

# parsTypeAnnotationsOnGetSet
source: Type annotations on property getters and setters must be given after the 'get()' or 'set(v)', e.g. 'with get() : string = ...'
cs: Poznámky typu u metod getter nebo setter vlastnosti se musí předávat až po get() nebo set(v). Příklad: with get() : string = ...
de: Typanmerkungen für Eigenschaftengetter und -setter müssen nach "get()" oder "set(v)" angegeben werden, z.B. "with get() : string = ...".
es: Las anotaciones en captadores y establecedores de propiedad se deben proporcionar después de 'get()' o 'set(v)'; por ejemplo, 'with get() : string = ...'.
fr: Les annotations de type des méthodes getter et setter d'une propriété doivent être spécifiées après 'get()' ou 'set(v)', par exemple 'with get() : string = ...'
it: Le annotazioni di tipo nei getter e setter di proprietà devono essere specificate dopo 'get()' o 'set(v)', ad esempio 'with get() : string = ...'
ja: プロパティのゲッターおよびセッターでは、'get()' または 'set(v)' の後に型の注釈を指定する必要があります。たとえば、'with get() : string = ...' などです。
ko: 속성 getter 및 setter에 대한 형식 주석은 'get()' 또는 'set(v)' 뒤에 지정해야 합니다(예: 'with get() : string = ...').
pl: Adnotacje typu w metodach ustawiających i pobierających właściwości muszą być podane po metodzie „get()” lub „set(v)” (np. „with get() : string = ...”)
pt_br: Anotações de tipo em getters e setters de propriedade devem ser fornecidas após o 'get()' ou 'set(v)', por exemplo: 'with get() : string = ...'
ru: Аннотации типов для методов получения или задания свойства необходимо указывать после выражений "get()" или "set(v)", например, "with get() : string = ..."
tr: Özellik alıcılar ve ayarlayıcılardaki tür ek açıklamaları 'get()' veya 'set(v)' ifadesinden sonra verilmelidir, örn. 'with get() : string = ...'
zh_hans: 必须在 "get()" 或 "set(v)" 后面提供属性 Getter 和 Setter 的类型批注，例如 "with get() : string = ..."
zh_hant: 屬性 getter 和 setter 的類型註釋必須在 'get()' 或 'set(v)' 之後指定，例如 'with get() : string = ...'

# parsGetterMustHaveAtLeastOneArgument
source: A getter property is expected to be a function, e.g. 'get() = ...' or 'get(index) = ...'
cs: Očekává se, že vlastnost getter bude funkcí, třeba get() = ... nebo get(index) = ...
de: Eine Getter-Eigenschaft muss eine Funktion sein, z.B. "get() = ..." oder "get(index) = ...".
es: Se espera que una propiedad de captador sea una función; por ejemplo, 'get() = ...' o 'get(index) = ...'.
fr: Une propriété de méthode getter est censée être une fonction, par exemple 'get() = ...' ou 'get(index) = ...'
it: Un proprietà di getter deve essere una funzione, ad esempio 'get() = ...' oppure 'get(index) = ...'
ja: ゲッターのプロパティは関数にする必要があります (たとえば、'get() = ...'、'get(index) = ...')
ko: getter 속성은 함수여야 합니다(예: 'get() = ...' 또는 'get(index) = ...').
pl: Oczekiwano, że właściwość metody pobierającej będzie funkcją, np. „get() = ...” lub „get(indeks) = ...”
pt_br: Espera-se que uma propriedade getter seja uma função, por exemplo, 'get() = ...' ou 'get(índice) = ...'
ru: Свойство метода получения должно быть функцией, например, "get() = ..." или "get(index) = ..."
tr: Alıcı özelliğinin işlev olması bekleniyor, örn. 'get() = ...' veya 'get(index) = ...'
zh_hans: Getter 属性应为一个函数，例如 "get() = ..." 或 "get(index) = ..."
zh_hant: getter 屬性必須是函式，例如 'get() = ...' 或 'get(index) = ...'

# parsMultipleAccessibilitiesForGetSet
source: Multiple accessibilities given for property getter or setter
cs: Zadali jste víc dostupností pro metodu getter nebo setter vlastnosti.
de: Für den Getter oder Setter der Eigenschaft wurden mehrere Zugriffsebenen angegeben.
es: Se proporcionaron varias accesibilidades para un captador o establecedor de propiedad.
fr: Plusieurs accessibilités fournies pour la méthode getter ou setter de la propriété
it: Sono state assegnate più accessibilità per il getter o il setter della proprietà
ja: プロパティのゲッターまたはセッターに指定されたアクセシビリティが複数あります
ko: 속성 getter 또는 setter에 대해 여러 액세스 가능성이 지정되었습니다.
pl: Podano wiele dostępności dla metody ustawiającej lub metody pobierającej właściwość
pt_br: Acessibilidades múltiplas fornecidas para getter ou setter de propriedade
ru: Задано несколько модификаторов доступности для метода получения или задания свойства
tr: Özellik alıcı veya ayarlayıcı için birden çok erişilebilirlik verildi
zh_hans: 为属性 Getter 或 Setter 给定了多个可访问性
zh_hant: 為屬性 getter 或 setter 指定了多個存取範圍

# parsSetSyntax
source: Property setters must be defined using 'set value = ', 'set idx value = ' or 'set (idx1,...,idxN) value = ... '
cs: Metody set vlastnosti musí být definované pomocí syntaxe set value = , set idx value = nebo set (idx1,...,idxN) value = ...
de: Eigenschaftensetter müssen mit "set value = ", "set idx value = " oder "set (idx1,...,idxN) value = ... " definiert werden.
es: Los establecedores de propiedad deben definirse con 'set value = ', 'set idx value = ' o 'set (idx1,...,idxN) value = ... '.
fr: Les méthodes setter d'une propriété doivent être définies via 'set value = ', 'set idx value = ' ou 'set (idx1,...,idxN) value = ... '
it: I setter di proprietà devono essere definiti con 'set value = ', 'set idx value = ' o 'set (idx1,...,idxN) value = ... '
ja: プロパティ Set アクセス操作子を定義するには、'set value = '、'set idx value = '、または 'set (idx1,...,idxN) value = ... ' を使用する必要があります
ko: 속성 setter는 'set value = ', 'set idx value = ' 또는 'set (idx1,...,idxN) value = ... '를 사용하여 정의해야 합니다.
pl: Metody ustawiające właściwości muszą być definiowane przy użyciu konstrukcji „set wartość = ”, „set indeks wartość = ” lub „set (indeks1,...,indeksN) wartość = ... ”
pt_br: Setters de propriedade devem ser definidos com o uso de 'set value = ', 'set idx value = ' ou 'set (idx1,...,idxN) value = ... '
ru: Для определения методов присваивания свойств необходимо использовать синтаксис "set value = ", "set idx value = " или "set (idx1,...,idxN) value = ... '
tr: Özellik ayarlayıcıları 'set value = ', 'set idx value = ' veya 'set (idx1,...,idxN) value = ... ' kullanılarak tanımlanmalıdır
zh_hans: 必须使用“set value =”、“set idx value =”或“set (idx1,...,idxN) value = ...”定义属性 setter'
zh_hant: 必須使用 'set value = '、'set idx value = ' 或 'set (idx1,...,idxN) value = ... ' 定義屬性 setter

# parsInterfacesHaveSameVisibilityAsEnclosingType
source: Interfaces always have the same visibility as the enclosing type
cs: Rozhraní mají vždycky stejnou viditelnost jako nadřazený typ.
de: Schnittstellen weisen immer die gleiche Sichtbarkeit auf wie der einschließende Typ.
es: Las interfaces tienen siempre la misma visibilidad que el tipo envolvente.
fr: Les interfaces ont toujours la même visibilité que le type englobant
it: Le interfacce hanno sempre la stessa visibilità del tipo di inclusione
ja: インターフェイスは、それを囲む型と常に同じ表示範囲を持ちます
ko: 인터페이스의 표시 유형은 항상 바깥쪽 형식과 같습니다.
pl: Interfejsy zawsze mają taką samą widoczność jak typ otaczający
pt_br: Interfaces sempre possuem a mesma visibilidade que o tipo de delimitador
ru: Видимость интерфейсов всегда соответствует видимости включающего их типа
tr: Arabirimler her zaman kapsayan tür ile aynı görünürlüğe sahiptir
zh_hans: 接口始终具有与封闭类型相同的可见性
zh_hant: 介面一定與封入類型採用相同的可見度

# parsAccessibilityModsIllegalForAbstract
source: Accessibility modifiers are not allowed on this member. Abstract slots always have the same visibility as the enclosing type.
cs: Modifikátory dostupnosti nejsou u tohoto člena povolené. Abstraktní datové oblasti mají vždycky stejnou viditelnost jako nadřazený typ.
de: Zugriffsmodifizierer sind für diesen Member nicht zulässig. Abstrakte Umsetzungsplätze weisen immer die gleiche Sichtbarkeit auf wie der einschließende Typ.
es: No se permiten modificadores de accesibilidad en este miembro. Las ranuras abstractas tienen siempre la misma visibilidad que el tipo envolvente.
fr: Les modificateurs d'accessibilité ne sont pas autorisés sur ce membre. Les emplacements abstraits ont toujours la même visibilité que le type englobant.
it: Modificatori di accessibilità non consentiti in questo membro. Gli slot astratti hanno sempre la stessa visibilità del tipo di inclusione.
ja: アクセシビリティ修飾子はこのメンバーでは許可されていません。抽象スロットには、それを囲む型と常に同じ表示範囲があります。
ko: 액세스 가능성 한정자는 이 멤버에서 허용되지 않습니다. 추상 슬롯의 표시 유형은 항상 바깥쪽 형식과 같습니다.
pl: Modyfikatory dostępności są niedozwolone w tym elemencie członkowskim. Miejsca abstrakcyjne zawsze mają taką samą widoczność co typ otaczający.
pt_br: Modificadores de acessibilidade não são permitidos neste membro. Slots abstratos sempre têm a mesma visibilidade que o tipo de delimitador.
ru: Использование модификаторов доступности для этого элемента не допускается. Видимость абстрактных слотов всегда соответствует видимости включающего их типа.
tr: Erişilebilirlik değiştiricilerine bu üyede izin verilmiyor. Soyut yuvalar, kapsayan tür ile her zaman aynı görünürlüğe sahiptir.
zh_hans: 不允许对此成员使用可访问性修饰符。抽象槽总是具有与封闭类型相同的可见性。
zh_hant: 不允許在這個成員上使用存取範圍修飾詞。抽象位置一定與封入類型採用相同的可見度。

# parsAttributesIllegalOnInherit
source: Attributes are not permitted on 'inherit' declarations
cs: Atributy u deklarací inherit nejsou povolené.
de: Attribute sind für inherit-Deklarationen nicht zulässig.
es: No se permiten atributos en declaraciones 'inherit'.
fr: Les attributs ne sont pas autorisés dans les déclarations 'inherit'
it: Gli attributi non sono consentiti in dichiarazioni 'inherit'
ja: 'inherit' 宣言に属性は使用できません
ko: 특성은 'inherit' 선언에서 허용되지 않습니다.
pl: Atrybuty są niedozwolone w deklaracjach „inherit”
pt_br: Não são permitidos atributos em declarações 'inherit'
ru: Использование атрибутов в объявлениях "inherit" не допускается
tr: 'inherit' tanımlamalarında özniteliklere izin verilmez
zh_hans: 不允许对“inherit”声明使用特性
zh_hant: 不允許在 'inherit' 宣告上使用屬性

# parsVisibilityIllegalOnInherit
source: Accessibility modifiers are not permitted on an 'inherits' declaration
cs: Modifikátory dostupnosti nejsou v deklaracích inherits povolené.
de: Zugriffsmodifizierer sind für eine inherits-Deklaration nicht zulässig.
es: No se permiten modificadores de accesibilidad en una declaración 'inherits'.
fr: Les modificateurs d'accessibilité ne sont pas autorisés sur une déclaration 'inherits'
it: Modificatori di accessibilità non consentiti in una dichiarazione 'inherits'
ja: 'inherits' 宣言にアクセシビリティ修飾子は使用できません
ko: 액세스 가능성 한정자는 'inherits' 선언에서 허용되지 않습니다.
pl: Modyfikatory dostępności nie są dozwolone w deklaracji „inherits”
pt_br: Modificadores de acessibilidade não são permitidos em uma declaração 'inherits'
ru: Использование модификаторов доступности в объявлении "inherits" не допускается
tr: 'inherits' bildiriminde erişilebilirlik değiştiricilerine izin verilmez
zh_hans: 不允许对“inherits”声明使用可访问性修饰符
zh_hant: 不允許在 'inherits' 宣告上使用存取範圍修飾詞

# parsInheritDeclarationsCannotHaveAsBindings
source: 'inherit' declarations cannot have 'as' bindings. To access members of the base class when overriding a method, the syntax 'base.SomeMember' may be used; 'base' is a keyword. Remove this 'as' binding.
cs: Deklarace inherit nemůžou mít vazby as. Pro přístup ke členům základní třídy při přepisování metody se dá použít syntaxe base.SomeMember, kde base je klíčové slovo. Tuto vazbu as odeberte.
de: Deklarationen vom Typ 'inherit' dürfen keine as-Bindungen aufweisen. Für den Zugriff auf Member der Basisklasse beim Überschreiben einer Methode kann die Syntax 'base.SomeMember' verwendet werden; 'base' ist ein Schlüsselwort. Entfernen Sie diese as-Bindung.
es: Las declaraciones 'inherit' no pueden tener enlaces 'as'. Para obtener acceso a los miembros de la clase base al invalidar un método, se puede usar la sintaxis 'base.SomeMember'; 'base' es una palabra clave. Quite este enlace 'as'.
fr: Les déclarations 'inherit' ne peuvent pas avoir de liaisons 'as'. Pour accéder aux membres de la classe de base lors de la substitution d'une méthode, la syntaxe 'base.SomeMember' peut être utilisée ; 'base' est un mot clé. Supprimez cette liaison 'as'.
it: Le dichiarazioni 'inherit' non possono contenere binding 'as'. Per accedere ai membri della classe di base quando si esegue l'override di un metodo, è possibile usare la sintassi 'base.SomeMember' dove 'base' è una parola chiave. Rimuovere il binding 'as'.
ja: 'inherit' 宣言に 'as' 束縛は指定できません。メソッドをオーバーライドするときに基底クラスのメンバーにアクセスするには、'base.SomeMember' という構文を使用できます。'base' はキーワードです。この 'as' 束縛は削除してください。
ko: 'inherit' 선언에는 'as' 바인딩을 지정할 수 없습니다. 메서드를 재정의할 때 기본 클래스의 멤버에 액세스하려면 'base.SomeMember' 구문을 사용할 수 있습니다. 'base'는 키워드입니다. 이 'as' 바인딩을 제거하세요.
pl: Deklaracje „inherit” nie mogą mieć powiązań „as”. Aby uzyskać dostęp do elementów członkowskich klasy podstawowej podczas przesłaniania metody, można użyć składni „base.ElementCzłonkowski”. „base” to słowo kluczowe. Usuń to powiązanie „as”.
pt_br: Declarações 'inherit' não podem ter associações 'as'. Para acessar membros de classe base quando um método estiver sendo substituído pode se usar a sintaxe 'base.SomeMember'; 'base' é uma palavra-chave. Remova essa associação 'as'.
ru: Объявления "inherit" не могут содержать привязки "as". Для доступа к элементам базового класса при переопределении метода можно использовать синтаксис "base.SomeMember", где "base" -- это ключевое слово. Удалить эту привязку "as".
tr: 'inherit' tanımlamalarının 'as' bağlamaları olamaz. Bir metodu geçersiz kılarken temel sınıfın üyelerine erişmek için 'base.SomeMember' sözdizimi kullanılabilir; 'base' bir anahtar sözcüktür. Bu 'as' bağlamasını kaldırın.
zh_hans: “inherit”声明不能具有“as”绑定。若要在重写某个方法时访问基类的成员，可以使用语法“base.SomeMember”；“base”为关键字。删除此“as”绑定。
zh_hant: 'inherit' 宣告不能有 'as' 繫結。若要在覆寫方法時存取基底類別的成員，可以使用 'base.SomeMember' 語法，其中 'base' 是關鍵字。請移除這個 'as' 繫結。

# parsAttributesIllegalHere
source: Attributes are not allowed here
cs: Tady atributy nejsou povolené.
de: Attribute sind an dieser Stelle nicht zulässig.
es: No se permiten atributos aquí.
fr: Les attributs ne sont pas autorisés ici
it: Gli attributi non sono consentiti in questa posizione
ja: ここでは属性を使用できません
ko: 특성은 여기에 허용되지 않습니다.
pl: Atrybuty są tutaj niedozwolone
pt_br: Não são permitidos atributos aqui
ru: Использование атрибутов не допускается
tr: Özniteliklere burada izin verilmez
zh_hans: 此处不允许使用特性
zh_hant: 這裡不允許屬性

# parsTypeAbbreviationsCannotHaveVisibilityDeclarations
source: Accessibility modifiers are not permitted in this position for type abbreviations
cs: Modifikátory dostupnosti nejsou na této pozici pro zkratky typu povolené.
de: Zugriffsmodifizierer sind an dieser Stelle für Typabkürzungen nicht zulässig.
es: No se permiten modificadores de accesibilidad en esta posición para abreviaciones de tipos.
fr: Les modificateurs d'accessibilité ne sont pas autorisés à cette position pour les abréviations de type
it: Modificatori di accessibilità non consentiti in questa posizione per le abbreviazioni di tipo
ja: 型略称のこの位置にアクセシビリティ修飾子は使用できません
ko: 액세스 가능성 한정자는 형식 약어에 대해 이 위치에 허용되지 않습니다.
pl: Modyfikatory dostępności są niedozwolone w tej pozycji dla skrótów typu
pt_br: Modificadores de acessibilidade não são permitidos nesta posição para abreviações do tipo
ru: Использование модификаторов доступности в этой позиции для сокращенных форм типов не допускается
tr: Erişilebilirlik değiştiricilerine tür kısaltmalarının bu konumunda izin verilmez
zh_hans: 对于类型缩写词，此位置不允许使用可访问性修饰符
zh_hant: 不允許在類型縮寫的這個位置使用存取範圍修飾詞

# parsEnumTypesCannotHaveVisibilityDeclarations
source: Accessibility modifiers are not permitted in this position for enum types
cs: Modifikátory dostupnosti nejsou na této pozici pro typy výčtu povolené.
de: Zugriffsmodifizierer sind an dieser Stelle für Enumerationstypen nicht zulässig.
es: No se permiten modificadores de accesibilidad en esta posición para tipos de enumeración.
fr: Les modificateurs d'accessibilité ne sont pas autorisés à cette position pour les types enum
it: I modificatori di accessibilità non sono consentiti in questa posizione per i tipi enumerazione
ja: 列挙型のこの位置にアクセシビリティ修飾子は使用できません
ko: 액세스 가능성 한정자는 열거형 형식에 대해 이 위치에 허용되지 않습니다.
pl: Modyfikatory dostępności są niedozwolone w tej pozycji dla typów wyliczeniowych
pt_br: Modificadores de acessibilidade não são permitidos nesta posição para tipos enum
ru: Использование модификаторов доступности в этой позиции для перечисляемых типов не допускается
tr: Erişilebilirlik değiştiricilerine enum türlerinin bu konumunda izin verilmez
zh_hans: 对于枚举类型，此位置不允许使用可访问性修饰符
zh_hant: 不允許在列舉類型的這個位置使用存取範圍修飾詞

# parsAllEnumFieldsRequireValues
source: All enum fields must be given values
cs: Všem polím výčtového typu se musí předat hodnota.
de: Alle Enumerationsfelder müssen Werte erhalten.
es: Deben proporcionarse valores a todos los campos de enumeración.
fr: Tous les champs enum doivent recevoir des valeurs
it: È necessario assegnare valori a tutti i campi di enumerazione
ja: すべての列挙型フィールドに値を指定する必要があります
ko: 모든 열거형 필드에는 값을 지정해야 합니다.
pl: Dla wszystkich pól wyliczeń muszą zostać podane wartości
pt_br: Todos campos enum devem ser valores especificados
ru: Всем перечисляемым полям необходимо присвоить значения
tr: Tüm enum alanları verilen değerler olmalıdır
zh_hans: 所有枚举字段都必须为给定值
zh_hant: 所有列舉欄位都必須指定值
