Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# parsSuccessiveArgsShouldBeSpacedOrTupled
source: Successive arguments should be separated by spaces or tupled, and arguments involving function or method applications should be parenthesized
cs: Po sobě jdoucí argumenty by měly být oddělené mezerami nebo by měly být řazenou kolekcí členů a argumenty zahrnující použití funkcí nebo metod by měly být v závorkách.
de: Aufeinanderfolgende Argumente sollten durch Leerzeichen getrennt oder als Tupel angegeben werden, und Argumente mit Funktions- oder Methodenanwendungen sollten in Klammern gesetzt werden.
es: Argumentos sucesivos deben separarse con espacios u organizarse en tuplas, y los argumentos que implican aplicaciones de función o método deben encerrarse entre paréntesis.
fr: Les arguments successifs doivent être séparés par des espaces ou être basés sur des tuples. En outre, les arguments impliquant des applications de fonction ou de méthode doivent être mis entre parenthèses
it: Gli argomenti successivi devono essere separati da spazi o inclusi in tuple, mentre gli argomenti che prevedono applicazioni di metodi o funzioni devono essere racchiusi tra parentesi
ja: 複数の引数が連続する場合、スペースで区切るかタプル化します。関数またはメソッド アプリケーションに関する引数の場合、かっこで囲む必要があります。
ko: 연속된 인수는 공백으로 구분하거나 튜플해야 하며 함수 또는 메서드 적용과 관련된 인수는 괄호로 묶어야 합니다.
pl: Kolejne argumenty powinny być oddzielone spacjami lub mieć postać krotek, a argumenty obejmujące aplikacje metody lub funkcji powinny być umieszczone w nawiasach okrągłych
pt_br: Argumentos sucessivos devem ser separados por espaços ou serem tuplas; argumentos envolvendo aplicações de função ou de método devem estar entre parênteses
ru: Последовательные аргументы следует разделять пробелами или включать в кортежи; аргументы, предполагающие применение функции или метода, следует заключать в круглые скобки
tr: Ardışık bağımsız değişkenler boşluklarla veya grup olarak tanımlayarak ayrılmalı ve işlev veya metot uygulamaları içeren bağımsız değişkenler ayraç içine alınmalıdır
zh_hans: 应使用空格来分隔连续参数或将这些连续参数组成元组，并且应使用括号将涉及函数或方法应用的参数括起来
zh_hant: 後續引數應該用空格分隔或採用 Tuple 形式，而且涉及函式或方法應用程式的引數應該用括號括住

# parsUnmatchedBracket
source: Unmatched '['
cs: Nespárovaná závorka [
de: Keine Entsprechung für "[".
es: '[' desemparejado.
fr: '[' non apparié
it: '[' senza corrispondenza
ja: '[' が対応しません
ko: '['의 짝이 맞지 않습니다.
pl: Niedopasowany element „[”
pt_br: '[' incompatível
ru: Несогласованный "["
tr: Eşleşmeyen '['
zh_hans: 不匹配的“[”
zh_hant: 無對應的 '['

# parsMissingQualificationAfterDot
source: Missing qualification after '.'
cs: Za tečkou chybí kvalifikace.
de: Fehlende Qualifikation nach ".".
es: Falta una calificación después de '.'
fr: Qualification manquante après '.'
it: Qualificazione mancante dopo '.'
ja: '.' の後に修飾子がありません
ko: '.' 뒤에 한정자가 없습니다.
pl: Brak kwalifikacji po znaku „.”
pt_br: Qualificação após '.' ausente
ru: Отсутствует квалификация после "."
tr: '.' sonrasında eksik nitelik
zh_hans: “.”后缺少限定
zh_hant: 在 '.' 後遺漏限定性

# parsParenFormIsForML
source: In F# code you may use 'expr.[expr]'. A type annotation may be required to indicate the first expression is an array
cs: V kódu F# můžete použít expr.[expr]. Je možné, že bude potřeba zadáním anotace typu vyznačit první výraz v poli.
de: Im F#-Code kann "expr.[expr]" verwendet werden. Möglicherweise ist eine Typanmerkung erforderlich, um den ersten Ausdruck in einem Array anzugeben.
es: En el código de F#, puede usar "expr.[expr]". Puede ser necesaria una anotación de tipos para indicar que la primera expresión es una matriz.
fr: En F#, vous pouvez utiliser 'expr.[expr]'. Une annotation de type peut être nécessaire pour indiquer que la première expression est un tableau
it: Nel codice F# è possibile usare 'espr.[espr]'. Per indicare che la prima espressione è una matrice, potrebbe essere necessaria un'annotazione di tipo
ja: F# コードでは、'expr.[expr]' を使用できます。最初の式が配列であることを示すには、型の注釈が必要です。
ko: F# 코드에서는 'expr.[expr]'을 사용할 수 있습니다. 첫 번째 식이 배열임을 나타내기 위해 형식 주석이 필요할 수 있습니다.
pl: W kodzie języka F# możesz użyć konstrukcji „wyrażenie.[wyrażenie]”. Adnotacja typu może być wymagana do wskazania, że pierwsze wyrażenie to tablica
pt_br: No código F#, é possível usar o 'expr.[expr]'. Uma anotação de tipo pode ser necessária para indicar que a primeira expressão é uma matriz
ru: В коде F# вы можете использовать выражения вида "expr.[expr]". Может потребоваться заметка с типом, чтобы указать, что первое выражение это массив
tr: F# kodunda 'expr.[expr]' kullanabilirsiniz. İlk ifadenin dizi olduğunu belirtmek için tür ek açıklaması gerekebilir
zh_hans: 可在 F# 代码中使用“expr.[expr]”。可能需要进行类型批注以指明第一个表达式是一个数组
zh_hant: 在 F# 程式碼中，您可使用 'expr.[expr]'。需要類型註釋來指示第一個運算式為陣列

# parsMismatchedQuote
source: Mismatched quotation, beginning with '{0}'
cs: Neshoda v citaci, která začíná na {0}
de: Anführungszeichen stimmen nicht überein, beginnt mit "{0}".
es: Falta el elemento de cierre de una expresión de código delimitada que comienza con '{0}'.
fr: Incompatibilité de quotation, qui commence par '{0}'
it: Quotation non corrispondente con '{0}' iniziale
ja: '{0}' で始まる引用符が対応しません
ko: 짝이 맞지 않는 인용구('{0}'(으)로 시작)입니다.
pl: Niezgodny cytat, począwszy od „{0}”
pt_br: Cotação incompatível, começando com '{0}'
ru: Несоответствующие кавычки, начиная с "{0}"
tr: '{0}' ile başlayan, eşleşmeyen alıntı
zh_hans: 不匹配的引用(以“{0}”开头)
zh_hant: 不相符的引號，以 '{0}' 開頭

# parsUnmatched
source: Unmatched '{0}'
cs: Nespárovaný výraz {0}
de: Keine Entsprechung für "{0}".
es: '{0}' desemparejado.
fr: '{0}' non apparié
it: '{0}' senza corrispondenza
ja: '{0}' が対応しません
ko: '{0}'의 짝이 맞지 않습니다.
pl: Niedopasowany element „{0}”
pt_br: '{0}' incompatível
ru: Несогласованный "{0}".
tr: Eşleşmeyen '{0}'
zh_hans: 不匹配的“{0}”
zh_hant: 無對應的 '{0}'

# parsUnmatchedBracketBar
source: Unmatched '[|'
cs: Nespárovaná dvojice znaků [|
de: Keine Entsprechung für "[|".
es: '[|' desemparejado.
fr: '[|' non apparié
it: '[|' senza corrispondenza
ja: '[|' が対応しません
ko: '[|'의 짝이 맞지 않습니다.
pl: Niedopasowany element „[|”
pt_br: '[|' incompatível
ru: Несогласованный "[|"
tr: Eşleşmeyen '[|'
zh_hans: 不匹配的“[|”
zh_hant: 無對應的 '[|'

# parsUnmatchedBrace
source: Unmatched '{{'
cs: Nespárovaná dvojice závorek {{
de: Keine Entsprechung für "{{".
es: '{{' desemparejado.
fr: '{{' non apparié
it: '{{' senza corrispondenza
ja: '{{' が対応しません
ko: '{{'의 짝이 맞지 않습니다.
pl: Niedopasowany element „{{”
pt_br: '{{' incompatível
ru: Несогласованный "{{"
tr: Eşleşmeyen '{{'
zh_hans: 不匹配的“{{”
zh_hant: 無對應的 '{{'

# parsFieldBinding
source: Field bindings must have the form 'id = expr;'
cs: Vazba pole musí být v podobě id = expr;
de: Feldbindungen müssen das Format "id = expr;" aufweisen.
es: Los enlaces de campo deben tener el formato 'id = expr;'.
fr: Les liaisons de champs doivent avoir la forme 'id = expr;'
it: Il formato dei binding di campi deve essere 'id = expr;'
ja: フィールドの束縛は 'id = expr;' という形式にする必要があります
ko: 필드 바인딩의 형식은 'id = expr;'이어야 합니다.
pl: Powiązania pól muszą mieć postać „identyfikator = wyrażenie;”
pt_br: Associações de campo devem ter a forma ' id = expr; '
ru: Привязка поля должна иметь вид "id = expr;"
tr: Alan bağlamaları 'id = expr;' biçiminde olmalıdır
zh_hans: 字段绑定的格式必须为“id = expr;”
zh_hant: 欄位繫結必須具有 'id = expr;' 形式

# parsMemberIllegalInObjectImplementation
source: This member is not permitted in an object implementation
cs: Tento člen není u implementace objektu povolený.
de: Dieser Member ist in einer Objektimplementierung unzulässig.
es: No se permite este miembro en una implementación de objeto.
fr: Ce membre n'est pas autorisé dans l'implémentation d'un objet
it: Membro non consentito in un'implementazione di oggetto
ja: オブジェクトの実装では、このメンバーは使用できません
ko: 이 멤버는 개체 구현에서 허용되지 않습니다.
pl: Ten element członkowski jest niedozwolony w implementacji obiektu
pt_br: Este membro não é permitido em uma implementação do objeto
ru: Использование этого элемента в реализации объекта не допускается
tr: Nesne uygulamasında bu üyeye izin verilmez
zh_hans: 对象实现中不允许使用此成员
zh_hant: 不允許在物件實作中使用這個成員

# parsMissingFunctionBody
source: Missing function body
cs: Chybí tělo funkce.
de: Fehlender Funktionsrumpf.
es: Falta el cuerpo de la función.
fr: Corps de la fonction manquant
it: Corpo funzione mancante
ja: 関数の本体がありません
ko: 함수 본문이 없습니다.
pl: Brak treści funkcji
pt_br: Corpo de função ausente
ru: Отсутствует тело функции
tr: Eksik işlev gövdesi
zh_hans: 缺少函数体
zh_hant: 遺漏函式主體

# parsSyntaxErrorInLabeledType
source: Syntax error in labelled type argument
cs: Chyba syntaxe v argumentu typu s popiskem
de: Syntaxfehler in Typargument mit Bezeichnung.
es: Error de sintaxis en argumento de tipo con etiqueta.
fr: Erreur de syntaxe dans l'argument de type étiqueté
it: Errore di sintassi in argomento tipo con etichetta
ja: ラベル付き型引数に構文エラーが見つかりました
ko: 레이블이 지정된 형식 인수에 구문 오류가 있습니다.
pl: Błąd składni w argumencie typu z etykietą
pt_br: Erro de sintaxe no argumento de tipo rotulado
ru: Ошибка синтаксиса в аргументе типа с меткой
tr: Etiketli tür bağımsız değişkeninde sözdizimi hatası
zh_hans: 带有标签的类型参数中的语法错误
zh_hant: 有標籤的型別引數中語法錯誤

# parsUnexpectedInfixOperator
source: Unexpected infix operator in type expression
cs: Neočekávaný operátor vpony ve výrazu typu
de: Unerwarteter infix-Operator in Typenausdruck.
es: Operador de infijo inesperado en una expresión de tipo.
fr: Opérateur infixe inattendu dans l'expression de type
it: Operatore infisso non previsto in espressione di tipo
ja: 型式に予期しない挿入演算子が見つかりました:
ko: 형식 식에 예기치 않은 중위 연산자가 있습니다.
pl: Nieoczekiwany operator infiksu w wyrażeniu typu
pt_br: Operador infixo inesperado na expressão de tipo
ru: Недопустимый инфиксный оператор в выражении типа
tr: Tür ifadesinde beklenmeyen içtakı işleci
zh_hans: 类型表达式中意外的中缀运算符
zh_hant: 類型運算式中未預期的中置運算子

# parsMultiArgumentGenericTypeFormDeprecated
source: The syntax '(typ,...,typ) ident' is not used in F# code. Consider using 'ident<typ,...,typ>' instead
cs: Syntaxe (typ,...,typ) ident se v kódu F# nepoužívá. Místo toho zkuste použít ident<typ,...,typ>.
de: Die Syntax "(typ,...,typ) ident" wird nicht in F#-Code verwendet. Verwenden Sie stattdessen "ident<typ,...,typ>".
es: La sintaxis "(typ,..., typ) ident" no se utiliza en código de F#. Considere el uso de "ident<typ,...,typ>" en lugar
fr: La syntaxe '(typ,...,typ) ident' n'est pas utilisée dans le code F#. Utilisez 'ident<typ,...,typ>' à la place
it: La sintassi '(typ,...,typ) ident' non è usata nel codice F#. Provare a usare 'ident<typ,...,typ>'
ja: 構文 '(typ,...,typ) ident' は F# コードでは使用されません。代わりに、'ident<typ,...,typ>' を使用してください
ko: '(typ,...,typ) ident' 구문은 F# 코드에서 사용되지 않습니다. 대신 'ident<typ,...,typ>'를 사용하세요.
pl: Składnia „(typ,...,typ) identyfikator” nie jest używana w kodzie F#. Rozważ użycie zamiast tego składni „identyfikator<typ,...,typ>”
pt_br: A sintaxe '(typ,...,typ) ident' não é usada no código F#. Use 'ident<typ,...,typ>'
ru: Синтаксис '(typ,...,typ) ident' не используется в коде F#. Используйте синтаксис 'ident<typ,...,typ>'
tr: F# kodunda '(typ,...,typ) ident' söz dizimi kullanılmaz . Bunun yerine 'ident<typ,...,typ>' söz dizimini kullanmayı göz önünde bulundurun
zh_hans: F# 代码中不使用 "(typ,...,typ) ident" 语法。请考虑改用 "ident<typ,...,typ>"
zh_hant: F# 程式碼中未使用 '(typ,...,typ) ident' 語法。請考慮改用 'ident<typ,...,typ>'

# parsInvalidLiteralInType
source: Invalid literal in type
cs: Neplatný literál v typu
de: Ungültiges Literal im Typ
es: Literal no válido en el tipo
fr: Littéral non valide dans le type
it: Valore letterale non valido nel tipo
ja: 型のリテラルが無効です
ko: 형식의 리터럴이 잘못되었습니다.
pl: Nieprawidłowy literał w typie
pt_br: Literal inválido no tipo
ru: Недопустимый литерал в типе
tr: Türde geçersiz sabit değer
zh_hans: 类型中的文本无效
zh_hant: 類型中的常值無效

# parsUnexpectedOperatorForUnitOfMeasure
source: Unexpected infix operator in unit-of-measure expression. Legal operators are '*', '/' and '^'.
cs: Neočekávaný operátor vpony ve výrazu měrné jednotky. Platnými operátory jsou znaky *, / a ^.
de: Unerwarteter infix-Operator in Maßeinheitenausdruck. Zulässige Operatoren sind "*", "/" und "^".
es: Operador de infijo inesperado en una expresión de unidad de medida. Los operadores válidos son '*', '/' y '^'.
fr: Opérateur infixe inattendu dans l'expression de l'unité de mesure. Les opérateurs conformes sont '*', '/' et '^'.
it: Operatore infisso non previsto in espressione di unità di misura. Operatori validi: '*', '/' e '^'.
ja: 単位式に予期しない挿入演算子が見つかりました。正しい演算子は '*'、'/'、および '^' です。
ko: 측정 단위 식에 예기치 않은 중위 연산자가 있습니다. 올바른 연산자는 '*', '/' 및 '^'입니다.
pl: Nieoczekiwany operator infiksu w wyrażeniu jednostki miary. Dozwolone operatory: „*”, „/” i „^”.
pt_br: Operador infixo inesperado na expressão de unidade de medida. Os operadores válidos são '*','/' e '^'.
ru: Недопустимый инфиксный оператор в выражении единицы измерения. Допустимые операторы: "*", "/" и "^".
tr: Ölçü birimi ifadesinde beklenmeyen içtakı işleci. Geçerli işleçler: '*', '/' ve '^'.
zh_hans: 度量单位表达式中意外的中缀运算符。合法的运算符为“*”、“/”和“^”。
zh_hant: 測量單位運算式中未預期的中置運算子。合法的運算子為 '*'、'/' 和 '^'。

# parsUnexpectedIntegerLiteralForUnitOfMeasure
source: Unexpected integer literal in unit-of-measure expression
cs: Neočekávaný celočíselný literál ve výrazu měrné jednotky
de: Unerwartetes Integer-Literal in Maßeinheitenausdruck.
es: Literal entero inesperado en una expresión de unidad de medida.
fr: Littéral d'entier inattendu dans l'expression de l'unité de mesure
it: Valore letterale Integer non previsto in espressione di unità di misura
ja: 単位式に予期しない整数リテラルが見つかりました:
ko: 측정 단위 식에 예기치 않은 정수 리터럴이 있습니다.
pl: Nieoczekiwany literał całkowity w wyrażeniu jednostki miary
pt_br: Literal de inteiro inesperado na expressão de unidade de medida
ru: Недопустимый целочисленный литерал в выражении единицы измерения
tr: Ölçü birimi ifadesinde beklenmeyen tamsayı sabit değeri
zh_hans: 度量单位表达式中意外的整数文本
zh_hant: 測量單位運算式中未預期的整數常值

# parsUnexpectedTypeParameter
source: Syntax error: unexpected type parameter specification
cs: Chyba syntaxe: neočekávaná specifikace parametru typu
de: Syntaxfehler: Unerwartete Typparameterangabe.
es: Error de sintaxis: especificación de parámetro de tipo inesperada.
fr: Erreur de syntaxe : spécification du paramètre de type inattendue
it: Errore di sintassi: specifica di parametro di tipo non prevista
ja: 構文エラー: 予期しない型パラメーターが指定されました
ko: 구문 오류: 예기치 않은 형식 매개 변수 지정입니다.
pl: Błąd składni: nieoczekiwana specyfikacja parametru typu
pt_br: Erro de sintaxe: especificação de parâmetro de tipo inesperada
ru: Синтаксическая ошибка: недопустимая спецификация параметра типа
tr: Sözdizimi hatası: beklenmeyen tür parametresi belirtimi
zh_hans: 语法错误: 意外的类型参数规范
zh_hant: 語法錯誤: 未預期的型別參數規格

# parsMismatchedQuotationName
source: Mismatched quotation operator name, beginning with '{0}'
cs: Neshoda v názvu operátoru citace (začíná na {0})
de: Anführungszeichen-Operatorname stimmt nicht überein, beginnt mit "{0}".
es: Falta el elemento de clausura en un nombre de operador de expresión de código delimitada que comienza con '{0}'.
fr: Incompatibilité du nom d'opérateur de quotation, qui commence par '{0}'
it: Nome operatore di quotation non corrispondente con '{0}' iniziale
ja: '{0}' で始まる演算子名の引用符が対応しません
ko: 짝이 맞지 않는 인용구 연산자 이름('{0}'(으)로 시작)입니다.
pl: Niezgodna nazwa operatora cytatu, począwszy od „{0}”
pt_br: Nome de operador de cotação incompatível, começando com '{0}'
ru: Несоответствующее имя оператора кавычки, начиная с "{0}"
tr: '{0}' ile başlayan, eşleşmeyen alıntı işleci adı
zh_hans: 不匹配的引用运算符名称(以“{0}”开头)
zh_hant: 不相符的引號運算子名稱，以 '{0}' 開頭

# parsActivePatternCaseMustBeginWithUpperCase
source: Active pattern case identifiers must begin with an uppercase letter
cs: Identifikátory velikosti písmen aktivního vzoru musí začínat velkým písmenem.
de: Schreibweisenbezeichner für das aktive Muster müssen mit einem Großbuchstaben beginnen.
es: Los identificadores de patrón activo deben comenzar con una letra mayúscula.
fr: Les identificateurs de casse du modèle actif doivent commencer par une lettre majuscule
it: Gli identificatori di distinzione tra maiuscole e minuscole nei criteri di ricerca attivi devono iniziare con una lettera maiuscola
ja: アクティブ パターンのケース識別子は先頭を大文字にする必要があります
ko: 활성 패턴 케이스 식별자는 대문자로 시작해야 합니다.
pl: Aktywne identyfikatory przypadku wzorca muszą się rozpoczynać od wielkiej litery
pt_br: Identificadores de caso de padrão ativo precisam ser iniciados com uma letra maiúscula
ru: Активные идентификаторы вариантов шаблона должны начинаться с прописной буквы
tr: Etkin desen örneği tanımlayıcıları büyük harfle başlamalıdır
zh_hans: 活动模式用例标识符必须以大写字母开头
zh_hant: 現用模式大小寫識別項必須以大寫字母開頭

# parsActivePatternCaseContainsPipe
source: The '|' character is not permitted in active pattern case identifiers
cs: Znak | není u identifikátorů velikosti písmen aktivních vzorů povolený.
de: Das Zeichen '|' ist nicht in Schreibweisenbezeichnern für das aktive Muster zulässig
es: El carácter '|' no se permite en identificadores de modelo activo
fr: Le caractère '|' n'est pas autorisé dans des identificateurs de cas de modèle actif
it: Il carattere '|' non è consentito in identificatori di distinzione tra maiuscole e minuscole di criteri attivi
ja: 文字 ' |' は、アクティブなパターンのケース識別子では許可されていません
ko: '|' 문자는 활성 패턴 케이스 식별자에 허용되지 않습니다.
pl: Znak „|” nie jest dozwolony w identyfikatorach przypadku aktywnego wzorca
pt_br: O caractere '|' não é permitido em identificadores de caso de padrão ativo
ru: Символ "|" запрещено использовать в идентификаторах вариантов активного шаблона
tr: '|' karakterine ektin desen örneği tanımlayıcılarında izin verilmez
zh_hans: 不允许在活动模式用例标识符中使用“|”字符
zh_hant: 現用模式大小寫識別碼不得使用字元 '|'

# parsIllegalDenominatorForMeasureExponent
source: Denominator must not be 0 in unit-of-measure exponent
cs: Jmenovatel nesmí být 0 v exponentu měrné jednotky.
de: Nenner darf in der Maßeinheit des Exponenten nicht 0 sein
es: El denominador no debe ser 0 en el exponente de unidad de medida
fr: La valeur de l’exposant en unité de mesure du dénominateur ne doit pas être égale à 0
it: Il denominatore non deve essere 0 nell'esponente dell'unità di misura
ja: 分母は単位指数で、0 以外でなければなりません
ko: 측정 단위 지수에서 분모는 0일 수 없습니다.
pl: Mianownik w wykładniku jednostki miary nie może być równy 0
pt_br: O denominador não deve ser 0 no expoente de unidade de medida
ru: Делитель в экспоненте единицы измерения не должен равняться 0.
tr: Ölçü birimi üssünde payda 0 olmamalıdır
zh_hans: 度量单位指数中的分母不得为 0
zh_hant: 度量單位指數的分母不得為 0

# parsNoEqualShouldFollowNamespace
source: No '=' symbol should follow a 'namespace' declaration
cs: Po deklaraci namespace nemůže následovat symbol =.
de: Auf eine namespace-Deklaration darf kein "="-Zeichen folgen.
es: Después de una declaración 'namespace' no puede haber un símbolo '='.
fr: Aucun symbole '=' ne doit suivre une déclaration 'namespace'
it: La dichiarazione 'namespace' non deve essere seguita da simboli '='
ja: 'namespace' 宣言の後に '=' 記号は指定できません
ko: 'namespace' 선언 뒤에 '=' 기호가 오면 안 됩니다.
pl: Symbol „=” nie może następować po deklaracji „namespace”
pt_br: Nenhum símbolo '=' deve seguir uma declaração 'namespace'
ru: После объявления "namespace" отсутствует символ "="
tr: 'namespace' bildirimini bir '=' simgesi izleyemez
zh_hans: “namespace”声明后面不应有“=”符号
zh_hant: 不得將 '=' 符號跟在 'namespace' 宣告之後

# parsSyntaxModuleStructEndDeprecated
source: The syntax 'module ... = struct .. end' is not used in F# code. Consider using 'module ... = begin .. end'
cs: Syntaxe module ... = struct ... end se v kódu F# nepoužívá. Zvažte použití syntaxe module ... = begin ... end.
de: Die Syntax "module ... = struct .. end" wird im F#-Code nicht verwendet. Verwenden Sie stattdessen "module ... = begin .. end".
es: La sintaxis 'module ... = struct .. end' no se usa en el código de F#. Considere el uso de 'module ... = begin .. end'.
fr: La syntaxe 'module ... = struct .. end' n'est pas utilisée pour le code F#. Utilisez 'module ... = begin .. end'
it: La sintassi 'module ... = struct .. end' non è usata nel codice F#. Provare a usare 'module ... = begin .. end'
ja: F# コードでは ... 'module ... = struct .. end' という構文は使用されません。'module ... = begin .. end' を使用してください。
ko: 'module ... = struct .. end' 구문은 F# 코드에서 사용되지 않습니다. 'module ... = begin .. end'를 사용하세요.
pl: Składnia „module ... = struct .. end” nie jest używana w kodzie języka F#. Rozważ użycie składni „module ... = begin .. end”
pt_br: A sintaxe 'module ... = struct .. end' não é usada no código F#. Considere usar 'module ... = begin .. end'
ru: Синтаксис "module ... = struct .. end" не используется в код F#. Рекомендуется использовать синтаксис "module ... = begin .. end"
tr: 'module ... = struct .. end' sözdizimi F# kodunda kullanılmaz. 'module ... = begin .. end' kullanmayı düşünün
zh_hans: 语法“module ... = struct .. end”不可用于 F# 代码。请考虑使用“module ... = begin .. end”
zh_hant: F# 程式碼中不使用語法 'module ... = struct .. end'。請考慮使用 'module ... = begin .. end'

# parsSyntaxModuleSigEndDeprecated
source: The syntax 'module ... : sig .. end' is not used in F# code. Consider using 'module ... = begin .. end'
cs: Syntaxe module ... : sig .. end se v kódu F# nepoužívá. Zvažte použití syntaxe module ... = begin ... end.
de: Die Syntax "module ... : sig .. end" wird im F#-Code nicht verwendet. Verwenden Sie stattdessen "module ... = begin .. end".
es: La sintaxis 'module ... : sig .. end' no se usa en el código de F#. Considere el uso de 'module ... = begin .. end'.
fr: La syntaxe 'module ... : sig .. end' n'est pas utilisée pour le code F#. Utilisez 'module ... = begin .. end'
it: La sintassi 'module ... : sig .. end' non è usata nel codice F#. Provare a usare 'module ... = begin .. end'
ja: F# コードでは 'module ... : sig .. end' という構文は使用されません。'module ... = begin .. end' を使用してください。
ko: 'module ... : sig .. end' 구문은 F# 코드에서 사용되지 않습니다. 'module ... = begin .. end'를 사용하세요.
pl: Składnia „module ... : sig .. end” nie jest używana w kodzie języka F#. Rozważ użycie składni „module ... = begin .. end”
pt_br: A sintaxe 'module ... : sig .. end' não é usada no código F#. Considere usar 'module ... = begin .. end'
ru: Синтаксис "module ... : sig .. end" не используется в коде F#. Рекомендуется использовать синтаксис "module ... = begin .. end"
tr: 'module ... : sig .. end' sözdizimi F# kodunda kullanılmaz. 'module ... = begin .. end' kullanmayı düşünün
zh_hans: 语法“module ... : sig .. end”不可用于 F# 代码。请考虑使用“module ... = begin .. end”
zh_hant: F# 程式碼中不使用語法 'module ... : sig .. end'。請考慮使用 'module ... = begin .. end'

# tcStaticFieldUsedWhenInstanceFieldExpected
source: A static field was used where an instance field is expected
cs: Použili jste statické pole tam, kde se očekává pole instance.
de: Ein statisches Feld wurde an einer Stelle verwendet, an der ein Instanzfeld erwartet wurde.
es: Se usó un campo estático donde se espera un campo de instancia.
fr: Un champ statique a été utilisé à l'emplacement où un champ d'instance est attendu
it: È stato utilizzato un campo statico in una posizione in cui era previsto un campo di istanza
ja: インスタンス フィールドが必要な場所に静的フィールドが使用されました
ko: 인스턴스 필드가 필요한데 정적 필드가 사용되었습니다.
pl: Użyto pola statycznego w miejscu, w którym jest oczekiwane pole wystąpienia
pt_br: Um campo estático foi usado onde era esperado um campo de instância
ru: Там, где требовалось поле экземпляра, было использовано статическое поле
tr: Örnek alanı beklenen yerde statik alan kullanılmış
zh_hans: 在需要实例字段的位置使用了静态字段
zh_hant: 在需要執行個體欄位的地方使用了靜態欄位
