Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# tcExpressionWithIfRequiresParenthesis
source: This list or array expression includes an element of the form 'if ... then ... else'. Parenthesize this expression to indicate it is an individual element of the list or array, to disambiguate this from a list generated using a sequence expression
cs: Tento výraz seznamu nebo pole zahrnuje element s formulací if ... then ... else. Ohraničte tento výraz závorkami, aby bylo jasné, že jde o samostatný prvek seznamu nebo pole. Odlišíte ho tak od seznamu generovaného pomocí výrazu pořadí.
de: Dieser Listen- oder Arrayausdruck enthält ein Element im Format "if ... then ... else". Setzen Sie diesen Ausdruck in Klammern, um ihn als einzelnes Element der Liste oder des Arrays zu kenntlich zu machen und den Ausdruck von einer Liste zu unterscheiden, die mithilfe eines Sequenzausdrucks erzeugt wurde.
es: Esta expresión de matriz o lista incluye un elemento con el formato 'if ... then ... else'. Ponga paréntesis a esta expresión para indicarla como elemento individual de la lista o matriz, con el fin de eliminar la ambigüedad respecto a una lista generada con una expresión de secuencia.
fr: Cette expression de liste ou de tableau comprend un élément sous la forme 'if ... then ... else'. Mettez cette expression entre parenthèses pour indiquer qu'il s'agit d'un élément individuel de la liste ou du tableau, afin de lever l'ambigüité par rapport à une liste générée à l'aide d'une expression de séquence
it: Questa espressione elenco o matrice include un elemento nel formato 'if ... then ... else'. Racchiudere l'espressione in parentesi per indicare che si tratta di un elemento singolo dell'elenco o della matrice allo scopo di eliminare l'ambiguità rispetto a un elenco generato mediante un'espressione sequenza
ja: このリスト式または配列式には、'if ... then ... else' という形式の要素が含まれます。この式をかっこで囲んでリストまたは配列の個別の要素であることを示し、シーケンス式を使用して生成されたリストとこのリストを区別してください。
ko: 이 목록 또는 배열 식에는 'if ... then ... else' 형식의 요소가 포함되어 있습니다. 식이 목록 또는 배열의 개별 요소임을 나타내고 이를 시퀀스 식을 사용하여 생성된 목록과 구분하려면 이 식을 괄호로 묶으세요.
pl: To wyrażenie listy lub tablicy zawiera element „if ... then ... else”. Ujmij to wyrażenie w nawiasy, aby określić, że jest to pojedynczy element listy lub tablicy, w celu odróżnienia go od listy wygenerowanej przy użyciu wyrażenia sekwencji
pt_br: Esta expressão de lista ou matriz inclui um elemento da forma 'if ... then ... else'. Use parênteses nesta expressão para indicar os elementos individuais da lista ou matriz. Use uma expressão de sequência para tirar esta ambiguidade desta lista gerada
ru: Данный список выражений массива включает элемент формы "if ... then ... else". Заключите данное выражение в скобки, чтобы показать, что это отдельный элемент списка или массива, отличающийся от списка, созданного с использованием выражения последовательности
tr: Liste veya dizi ifadesi 'if ... then ... else' biçiminde bir öğe içeriyor. Listenin veya dizinin bağımsız bir öğesi olduğunu belirtmek, dizi ifadesi kullanılarak oluşturulmuş listeden ayırt etmek için bu ifadeyi ayraç içine alın
zh_hans: 此列表或数组表达式包括采用“if ... then ... else”格式的元素。请使用括号将此表达式括起来以指示它是列表或数组中的单个元素，从而将此表达式与使用序列表达式生成的列表进行区分
zh_hant: 這個清單或陣列運算式包含 'if ... then ... else' 形式的項目。請將這個運算式括在括號內，表示它是清單或陣列的個別項目，以區別這一項與使用循序項運算式產生的清單

# tcUnableToParseFormatString
source: Unable to parse format string '{0}'
cs: Formátovací řetězec {0} se nedá parsovat.
de: Formatzeichenfolge "{0}" kann nicht analysiert werden.
es: No se puede analizar la cadena de formato '{0}'.
fr: Impossible d'analyser la chaîne de format '{0}'
it: Non è possibile analizzare la stringa di formato '{0}'
ja: 書式指定文字列 '{0}' を解析できません
ko: 서식 문자열 '{0}'을(를) 구문 분석할 수 없습니다.
pl: Nie można przeanalizować ciągu formatu „{0}”
pt_br: Não é possível analisar a cadeia de caracteres de formato '{0}'
ru: Не удается выполнить синтаксический анализ строки формата "{0}"
tr: '{0}' biçim dizesi ayrıştırılamıyor
zh_hans: 无法分析格式字符串“{0}”
zh_hant: 無法剖析格式字串 '{0}'

# tcListLiteralMaxSize
source: This list expression exceeds the maximum size for list literals. Use an array for larger literals and call Array.ToList.
cs: Tento výraz seznamu překračuje maximální velikost literálů seznamu. Použijte pole pro rozsáhlejší literály a volejte metodu Array.ToList.
de: Dieser Listenausdruck übersteigt die maximale Größe für Listenliterale. Verwenden Sie für umfangreichere Literale ein Array, und rufen Sie "Array.ToList" auf.
es: La expresión de lista supera el tamaño máximo para literales de lista. Use una matriz para literales de mayor tamaño y llame a Array.ToList.
fr: Cette expression de liste dépasse la taille maximale des littéraux de liste. Utilisez un tableau pour des littéraux plus importants et appelez Array.ToList.
it: Questa espressione elenco supera la dimensione massima per i valori letterali di elenco. Usare una matrice per valori letterali più grandi e chiamare Array.ToList.
ja: このリスト式は、リスト リテラルの最大サイズを超えています。より大きなリテラルの配列を使用し、Array.ToList を呼び出してください。
ko: 이 목록 식은 목록 리터럴의 최대 크기를 초과합니다. 보다 큰 리터럴을 위한 배열을 사용하고 Array.ToList를 호출하세요.
pl: To wyrażenie listy przekracza maksymalny rozmiar literałów list. W przypadku większych literałów użyj tablicy i wywołaj element Array.ToList.
pt_br: Esta expressão de lista excede o tamanho máximo para literais de lista. Use uma matriz para literais maiores e chame Array.ToList.
ru: Данное выражение списка превышает максимальный размер литералов списка. Для больших литералов используется массив и вызывается Array.ToList.
tr: Bu liste ifadesi liste sabit değerlerinin en büyük boyutunu aşıyor. Daha büyük sabit değerler için dizi kullanın ve Array.ToList işlevini çağırın.
zh_hans: 此列表表达式超出列表文本的最大大小。请对大型的文本使用数组并调用 Array.ToList。
zh_hant: 這個清單運算式已超過清單常值的大小上限。請使用供較大常值使用的陣列，並呼叫 Array.ToList。

# tcExpressionFormRequiresObjectConstructor
source: The expression form 'expr then expr' may only be used as part of an explicit object constructor
cs: Notace expr then expr se dá ve výrazu použít jenom v rámci explicitního konstruktoru objektu.
de: Das Ausdrucksformat 'expr then expr' darf nur als Teil eines expliziten Objektkonstruktors verwendet werden.
es: El formato de expresión 'expr then expr' se puede usar sólo como parte de un constructor de objeto explícito.
fr: La forme d'expression 'expr then expr' ne peut être utilisée que dans le cadre d'un constructeur d'objet explicite
it: Il formato di espressione 'expr then expr' può essere utilizzato solo all'interno di un costruttore di oggetto esplicito
ja: 明示的なオブジェクト コンストラクターの一部としてのみ、'expr then expr' という形式の式を使用できます
ko: 식 형식 'expr then expr'은 명시적 개체 생성자의 일부로만 사용할 수 있습니다.
pl: Wyrażenie w postaci „wyrażenie then wyrażenie” może być używane tylko jako część jawnego konstruktora obiektów
pt_br: A forma de expressão 'expr then expr' só pode ser usada como parte de um construtor de objeto explícito
ru: Форма выражения ''expr then expr'' может использоваться только как часть конструктора явного объекта
tr: 'expr then expr' ifade biçimi yalnızca açık nesne oluşturucunun parçası olarak kullanılabilir
zh_hans: 表达式格式“expr then expr”只能用作显式对象构造函数的一部分
zh_hant: 運算式形式 'expr then expr' 只能用來做為明確物件建構函式的一部分

# tcNamedArgumentsCannotBeUsedInMemberTraits
source: Named arguments cannot be given to member trait calls
cs: Pojmenované argumenty nejde předávat voláním vlastností členů.
de: Benannte Argumente dürfen nicht an Aufrufe für Membermerkmale übergeben werden.
es: No se pueden dar argumentos con nombre a llamadas de cola de miembro.
fr: Impossible de fournir des arguments nommés aux appels de membres de trait
it: Non è possibile assegnare argomenti denominati a chiamate di tratti del membro
ja: 名前付き引数をメンバーの特徴 (trait) の呼び出しに指定することはできません
ko: 명명된 인수는 멤버 특성 호출에 지정할 수 없습니다.
pl: Nazwane argumenty nie mogą być określane dla wywołań cech elementów członkowskich
pt_br: Argumentos nomeados não podem ser dados às chamadas características de membros
ru: Именованные аргументы не могут применяться к вызовам свойств элемента
tr: Adlandırılmış bağımsız değişkenler üye nitelik çağrılarına verilemez
zh_hans: 不能将命名参数提供给成员特征调用
zh_hant: 不能將具名引數指定給成員特性呼叫

# tcNotValidEnumCaseName
source: This is not a valid name for an enumeration case
cs: Toto není platný název případu výčtu.
de: Dies ist kein gültiger Name für einen Enumerationsfall.
es: Este no es un nombre válido para un caso de enumeración.
fr: Nom non valide pour un cas d'énumération
it: Nome non valido per un case di enumerazione
ja: 列挙型のケースの有効な名前ではありません
ko: 열거형 케이스에 대한 올바른 이름이 아닙니다.
pl: To nie jest prawidłowa nazwa przypadku wyliczenia
pt_br: Este não é um nome válido para um caso de enumeração
ru: Недопустимое имя для случая перечисления
tr: Bu, sabit listesi durumu olarak geçerli bir ad değil
zh_hans: 对于枚举用例来说，这不是有效的名称
zh_hant: 這不是列舉案例的有效名稱

# tcFieldIsNotMutable
source: This field is not mutable
cs: Toto pole není měnitelné.
de: Dieses Feld ist nicht änderbar.
es: Este campo no es mutable.
fr: Ce champ n'est pas mutable
it: Questo campo non è modificabile
ja: このフィールドは変更可能ではありません
ko: 이 필드는 변경할 수 없습니다.
pl: Nie można modyfikować tego pola
pt_br: Este campo não é mutável
ru: Это поле не является изменяемым
tr: Bu alan değiştirilebilir değil
zh_hans: 此字段是不可变的
zh_hant: 這個欄位不是可變動的欄位

# tcConstructRequiresListArrayOrSequence
source: This construct may only be used within list, array and sequence expressions, e.g. expressions of the form 'seq {{ ... }}', '[ ... ]' or '[| ... |]'. These use the syntax 'for ... in ... do ... yield...' to generate elements
cs: Tento konstruktor se dá použít jenom ve výrazech seznamů, polí a posloupností, například ve výrazech ve formě seq {{ ... }}, [ ... ] nebo [| ... |]. Tyto výrazy používají syntaxi for ... in ... do ... yield... ke generování elementů.
de: Dieses Konstrukt darf nur innerhalb von Listen-, Array- und Sequenzausdrücken verwendet werden, also Ausdrücken im Format "seq {{ ... }}", "[ ... ]" oder "[| ... |]". Bei diesen wird zum Generieren von Elementen die Syntax "for ... in ... do ... yield..." verwendet.
es: Esta construcción solo se puede usar en expresiones de lista, matriz y secuencia; por ejemplo, expresiones con el formato "seq {{ ... }}", "[ ... ]" o "[| ... |]". Estas expresiones usan la sintaxis "for ... in ... do ... yield..." para generar elementos.
fr: Cette construction ne peut être utilisée que dans des expressions de liste, de tableau et de séquence, par exemple des expressions sous la forme 'seq {{ ... }}', '[ ... ]' ou '[| ... |]'. Celles-ci utilisent la syntaxe 'for ... in ... do ... yield...' pour générer des éléments
it: Il costrutto può essere usato solo in espressioni sequenza, elenco e matrice, ad esempio espressioni nel formato 'seq {{ ... }}', '[ ... ]' o '[| ... |]'. Viene usata la sintassi 'for ... in ... do ... yield...' per generare elementi
ja: このコンストラクトは、リスト式、配列式、およびシーケンス式内でのみ使用できます (たとえば、'seq {{ ... }}'、'[ ... ]'、'[| ... |]' などの形式の式)。この場合、要素を生成するには 'for ... in ... do ... yield...' という構文を使用します。
ko: 이 생성자는 목록, 배열 및 시퀀스 식 내에서만 사용할 수 있습니다(예: 'seq {{ ... }}', '[ ... ]' 또는 '[| ... |]' 형식의 식). 이러한 식은 'for ... in ... do ... yield...' 구문을 사용하여 요소를 생성합니다.
pl: Ta konstrukcja może być używana tylko w wyrażeniach list, tablic i sekwencji, na przykład w wyrażeniach „seq {{ ... }}”, „[ ... ]” lub „[| ... |]”. Generują one elementy za pomocą składni „for ... in ... do ... yield...”
pt_br: Esse constructo só pode ser utilizado em expressões de lista, de matriz e de sequência, como expressões da forma 'seq {{ ... }}', '[ ... ]' ou '[| ... |]', por exemplo. Elas usam a sintaxe 'for ... in ... do ... yield...' para gerar elementos
ru: Использовать эту конструкцию можно только в выражениях списка, массива и последовательности, например в выражениях формы "seq {{ … }}", "[ … ]" или "[| … |]". Они создают элементы с помощью синтаксиса "for … in … do … yield…"
tr: Bu yapı, yalnızca liste, dizi ve sıra ifadeleri içinde (örn. 'seq {{ ... }}', '[ ... ]' veya '[| ... |]' biçimindeki ifadelerde) kullanılabilir. Bunlarda öğe oluşturmak için 'for ... in ... do ... yield...' söz dizimi kullanılır
zh_hans: 只能在列表、数组和序列表达式中使用此构造函数，例如格式为“seq {{ ... }}”、“[ ... ]”或“[| ... |]”的表达式。它们将使用语法“for ... in ... do ... yield...”来生成元素
zh_hant: 此建構只可用於清單、陣列以及循序項運算式內，例如 'seq {{ ... }}'、'[ ... ]' 或 '[| ... |]' 形式的運算式。這些運算式使用語法 'for ... in ... do ... yield...' 來產生元素

# tcConstructRequiresComputationExpressions
source: This construct may only be used within computation expressions. To return a value from an ordinary function simply write the expression without 'return'.
cs: Tento konstruktor se dá použít jenom ve výrazech výpočtu. Pokud chcete vracet hodnotu z běžné funkce, napište jednoduše výraz bez return.
de: Dieses Konstrukt darf nur innerhalb von Berechnungsausdrücken verwendet werden. Wenn ein Wert von einer normalen Funktion zurückgegeben werden soll, lassen Sie einfach "return" im Ausdruck weg.
es: Esta construcción se puede usar solo en expresiones de cómputo. Para devolver un valor desde una función ordinaria, simplemente escriba la expresión sin 'return'.
fr: Cette construction ne peut être utilisée que dans des expressions de calcul. Pour retourner une valeur à partir d'une fonction ordinaire, écrivez simplement l'expression sans 'return'.
it: Questo costrutto può essere utilizzato solo in espressioni di calcolo. Per restituire un valore da una funzione ordinaria, è sufficiente scrivere l'espressione senza 'return'.
ja: このコンストラクトはコンピュテーション式内でのみ使用できます。通常の関数から値を返すには、'return' を使用せずに式を記述してください。
ko: 이 생성자는 계산 식 내에서만 사용할 수 있습니다. 일반 함수에서 값을 반환하려면 단순히 'return' 없이 식을 작성하세요.
pl: Ta konstrukcja może być używana tylko w wyrażeniach obliczeń. Aby zwrócić wartość ze zwykłej funkcji, wpisz wyrażenie bez wyrazu „return”.
pt_br: Esse constructo só pode ser utilizado em expressões de computação. Para retornar um valor de uma função comum apenas escreva a expressão sem o 'return'.
ru: Данный конструктор может быть использован только в вычислительных выражениях Для возврата значения из обычной функции просто напишите выражение без "return".
tr: Bu yapı yalnızca hesaplama ifadeleri içinde kullanılabilir. Normal bir işlevden değer döndürmek için sadece ifadeyi 'return' olmadan yazın.
zh_hans: 只能在计算表达式中使用此构造。若要从普通函数返回值，只需编写不带“return”的表达式。
zh_hant: 這個建構只能用在計算運算式內。若要從一般函式傳回值，只要撰寫沒有的 'return' 運算式。

# tcConstructRequiresSequenceOrComputations
source: This construct may only be used within sequence or computation expressions
cs: Tento konstruktor se dá použít jenom ve výrazech pořadí nebo výpočtu.
de: Dieses Konstrukt darf nur innerhalb von Sequenz- oder Berechnungsausdrücken verwendet werden.
es: Esta construcción solo se puede usar en expresiones de secuencia y cómputo.
fr: Cette construction ne peut être utilisée que dans des expressions de calcul ou de séquence
it: Questo costrutto può essere utilizzato solo in espressioni sequenza o di calcolo
ja: このコンストラクトはシーケンス式およびコンピュテーション式内でのみ使用できます
ko: 이 생성자는 시퀀스 또는 계산 식 내에서만 사용할 수 있습니다.
pl: Ta konstrukcja może być używana tylko w wyrażeniach sekwencji lub obliczeń
pt_br: Esse constructo só pode ser utilizado em expressões de sequência ou computação
ru: Данный конструктор может быть использован только в вычислительных выражениях или выражениях последовательностей
tr: Bu yapı yalnızca dizi ve hesaplama ifadeleri içinde kullanılabilir
zh_hans: 只能在序列或计算表达式中使用此构造
zh_hant: 這個建構只能用在循序項運算式或計算運算式內

# tcConstructRequiresComputationExpression
source: This construct may only be used within computation expressions
cs: Tento konstruktor se dá použít jenom ve výrazech výpočtu.
de: Dieses Konstrukt darf nur innerhalb von Berechnungsausdrücken verwendet werden.
es: Esta construcción se puede usar solo en expresiones de cómputo.
fr: Cette construction ne peut être utilisée que dans des expressions de calcul
it: Questo costrutto può essere utilizzato solo in espressioni di calcolo
ja: このコンストラクトはコンピュテーション式内でのみ使用できます
ko: 이 생성자는 계산 식 내에서만 사용할 수 있습니다.
pl: Ta konstrukcja może być używana tylko w wyrażeniach obliczeń
pt_br: Esse constructo só pode ser utilizado em expressões de computação
ru: Данный конструктор может быть использован только в вычислительных выражениях
tr: Bu yapı yalnızca hesaplama ifadeleri içinde kullanılabilir
zh_hans: 只能在计算表达式中使用此构造
zh_hant: 這個建構只能用在計算運算式內

# tcInvalidIndexerExpression
source: Invalid indexer expression
cs: Neplatný výraz indexeru
de: Ungültiger Indexerausdruck.
es: Expresión de indizador no válido.
fr: Expression d'indexeur non valide
it: Espressione di indicizzatore non valida
ja: インデクサー式が無効です
ko: 인덱서 식이 잘못되었습니다.
pl: Nieprawidłowe wyrażenie indeksatora
pt_br: Expressão de indexador inválida
ru: Недопустимое выражение индексатора
tr: Geçersiz dizin erişimcisi ifadesi
zh_hans: 索引器表达式无效
zh_hant: 無效的索引子運算式

# tcObjectOfIndeterminateTypeUsedRequireTypeConstraint
source: The operator 'expr.[idx]' has been used on an object of indeterminate type based on information prior to this program point. Consider adding further type constraints
cs: Operátor expr.[idx] se používá u objektu neurčitého typu založeného na informacích před tímto místem v programu. Zvažte přidání dalších omezení typu.
de: Der expr.[idx]-Operator hat auf Grundlage von Informationen vor diesem Programmpunkt ein Objekt unbestimmten Typs verwendet. Fügen Sie ggf. weitere Typeinschränkungen hinzu.
es: Se ha usado el operador "expr.[idx]" en un objeto de tipo indeterminado basado en información anterior a este punto del programa. Considere agregar más restricciones de tipo.
fr: L'opérateur 'expr.[idx]' a été utilisé sur un objet de type indéterminé basé sur des informations situées avant ce point du programme. Ajoutez des contraintes de type supplémentaires
it: L'operatore 'expr.[idx]' è stato usato in un oggetto di tipo non determinato in base alle informazioni precedenti a questo punto del programma. Provare ad aggiungere ulteriori vincoli di tipo
ja: このプログラムのポイントよりも前の情報に基づいた不確定の型のオブジェクトに、演算子 'expr.[idx]' が使用されました。型の制約を増やしてください。
ko: 'expr.[idx]' 연산자가 이 프로그램 지점 전의 정보를 기반으로 하는 확인할 수 없는 형식의 개체에 사용되었습니다. 형식 제약 조건을 더 추가해 보세요.
pl: Operator „wyrażenie.[indeks]” został użyty w obiekcie nieokreślonego typu na podstawie informacji przed tym punktem programu. Rozważ dodanie kolejnych ograniczeń typów
pt_br: O operador 'expr.[idx]' foi usado em um objeto de tipo indeterminado baseado em informações anteriores a este ponto do programa. Considere adicionar novas restrições de tipo
ru: Оператор "expr.[idx]" применялся к объекту неопределенного типа на основе информации, полученной до этой точки программы. Попробуйте добавить дополнительные ограничения типа
tr: Bu program noktasından önceki bilgiler temelinde 'expr.[idx]' işleci belirsiz türdeki bir nesnede kullanılmış. Başka tür kısıtlamaları eklemeyi düşünün
zh_hans: 已基于此程序点之前的信息对不确定类型的对象使用运算符“expr.[idx]”。请考虑添加更多类型约束
zh_hant: 運算子 'expr.[idx]' 已依據此程式點之前的資訊，用於不定類型的物件。請考慮新增進一步的類型限制式

# tcCannotInheritFromVariableType
source: Cannot inherit from a variable type
cs: Z typu proměnné se nedá dědit.
de: Von einem Variablentyp kann nicht geerbt werden.
es: No se puede heredar de un tipo de variable.
fr: Impossible d'hériter d'un type variable
it: Non è possibile ereditare da un tipo di variabile
ja: 変数型から継承できません
ko: 변수 형식에서 상속할 수 없습니다.
pl: Nie można dziedziczyć po typie zmiennej
pt_br: Não é possível herdar de um tipo de variável
ru: Не удается реализовать наследование от типа переменной
tr: Değişken türünden devralınamıyor
zh_hans: 无法从变量类型继承
zh_hant: 無法繼承自變數類型

# tcObjectConstructorsOnTypeParametersCannotTakeArguments
source: Calls to object constructors on type parameters cannot be given arguments
cs: Volání konstruktorů objektu u parametrů typu se nedají předávat argumenty.
de: Aufrufe von Objektkonstruktoren auf Typparametern dürfen keine Argumente erhalten.
es: No se pueden dar argumentos a llamadas a constructores de objeto en parámetros de tipo.
fr: Impossible de fournir des arguments aux appels de constructeurs d'objets sur les paramètres de type
it: Non è possibile assegnare argomenti a chiamate a costruttori di oggetto in parametri di tipo
ja: 型パラメーター上のオブジェクト コンストラクターの呼び出しに引数を指定することはできません
ko: 형식 매개 변수의 개체 생성자에 대한 호출에는 인수를 지정할 수 없습니다.
pl: Wywołania konstruktorów obiektów w parametrach typu nie mogą mieć argumentów
pt_br: Chamadas para construtores de objeto sobre parâmetros de tipo não podem receber argumentos
ru: Вызовам конструкторов объектов на параметрах типа нельзя присваивать аргументы
tr: Tür parametrelerindeki nesne oluşturucu çağrılarına bağımsız değişken verilemez
zh_hans: 不能为针对类型参数的对象构造函数调用提供参数
zh_hant: 呼叫類型參數的物件建構函式時不能指定引數

# tcCompiledNameAttributeMisused
source: The 'CompiledName' attribute cannot be used with this language element
cs: Atribut CompiledName se nedá u tohoto elementu jazyka použít.
de: Das CompiledName-Attribut kann nicht mit diesem Sprachelement verwendet werden.
es: No se puede usar el atributo 'CompiledName' con este elemento de lenguaje.
fr: Impossible d'utiliser l'attribut 'CompiledName' avec cet élément de langage
it: Non è possibile usare l'attributo 'CompiledName' con questo elemento del linguaggio
ja: この言語要素では、'CompiledName' 属性を使用できません
ko: 'CompiledName' 특성은 이 언어 요소에 사용할 수 없습니다.
pl: Nie można użyć atrybutu „CompiledName” z tym elementem języka
pt_br: O atributo 'CompiledName' não pode ser usado com este elemento de linguagem
ru: Атрибут "CompiledName" нельзя использовать с данным элементом языка.
tr: 'CompiledName' özniteliği bu dil öğesiyle kullanılamaz
zh_hans: “CompiledName”特性不能用于此语言元素
zh_hant: 'CompiledName' 屬性不能搭配這個語言項目一起使用

# tcNamedTypeRequired
source: '{0}' may only be used with named types
cs: {0} se dá použít jenom u pojmenovaných typů.
de: {0} darf nur für benannte Typen verwendet werden.
es: '{0}' se puede usar sólo con tipos con nombre.
fr: '{0}' ne peut être utilisé qu'avec des types nommés
it: '{0}' è utilizzabile solo con tipi denominati
ja: '{0}' を使用できるのは、名前付き型のみです
ko: '{0}'은(는) 명명된 형식에만 사용할 수 있습니다.
pl: Element „{0}” może być używany tylko z nazwanymi typami
pt_br: '{0}' só podem ser usados com tipos nomeados
ru: {0} может использоваться только с именованными типами
tr: '{0}' yalnızca adlandırılmış türlerle kullanılır
zh_hans: “{0}”只能用于命名类型
zh_hant: '{0}' 只能搭配具名類型一起使用

# tcInheritCannotBeUsedOnInterfaceType
source: 'inherit' cannot be used on interface types. Consider implementing the interface by using 'interface ... with ... end' instead.
cs: Deklarace inherit se nedá použít u typů rozhraní. Zvažte místo toho možnost implementovat rozhraní pomocí interface ... with ... end.
de: inherit kann nicht für Schnittstellentypen verwendet werden. Implementieren Sie die Schnittstelle stattdessen mit "interface ... with ... end".
es: No se puede usar 'inherit' en tipos de interfaz. Considere implementar la interfaz usando 'interface ... with ... end' en su lugar.
fr: Impossible d'utiliser 'inherit' sur les types interface. Implémentez l'interface avec 'interface ... with ... end' à la place.
it: Non è possibile usare 'inherit' in tipi di interfaccia. Provare invece a implementare l'interfaccia mediante 'interface ... with ... end'.
ja: インターフェイス型に 'inherit' は使用できません。代わりに 'interface ... with ... end' を使用してインターフェイスを実装してください。
ko: 'inherit'은 인터페이스 형식에 대해 사용할 수 없습니다. 대신 'interface ... with ... end'를 사용하여 인터페이스를 구현하세요.
pl: Deklaracja „inherit” nie może być używana w typach interfejsu. Zamiast tego rozważ zaimplementowanie interfejsu za pomocą konstrukcji „interface ... with ... end”.
pt_br: 'inherit' não pode ser usado em tipos de interface. Considere implementar a interface usando 'interface ... with ... end'.
ru: inherit не может использоваться в типах интерфейса. Рекомендуется реализовать интерфейс, используя "interface ... with ... end"
tr: Arabirim türlerinde 'inherit' kullanılamaz. Onun yerine arabirimi 'interface ... with ... end' kullanarak uygulamayı düşünün.
zh_hans: “inherit”不能用于接口类型。请考虑改用“interface ... with ... end”实现接口。
zh_hant: 'inherit' 不能用在介面類型上。請考慮改用 'interface ... with ... end' 來實作介面。
