Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# tcNewCannotBeUsedOnInterfaceType
source: 'new' cannot be used on interface types. Consider using an object expression '{{ new ... with ... }}' instead.
cs: U typů rozhraní se new použít nedá. Zvažte možnost použít místo toho objektový výraz {{ new ... with ... }}.
de: new kann nicht für Schnittstellentypen verwendet werden. Verwenden Sie stattdessen einen Objektausdruck "{{ new ... with ... }}".
es: No se puede usar 'new' en tipos de interfaz. Considere el uso de una expresión de objeto '{{ new ... with ... }}' en su lugar.
fr: Impossible d'utiliser 'new' sur les types interface. Utilisez une expression d'objet '{{ new ... with ... }}' à la place.
it: Non è possibile usare 'new' in tipi di interfaccia. Provare a usare invece un'espressione di oggetto '{{ new ... with ... }}'.
ja: インターフェイス型では 'new' を使用できません。代わりにオブジェクト式 '{{ new ... with ... }}' を使用してください。
ko: 'new'는 인터페이스 형식에 대해 사용할 수 없습니다. 대신 개체 식 '{{ new ... with ... }}'를 사용하세요.
pl: Element „new” nie może być używany w typach interfejsów. Zamiast tego rozważ użycie wyrażenia obiektu „{{ new ... with ... }}”.
pt_br: new' não pode ser usado em tipos de interface. Considere usar uma expressão de objeto '{{ new ... with ... }}'.
ru: new не может использоваться в типах интерфейса. Вместо этого рекомендуется использовать выражение объекта "{{ new ... with ... }}"
tr: 'new' arabirim türlerinde kullanılamaz. Bunun yerine bir nesne ifadesi '{{ new ... with ... }}' kullanmayı düşünün.
zh_hans: “new”不能用于接口类型。请考虑改用对象表达式“{{ new ... with ... }}”。
zh_hant: 'new' 不能用在介面類型上。請考慮改用物件運算式 '{{ new ... with ... }}'。

# tcAbstractTypeCannotBeInstantiated
source: Instances of this type cannot be created since it has been marked abstract or not all methods have been given implementations. Consider using an object expression '{{ new ... with ... }}' instead.
cs: Instance tohoto typu se nedají vytvořit, a to buď proto, že je tento typ označený jako abstraktní, nebo proto, že jste neimplementovali všechny metody. Zvažte možnost použít místo toho objektový výraz {{ new ... with ... }}.
de: Instanzen dieses Typs können nicht erstellt werden, da er als "abstract" markiert wurde oder nicht für alle Methoden Implementierungen vorhanden sind. Verwenden Sie stattdessen einen Objektausdruck "{{ new ... with ... }}".
es: No se pueden crear instancias de este tipo porque se ha marcado como abstract o no se han proporcionado implementaciones a todos los métodos. Considere el uso de una expresión de objeto '{{ new ... with ... }}' en su lugar.
fr: Impossible de créer des instances de ce type, car il est marqué comme abstract, ou toutes les méthodes n'ont pas reçu d'implémentations. Utilisez une expression d'objet '{{ new ... with ... }}' à la place.
it: Non è possibile creare istanze di questo tipo perché è stato contrassegnato come astratto oppure non a tutti i metodi sono state assegnate implementazioni. Provare a usare invece un'espressione di oggetto '{{ new ... with ... }}'.
ja: abstract とマークされているか、一部のメソッドが実装されていないため、この型のインスタンスを作成できません。代わりにオブジェクト式 '{{ new ... with ... }}' を使用してください。
ko: 이 형식의 인스턴스가 abstract로 표시되었거나 메서드 중 일부에 구현이 지정되지 않았으므로 해당 인스턴스를 만들 수 없습니다. 대신 개체 식 '{{ new ... with ... }}'를 사용하세요.
pl: Nie można utworzyć wystąpień tego typu, ponieważ został on oznaczony jako abstrakcyjny lub nie wszystkie metody mają implementacje. Zamiast tego rozważ użycie wyrażenia obiektu „{{ new ... with ... }}”.
pt_br: Instâncias desse tipo não podem ser criadas uma vez que elas foram marcadas como abstratas ou nem todos os métodos receberam implementações. Considere usar uma expressão de objeto '{{ new ... with ... }}' em vez disso.
ru: Создание экземпляров этого типа невозможно, поскольку он помечен как abstract, и реализации представлены не для всех методов. Вместо этого рекомендуется использовать выражение объекта "{{ new ... with ... }}"
tr: Bu tür soyut olarak işaretlendiği veya metotlarının tümüne uygulama verilmediği için örnekleri oluşturulamaz. Onun yerine bir nesne ifadesi '{{ new ... with ... }}' kullanmayı düşünün.
zh_hans: 无法创建此类型的实例，因为已将此类型标记为抽象的或者没有为所有方法给定实现。请考虑改用对象表达式“{{ new ... with ... }}”。
zh_hant: 無法建立這種類型的執行個體，因為它已標記為抽象或不是所有方法都有實作。請考慮改用物件運算式 '{{ new ... with ... }}'。

# tcIDisposableTypeShouldUseNew
source: It is recommended that objects supporting the IDisposable interface are created using the syntax 'new Type(args)', rather than 'Type(args)' or 'Type' as a function value representing the constructor, to indicate that resources may be owned by the generated value
cs: Doporučuje se, aby se objekty, které podporují rozhraní IDisposable, vytvářely pomocí syntaxe new Type(args) a ne Type(args) nebo Type jako hodnota funkce představující konstruktor. Tím se určí, že prostředky může vlastnit generovaná hodnota.
de: Objekte, die die IDisposable-Schnittstelle unterstützen, sollten mit der Syntax "new Type(args)" statt mit "Type(args)" oder "Type" als Funktionswert für den Konstruktor erstellt werden, um anzugeben, dass die Ressourcen sich möglicherweise im Besitz des generierten Werts befinden.
es: Se recomienda que los objetos que admiten la interfaz IDisposable se creen con la sintaxis "new Type(args)", en lugar de con "Type(args)" o "Type" como valor de función que representa al constructor, para indicar que los recursos pueden ser propiedad del valor generado
fr: Il est recommandé que les objets prenant en charge l'interface IDisposable soient créés avec la syntaxe 'new Type(args)', au lieu de 'Type(args)' ou de 'Type' comme une valeur de fonction représentant le constructeur, pour indiquer que des ressources peuvent être détenues par la valeur générée
it: Per indicare che le risorse possono essere di proprietà del valore generato, è consigliabile usare la sintassi 'new Type(args)', invece di 'Type(args)' o di 'Type' come valore della funzione che rappresenta il costruttore, per creare oggetti che supportano l'interfaccia IDisposable
ja: IDisposable インターフェイスをサポートするオブジェクトは、コンストラクターを表す関数値として 'Type(args)' や 'Type' ではなく 'new Type(args)' の構文を使用して作成することをお勧めします。これは、リソースが生成された値に所有される可能性があることを示すためです
ko: IDisposable 인터페이스를 지원하는 개체는 생성 값이 리소스를 소유할 수도 있다는 것을 표시하기 위해 생성자를 나타내는 함수 값으로 'Type(args)' 또는 'Type'이 아니라 'new Type(args)' 구문을 사용하여 만드는 것이 좋습니다.
pl: Zaleca się, aby obiekty obsługujące interfejs IDisposable były tworzone przy użyciu składni „new Type(args)”, a nie „Type(args)” lub „Type” jako wartości funkcji reprezentującej konstruktor, w celu określenia, że zasoby mogą należeć do wygenerowanej wartości
pt_br: Recomenda-se que objetos que deem suporte à interface IDisposable sejam criados usando a sintaxe 'new Type(args)', em vez de 'Type(args)' ou 'Type' como um valor de função representando o construtor, para indicar que os recursos podem ser de propriedade do valor gerado
ru: Рекомендуется создавать объекты, поддерживающие интерфейс IDisposable с помощью "new Type(args)", а не "Type(args)" или "Type" в качестве значения функции, представляющего конструктор; это делается для того, чтобы указать, что ресурсы могут принадлежать созданному значению.
tr: Kaynakların oluşturulan değer tarafından sahiplenilebileceğini belirtmek için, IDisposable arabirimini destekleyen nesnelerin, oluşturucuyu temsil eden bir işlev değeri olarak 'Type(args)' veya 'Type' yerine 'new Type(args)' söz dizimi kullanılarak oluşturulması önerilir
zh_hans: 建议通过将语法 "new Type(args)"(而非 "Type(args)" 或 "Type")用作表示构造函数的函数值来创建支持 IDisposable 接口的对象，以指示生成的值可拥有该资源
zh_hant: 建議不要使用 'Type(args)' 或 'Type' 做為函式值來代表建構函式，而應使用 'new Type(args)' 來建立支援 IDisposable 介面的物件，以表示資源可由產生的值擁有

# tcSyntaxCanOnlyBeUsedToCreateObjectTypes
source: '{0}' may only be used to construct object types
cs: {0} se dá použít jenom k vytvoření objektových typů.
de: {0} darf nur für Konstruktobjekttypen verwendet werden.
es: '{0}' se puede usar sólo para construir tipos de objeto.
fr: '{0}' ne peut être utilisé que pour construire des types d'objets
it: '{0}' è utilizzabile solo per costruire tipi di oggetto
ja: '{0}' は、オブジェクト型を構築するときにのみ使用できます
ko: '{0}'은(는) 개체 형식을 생성하는 데에만 사용할 수 있습니다.
pl: Składnia „{0}” może być używana tylko w celu tworzenia typów obiektów
pt_br: '{0}' só podem ser usados para tipos de objetos de constructo
ru: {0}" может использоваться только для формирования типов объектов
tr: '{0}' yalnızca nesne türlerini oluşturmak için kullanılabilir
zh_hans: “{0}”只能用于构造对象类型
zh_hant: '{0}' 只能用來建構物件類型

# tcConstructorRequiresCall
source: Constructors for the type '{0}' must directly or indirectly call its implicit object constructor. Use a call to the implicit object constructor instead of a record expression.
cs: Konstruktory pro typ {0} musí přímo nebo nepřímo volat svoje implicitní konstruktory objektu. Místo výrazu záznamu použijte volání implicitního konstruktoru objektu.
de: Konstruktoren für den Typ "{0}" müssen den impliziten Objektkonstruktor direkt oder indirekt aufrufen. Verwenden Sie den Aufruf des impliziten Objektkonstruktors anstelle eines Datensatzausdrucks.
es: Los constructores para el tipo '{0}' deben llamar directa o indirectamente a su constructor de objeto implícito. Use una llamada al constructor de objeto implícito en lugar de una expresión de registro.
fr: Les constructeurs du type '{0}' doivent directement ou indirectement appeler son constructeur d'objet implicite. Utilisez un appel au constructeur d'objet implicite à la place d'une expression d'enregistrement.
it: I costruttori per il tipo '{0}' devono chiamare direttamente o indirettamente il relativo costruttore di oggetto implicito. Utilizzare una chiamata al costruttore di oggetto implicito invece di un'espressione di record.
ja: 型 '{0}' のコンストラクターはその暗黙的なオブジェクト コンストラクターを直接、または間接的に呼び出す必要があります。レコード式ではなく、暗黙的なオブジェクト コンストラクターの呼び出しを使用してください。
ko: '{0}' 형식에 대한 생성자는 직접 또는 간접적으로 해당 암시적 개체 생성자를 호출해야 합니다. 레코드 식 대신 암시적 개체 생성자에 대한 호출을 사용하세요.
pl: Konstruktory typu „{0}” muszą bezpośrednio lub pośrednio wywoływać swojego niejawnego konstruktora obiektów. Użyj wywołania niejawnego konstruktora obiektów zamiast wyrażenia rekordu.
pt_br: Construtores para o tipo '{0}' devem chamar seu construtor de objeto implícito direta ou indiretamente. Use uma chamada para o construtor de objeto implícito em vez de uma expressão de registro.
ru: Конструкторы для типа "{0}" должны напрямую или косвенно вызывать свой неявный конструктор объекта. Вместо выражения записи используйте вызов неявного конструктора объекта.
tr: '{0}' türünün oluşturucuları doğrudan veya dolaylı olarak kendi örtük nesne oluşturucusunu çağırmalıdır. Kayıt ifadesi yerine örtük nesne oluşturucusu çağrısını kullanın.
zh_hans: 类型“{0}”的构造函数必须直接或间接调用其隐式对象构造函数。请使用对隐式对象构造函数的调用，而不是记录表达式。
zh_hant: 類型 '{0}' 的建構函式必須直接或間接呼叫其隱含物件建構函式。請不要使用記錄運算式，改為呼叫隱含物件建構函式。

# tcUndefinedField
source: The field '{0}' has been given a value, but is not present in the type '{1}'
cs: Poli {0} se předala hodnota, která se ale nenachází v typu {1}.
de: Das Feld "{0}" hat einen Wert erhalten, ist aber im Typ "{1}" nicht vorhanden.
es: Se ha proporcionado un valor al campo '{0}', pero no está presente en el tipo '{1}'.
fr: Le champ '{0}' a une valeur, mais n'est pas présent dans le type '{1}'
it: Al campo '{0}' è stato assegnato un valore, tuttavia non è presente nel tipo '{1}'
ja: フィールド '{0}' に値が指定されましたが、このフィールドは型 '{1}' に存在しません
ko: {0}' 필드에 값이 지정되었지만 해당 필드가 '{1}' 형식에 없습니다.
pl: Pole „{0}” ma określoną wartość, ale nie występuje w typie „{1}”
pt_br: O campo '{0}' recebeu um valor, mas ele não está presente no tipo '{1}'
ru: Значение для поля "{0}" было задано, но не представлено в типе "{1}"
tr: {0}' alanına bir değer verilmiş ancak '{1}' türünde bu yok
zh_hans: 已为字段“{0}”给定值，但该字段未包含在类型“{1}”中
zh_hant: 欄位 '{0}' 已經指定值，但是未出現在類型 '{1}' 中

# tcFieldRequiresAssignment
source: No assignment given for field '{0}' of type '{1}'
cs: Poli {0} typu {1} se nepředalo žádné přiřazení.
de: Keine Zuweisung für Feld "{0}" vom Typ "{1}" angegeben.
es: No se proporcionó ninguna asignación para el campo '{0}' de tipo '{1}'.
fr: Aucune assignation spécifiée pour le champ '{0}' de type '{1}'
it: Nessuna assegnazione specificata per il campo '{0}' di tipo '{1}'
ja: 型 '{1}' のフィールド '{0}' に割り当てが指定されていません
ko: {1}' 형식의 '{0}' 필드에 대해 지정된 할당이 없습니다.
pl: Brak przypisania dla pola „{0}” typu „{1}”
pt_br: Nenhuma atribuição foi dada ao campo '{0}' do tipo '{1}'
ru: Нет назначения для поля "{0}" типа "{1}"
tr: {1}' türündeki '{0}' alanı için bir atama verilmedi
zh_hans: 未为类型“{1}”的字段“{0}”赋值
zh_hant: 未針對類型 '{1}' 的欄位 '{0}' 指定指派

# tcExtraneousFieldsGivenValues
source: Extraneous fields have been given values
cs: Nadbytečným polím se předaly hodnoty.
de: Zusätzliche Felder haben Werte erhalten.
es: Se han proporcionado valores a unos campos extraños.
fr: Des champs superflus ont reçu des valeurs
it: Sono stati assegnati valori a campi estranei
ja: 不適切なフィールドに値を指定しました
ko: 잘못 사용된 필드에 값이 지정되었습니다.
pl: Określono wartości dodatkowych pól
pt_br: Campos incorretos receberam valores
ru: Посторонние поля получили значения
tr: Dış alanlara değerler verilmiş
zh_hans: 已为外来字段给定值
zh_hant: 已經為沒有直接關聯的欄位指定值

# tcObjectExpressionsCanOnlyOverrideAbstractOrVirtual
source: Only overrides of abstract and virtual members may be specified in object expressions
cs: V objektových výrazech se dají specifikovat jenom přepsání abstraktních a virtuálních členů.
de: Nur Überschreibungen von abstrakten und virtuellen Membern dürfen in Objektausdrücken angegeben werden.
es: Solo se pueden especificar invalidaciones de miembros abstractos y virtuales en expresiones de objeto.
fr: Seules les substitutions de membres abstraits et virtuels peuvent être spécifiées dans les expressions d'objet
it: Nelle espressioni di oggetto possono essere specificati solo override di membri astratti e virtuali
ja: オブジェクト式に指定できるのは、抽象メンバーおよび仮想メンバーのオーバーライドのみです。
ko: 추상 및 가상 멤버의 재정의만 개체 식에 지정할 수 있습니다.
pl: W wyrażeniach obiektów można określić tylko przesłonięcia abstrakcyjnych i wirtualnych elementów członkowskich
pt_br: Apenas substituições de membros abstratos e virtuais podem ser especificadas nas expressões de objeto
ru: В выражениях объектов могут указываться только переопределения абстрактных и виртуальных элементов
tr: Nesne ifadelerinde yalnızca soyut ve sanal üyelerin geçersiz kılmaları belirtilebilir
zh_hans: 只能在对象表达式中指定抽象和虚拟成员的重写
zh_hant: 只有抽象和虛擬成員的覆寫可以在物件運算式中指定

# tcNoAbstractOrVirtualMemberFound
source: The member '{0}' does not correspond to any abstract or virtual method available to override or implement.
cs: Člen {0} neodpovídá žádné abstraktní ani virtuální metodě, která by se dala přepsat nebo implementovat.
de: Der Member "{0}" entspricht keiner abstrakten oder virtuellen Methode, die zum Überschreiben oder Implementieren zur Verfügung steht.
es: El miembro "{0}" no corresponde a ningún método abstracto o virtual disponible para invalidarlo o implementarlo.
fr: Le membre '{0}' ne correspond à aucune méthode abstraite ou virtuelle pouvant être substituée ou implémentée.
it: Il membro '{0}' non corrisponde ad alcun metodo astratto o virtuale disponibile per l'override o l'implementazione.
ja: メンバー '{0}' は、無視または実装に使用できるどの抽象メソッドまたは仮想メソッドにも対応していません。
ko: '{0}' 멤버는 재정의 또는 구현할 수 있는 어떠한 추상 또는 가상 메서드에도 해당하지 않습니다.
pl: Element członkowski „{0}” nie odpowiada żadnej metodzie abstrakcyjnej ani wirtualnej dostępnej do przesłonięcia lub zaimplementowania.
pt_br: O membro '{0}' não corresponde a nenhum método virtual ou abstrato disponível para substituição ou implementação.
ru: Элемент "{0}" не соответствует какому-либо абстрактному или виртуальному методу, доступному для переопределения или реализации.
tr: '{0}' adlı üye, geçersiz kılma veya uygulama için kullanılabilen herhangi bir soyut veya sanal metoda karşılık gelmiyor.
zh_hans: 成员“{0}”与可用于替代或实现的任何抽象或虚拟方法均不对应。
zh_hant: 成員 '{0}' 未對應到可用於覆寫或實作的任何抽象或虛擬方法。

# tcMemberFoundIsNotAbstractOrVirtual
source: The type {0} contains the member '{1}' but it is not a virtual or abstract method that is available to override or implement.
cs: Typ {0} obsahuje člen {1}, ale není to virtuální nebo abstraktní metoda, která by se dala přepsat nebo implementovat.
de: Der Typ {0} enthält den Member "{1}", entspricht aber keiner virtuellen oder abstrakten Methode, die zum Überschreiben oder Implementieren verfügbar ist.
es: El tipo {0} contiene el miembro "{1}", pero no es un método virtual o abstracto que esté disponible para invalidarlo o implementarlo.
fr: Le type {0} contient le membre '{1}', mais il ne s'agit pas d'une méthode virtuelle ou abstraite pouvant être substituée ou implémentée.
it: Il tipo {0} contiene il membro '{1}', ma non è un metodo virtuale o astratto disponibile per l'override o l'implementazione.
ja: 型 {0} にメンバー '{1}' が含まれていますが、このメンバーはオーバーライドまたは実装に使用できる仮想メソッドでも抽象メソッドでもありません。
ko: {0} 형식에 '{1}' 멤버가 포함되어 있지만 이 멤버는 재정의 또는 구현할 수 있는 가상 또는 추상 메서드가 아닙니다.
pl: Typ {0} zawiera element członkowski „{1}”, ale nie jest metodą wirtualną lub abstrakcyjną, która jest dostępna do przesłonięcia lub zaimplementowania.
pt_br: O tipo {0} contém o membro '{1}', mas ele não é um método virtual ou abstrato disponível para substituição ou implementação.
ru: Тип {0} содержит элемент "{1}", но не является виртуальным или абстрактным методом, доступным для переопределения или реализации.
tr: {0} türü, '{1}' üyesini içeriyor ancak bu, geçersiz kılma veya uygulama için kullanılabilen bir sanal veya soyut metot değil.
zh_hans: 类型 {0} 包含成员“{1}”，但其不是可用于替代或实现的虚拟或抽象方法。
zh_hant: 類型 {0} 包含成員 '{1}'，但它不是可用於覆寫或實作的虛擬或抽象方法。

# tcArgumentArityMismatch
source: The member '{0}' does not accept the correct number of arguments. {1} argument(s) are expected, but {2} were given. The required signature is '{3}'.{4}
cs: Člen {0} nepřijímá správný počet argumentů. Očekávaný počet argumentů je {1}, ale předalo se jich {2}. Požadovaná signatura je {3}.{4}
de: Der Member "{0}" akzeptiert nicht die richtige Anzahl von Argumenten. {1} Argumente werden erwartet, es wurden aber {2} Argumente angegeben. Die erforderliche Signatur ist "{3}".{4}
es: El miembro '{0}' no acepta el número correcto de argumentos. Se esperan {1} argumentos, pero se dieron {2}. La signatura necesaria es '{3}'.{4}
fr: Le membre '{0}' n'accepte pas le nombre approprié d'arguments. {1} argument(s) attendu(s) mais {2} fournis. La signature nécessaire est '{3}'.{4}
it: Il membro '{0}' non accetta il numero corretto di argomenti. Sono previsti {1} argomenti, ma ne sono stati specificati {2}. La firma richiesta è '{3}'.{4}
ja: メンバー '{0}' の引数の数が正しくありません。{1} 個の引数が必要ですが、指定されたのは {2} 個です。必要な署名は '{3}' です。{4}
ko: {0}' 멤버가 올바른 수의 인수를 적용하지 않습니다. {1}개의 인수가 필요하지만 {2}개 지정되었습니다. 필요한 시그니처는 '{3}'입니다.{4}
pl: Element członkowski „{0}” nie akceptuje poprawnej liczby argumentów. Oczekiwana liczba argumentów: {1}, podano argumentów: {2}. Wymagany podpis to „{3}”.{4}
pt_br: O membro '{0}' não aceita o número correto de argumentos. São esperados {1} argumentos, mas foram fornecidos {2}. A assinatura exigida é '{3}'.{4}
ru: Члену "{0}" передано неправильное число аргументов. Ожидалось аргументов: {1}, предоставлено аргументов: {2}. Требуемая сигнатура — "{3}".{4}
tr: {0}' üyesine doğru sayıda bağımsız değişken geçirilmedi. {1} bağımsız değişken bekleniyor ancak geçerli sayı, {2}. Gerekli imza: '{3}'.{4}
zh_hans: 成员“{0}”未接受正确的参数数目。应为 {1} 个参数，但给出了 {2} 个参数。必需的签名为“{3}”。{4}
zh_hant: 成員 '{0}' 不接受正確數目的引數。應為 {1} 個引數，但提供了 {2} 個。必要特徵標記為 '{3}'。{4}

# tcArgumentArityMismatchOneOverload
source: The member '{0}' does not accept the correct number of arguments. One overload accepts {1} arguments, but {2} were given. The required signature is '{3}'.{4}
cs: Člen {0} nepřijímá správný počet argumentů. Počet argumentů přijímaných jedním přetížením je {1}, ale předalo se jich {2}. Požadovaná signatura je {3}.{4}
de: Der Member "{0}" akzeptiert nicht die richtige Anzahl von Argumenten. Eine Überladung akzeptiert {1} Argumente, es wurden aber {2} Argumente angegeben. Die erforderliche Signatur ist "{3}".{4}
es: El miembro '{0}' no acepta el número correcto de argumentos. Una sobrecarga acepta {1} argumentos, pero se dieron {2}. La signatura necesaria es '{3}'.{4}
fr: Le membre '{0}' n'accepte pas le nombre approprié d'arguments. Une surcharge accepte {1} arguments, mais {2} ont été fournis. La signature nécessaire est '{3}'.{4}
it: Il membro '{0}' non accetta il numero corretto di argomenti. Un overload accetta {1} argomenti, ma ne sono stati specificati {2}. La firma richiesta è '{3}'.{4}
ja: メンバー '{0}' の引数の数が正しくありません。1 つのオーバーロードには {1} 個の引数を指定できますが、{2} 個が指定されました。必要な署名は '{3}' です。{4}
ko: {0}' 멤버가 올바른 수의 인수를 받지 못했습니다. 하나의 오버로드는 {1}개의 인수를 받지만 {2}개가 주어졌습니다. 필요한 시그니처는 '{3}'입니다.{4}
pl: Element członkowski „{0}” nie akceptuje poprawnej liczby argumentów. Jedno przeciążenie akceptuje następującą liczbę argumentów: {1}, podano argumentów: {2}. Wymagany podpis to „{3}”.{4}
pt_br: O membro '{0}' não aceita o número correto de argumentos. Uma sobrecarga aceita {1} argumentos, mas {2} foram fornecidos. A assinatura exigida é '{3}'.{4}
ru: Члену "{0}" передано неправильное число аргументов. Одна перегрузка принимает следующее число аргументов: {1}, предоставлено аргументов: {2}. Требуемая сигнатура — "{3}".{4}
tr: {0}' üyesine doğru sayıda bağımsız değişken geçirilmedi. Bir aşırı yükleme {1} bağımsız değişken kabul ediyor ancak geçerli sayı {2}. Gerekli imza: '{3}'.{4}
zh_hans: 成员“{0}”不支持正确的参数数目。一个重载只支持 {1} 个参数，但给出了 {2} 个参数。必需的签名为“{3}”。{4}
zh_hant: 成員 '{0}' 不接受正確數目的引數。一次多載接受 {1} 個引數，但提供了 {2} 個。必要特徵標記為 '{3}'。{4}

# tcSimpleMethodNameRequired
source: A simple method name is required here
cs: Tady se vyžaduje jednoduchý název metody.
de: An dieser Stelle ist ein einfacher Methodenname erforderlich.
es: Aquí se requiere un nombre de método simple.
fr: Un nom de méthode simple est requis ici
it: In questa posizione è necessario un nome di metodo semplice
ja: ここでは単純なメソッド名が必要です
ko: 단순 메서드 이름이 여기에 필요합니다.
pl: W tym miejscu jest wymagana prosta nazwa metody
pt_br: Um nome de método simples é requerido aqui
ru: Здесь требуется простое имя метода
tr: Burada basit metot adı gereklidir
zh_hans: 此处需要简单的方法名称
zh_hant: 此處要有簡單方法名稱
