Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# arrayElementHasWrongType
source: All elements of an array must be of the same type as the first element, which here is '{0}'. This element has type '{1}'.
cs: Všechny elementy výrazu konstruktoru pole musí mít stejný typ. Očekávalo se, že tento výraz bude mít typ {0}, ale tady je typu {1}.
de: Alle Elemente eines Arraykonstruktorausdrucks müssen den gleichen Typ aufweisen. Es wurde erwartet, dass dieser Ausdruck den Typ "{0}" aufweist, hier liegt aber der Typ "{1}" vor.
es: Todos los elementos de una expresión de constructor de matriz deben tener el mismo tipo. Se esperaba que esta expresión tuviera el tipo "{0}", pero aquí tiene el tipo "{1}".
fr: Tous les éléments d'une expression comportant un constructeur de tableau doivent avoir le même type. Cette expression était censée avoir le type '{0}', mais elle a ici le type '{1}'.
it: Il tipo di tutti gli elementi di un'espressione di costruttore di matrice deve essere lo stesso. Il tipo previsto di questa espressione è '{0}', ma quello effettivo è '{1}'.
ja: 配列コンストラクター式の要素はすべて同じ型である必要があります。この式に必要な型は '{0}' ですが、ここでは型 '{1}' になっています。
ko: 배열 생성자의 모든 요소는 동일한 형식이어야 합니다. 이 식에는 '{0}' 형식이 필요하지만 여기에서는 '{1}' 형식이 지정되었습니다.
pl: Wszystkie elementy wyrażenia konstruktora tablicy muszą mieć ten sam typ. Oczekiwano, że to wyrażenie będzie miało typ „{0}”, ale tutaj ma typ „{1}”.
pt_br: Todos os elementos de uma expressão do construtor de matriz devem ter o mesmo tipo. Essa expressão deveria ter o tipo '{0}', mas aqui tem o tipo '{1}'.
ru: Все элементы выражения конструктора массива должны иметь один и тот же тип. В этом выражении ожидалось использование типа "{0}", но используется тип "{1}".
tr: Bir array constructor ifadesinin tüm öğeleri aynı türe sahip olmalıdır. Bu ifadenin '{0}' türünde olması bekleniyordu ancak burada '{1}' türünde.
zh_hans: 数组构造函数表达式的所有元素必须具有同一类型。此表达式的类型应为“{0}”，但此处类型为“{1}”。
zh_hant: 陣列建構函式運算式的所有項目都必須是同一種類型。此運算式應具備類型 '{0}'，但卻是類型 '{1}'。

# missingElseBranch
source: This 'if' expression is missing an 'else' branch. Because 'if' is an expression, and not a statement, add an 'else' branch which also returns a value of type '{0}'.
cs: Ve výrazu if chybí větev else. Větev then je typu {0}. Protože if je výraz a ne příkaz, přidejte větev else, která vrátí hodnotu stejného typu.
de: Dem if-Ausdruck fehlt ein else-Branch. Der then-Branch weist den Typ "{0}" auf. Da "if" ein Ausdruck und keine Anweisung ist, fügen Sie einen else-Branch hinzu, der einen Wert des gleichen Typs zurückgibt.
es: La expresión "if" no tiene una rama "else". La rama "then" tiene el tipo '{0}'. Dado que "if" es una expresión y no una instrucción, agregue una rama "else" que devuelva un valor del mismo tipo.
fr: Il manque à l'expression 'if' une branche 'else'. La branche 'then' a le type '{0}'. Dans la mesure où 'if' est une expression, et non une instruction, ajoutez une branche 'else' qui retourne une valeur du même type.
it: Nell'espressione 'if' manca un ramo 'else'. Il tipo del ramo 'then' è '{0}'. Dal momento che 'if' è un'espressione e non un'istruzione, aggiungere un ramo 'else' che restituisca un valore dello stesso tipo.
ja: 'if' 式に 'else' ブランチがありません。'then' ブランチは型 '{0}' です。'if' はステートメントではなく式であるため、同じ型の値を返す 'else' ブランチを追加してください。
ko: 'if' 식에 'else' 분기가 누락되었습니다. 'then' 분기의 형식은 '{0}'입니다. 'if'는 문이 아니라 식이므로 동일한 형식의 값을 반환하는 'else' 분기를 추가하세요.
pl: W wyrażeniu „if” brakuje gałęzi „else”. Gałąź „then” ma typ „{0}”. Jako że „if” jest wyrażeniem, a nie instrukcją, dodaj gałąź „else”, która będzie zwracać wartość tego samego typu.
pt_br: A expressão 'if' está sem uma ramificação 'else'. A ramificação 'then' tem tipo '{0}'. Como 'if' é uma expressão e não uma instrução, adicione uma ramificação 'else' que retorna um valor do mesmo tipo.
ru: Выражение "if" не содержит ветвь "else". Ветвь "then" включает тип "{0}". Так как "if" является выражением, а не оператором, добавьте ветвь "else", которая возвращает значение того же типа.
tr: 'if' ifadesinde bir 'else' dalı eksik. 'then' dalı '{0}' türünde. 'if' bir ifade değil deyim olduğundan, aynı türde değer döndüren bir 'else' dalı eklemeniz gerekir.
zh_hans: if 表达式缺少 "else" branch。"then" branch 的类型为“{0}”。因为 "if" 是一个表达式，而非语句，请添加将返回同一类型值的 "else" branch。
zh_hant: 'if' 運算式遺漏 'else' 分支。'then' 分支具有類型 '{0}'。因為 'if' 為運算式而非陳述式，所以請新增會傳回的值類型相同的 'else' 分支。

# ifExpression
source: The 'if' expression needs to have type '{0}' to satisfy context type requirements. It currently has type '{1}'.
cs: Aby se splnily požadavky na typ kontextu, musí mít výraz if typ {0}. V tuto chvíli má typ {1}.
de: Der if-Ausdruck muss Typ "{0}" aufweisen, damit die Kontexttypanforderungen erfüllt sind. Derzeit weist er Typ "{1}" auf.
es: La expresión "if" debe tener el tipo "{0}" para cumplir con los requisitos del tipo de contexto. Actualmente tiene el tipo "{1}".
fr: L'expression 'if' doit avoir le type '{0}' pour répondre aux exigences de type du contexte. Elle a le type '{1}'.
it: Per soddisfare i requisiti relativi al tipo di contesto, il tipo dell'espressione 'if' deve essere '{0}', ma è attualmente '{1}'.
ja: コンテキストの型要件を満たすためには、'if' 式の型は '{0}' である必要があります。現在の型は '{1}' です。
ko: if' 식은 컨텍스트 형식 요구 사항을 충족하기 위해 '{0}' 형식이 필요하지만 현재 형식은 '{1}'입니다.
pl: Wyrażenie „if” musi mieć typ „{0}”, aby spełnić wymagania typu kontekstu. Obecny typ: „{1}”.
pt_br: A expressão 'if' precisa ter o tipo '{0}' para atender aos requisitos do tipo de contexto. No momento, ela tem o tipo '{1}'.
ru: Для соблюдения требований к типу контекста в выражении "if" должен использоваться тип "{0}". Сейчас используется тип "{1}".
tr: if' ifadesinin bağlam türü gereksinimlerini karşılayabilmesi için '{0}' türüne sahip olması gerekir. Şu anda '{1}' türüne sahip.
zh_hans: if 表达式需要具有类型“{0}”才能满足上下文类型要求。当前的类型为“{1}”。
zh_hant: if' 運算式必須具備類型 '{0}'，才能滿足內容類型的需求。其目前的類型為 '{1}'。

# elseBranchHasWrongType
source: All branches of an 'if' expression must return values of the same type as the first branch, which here is '{0}'. This branch returns a value of type '{1}'.
cs: Všechny větve výrazu if musí mít stejný typ. Očekávalo se, že tento výraz bude mít typ {0}, ale tady je typu {1}.
de: Alle Branches eines if-Ausdrucks müssen den gleichen Typ aufweisen. Es wurde erwartet, dass dieser Ausdruck den Typ "{0}" aufweist, hier liegt aber der Typ "{1}" vor.
es: Todas las ramas de una expresión "if" deben devolver el mismo tipo. Se esperaba que esta expresión tuviera el tipo "{0}", pero aquí tiene el tipo "{1}".
fr: Toutes les branches d'une expression 'if' doivent avoir le même type. Cette expression était censée avoir le type '{0}', mais elle a ici le type '{1}'.
it: Il tipo di tutti i rami di un'espressione 'if' deve essere lo stesso. Il tipo previsto di questa espressione è '{0}', ma quello effettivo è '{1}'.
ja: if' 式のすべてのブランチは同じ型である必要があります。この式に必要な型は '{0}' ですが、ここでは型 '{1}' になっています。
ko: if' 식의 모든 분기는 동일한 형식이어야 합니다. 이 식에는 '{0}' 형식이 필요하지만 여기에서는 '{1}' 형식이 지정되었습니다.
pl: Wszystkie gałęzie wyrażenia „if” muszą mieć ten sam typ. Oczekiwano, że to wyrażenie będzie miało typ „{0}”, ale tutaj ma typ „{1}”.
pt_br: Todas as ramificações de uma expressão 'if' devem ter o mesmo tipo. Essa expressão deveria ter o tipo '{0}', mas aqui tem o tipo '{1}'.
ru: Все ветви выражения "if" должны иметь один и тот же тип. В этом выражении ожидалось использование типа "{0}", но используется тип "{1}".
tr: Bir 'if' ifadesinin tüm dalları aynı türe sahip olmalıdır. Bu ifadenin '{0}' türünde olması bekleniyordu ancak burada '{1}' türünde.
zh_hans: if 表达式的所有分支必须具有同一类型。此表达式的类型应为“{0}”，但此处类型为“{1}”。
zh_hant: if' 運算式的所有分支都必須是同一種類型。此運算式應具備類型 '{0}'，但卻是類型 '{1}'。

# followingPatternMatchClauseHasWrongType
source: All branches of a pattern match expression must return values of the same type as the first branch, which here is '{0}'. This branch returns a value of type '{1}'.
cs: Všechny větve výrazu porovnání vzorů musí vracet hodnoty stejného typu. První větev vrátila hodnotu typu {0}, ale tato větev vrátila hodnotu typu {1}.
de: Alle Branches eines Musterübereinstimmungsausdrucks müssen Werte des gleichen Typs zurückgeben. Der erste Branch hat einen Wert vom Typ "{0}" zurückgegeben, aber dieser Branch gab einen Wert vom Typ "{1}" zurück.
fr: Toutes les branches d'une expression comportant des critères spéciaux doivent retourner des valeurs du même type. La première branche a retourné une valeur de type '{0}', mais cette branche a retourné une valeur de type '{1}'.
it: Tutti i rami di un'espressione di criteri di ricerca devono restituire valori dello stesso tipo. Il primo ramo ha restituito un valore di tipo '{0}', ma questo ramo ha restituito un valore di tipo '{1}'.
ja: パターン マッチ式のすべてのブランチは、同じ型の値を返す必要があります。最初のブランチが返した値の型は '{0}' ですが、このブランチが返した値の型は '{1}' です。
ko: 패턴 일치 식의 모든 분기는 동일한 형식의 값을 반환해야 합니다. 첫 번째 분기는 '{0}' 형식의 값을 반환했지만 이 분기는 '{1}' 형식의 값을 반환했습니다.
pl: Wszystkie gałęzie wyrażenia dopasowania do wzorca muszą zwracać wartości tego samego typu. Pierwsza gałąź zwróciła wartość typu „{0}”, ale ta gałąź zwróciła wartość typu „{1}”
pt_br: Todos os branches de uma expressão correspondente ao padrão precisam retornar valores do mesmo tipo. O primeiro branch retornou um valor do tipo '{0}', mas este branch retornou um valor do tipo '{1}'.
ru: Все ветви выражения сопоставления шаблонов должны возвращать значения одного типа. Первая ветвь возвратила значение типа "{0}", а эта ветвь — типа "{1}".
tr: Bir desen eşleştirme ifadesinin tüm dalları aynı türdeki değerleri döndürmelidir. Birinci dal '{0}' türünde bir değer döndürdü ancak bu dal '{1}' türünde bir değer döndürdü.
zh_hans: 模式匹配表达式的所有分支必须返回相同类型的值。第一个分支返回“{0}”类型的值，但此分支返回“{1}”类型的值。
zh_hant: 模式比對運算式的所有分支，都必須傳回相同類型的值。第一個分支傳回了類型 '{0}' 的值，但此分支卻傳回了類型 '{1}' 的值。

# patternMatchGuardIsNotBool
source: A pattern match guard must be of type 'bool', but this 'when' expression is of type '{0}'.
cs: Ochrana porovnání vzorů musí být typu bool, ale tento výraz when je typu {0}.
de: Ein Musterübereinstimmungswächter muss den Typ "bool" aufweisen, dieser when-Ausdruck hat hingegen den Typ "{0}".
es: Un protector de coincidencia de patrones debe ser del tipo "bool", pero esta expresión "when" es del tipo "{0}".
fr: Une protection de critères spéciaux doit être de type 'bool', mais cette expression 'when' est de type '{0}'.
it: Il guard dei criteri di ricerca deve essere di tipo 'bool', ma questa espressione 'when' è di tipo '{0}'.
ja: パターン マッチ ガードは型 'bool' である必要がありますが、この 'when' 式は型 '{0}' です。
ko: 패턴 일치 가드의 형식은 'bool'이어야 하지만 'when' 식의 형식은 '{0}'입니다.
pl: Zabezpieczenie dopasowania do wzorca musi mieć typ „bool”, ale to wyrażenie „when” ma typ „{0}”.
pt_br: A proteção da correspondência de padrão deve ser do tipo 'bool', mas esta expressão 'when' é do tipo '{0}'.
ru: Условие соответствия шаблону должно иметь тип "bool", но это выражение "when" имеет тип "{0}".
tr: Bir desen eşleşmesi koruyucusunun 'bool' türünde olması gerekir, ancak bu 'when' ifadesi '{0}' türünde.
zh_hans: 模式匹配临界必须是 "bool" 类型，但此 "when" 表达式的类型为“{0}”。
zh_hant: 模式比對成立條件必須是類型 'bool'，但此 'when' 運算式卻是類型 '{0}'。

# commaInsteadOfSemicolonInRecord
source: A ';' is used to separate field values in records. Consider replacing ',' with ';'.
cs: Pro oddělení hodnot v záznamech se používá znak ; (středník). Zvažte nahrazení znaků , (čárka) znaky ; (středník).
de: Das Zeichen ";" wird verwendet, um Feldwerte in Datensätzen zu trennen. Ersetzen Sie "," ggf. durch ";".
es: El carácter ";" se usa para separar los valores de los campos en los registros. Considere la posibilidad de reemplazar "," por ";".
fr: Un ';' sert à séparer les valeurs de champs des enregistrements. Remplacez ',' par ';'.
it: Per separare i valori di campo nei record si usa il punto e virgola (';'). Provare a sostituire la virgola (',') con il punto e virgola (';').
ja: ';' は、レコード内でフィールド値を区切るために使われます。',' を ';' で置き換えることを検討してください。
ko: ';'은 레코드에서 필드 값을 구분하는 데 사용됩니다. ','를 ';'으로 바꾸세요.
pl: Znak „;” jest używany do rozdzielania wartości pól w rekordach. Rozważ zastąpienie znaku „,” znakiem „;”.
pt_br: Um ';' é usado para separar os valores de campo nos registros. Considere substituir ',' por ';'.
ru: Символ ";" используется для разделения значений поля в записях. Рекомендуется заменить "," на ";".
tr: Kayıtlarda alan değerlerini ayırmak için ';' kullanılır. ',' karakterini ';' ile değiştirmeyi düşünün.
zh_hans: 使用 ";" 来分隔记录中的字段值。考虑使用 ";" 替换 ","。
zh_hant: 記錄中使用 ';' 來分隔欄位值。請考慮以 ';' 取代 ','。

# derefInsteadOfNot
source: The '!' operator is used to dereference a ref cell. Consider using 'not expr' here.
cs: Operátor ! se používá k přístupu k buňce ref přes ukazatel. Zvažte možnost použít tady not expr.
de: Der Operator "!" wird zum Dereferenzieren einer Verweiszelle verwendet. Verwenden Sie hier ggf. "not expr".
es: El operador '!' se utiliza para desreferenciar una celda ref. Considere utilizar 'no expr' aquí.
fr: L'opérateur '!' est utilisé pour déréférencer une cellule ref. Songez à utiliser 'not expr' ici.
it: L'operatore '!' viene usato per dereferenziare una cella di riferimento. In questo punto provare a usare 'not expr'.
ja: '!' 演算子は ref セルの逆参照に使用されます。ここに 'not expr' を使用することをご検討ください。
ko: '!' 연산자는 참조 셀을 역참조하는 데 사용됩니다. 여기에 'not expr' 사용을 고려하세요.
pl: Operator „!” umożliwia wyłuskanie komórki odwołania. Rozważ użycie tutaj elementu „not expr”.
pt_br: O operador '!' é usado para desreferenciar uma célula de referência. Considere usar 'not expr' aqui.
ru: Оператор "!" используется для разыменования ссылочной ячейки. Рассмотрите использование здесь "not expr".
tr: '!' operatörü bir ref hücresine başvurmak için kullanılır. Burada 'not expr' kullanmayı deneyin.
zh_hans: ! 运算符用于取消引用引用的单元格。请考虑在此处使用 "not expr"。
zh_hant: '!' 運算子用於將 ref 儲存格取值 (Dereference)。請考慮在此使用 'not expr'。

# buildUnexpectedTypeArgs
source: The non-generic type '{0}' does not expect any type arguments, but here is given {1} type argument(s)
cs: U typu {0}, který není obecný, se neočekávají žádné argumenty typu, ale tady se mu argumenty typu předávají ({1}).
de: Der nicht generische Typ "{0}" erwartet keine Typargumente; hier wird/werden jedoch {1} Typargument(e) übergeben.
es: El tipo no genérico '{0}' no espera ningún argumento de tipo, pero aquí se le proporcionan {1} argumentos de tipo.
fr: Le type non générique '{0}' n'attend aucun argument de type mais reçoit ici {1} argument(s) de type
it: Il tipo non generico '{0}' non prevede alcun argomento tipo, tuttavia è stata rilevata la presenza di {1} argomento/i tipo
ja: 非ジェネリック型 '{0}' に型引数は使用できませんが、{1} 個の型引数があります
ko: 제네릭이 아닌 형식 '{0}'에는 형식 인수가 필요하지 않지만 여기에서는 {1}개의 형식 인수가 지정되었습니다.
pl: Typ inny niż ogólny „{0}” nie oczekuje żadnych argumentów typu, ale tutaj podano następującą liczbę argumentów typu: {1}
pt_br: O tipo não genérico '{0}' não espera nenhum argumento de tipo, mas aqui são dados argumentos do tipo {1}
ru: Для не являющегося универсальным типа "{0}" не требуются аргументы типа, однако здесь задано следующее число аргументов типа: {1}
tr: Genel olmayan '{0}' türü herhangi bir tür bağımsız değişkeni beklemez, ancak burada {1} tür bağımsız değişkenleri verilmiş
zh_hans: 非泛型类型“{0}”不需要任何类型参数，但此处给定了 {1} 个类型参数
zh_hant: 非泛型型別 '{0}' 不需要任何型別引數，但此處指定了 {1} 個型別引數

# returnUsedInsteadOfReturnBang
source: Consider using 'return!' instead of 'return'.
cs: Zvažte použití parametru return! namísto return.
de: Verwenden Sie ggf. "return!" anstelle von "return".
es: Considere la posibilidad de usar "return!" en lugar de "return".
fr: Utilisez 'return!' à la place de 'return'.
it: Provare a usare 'return!' invece di 'return'.
ja: 'return' の代わりに 'return!' を使うことを検討してください。
ko: 'return'이 아니라 'return!'를 사용하세요.
pl: Rozważ użycie polecenia „return!” zamiast „return”.
pt_br: Considere usar 'return!' em vez de 'return'.
ru: Рекомендуется использовать "return!" вместо "return".
tr: 'return' yerine 'return!' kullanmayı deneyin.
zh_hans: 考虑使用 "return!"，而非 "return"。
zh_hant: 請考慮使用 'return!'，而不使用 'return'。

# useSdkRefs
source: Use reference assemblies for .NET framework references when available (Enabled by default).
cs: Pro odkazy na rozhraní .NET používejte referenční sestavení, pokud jsou k dispozici (ve výchozím nastavení povolené).
de: Verweisassemblys für .NET Framework-Verweise verwenden, wenn verfügbar (standardmäßig aktiviert).
es: Use ensamblados de referencia para las referencias de .NET Framework cuando estén disponibles (habilitado de forma predeterminada).
fr: Utilisez des assemblys de référence pour les références .NET Framework quand ils sont disponibles (activé par défaut).
it: Usa gli assembly di riferimento per i riferimenti a .NET Framework quando disponibili (abilitato per impostazione predefinita).
ja: 使用可能な場合は、.NET Framework リファレンスの参照アセンブリを使用します (既定で有効)。
ko: 기본적으로 활성화되는 참조 어셈블리를 .NET Framework 참조에 사용합니다(사용 가능한 경우).
pl: Użyj zestawów odwołań dla odwołań do programu .NET Framework, gdy są dostępne (domyślnie włączone).
pt_br: Use assemblies de referência para referências do .NET Framework quando disponível (habilitado por padrão).
ru: Использовать базовые сборки для ссылок на платформу .NET, если базовые сборки доступны (включено по умолчанию).
tr: Kullanılabilir olduğunda, .NET Framework başvuruları için başvuru bütünleştirilmiş kodlarını kullanın (Varsayılan olarak etkindir).
zh_hans: 如果可用，请对 .NET Framework 引用使用引用程序集(默认启用)。
zh_hant: 請在可行的情況下使用適用於 .NET 架構參考的參考組件 (預設會啟用)。

# xmlDocBadlyFormed
source: This XML comment is invalid: '{0}'
cs: Tento komentář XML není platný: {0}
de: Dieser XML-Kommentar ist ungültig: "{0}"
es: El comentario XML no es válido: "{0}"
fr: Ce commentaire XML est non valide : '{0}'
it: Questo commento XML non è valido: '{0}'
ja: この XML コメントは無効です: '{0}'
ko: 이 XML 주석이 잘못됨: '{0}'
pl: Ten komentarz XML jest nieprawidłowy: „{0}”
pt_br: Este comentário XML é inválido: '{0}'
ru: Недопустимый XML-комментарий: "{0}"
tr: Bu XML açıklaması geçersiz: '{0}'
zh_hans: 此 XML 注释无效:“{0}”
zh_hant: 此 XML 註解無效: '{0}'

# xmlDocDuplicateParameter
source: This XML comment is invalid: multiple documentation entries for parameter '{0}'
cs: Tento komentář XML není platný: několik položek dokumentace pro parametr {0}
de: Dieser XML-Kommentar ist ungültig: mehrere Dokumentationseinträge für Parameter "{0}".
es: El comentario XML no es válido: hay varias entradas de documentación para el parámetro "{0}"
fr: Ce commentaire XML est non valide : il existe plusieurs entrées de documentation pour le paramètre '{0}'
it: Questo commento XML non è valido: sono presenti più voci della documentazione per il parametro '{0}'
ja: この XML コメントは無効です: パラメーター '{0}' に複数のドキュメント エントリがあります
ko: 이 XML 주석이 잘못됨: 매개 변수 '{0}'에 대한 여러 설명서 항목이 있음
pl: Ten komentarz XML jest nieprawidłowy: wiele wpisów dokumentacji dla parametru „{0}”
pt_br: Este comentário XML é inválido: várias entradas de documentação para o parâmetro '{0}'
ru: Недопустимый XML-комментарий: несколько записей документации для параметра "{0}"
tr: Bu XML açıklaması geçersiz: '{0}' parametresi için birden çok belge girişi var
zh_hans: 此 XML 注释无效: 参数“{0}”有多个文档条目
zh_hant: 此 XML 註解無效: '{0}' 參數有多項文件輸入

# xmlDocInvalidParameterName
source: This XML comment is invalid: unknown parameter '{0}'
cs: Tento komentář XML není platný: neznámý parametr {0}
de: Dieser XML-Kommentar ist ungültig: unbekannter Parameter "{0}".
es: El comentario XML no es válido: parámetro "{0}" desconocido
fr: Ce commentaire XML est non valide : paramètre inconnu '{0}'
it: Questo commento XML non è valido: il parametro '{0}' è sconosciuto
ja: この XML コメントは無効です: パラメーター '{0}' が不明です
ko: 이 XML 주석이 잘못됨: 알 수 없는 매개 변수 '{0}'
pl: Ten komentarz XML jest nieprawidłowy: nieznany parametr „{0}”
pt_br: Este comentário XML é inválido: parâmetro desconhecido '{0}'
ru: Недопустимый XML-комментарий: неизвестный параметр "{0}"
tr: Bu XML açıklaması geçersiz: '{0}' parametresi bilinmiyor
zh_hans: 此 XML 注释无效: 未知参数“{0}”
zh_hant: 此 XML 註解無效: 未知的參數 '{0}'

# xmlDocMissingCrossReference
source: This XML comment is invalid: missing 'cref' attribute for cross-reference
cs: Tento komentář XML není platný: chybí atribut cref pro křížový odkaz
de: Dieser XML-Kommentar ist ungültig: Attribut "cref" für Querverweis fehlt.
es: El comentario XML no es válido: falta el atributo "cref" para la referencia cruzada
fr: Ce commentaire XML est non valide : attribut 'cref' manquant pour la référence croisée
it: Questo commento XML non è valido: manca l'attributo 'cref' per il riferimento incrociato
ja: この XML コメントは無効です: 相互参照に 'cref' 属性がありません
ko: 이 XML 주석이 잘못됨: 상호 참조에 'cref' 특성이 없음
pl: Ten komentarz XML jest nieprawidłowy: brak atrybutu „cref” dla odsyłacza
pt_br: Este comentário XML é inválido: atributo 'cref' ausente para referência cruzada
ru: Недопустимый XML-комментарий: отсутствует атрибут "cref" для перекрестной ссылки
tr: Bu XML açıklaması geçersiz. Çapraz başvuru için 'cref' özniteliği eksik
zh_hans: 此 XML 注释无效: 交叉引用缺少 "cref" 属性
zh_hant: 此 XML 註解無效: 沒有 'cref' 屬性可用於交互參照

# xmlDocMissingParameter
source: This XML comment is incomplete: no documentation for parameter '{0}'
cs: Tento komentář XML není úplný: žádná dokumentace pro parametr {0}
de: Dieser XML-Kommentar ist unvollständig: keine Dokumentation für Parameter "{0}".
es: El comentario XML está incompleto: no hay documentación para el parámetro "{0}"
fr: Ce commentaire XML est incomplet : il n'existe aucune documentation pour le paramètre '{0}'
it: Questo commento XML è incompleto: non è presente la documentazione per il parametro '{0}'
ja: この XML コメントは不完全です: パラメーター '{0}' にドキュメントがありません
ko: 이 XML 주석이 불완전함: 매개 변수 '{0}'에 대한 설명서가 없음
pl: Ten komentarz XML jest niekompletny: brak dokumentacji dla parametru „{0}”
pt_br: Este comentário XML está incompleto: nenhuma documentação para o parâmetro '{0}'
ru: Неполный XML-комментарий: отсутствует документация для параметра "{0}"
tr: Bu XML açıklaması eksik: '{0}' parametresi için belge yok
zh_hans: 此 XML 注释不完整: 参数“{0}”没有文档
zh_hant: 此 XML 註解不完整: 參數 '{0}' 沒有文件

# xmlDocMissingParameterName
source: This XML comment is invalid: missing 'name' attribute for parameter or parameter reference
cs: Tento komentář XML není platný: chybí atribut name pro parametr nebo odkaz na parametr
de: Dieser XML-Kommentar ist ungültig: Attribut "name" für Parameter oder Parameterverweis fehlt.
es: El comentario XML no es válido: falta el atributo "name" para el parámetro o la referencia de parámetro
fr: Ce commentaire XML est non valide : attribut 'name' manquant pour le paramètre ou la référence de paramètre
it: Questo commento XML non è valido: manca l'attributo 'name' per il parametro o il riferimento a parametro
ja: この XML コメントは無効です: パラメーターまたはパラメーター参照に 'name' 属性がありません
ko: 이 XML 주석이 잘못됨: 매개 변수 또는 매개 변수 참조에 'name' 특성이 없음
pl: Ten komentarz XML jest nieprawidłowy: brak atrybutu „name” dla parametru lub odwołania parametru
pt_br: Este comentário XML é inválido: atributo 'name' ausente para parâmetro ou referência de parâmetro
ru: Недопустимый XML-комментарий: отсутствует атрибут "name" для параметра или ссылки на параметр
tr: Bu XML açıklaması geçersiz: Parametre veya parametre başvurusu için 'name' özniteliği eksik
zh_hans: 此 XML 注释无效: 参数或参数引用缺少 "name" 属性
zh_hant: 此 XML 註解無效: 參數或參數參考沒有 'name' 屬性
