Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# featureWitnessPassing
source: witness passing for trait constraints in F# quotations
cs: Předávání kopie clusteru pro omezení vlastností v uvozovkách v jazyce F#
de: Zeugenübergabe für Merkmalseinschränkungen in F#-Zitaten
es: Paso de testigo para las restricciones de rasgos en las expresiones de código delimitadas de F#
fr: Passage de témoin pour les contraintes de trait dans les quotations F#
it: Passaggio del testimone per vincoli di tratto in quotation F#
ja: F# 引用での特性制約に対する監視の引き渡し
ko: F# 인용의 특성 제약 조건에 대한 감시 전달
pl: monitor, który przekazuje ograniczenia cech języka F#
pt_br: Passagem de testemunha para restrições de característica nas citações do F#
ru: Передача свидетеля для ограничений признаков в цитированиях F#
tr: F# alıntılarındaki nitelik kısıtlamaları için tanık geçirme
zh_hans: F# 引号中特征约束的见证传递
zh_hant: 見證 F# 引號中特徵條件約束的傳遞

# forFormatInvalidForInterpolated
source: Interpolated strings may not use '%' format specifiers unless each is given an expression, e.g. '%d{{1+1}}'.
cs: Interpolované řetězce nemůžou používat specifikátory formátu %, pokud se každému z nich nezadá nějaký výraz, např. %d{{1+1}}.
de: Interpolierte Zeichenfolgen dürfen keine Formatbezeichner vom Typ "%" verwenden, es sei denn, jeder erhält einen Ausdruck, z. B. "%d{{1+1}}".
es: Las cadenas interpoladas no pueden usar los especificadores de formato "%", a menos que se les proporcione una expresión individualmente; por ejemplo, "%d{{1+1}}".
fr: Les chaînes interpolées ne peuvent pas utiliser les spécificateurs de format '%' à moins de recevoir une expression, par exemple '%d{{1+1}}'.
it: Nelle stringhe interpolate non è possibile usare gli identificatori di formato '%' a meno che non si indichi un'espressione per ognuno di essi, ad esempio '%d{{1+1}}'.
ja: '%d{{1+1}}' などの式が指定されている場合を除き、補間された文字列では '%' 書式指定子を使用できません。
ko: 각 보간 문자열에 식(예: '%d{{1+1}}')이 지정되지 않는 한 '%' 형식 지정자를 사용할 수 없습니다.
pl: W interpolowanych ciągach nie można używać specyfikatorów formatu „%”, chyba że każdemu z nich odpowiada wyrażenie, na przykład „%d{{1+1}}”.
pt_br: As cadeias de caracteres interpoladas não podem usar especificadores de formato '%', a menos que cada um receba uma expressão, por exemplo, '%d{{1+1}}'.
ru: В интерполированных строках запрещено использовать описатели формата "%", если только каждому из них не назначено выражение, например "'%d{{1+1}}".
tr: Düz metin arasına kod eklenmiş dizeler, her birine '%d{{1+1}}' gibi bir ifade verilmedikçe '%' biçim belirticilerini kullanamaz.
zh_hans: 内插字符串不会使用 "%" 格式说明符，除非为每个字符串提供诸如 "%d{{1+1}}" 之类的表达式。
zh_hant: 除非每個插補字串都有一個運算式，否則不可使用 '%' 格式指定名稱，例如 '%d{{1+1}}'。

# forFormatInvalidForInterpolated2
source: .NET-style format specifiers such as '{{x,3}}' or '{{x:N5}}' may not be mixed with '%' format specifiers.
cs: Specifikátory formátu ve stylu .NET, třeba {{x,3}} nebo {{x:N5}}, se nedají kombinovat se specifikátory formátu %.
de: Formatbezeichner im .NET-Format, z. B. "{{x,3}}" oder "{{x:N5}}", dürfen nicht mit Formatbezeichnern vom Typ "%" gemischt werden.
es: Los especificadores de formato de estilo .NET, como "{{x,3}}" o "{{x:N5}}", no se pueden mezclar con los especificadores de formato "%".
fr: Les spécificateurs de format de style .NET tels que '{{x,3}}' et '{{x:N5}}' ne peuvent pas être combinés avec les spécificateurs de format '%'.
it: Non è possibile combinare gli identificatori di formato di tipo .NET, come '{{x,3}}' o '{{x:N5}}', con gli identificatori di formato '%'.
ja: '{{x,3}}' や '{{x:N5}}' などの .NET 形式の書式指定子は、'%' 書式指定子と混在させることはできません。
ko: '{{x,3}}' 또는 '{{x:N5}}' 등의 .NET 스타일 형식 지정자를 '%' 형식 지정자와 혼합할 수 없습니다.
pl: Specyfikatory formatu w stylu platformy .NET, takie jak „{{x,3}}” lub „{{x:N5}}”, nie mogą być mieszane ze specyfikatorami formatu „%”.
pt_br: Especificadores de formato do estilo .NET, como '{{x,3}}' ou '{{x:N5}}', não podem ser misturados com especificadores de formato '%'.
ru: Описатели формата в стиле .NET, такие как "{{x,3}}" или "{{x:N5}}", запрещено смешивать с описателями формата "%".
tr: '{{X,3}}' ya da '{{x:N5}}' gibi .NET stili biçim belirticileri '%' biçim belirticileriyle karışık kullanılamaz.
zh_hans: .NET 样式的格式说明符(如 "{{x,3}}" 或 "{{x:N5}}")不能与 "%" 格式说明符混合使用。
zh_hant: .NET 樣式格式指定名稱 (如 '{{x,3}}' 或 '{{x:N5}}') 不可與 '%' 格式指定名稱混用。

# forFormatInvalidForInterpolated3
source: The '%P' specifier may not be used explicitly.
cs: Specifikátor %P se nedá použít explicitně.
de: Der Bezeichner "%P" darf nicht explizit verwendet werden.
es: El especificador "%P" no se puede usar de forma explícita.
fr: Le spécificateur '%P' ne peut pas être utilisé explicitement.
it: Non è possibile usare in modo esplicito l'identificatore '%P'.
ja: '%P' 指定子は、明示的に使用できません。
ko: '%P' 지정자를 명시적으로 사용할 수 없습니다.
pl: Specyfikator „%P” nie może być używany jawnie.
pt_br: Não é possível usar o especificador '%P' explicitamente.
ru: Описатель "%P" запрещено использовать явно.
tr: '%P' belirticisi açık olarak kullanılamaz.
zh_hans: 不能显式使用 "%P" 说明符。
zh_hant: '%P' 指定名稱不可明確地使用。

# forFormatInvalidForInterpolated4
source: Interpolated strings used as type IFormattable or type FormattableString may not use '%' specifiers, only .NET-style interpolands such as '{{expr}}', '{{expr,3}}' or '{{expr:N5}}' may be used.
cs: Interpolované řetězce, které se používají jako typ IFormattable nebo FormattableString, nemůžou používat specifikátory %. Použít je možné jen interpolované výrazy ve stylu .NET, třeba {{expr}}, {{expr,3}} nebo {{expr:N5}}.
de: Interpolierte Zeichenfolgen, die als Typ "IFormattable" oder "FormattableString" verwendet werden, dürfen keine Spezifizierer vom Typ "%" verwenden. Es dürfen nur Interpolanten im .NET-Format wie "{{expr}}", "{{expr,3}}" oder "{{expr:N5}}" verwendet werden.
es: Las cadenas interpoladas que se usan como tipo IFormattable o FormattableString no pueden usar los especificadores "%"; solo pueden utilizar operandos de interpolación de estilo .NET, como "{{expr}}", "{{expr,3}}" o "{{expr:N5}}".
fr: Les chaînes interpolées utilisées en tant que type IFormattable ou FormattableString ne peuvent pas utiliser les spécificateurs '%'. Seuls les spécificateurs de style .NET tels que '{{expr}}', '{{expr,3}}' et '{{expr:N5}}' peuvent être utilisés.
it: Nelle stringhe interpolate usate come tipo IFormattable o FormattableString non è possibile usare gli identificatori '%', ma è possibile usare solo interpolanti di tipo .NET, come '{{expr}}', '{{expr,3}}' o '{{expr:N5}}'.
ja: IFormattable 型または FormattableString 型として使用される補間された文字列では、'%' 指定子を使用できません。'{{expr}}'、'{{expr,3}}'、'{{expr:N5}}' などの .NET 形式の補間のみ使用できます。
ko: 형식 IFormattable 또는 형식 FormattableString으로 사용된 보간 문자열은 '%' 지정자를 사용할 수 없으며 '{{expr}}', '{{expr,3}}' 또는 '{{expr:N5}}' 등의 .NET 스타일 인터폴란드를 사용할 수 있습니다.
pl: W interpolowanych ciągach używanych jako typ IFormattable lub FormattableString nie można używać specyfikatorów „%”. Można używać tylko operatorów interpolacji, takich jak „{{expr}}”, „{{expr,3}}” lub „{{expr:N5}}”.
pt_br: As cadeias de caracteres interpoladas usadas como tipo IFormattable ou tipo FormattableString não podem usar especificadores '%'. Apenas interpoladores de estilo .NET, como '{{expr}}', '{{expr,3}}' ou '{{expr:N5}}' podem ser usados.
ru: Интерполированные строки, используемые в качестве типа IFormattable или FormattableString, не могут использовать описатели "%". Можно использовать только описатели в стиле .NET, такие как "{{expr}}", "{{expr,3}}" или "{{expr:N5}}".
tr: IFormattable veya FormattableString türü olarak kullanılan düz metin arasına kod eklenmiş dizeler '%' belirticilerini kullanamaz. Yalnızca '{{ifade}}', '{{ifade,3}}' veya '{{ifade:N5}}' gibi .NET stili düz metin arasına kod ekleme işlemleri kullanılabilir.
zh_hans: 作为类型 IFormattable 或类型 FormattableString 使用的内插字符串不能使用 "%" 说明符，只能使用 .NET 样式的插植，如 "{{expr}}"、"{{expr,3}}" 或 "{{expr:N5}}"。
zh_hant: 用作類型 IFormattable 或類型 FormattableString 的插補字串不能使用 '%' 指定名稱，只能使用 .NET 樣式的插補值，例如 '{{expr}}'、'{{expr,3}}' 或 '{{expr:N5}}'。

# fromEndSlicingRequiresVFive
source: From the end slicing with requires language version 5.0, use /langversion:preview.
cs: Vytváření průřezů od konce vyžaduje jazykovou verzi 5.0, použijte /langversion:preview.
de: Für das vom Ende ausgehende Slicing ist Sprachversion 5.0 erforderlich. Verwenden Sie /langversion:preview.
es: La segmentación desde el final requiere la versión de lenguaje 5.0, use /langversion:preview.
fr: L'extraction à partir de la fin nécessite la version 5.0 du langage. Utilisez /langversion:preview.
it: Con il sezionamento dalla fine è richiesta la versione 5.0 del linguaggio. Usare /langversion:preview.
ja: 言語バージョン 5.0 が必要な最後からのスライスで、/langversion:preview を使用してください。
ko: 언어 버전 5.0이 필요한 끝 조각화에서는 /langversion:preview를 사용하세요.
pl: Wycinanie od końca wymaga języka w wersji 5.0, użyj parametru /langversion:preview.
pt_br: A opção 'Divisão começando no final' requer a versão de idioma 5.0. Use /langversion:preview.
ru: Для конечного среза, для которого требуется версия языка 5.0, используйте параметр /langversion:preview.
tr: Sondan dilimleme, 5.0 dil sürümünü gerektirir, /langversion:preview kullanın.
zh_hans: 需要语言版本 5.0 才能从末尾切片，请使用 /langversion:preview。
zh_hant: 從結尾處切割需要語言版本 5.0，請使用 /langversion:preview。

# fsiInvalidDirective
source: Invalid directive '#{0} {1}'
cs: Neplatná direktiva #{0} {1}
de: Ungültige Direktive "#{0} {1}"
es: Directiva '#{0} {1}' no válida.
fr: Directive non valide '#{0} {1}'
it: Direttiva '#{0} {1}' non valida
ja: 無効なディレクティブ '#{0} {1}'
ko: 잘못된 지시문 '#{0} {1}'
pl: Nieprawidłowa dyrektywa „#{0} {1}”
pt_br: Diretriz inválida '#{0} {1}'
ru: Недопустимая директива "#{0} {1}"
tr: Geçersiz yönerge '#{0} {1}'
zh_hans: 无效的指令“#{0} {1}”
zh_hant: 無效的指示詞 '#{0} {1}'

# keywordDescriptionConst
source: Keyword to specify a constant literal as a type parameter argument in Type Providers.
cs: Klíčové slovo, které specifikuje konstantní literál jako argument parametru typu v poskytovatelích typů
de: Schlüsselwort, um ein konstantes Literal als Typparameterargument in Typanbietern anzugeben.
es: Palabra clave para especificar un literal de constante como argumento de parámetro de tipo en los proveedores de tipo.
fr: Mot clé permettant de spécifier une constante littérale en tant qu'argument de paramètre de type dans les fournisseurs de types.
it: Parola chiave per specificare un valore letterale di costante come argomento del parametro di tipo in Provider di tipi.
ja: 定数リテラルを型プロバイダーの型パラメーター引数として指定するキーワード。
ko: 상수 리터럴을 형식 공급자의 형식 매개 변수 인수로 지정하는 키워드입니다.
pl: Słowo kluczowe na potrzeby określania literału stałej jako argumentu parametru typu w przypadku dostawców typów.
pt_br: Palavra-chave para especificar um literal constante como um argumento de parâmetro de tipo nos Provedores de Tipo.
ru: Ключевое слово для указания константного литерала в качестве аргумента параметра типа в поставщиках типов.
tr: Tür Sağlayıcılarında tür parametresi bağımsız değişkeni olarak sabit değişmez değeri belirtmek için anahtar sözcük.
zh_hans: 用于将常量文本指定为类型提供程序中的类型形参实参的关键字。
zh_hant: 用於在型別提供者中，將常數常值指定為型別參數引數的關鍵字。

# lexByteStringMayNotBeInterpolated
source: a byte string may not be interpolated
cs: Bajtový řetězec se nedá interpolovat.
de: Eine Bytezeichenfolge darf nicht interpoliert werden.
es: no se puede interpolar una cadena de bytes
fr: une chaîne d'octets ne peut pas être interpolée
it: non è possibile interpolare una stringa di byte
ja: バイト文字列は補間されていない可能性があります
ko: 바이트 문자열을 보간하지 못할 수 있습니다.
pl: ciąg bajtowy nie może być interpolowany
pt_br: uma cadeia de caracteres de byte não pode ser interpolada
ru: невозможно выполнить интерполяцию для строки байтов
tr: bir bayt dizesi, düz metin arasına kod eklenerek kullanılamaz
zh_hans: 不能内插字节字符串
zh_hant: 位元組字串不能是插補字串

# lexRBraceInInterpolatedString
source: A '}}' character must be escaped (by doubling) in an interpolated string.
cs: Znak }} musí být v interpolovaném řetězci uvozený (zdvojeným znakem).
de: Ein }}-Zeichen muss in einer interpolierten Zeichenfolge (durch Verdoppeln) mit Escapezeichen versehen werden.
es: El carácter "}}" se debe escapar (duplicándose) en las cadenas interpoladas.
fr: Un caractère '}}' doit faire l'objet d'une séquence d'échappement (par doublement) dans une chaîne interpolée.
it: In una stringa interpolata è necessario specificare il carattere di escape di un carattere '}}' raddoppiandolo.
ja: 文字 '}}' は、補間された文字列内で (二重にすることで) エスケープする必要があります。
ko: '}}' 문자는 보간된 문자열에서 이중으로 사용하여 이스케이프해야 합니다.
pl: W przypadku znaku „}}” należy zastosować ucieczkę (przez wpisanie dwóch takich znaków) w ciągu interpolowanym.
pt_br: Um caractere ''}}' precisa ser de escape (ao duplicar) em uma cadeia de caracteres interpolada.
ru: Символ "}}" необходимо экранировать (путем дублирования) в интерполированной строке.
tr: Bir '}}' karakteri, düz metin arasına kod eklenmiş bir dizede kaçış dizisi ile (yineleme yapılarak) belirtilir.
zh_hans: 在内插字符串中，必需对 "}}" 字符进行转义(通过加倍)。
zh_hant: 在插補字串中，必須將 '}}' 字元逸出 (重複一次)。

# lexSingleQuoteInSingleQuote
source: Invalid interpolated string. Single quote or verbatim string literals may not be used in interpolated expressions in single quote or verbatim strings. Consider using an explicit 'let' binding for the interpolation expression or use a triple quote string as the outer string literal.
cs: Neplatný interpolovaný řetězec. Literály s jednoduchou uvozovkou nebo doslovné řetězcové literály se nedají použít v interpolovaných výrazech v řetězcích s jednoduchou uvozovkou nebo v doslovných řetězcích. Zvažte možnost použít pro výraz interpolace explicitní vazbu let nebo řetězec s trojitými uvozovkami jako vnější řetězcový literál.
de: Ungültige interpolierte Zeichenfolge. Literale mit einzelnen Anführungszeichen oder ausführliche Zeichenfolgenliterale dürfen nicht in interpolierten Ausdrücken in Zeichenfolgen mit einfachen Anführungszeichen oder ausführlichen Zeichenfolgen verwendet werden. Erwägen Sie die Verwendung einer expliziten let-Bindung für den Interpolationsausdruck, oder verwenden Sie eine Zeichenfolge mit dreifachen Anführungszeichen als äußeres Zeichenfolgenliteral.
es: Cadena interpolada no válida. No se pueden usar literales de cadena textual o de comillas simples en expresiones interpoladas en cadenas textuales o de comillas simples. Puede usar un enlace "let" explícito para la expresión de interpolación o utilizar una cadena de comillas triples como literal de cadena externo.
fr: Chaîne interpolée non valide. Les littéraux de chaîne verbatim ou à guillemet simple ne peuvent pas être utilisés dans les expressions interpolées dans des chaînes verbatim ou à guillemet simple. Utilisez une liaison 'let' explicite pour l'expression d'interpolation ou une chaîne à guillemets triples comme littéral de chaîne externe.
it: La stringa interpolata non è valida. Non è possibile usare valori letterali stringa tra virgolette singole o verbatim in espressioni interpolate in stringhe verbatim o tra virgolette singole. Provare a usare un binding 'let' esplicito per l'espressione di interpolazione oppure usare una stringa tra virgolette triple come valore letterale stringa esterno.
ja: 補間された文字列が無効です。単一引用符または逐語的文字列リテラルは、単一引用符または逐語的文字列内の補間された式では使用できません。補間式に対して明示的な 'let' バインドを使用するか、外部文字列リテラルとして三重引用符文字列を使用することをご検討ください。
ko: 잘못된 보간 문자열. 작은 따옴표 또는 축자 문자열 리터럴은 작은 따옴표 또는 축자 문자열의 보간 식에 사용할 수 없습니다. 보간 식에 명시적 'let' 바인딩을 사용하거나 삼중 따옴표 문자열을 외부 문자열 리터럴로 사용해 보세요.
pl: Nieprawidłowy ciąg interpolowany. Literały z pojedynczymi cudzysłowami lub literały ciągów dosłownych nie mogą być używane w wyrażeniach interpolowanych w ciągach z pojedynczymi cudzysłowami lub ciągach dosłownych. Rozważ użycie jawnego powiązania „let” dla wyrażenia interpolacji lub użycie ciągu z potrójnymi cudzysłowami jako zewnętrznego literału ciągu.
pt_br: Cadeia de caracteres interpolada inválida. Literais de cadeia de caracteres verbatim ou com aspas simples não podem ser usados em expressões interpoladas em cadeias de caracteres verbatim ou com aspas simples. Considere usar uma associação 'let' explícita para a expressão de interpolação ou use uma cadeia de caracteres de aspas triplas como o literal da cadeia de caracteres externa.
ru: Недопустимая интерполированная строка. Строковые литералы с одинарными кавычками или буквальные строковые литералы запрещено использовать в интерполированных выражениях в строках с одинарными кавычками или буквальных строках. Рекомендуется использовать явную привязку "let" для выражения интерполяции или использовать строку с тройными кавычками как внешний строковый литерал.
tr: Geçersiz düz metin arasına kod eklenmiş dize. Tek tırnaklı veya düz metin dizesi sabitleri, tek tırnaklı veya düz metin dizelerinde düz metin arasına kod eklenmiş ifadelerde kullanılamaz. Düz metin arasına kod ekleme ifadesi için açık bir 'let' bağlaması kullanmayı düşünün veya dış dize sabiti olarak üç tırnaklı bir dize kullanın.
zh_hans: 内插字符串无效。在单引号字符串或逐字字符串的内插表达式中不能使用单引号或逐字字符串文本。请考虑对内插表达式使用显式 "let" 绑定，或使用三重引号字符串作为外部字符串文本。
zh_hant: 插補字串無效。單引號或逐字字串常值不能用於單引號或逐字字串的插補運算式中。請考慮為內插補點運算式使用明確的 'let' 繫結，或使用三引號字串作為外部字串常值。

# lexTripleQuoteInTripleQuote
source: Invalid interpolated string. Triple quote string literals may not be used in interpolated expressions. Consider using an explicit 'let' binding for the interpolation expression.
cs: Neplatný interpolovaný řetězec. V interpolovaných výrazech se nedají použít řetězcové literály s trojitými uvozovkami. Zvažte možnost použít pro interpolovaný výraz explicitní vazbu let.
de: Ungültige interpolierte Zeichenfolge. Zeichenfolgenliterale mit dreifachen Anführungszeichen dürfen in interpolierten Ausdrücken nicht verwendet werden. Erwägen Sie die Verwendung einer expliziten let-Bindung für den Interpolationsausdruck.
es: Cadena interpolada no válida. No se pueden usar literales de cadena de comillas triples en las expresiones interpoladas. Puede usar un enlace "let" explícito para la expresión de interpolación.
fr: Chaîne interpolée non valide. Les littéraux de chaîne à guillemets triples ne peuvent pas être utilisés dans des expressions interpolées. Utilisez une liaison 'let' explicite pour l'expression d'interpolation.
it: La stringa interpolata non è valida. Non è possibile usare valori letterali stringa tra virgolette triple in espressioni interpolate. Provare a usare un binding 'let' esplicito per l'espressione di interpolazione.
ja: 補間された文字列が無効です。三重引用符文字列リテラルは、補間された式では使用できません。補間式に対して明示的な 'let' バインドを使用することをご検討ください。
ko: 잘못된 보간 문자열. 삼중 따옴표 문자열 리터럴은 보간 식에 사용할 수 없습니다. 보간 식에 명시적 'let' 바인딩을 사용해 보세요.
pl: Nieprawidłowy ciąg interpolowany. Literały ciągów z potrójnymi cudzysłowami nie mogą być używane w wyrażeniach interpolowanych. Rozważ użycie jawnego powiązania „let” dla wyrażenia interpolacji.
pt_br: Cadeia de caracteres interpolada inválida. Literais de cadeia de caracteres de aspas triplas não podem ser usados em expressões interpoladas. Considere usar uma associação 'let' explícita para a expressão de interpolação.
ru: Недопустимая интерполированная строка. Строковые литералы с тройными кавычками запрещено использовать в интерполированных выражениях. Рекомендуется использовать явную привязку "let" для выражения интерполяции.
tr: Geçersiz düz metin arasına kod eklenmiş dize. Üç tırnaklı dize sabitleri, düz metin arasına kod eklenmiş ifadelerde kullanılamaz. Düz metin arasına kod ekleme ifadesi için açık bir 'let' bağlaması kullanmayı düşünün.
zh_hans: 内插字符串无效。在内插表达式中不能使用三重引号字符串文字。请考虑对内插表达式使用显式的 "let" 绑定。
zh_hant: 插補字串無效。三引號字串常值不可用於插補運算式。請考慮為內插補點運算式使用明確的 'let' 繫結。

# nativeResourceFormatError
source: Stream does not begin with a null resource and is not in '.RES' format.
cs: Stream nezačíná zdrojem s hodnotou null a není ve formátu .RES.
de: Der Stream beginnt nicht mit einer NULL-Ressource und ist nicht im RES-Format.
es: El flujo no comienza con un recurso nulo ni está en formato ".RES".
fr: Le flux ne commence pas par une ressource null et n'est pas au format '.RES'.
it: Il flusso non inizia con una risorsa Null e non è in formato '.RES'.
ja: ストリームは null リソースでは始まらず、'RES' 形式でもありません。
ko: 스트림은 null 리소스로 시작되지 않으며 '.RES' 형식이 아닙니다.
pl: Strumień nie zaczyna się od zasobu o wartości null i nie jest w formacie „.RES”.
pt_br: Stream não começa com um recurso nulo e não está no formato '.RES'.
ru: Поток не начинается с нулевого ресурса и не соответствует формату ".RES".
tr: Akış null kaynakla başlamıyor ve '.RES' biçiminde değil.
zh_hans: 流应以空资源开头并且应采用 .RES 格式。
zh_hant: 資料流未以 null 資源開頭，並且未使用 '.RES' 格式。

# nativeResourceHeaderMalformed
source: Resource header beginning at offset {0} is malformed.
cs: Hlavička zdroje začínající na posunu {0} má chybný formát.
de: Der Ressourcenheader, der am Offset {0} beginnt, ist fehlerhaft formatiert.
es: El encabezado de los recursos que comienza en el desplazamiento {0} está mal formado.
fr: L'en-tête de ressource commençant au décalage {0} est mal formé.
it: L'intestazione di risorsa che inizia a partire dall'offset {0} non è valida.
ja: オフセット {0} で始まるリソース ヘッダーの形式に誤りがあります。
ko: 오프셋 {0}에서 시작하는 리소스 헤더의 형식이 잘못되었습니다.
pl: Nagłówek zasobu rozpoczynający się od przesunięcia {0} jest nieprawidłowo sformułowany.
pt_br: O cabeçalho do recurso que começa no deslocamento {0} está malformado.
ru: Заголовок ресурса некорректен начиная со смещения {0}.
tr: {0} uzaklığında başlayan kaynak üst bilgisi hatalı biçimlendirilmiş.
zh_hans: 以偏移量 {0} 开始的资源标头格式不正确。
zh_hant: 從位移 {0} 開始的資源標頭格式錯誤。

# optsLangVersion
source: Display the allowed values for language version, specify language version such as 'latest' or 'preview'
cs: Zobrazte si povolené hodnoty verze jazyka a pak zadejte požadovanou verzi, například latest nebo preview.
de: Zeigen Sie die zulässigen Werte für die Sprachversion an. Geben Sie die Sprachversion als "latest" oder "preview" an.
es: Mostrar los valores permitidos para la versión de idioma, especificar la versión de idioma como "latest" "preview"
fr: Afficher les valeurs autorisées pour la version du langage, spécifier la version du langage comme 'dernière' ou 'préversion'
it: Visualizza i valori consentiti per la versione del linguaggio. Specificare la versione del linguaggio, ad esempio 'latest' o 'preview'
ja: 言語バージョンで許可された値を表示し、'最新' や 'プレビュー' などの言語バージョンを指定する
ko: 언어 버전의 허용된 값을 표시하고 '최신' 또는 '미리 보기'와 같은 언어 버전을 지정합니다.
pl: Wyświetl dozwolone wartości dla wersji językowej; określ wersję językową, np. „latest” lub „preview”
pt_br: Exibe os valores permitidos para a versão do idioma, especifica a versão do idioma, como 'mais recente ' ou 'prévia'
ru: Отображение допустимых значений для версии языка. Укажите версию языка, например, "latest" или "preview".
tr: Dil sürümü için izin verilen değerleri görüntüleyin, dil sürümünü 'en son' veya 'önizleme' örneklerindeki gibi belirtin
zh_hans: 显示语言版本的允许值，指定语言版本，如“最新”或“预览”
zh_hant: 顯示語言版本允許的值，指定 'latest' 或 'preview' 等語言版本

# optsSupportedLangVersions
source: Supported language versions:
cs: Podporované jazykové verze:
de: Unterstützte Sprachversionen:
es: Versiones de lenguaje admitidas:
fr: Versions linguistiques prises en charge :
it: Versioni del linguaggio supportate:
ja: サポートされる言語バージョン:
ko: 지원되는 언어 버전:
pl: Obsługiwane wersje językowe:
pt_br: Versões de linguagens com suporte:
ru: Поддерживаемые языковые версии:
tr: Desteklenen dil sürümleri:
zh_hans: 支持的语言版本:
zh_hant: 支援的語言版本:
