Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# tcByrefsMayNotHaveTypeExtensions
source: Byref types are not allowed to have optional type extensions.
cs: Typy ByRef nesmí mít rozšíření volitelného typu.
de: ByRef-Typen dürfen keine optionalen Typerweiterungen aufweisen.
es: Los tipos de ByRef no pueden tener extensiones de tipo opcional.
fr: Les types ByRef ne sont pas autorisés à avoir des extensions de type en option.
it: Con i tipi byref non sono consentite estensioni di tipo facoltative.
ja: byref 型には、オプションの型拡張子を指定することはできません。
ko: byref 형식에는 선택적 형식 확장을 사용할 수 없습니다.
pl: Typy Byref nie mogą mieć opcjonalnych rozszerzeń typu.
pt_br: Tipos de ByRef não podem ter extensões de tipo opcionais.
ru: Типы byref не могут иметь расширения необязательного типа.
tr: Byref türlerinin isteğe bağlı tür genişletmelerine sahip olmasına izin verilmez.
zh_hans: 不允许 byref 类型具有可选类型扩展名。
zh_hant: Byref 類型不得有選擇性類型延伸模組。

# tcCannotPartiallyApplyExtensionMethodForByref
source: Cannot partially apply the extension method '{0}' because the first parameter is a byref type.
cs: Nejde částečně použít rozšiřující metodu {0}, protože první parametr je typu byref.
de: Die Erweiterungsmethode "{0}" kann nicht teilweise angewendet werden, da der erste Parameter ein Byref-Typ ist.
es: No se puede aplicar parcialmente el método de extensión "{0}" porque el primer parámetro es un tipo byref.
fr: Impossible d'appliquer partiellement la méthode d’extension « {0} » car le premier paramètre est un type byref.
it: Non è possibile applicare parzialmente il metodo di estensione '{0}' perché il primo parametro è un tipo byref.
ja: 最初のパラメーターは byref 型なので、拡張メソッド '{0}' を部分的に適用することはできません。
ko: 첫 번째 매개 변수가 byref 형식이므로 '{0}' 확장 메서드를 부분적으로 적용할 수 없습니다.
pl: Nie można częściowo zastosować metody rozszerzenia „{0}”, ponieważ pierwszy parametr jest typu byref.
pt_br: Não é possível aplicar parcialmente o método de extensão '{0}' porque o primeiro parâmetro é um tipo de byref.
ru: Не удается частично применить метод расширения "{0}", так как первый параметр имеет тип byref.
tr: İlk parametre bir byref türü olduğundan '{0}' genişletme metodunu kısmi olarak uygulayamazsınız.
zh_hans: 无法部分应用扩展方法 "{0}", 因为第一个参数是 byref 类型。
zh_hant: 因為第一個參數是 byref 類型，所以無法部分套用擴充方法 '{0}'。

# tcTypeDoesNotInheritAttribute
source: This type does not inherit Attribute, it will not work correctly with other .NET languages.
cs: Tento typ nedědí atribut. S jinými jazyky .NET nebude správně fungovat.
de: Dieser Typ erbt keine Attribute und kann nicht mit anderen .NET-Sprachen verwendet werden.
es: Este tipo no hereda el atributo, que no funciona correctamente con otros lenguajes. NET.
fr: Ce type n'hérite pas d'attribut, il ne fonctionne pas correctement avec d'autres langages .NET.
it: Questo tipo non eredita Attribute e non funzionerà correttamente con altri linguaggi .NET.
ja: この型は属性を継承しません。他の .NET 言語で正しく動作しません。
ko: 이 형식을 특성을 상속하지 않으므로 다른 .NET 언어에서 올바로 작동하지 않습니다.
pl: Ten typ nie dziedziczy atrybutu, więc nie będzie działać prawidłowo z innymi językami .NET.
pt_br: Este tipo não herda atributo, ele não funcionará corretamente com outras linguagens .NET.
ru: Этот тип не наследует атрибут (Attribute), он не будет корректно взаимодействовать с другими языками .NET.
tr: Bu tür Özniteliği devralmaz, diğer .NET dilleriyle düzgün çalışmaz.
zh_hans: 此类型不会继承 Attribute，它在使用其他 .NET 语言时无法正常运行。
zh_hant: 此類型不會繼承 Attribute，因此無法搭配其他 .NET 語言正確執行。

# parsInvalidAnonRecdExpr
source: Invalid anonymous record expression
cs: Neplatný výraz anonymního záznamu
de: Ungültiger anonymer Datensatzausdruck
es: Expresión no válida de registro anónimo
fr: Expression d'enregistrement anonyme non valide
it: L'espressione del record anonimo non è valida
ja: 無効な匿名レコード式
ko: 잘못된 무명 레코드 식
pl: Nieprawidłowe wyrażenie rekordu anonimowego
pt_br: Expressão de registro anônimo inválida
ru: Недопустимое выражение анонимной записи
tr: Geçersiz anonim kayıt ifadesi
zh_hans: 匿名记录表达式无效
zh_hant: 匿名記錄運算式無效

# parsInvalidAnonRecdType
source: Invalid anonymous record type
cs: Neplatný typ anonymního záznamu
de: Ungültiger anonymer Datensatztyp
es: Tipo de registro anónimo no válido
fr: Type d'enregistrement anonyme non valide
it: Il tipo di record anonimo non è valido
ja: 無効な匿名レコードの種類
ko: 잘못된 무명 레코드 형식
pl: Nieprawidłowy typ rekordu anonimowego
pt_br: Tipo de registro anônimo inválido
ru: Недопустимый анонимный тип записи
tr: Geçersiz anonim kayıt türü
zh_hans: 匿名记录类型无效
zh_hant: 匿名記錄類型無效

# tcCopyAndUpdateNeedsRecordType
source: The input to a copy-and-update expression that creates an anonymous record must be either an anonymous record or a record
cs: Vstupem výrazu pro kopírování a aktualizaci, který vytvoří anonymní záznam, musí být anonymní záznam nebo záznam.
de: Die Eingabe in einen Ausdruck für das Kopieren und Aktualisieren, der einen anonymen Datensatz erstellt, muss entweder ein anonymer Datensatz oder ein Datensatz sein.
es: La entrada a una expresión de copia y actualización que crea un registro anónimo debe ser un registro anónimo o un registro
fr: L'entrée d'une expression de copie et mise à jour qui crée un enregistrement anonyme doit être un enregistrement anonyme ou un enregistrement
it: Il valore di input di un'espressione di copia e aggiornamento che crea un record anonimo deve essere un record anonimo o un record
ja: 匿名レコードを作成する copy-and-update 式への入力には匿名レコードまたはレコードを 1 つ含める必要があります
ko: 무명 레코드를 만드는 복사 및 업데이트 식의 입력은 무명 레코드이거나 레코드여야 합니다.
pl: Dane wejściowe wyrażenia kopiowania i aktualizowania, które tworzy rekord anonimowy, muszą być rekordem lub rekordem anonimowym
pt_br: A entrada para uma expressão de copiar-e-atualizar que cria um registro anônimo deve ser um registro ou um registro anônimo
ru: Входные данные для выражения копирования и обновления, создающего анонимную запись, должны представлять собой анонимную или обычную запись
tr: Anonim kayıt oluşturan bir copy-and-update ifadesinin girişi anonim bir kayıt ya da bir kayıt olmalıdır
zh_hans: 创建匿名记录的“复制和更新”表达式的输入必须是匿名记录或记录
zh_hant: 對於會建立匿名記錄的複製並更新運算式，必須輸入匿名記錄或記錄

# chkInvalidFunctionParameterType
source: The parameter '{0}' has an invalid type '{1}'. This is not permitted by the rules of Common IL.
cs: Parametr {0} má neplatný typ {1}. To nepovolují pravidla Common IL.
de: Der Parameter "{0}" weist einen ungültigen Typ "{1}" auf. Dies ist gemäß den Regeln von Common IL unzulässig.
es: El parámetro "{0}" tiene un tipo no válido "{1}". Esto no está permitido por las reglas de Common IL.
fr: Le paramètre « {0} » a un type non valide (« {1} »), ce qui n'est pas autorisé par les règles de Common IL.
it: Il parametro '{0}' contiene un tipo non valido '{1}'. Questo comportamento non è consentito dalle regole di Common IL.
ja: パラメーター '{0}' には無効な型 '{1}' が指定されています。これは Common IL の規則では許可されていません。
ko: '{0}' 매개 변수에 잘못된 형식 '{1}'이(가) 있습니다. 이 형식은 공통 IL의 규칙에서 허용하지 않습니다.
pl: Parametr „{0}” ma nieprawidłowy typ „{1}”. Nie jest to dozwolone przez reguły języka Common IL.
pt_br: O parâmetro '{0}' tem um tipo inválido '{1}'. Isso não é permitido pelas regras do IL comum.
ru: Параметр "{0}" имеет недопустимый тип "{1}". Это не допускается правилами общего промежуточного языка.
tr: '{0}' parametresi geçersiz '{1}' türünde. Ortak IL kuralları uyarınca buna izin verilmez.
zh_hans: 参数 "{0}" 的类型 "{1}" 无效。通用 IL 的规则不允许使用此类型。
zh_hant: 參數 '{0}' 的類型 '{1}' 無效。Common IL 的規則不允許此狀況。

# chkInvalidFunctionReturnType
source: The function or method has an invalid return type '{0}'. This is not permitted by the rules of Common IL.
cs: Funkce nebo metoda má neplatný návratový typ {0}. To nepovolují pravidla Common IL.
de: Die Funktion oder Methode weist einen ungültigen Rückgabetyp "{0}" auf. Dies ist gemäß den Regeln von Common IL unzulässig.
es: La función o método tiene un tipo de valor devuelto no válido "{0}". Esto no está permitido por las reglas de Common IL.
fr: La méthode ou la fonction a un type de retour non valide (« {0} »), ce qui n’est pas autorisé par les règles de Common IL.
it: La funzione o il metodo contiene un tipo restituito non valido '{0}'. Questo comportamento non è consentito dalle regole di Common IL.
ja: 関数またはメソッドには、無効な戻り値の型 '{0}' が指定されています。これは Common IL の規則では許可されていません。
ko: 함수 또는 메서드에 잘못된 반환 형식 '{0}'이(가) 있습니다. 이는 공통 IL의 규칙에서 허용하지 않습니다.
pl: Funkcja lub metoda ma nieprawidłowy zwracany typ „{0}”. Nie jest to dozwolone przez reguły języka Common IL.
pt_br: A função ou método tem um tipo de retorno inválido '{0}'. Isso não é permitido pelas regras do IL Comum.
ru: Функция или метод имеет недопустимый возвращаемый тип "{0}". Это не допускается правилами общего промежуточного языка.
tr: İşlev veya metot geçersiz '{0}' dönüş türüne sahip. Ortak IL kuralları uyarınca buna izin verilmez.
zh_hans: 函数或方法的返回类型 "{0}" 无效。通用 IL 的规则不允许使用此类型。
zh_hant: 函式或方法的傳回型別 '{0}' 無效。Common IL 的規則不允許此狀況。

# typrelNoImplementationGivenSeveral
source: No implementation was given for those members: {0}
cs: Následující členy nemají žádnou implementaci: {0}
de: Für folgende Member wurde keine Implementierung angegeben: {0}
es: No se ha proporcionado ninguna implementación para esos miembros: {0}
fr: Aucune implémentation pour ces membres : {0}
it: Non è stata specificata alcuna implementazione per tali membri: {0}
ja: これらのメンバーに実装が指定されていません: {0}
ko: 멤버 {0}에 지정된 구현이 없습니다.
pl: Nie podano implementacji dla tych składowych: {0}
pt_br: Implementação não foi concedida para os membros: {0}
ru: Реализация для этих членов отсутствует: {0}
tr: Bu üyelere uygulama verilmedi: {0}
zh_hans: 没有为这些成员提供实现: {0}
zh_hant: 未提供任何實作給這些成員: {0}

# typrelNoImplementationGivenSeveralWithSuggestion
source: No implementation was given for those members: {0}Note that all interface members must be implemented and listed under an appropriate 'interface' declaration, e.g. 'interface ... with member ...'.
cs: Následující členy nemají žádnou implementaci: {0} Všechny členy rozhraní je potřeba implementovat a uvést pod příslušnou deklarací interface, třeba takto: interface ... with member ...
de: Für folgende Member wurde keine Implementierung angegeben: {0} Beachten Sie, dass alle Schnittstellenmember implementiert und in einer entsprechenden interface-Deklaration aufgeführt werden müssen, z.B. "interface ... with member ...".
es: No se ha proporcionado ninguna implementación para esos miembros: {0}Tenga en cuenta que todos los miembros de la interfaz deben implementarse y enumerarse en una declaracón "interface" adecuada; por ejemplo, "interface ... with member ...".
fr: Aucune implémentation pour ces membres : {0} Notez que tous les membres d'interface doivent être implémentés et listés sous une déclaration 'interface' appropriée, par ex., 'interface ... with member ...'.
it: Non è stata specificata alcuna implementazione per tali membri: {0}. Si noti che tutti i membri dell'interfaccia devono essere implementati ed elencati in una dichiarazione 'interface' appropriata, ad esempio 'interface ... with member ...'.
ja: これらのメンバーに実装が指定されていません: {0} すべてのインターフェイス メンバーは実装され、適切な 'interface' 宣言でリストされている必要があります。例: 'interface ... with member ...'。
ko: 멤버 {0}에 지정된 구현이 없습니다. 모든 인터페이스 멤버가 구현되어 적절한 'interface' 선언에 나열되어야 합니다(예: 'interface ... with member ...').
pl: Nie podano implementacji dla tych składowych: {0}Pamiętaj, że wszystkie składowe interfejsu muszą być zaimplementowane i wymienione w ramach odpowiedniej deklaracji „interface”, np. „interface ... with member ...”.
pt_br: Implementação não concedida para os membros: {0} Todos os membros de interface devem ser implementados e listados em uma declaração de 'interface' apropriada, por exemplo, 'interface ... com membro ...'.
ru: Реализация для этих членов отсутствует: {0}Обратите внимание, что каждый член интерфейса должен быть реализован и указан в соответствующем объявлении "interface", например, "интерфейс ... с членом ...".
tr: Bu üyelere uygulama verilmedi: {0}Tüm arabirim üyelerinin uygulanması ve uygun bir "arabirim" bildirimi (ör. "arabirim ... ile üye ..." kapsamında listelenmesi gerektiğini unutmayın.
zh_hans: 没有为这些成员提供实现: {0}请注意，必须实现所有接口成员，并在适当的 "interface" 声明下将其列出，例如 "interface ... with member ..."。
zh_hant: 未提供任何實作給這些成員: {0}請注意，所有介面成員都必須經過實作，並列於適當的 'interface' 宣告下，例如 'interface ... with member ...'。

# typrelNoImplementationGivenSeveralTruncated
source: No implementation was given for those members (some results omitted): {0}
cs: Následující členy nemají žádnou implementaci (některé výsledky jsou vynechané): {0}
de: Für folgende Member wurde keine Implementierung angegeben (einige Ergebnisse ausgelassen): {0}
es: No se ofreció ninguna implementación para esos miembros (se omitieron algunos resultados): {0}
fr: Aucune implémentation pour ces membres (certains résultats sont omis) : {0}
it: Non è stata specificata alcuna implementazione per tali membri (alcuni risultati sono stati omessi): {0}
ja: これらのメンバーに実装が指定されていません (一部の結果が省略されました): {0}
ko: 멤버 {0}에 지정된 구현이 없습니다(일부 결과는 생략됨).
pl: Nie podano implementacji dla tych składowych (niektóre wyniki zostały pominięte): {0}
pt_br: Implementação não concedida para os membros (alguns resultados omitidos): {0}
ru: Реализация для этих членов отсутствует (некоторые результаты опущены): {0}
tr: Bu üyelere uygulama verilmedi (bazı sonuçlar atlandı): {0}
zh_hans: 没有为这些成员提供实现 (省略了一些结果): {0}
zh_hant: 未提供任何實作給這些成員 (部分結果已省略): {0}

# typrelNoImplementationGivenSeveralTruncatedWithSuggestion
source: No implementation was given for those members (some results omitted): {0}Note that all interface members must be implemented and listed under an appropriate 'interface' declaration, e.g. 'interface ... with member ...'.
cs: Následující členy nemají žádnou implementaci (některé výsledky jsou vynechané): {0} Všechny členy rozhraní je potřeba implementovat a uvést pod příslušnou deklarací interface, třeba takto: interface ... with member ...
de: Für folgende Member wurde keine Implementierung angegeben (einige Ergebnisse ausgelassen): {0} Beachten Sie, dass alle Schnittstellenmember implementiert und in einer entsprechenden interface-Deklaration aufgeführt werden müssen, z.B. "interface ... with member ...".
es: No se ofreció ninguna implementación para esos miembros (se omitieron algunos resultados): {0} Tenga en cuenta que todos los miembros de la interfaz deben implementarse y enumerarse bajo una declaración de "interface" apropiada; por ejemplo, "interface ... with member ...".
fr: Aucune implémentation pour ces membres (certains résultats sont omis) : {0} Notez que tous les membres d'interface doivent être implémentés et listés sous une déclaration 'interface' appropriée, par ex., 'interface ... with member ... '.
it: Non è stata specificata alcuna implementazione per tali membri (alcuni risultati sono stati omessi): {0}. Si noti che tutti i membri dell'interfaccia devono essere implementati ed elencati in una dichiarazione 'interface' appropriata, ad esempio 'interface ... with member ...'.
ja: これらのメンバーに実装が指定されていません (一部の結果が省略されました): {0} すべてのインターフェイス メンバーは実装され、適切な 'interface' 宣言でリストされている必要があります。例: 'interface ... with member ...'。
ko: 멤버 {0}에 지정된 구현이 없습니다(일부 결과는 생략됨). 모든 인터페이스 멤버가 구현되어 적절한 'interface' 선언에 나열되어야 합니다(예: 'interface ... with member ...').
pl: Nie podano implementacji dla tych składowych (niektóre wyniki zostały pominięte): {0}Pamiętaj, że wszystkie składowe interfejsów muszą być zaimplementowane i wymienione w ramach odpowiedniej deklaracji „interface” np. „interface ... with member ...”.
pt_br: Implementação não concedida para os membros (alguns resultados omitidos): {0} Todos os membros de interface devem ser implementados e listados em uma declaração de 'interface' apropriada, por exemplo, 'interface ... com o membro...'.
ru: Реализация для этих членов отсутствует (некоторые результаты опущены): {0}Обратите внимание, что каждый член интерфейса должен быть реализован и указан в соответствующем объявлении "interface", например, "интерфейс ... с членом ...".
tr: Bu üyelere uygulama verilmedi (bazı sonuçlar atlandı): {0}Tüm arabirim üyelerinin uygulanması ve uygun bir "arabirim" bildirimi (ör. "arabirim ... ile üye ..." kapsamında listelenmesi gerektiğini unutmayın.
zh_hans: 没有为这些成员提供实现 (省略了一些结果): {0}请注意，必须实现所有接口成员，并在适当的 "interface" 声明下列出，例如 "interface ... with member ..."。
zh_hant: 未提供任何實作給這些成員 (部分結果已省略): {0}請注意，所有介面成員都必須經過實作，並列於適當的 'interface' 宣告下，例如 'interface ... with member ...'。

# expressionHasNoName
source: Expression does not have a name.
cs: Výraz není pojmenovaný.
de: Ausdruck hat keinen Namen.
es: La expresión no tiene un nombre.
fr: L'expression n'a pas de nom.
it: L'espressione non ha un nome.
ja: 式に名前がありません。
ko: 식에 이름이 없습니다.
pl: Wyrażenie nie ma nazwy.
pt_br: A expressão não tem um nome.
ru: Выражение не имеет имени.
tr: İfade bir ada sahip değil.
zh_hans: 表达式不具有名称。
zh_hant: 運算式沒有名稱。

# chkNoFirstClassNameOf
source: Using the 'nameof' operator as a first-class function value is not permitted.
cs: Použití operátoru nameof jako hodnoty funkce první třídy není povolené.
de: Die Verwendung des Operators "nameof" als erstklassiger Funktionswert ist nicht zulässig.
es: No se permite el uso del operador "nameof" como un valor de función de primera clase.
fr: L'utilisation de l'opérateur 'nameof' comme valeur de fonction de première classe n'est pas autorisée.
it: L'operatore 'nameof' non è consentito come valore di funzione di prima classe.
ja: 'nameof' 演算子をファーストクラスの関数値として使用することは許可されていません。
ko: 'nameof' 연산자는 첫 번째 클래스 함수 값으로 사용할 수 없습니다.
pl: Używanie operatora „nameof” jako pierwszoklasowej wartości funkcji nie jest dozwolone.
pt_br: O uso do operador ' nameof ' como um valor de função de primeira classe não é permitido.
ru: Использование оператора "nameof" в качестве значения функции первого класса не допускается.
tr: 'Nameof' işlecinin birinci sınıf işlev değeri olarak kullanılmasına izin verilmez.
zh_hans: 不允许使用 "nameof" 运算符作为第一类函数的值。
zh_hant: 不允許使用"nameof" 運算子作為第一類函式值。

# optsPathMap
source: Maps physical paths to source path names output by the compiler
cs: Mapuje fyzické cesty na názvy zdrojových cest z výstupu kompilátoru.
de: Ordnet der Ausgabe von Quellpfadnamen des Compilers physische Pfade zu
es: Asigna rutas físicas de acceso a nombres de ruta de origen resultantes del compilador
fr: Mappe les chemins physiques aux noms de chemin source générés par le compilateur
it: Esegue il mapping dei percorsi fisici ai nomi di percorso di origine restituiti dal compilatore
ja: 物理パスをコンパイラ出力のソース パス名にマップします
ko: 컴파일러에서 실제 경로를 소스 경로 이름 출력에 매핑합니다.
pl: Mapuje ścieżki fizyczne na wyjściowe nazwy ścieżek źródłowych z kompilatora
pt_br: Mapeia caminhos físicos para nomes de caminho de origem gerados pelo compilador
ru: Сопоставляет физические пути с исходными путями в выходных данных компилятора
tr: Fiziksel yolları derleyiciye göre kaynak yol adları çıkışıyla eşler
zh_hans: 将物理路径映射到编译器输出的源路径名
zh_hant: 將實體路徑對應至來源路徑名稱，由編譯器輸出

# fscPathMapDebugRequiresPortablePdb
source: --pathmap can only be used with portable PDBs (--debug:portable or --debug:embedded)
cs: Parametr --pathmap se může používat jenom s přenositelnými soubory PDB (--debug:portable nebo --debug:embedded)
de: --pathmap kann nur mit portierbaren PDB-Dateien verwendet werden (--debug:portable oder --debug:embedded)
es: --pathmap solo se puede utilizar con PDB portátiles (--Debug:portable o --Debug:embedded)
fr: --pathmap peut seulement être utilisé avec des PBD portables (--debug:portable ou --debug:embedded)
it: --pathmap può essere usato solo con file PDB portabili (--debug:portable o --debug:embedded)
ja: --pathmap は、ポータブル PDB でのみ使用できます (--debug:portable または --debug:embedded)
ko: --pathmap은 이식 가능한 PDB에만 사용할 수 있습니다(--debug:portable 또는 --debug:embedded).
pl: Argumentu --pathmap można używać tylko z przenośnymi plikami PDB (--debug:portable lub --debug:embedded)
pt_br: --pathmap só pode ser usado com PDBs portáteis (--debug:portable ou --debug:embedded)
ru: Параметр --pathmap может использоваться только с переносимыми PDB-файлами (--debug:portable или --debug:embedded)
tr: --pathmap yalnızca taşınabilir PDB'ler (--debug:portable veya --debug:embedded) ile kullanılabilir
zh_hans: --pathmap 只能与可移植的 PDB 一起使用(--debug:portable 或 --debug:embedded)
zh_hant: --pathmap 只能搭配可攜式 PDB 使用 (--debug:portable 或 --debug:embedded)

# optsInvalidPathMapFormat
source: Invalid path map. Mappings must be comma separated and of the format 'path=sourcePath'
cs: Neplatná mapa cest. Mapování musí být oddělená čárkami a používat formát cesta=zdrojováCesta.
de: Ungültige Pfadzuordnung. Zuordnungen müssen durch Kommas getrennt werden und das Format 'path=sourcePath' aufweisen
es: Mapa de ruta no válido. Las asignaciones deben estar separadas por comas y tener el formato "path=rutaOrigen"
fr: Mappage de chemin non valide. Les mappages doivent être séparés par des virgules et au format 'path=sourcePath'
it: Mapping di percorso non valido. I mapping devono essere delimitati da virgole e specificati in formato 'percorso=percorsoOrigine'
ja: 無効なパス マップです。マッピングはコンマ区切りの 'path=sourcePath' 形式である必要があります
ko: 잘못된 경로 맵입니다. 매핑은 쉼표로 구분되어야 하며 'path=sourcePath' 형식이어야 합니다.
pl: Nieprawidłowe mapowanie ścieżek. Mapowania muszą być rozdzielone przecinkami i mieć format „path=sourcePath”
pt_br: Mapa de caminho inválido. Os mapeamentos devem ser separados por vírgulas e do formato 'path=sourcePath'
ru: Недействительная карта путей. Сопоставления должны быть разделены запятыми и должны иметь формат "path=исходный_путь"
tr: Geçersiz yol eşlemesi. Eşlemeler virgülle ayrılmış ve 'path=sourcePath' biçiminde olmalıdır
zh_hans: 路径映射无效。映射必须以逗号分隔，且采用 "path=sourcePath" 格式
zh_hant: 路徑對應無效。對應必須以逗號分隔，且格式應為 'path=sourcePath'

# optsCompilerTool
source: Reference an assembly or directory containing a design time tool (Short form: -t)
cs: Odkaz na sestavení nebo adresář obsahující nástroj pro dobu návrhu (krátký tvar: -t)
de: Verweisen Sie auf eine Assembly oder ein Verzeichnis mit einem Entwurfszeittool (Kurzform: -t).
es: Referencia a un ensamblado o directorio que contiene una herramienta de tiempo de diseño (forma corta: -t)
fr: Référence un assembly ou un répertoire contenant un outil design-time (forme courte : -t)
it: Fa riferimento a un assembly o una directory contenente uno strumento della fase di progettazione. Forma breve: -t
ja: デザイン時ツールを含むアセンブリまたはディレクトリを参照します (短い形式: -t)
ko: 디자인 타임 도구를 포함하는 어셈블리 또는 디렉터리를 참조합니다(약식: -t).
pl: Odwołuje się do zestawu lub katalogu zawierającego narzędzie czasu projektowania (krótka wersja: -t)
pt_br: Referenciar um assembly ou um diretório contendo uma ferramenta de tempo de design (forma abreviada: -t)
ru: Ссылка на сборку или каталог, содержащие инструмент времени разработки (краткая форма: -t)
tr: Tasarım zamanı aracı içeren bir bütünleştirilmiş koda veya dizine başvurun (Kısa biçim: -t)
zh_hans: 引用包含设计时工具的程序集或目录(短格式: -t)
zh_hant: 參考包含設計階段工具的組件或目錄 (簡短形式: -t)

# packageManagerUnknown
source: Package manager key '{0}' was not registered in {1}. Currently registered: {2}
cs: Klíč správce balíčků {0} nebyl zaregistrován v {1}. Aktuálně registrováno: {2}
de: Der Paket-Manager-Schlüssel "{0}" wurde in "{1}" nicht registriert. Aktuell registriert: {2}
es: La clave del administrador de paquetes "{0}" no se registró en {1}. Registrada actualmente: {2}
fr: La clé '{0}' du gestionnaire de packages n'était pas inscrite dans {1}. L'inscription a été effectuée : {2}
it: La chiave di gestione pacchetti '{0}' non è stata registrata in {1}. Attualmente registrata: {2}
ja: パッケージ マネージャー キー '{0}' は {1} に登録されていませんでした。現在登録済み: {2}
ko: 패키지 관리자 키 '{0}'이(가) {1}에 등록되지 않았습니다. 현재 {2}이(가) 등록되었습니다.
pl: Klucz menedżera pakietów „{0}” nie został zarejestrowany w elemencie {1}. Obecnie zarejestrowane: {2}
pt_br: A chave '{0}' do gerenciador de pacotes não foi registrada em {1}. Registrada no momento: {2}
ru: Ключ "{0}" диспетчера пакетов не был зарегистрирован в {1}. Текущий зарегистрированный ключ: {2}
tr: '{0}' paket yöneticisi anahtarı {1} içinde kayıtlı değil. Şu anda kayıtlı: {2}
zh_hans: 未在 {1} 中注册包管理器密钥“{0}”。当前注册: {2}
zh_hant: 套件管理員金鑰 '{0}' 未在 {1} 中註冊。目前已註冊: {2}
