Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# optsLinkresource
source: Link the specified resource to this assembly where the resinfo format is <file>[,<string name>[,public|private]]
cs: Propojí zadaný prostředek s tímto sestavením, kde formát resinfo je <soubor>[,<název řetězce>[,public|private]].
de: Verknüpfen Sie die angegebene Ressource mit der Assembly, die das resinfo-Format "<file>[,<string name>[,public|private]]" aufweist.
es: Vincular el recurso especificado a este ensamblado donde el formato resinfo es <file>[,<string name>[,public|private]]
fr: Lier la ressource spécifiée à cet assembly où le format resinfo est <fichier>[,<nom de la chaîne>[,public|private]]
it: Collega la risorsa specificata all'assembly in cui il formato di resinfo è <file>[,<nome stringa>[,public|private]]
ja: 指定されたリソースを、resinfo 形式が <file>[,<string name>[,public|private]] のこのアセンブリにリンクします
ko: resinfo 형식이 <file>[,<string name>[,public|private]]인 경우 지정한 리소스를 이 어셈블리에 연결합니다.
pl: Połącz określony zasób z tym zestawem, gdzie format informacji o zasobie to <plik>[,<nazwa ciągu>[,public|private]]
pt_br: Vincule o recurso especificado a esse assembly em que o formato resinfo é <file>[,<string name>[,public|private]]
ru: Привязка указанного ресурса к этой сборке, где формат resinfo имеет следующий вид: <файл>[,<имя строки>[,public|private]]
tr: Belirtilen kaynağı, resinfo biçimi <file>[,<string name>[,public|private]] olacak şekilde bu derlemeye bağlayın
zh_hans: 将指定的资源链接到此程序集，其中 resinfo 格式为 <file>[,<string name>[,public|private]]
zh_hant: 將指定的資源連結到此組件，其中 resinfo 格式為 <檔案>[,<字串名稱>[,public|private]]

# optsDebugPM
source: Emit debug information (Short form: -g)
cs: Generuje ladicí informace (krátký tvar: -g).
de: Debuginformationen ausgeben (Kurzform: -g)
es: Emitir información de depuración (forma corta: -g)
fr: Émettre les informations de débogage (forme abrégée : -g)
it: Crea informazioni di debug (forma breve: -g)
ja: デバッグ情報を生成します (短い形式: -g)
ko: 디버그 정보를 내보냅니다(약식: -g).
pl: Emituj informacje debugowania (krótka wersja: -g)
pt_br: Emita as informação de depuração (Forma abreviada: -g)
ru: Вывод отладочной информации (краткая форма: -g)
tr: Hata ayıklama bilgilerini yay (Kısa biçimi: -g)
zh_hans: 发出调试信息(缩写: -g)
zh_hant: 發出偵錯資訊 (簡短形式: -g)

# optsDebug
source: Specify debugging type: full, portable, embedded, pdbonly. ('{0}' is the default if no debuggging type specified and enables attaching a debugger to a running program, 'portable' is a cross-platform format, 'embedded' is a cross-platform format embedded into the output file).
cs: Zadejte typ ladění: full, portable, embedded, pdbonly. ({0} je výchozí hodnota v případě, že není zadaný žádný typ ladění, a umožňuje připojení ladicího programu ke spuštěnému programu, portable je formát pro různé platformy, embedded je formát pro různé platformy vložený do výstupního souboru).
de: Geben Sie den Debugtyp an: full, portable, embedded, pdbonly. ("{0}" ist der Standardwert, wenn kein Debugtyp angegeben wird, und ermöglicht das Anfügen eines Debuggers an ein aktuell ausgeführtes Programm. "portable" ist ein plattformübergreifendes Format, "embedded" ein plattformübergreifendes, in die Ausgabedatei eingebettetes Format).
es: Especifique el tipo de depuración: full, portable, embedded, pdbonly. ('{0}' es el valor predeterminado si no se especifica ningún tipo de depuración y permite conectar un depurador a un programa en ejecución, 'portable' es un formato multiplataforma, 'embedded' es un formato multiplataforma insertado en el archivo de salida).
fr: Spécifiez le type de débogage : full, portable, embedded, pdbonly. ('{0}' est la valeur par défaut si aucun type de débogage n'est spécifié. Cette valeur permet d'attacher un débogueur à un programme en cours d'exécution, 'portable' est un format multiplateforme, 'embedded' est un format multiplateforme incorporé dans le fichier de sortie).
it: Consente di specificare il tipo di debug: full, portable, embedded, pdbonly. '{0}' è l'impostazione predefinita se non viene specificato il tipo di debug e consente di associare un debugger a un programma in esecuzione. 'portable' è un formato multipiattaforma. 'embedded' è un formato multipiattaforma incorporato nel file di output.
ja: デバッグの種類 full、portable、pdbonly を指定します (デバッグの種類が指定されない場合には '{0}' が既定で、実行中のプログラムにデバッガーを付加することができます。'portable' はクロスプラットフォーム形式、'embedded' は出力ファイルに埋め込まれたクロスプラットフォーム形式です)。
ko: 디버깅 형식(full, portable, embedded, pdbonly)을 지정합니다. '{0}'은(는) 디버깅 형식을 지정하지 않은 경우 기본값이며 디버거를 실행 중인 프로그램에 연결할 수 있습니다. 'portable'은 플랫폼 간 형식이고, 'embedded'는 출력 파일에 포함된 플랫폼 간 형식입니다.
pl: Określ typ debugowania: full, portable, pdbonly. Wartość „{0}” jest wartością domyślną, jeśli nie określono typu debugowania, i umożliwia dołączenie debugera do działającego programu. Wartość „portable” określa format międzyplatformowy. Wartość „embedded” określa format międzyplatformowy osadzony w pliku wyjściowym.
pt_br: Especificar tipo de depuração: completo, portátil, incorporado, somente PDB. ('{0}' será o padrão se nenhum tipo de depuração for especificado e permite anexar um depurador a um programa em execução; 'portátil' é um formato multiplataforma; 'incorporado' é um formato multiplataforma incorporado no arquivo de saída).
ru: Укажите тип отладки: full, portable, embedded, pdbonly (если тип отладки не указан, по умолчанию используется тип "{0}", позволяющий подключить отладчик к выполняющейся программе; тип portable представляет собой кроссплатформенный формат; тип embedded — кроссплатформенный формат, встроенный в выходной файл).
tr: Hata ayıklama türünü belirtin: full, portable, embedded, pdbonly. (Hata ayıklama türü belirtilmemişse '{0}' varsayılandır ve çalışan bir programa hata ayıklayıcı iliştirmeyi etkinleştirir. 'portable' bir çoklu platform biçimidir, 'embedded' çıkış dosyasına gömülü bir çoklu platform biçimidir).
zh_hans: 指定调试类型: full、portable、embedded、pdbonly。(若未指定调试类型，则默认为“{0}”，它允许将调试程序附加到正在运行的程序。"portable" 是跨平台格式，"embedded" 是嵌入到输出文件中的跨平台格式)。
zh_hant: 指定偵錯類型: full、portable、embedded、pdbonly。(如果未指定偵錯類型，即預設為 '{0}'，並允許將偵錯工具附加到正在執行的程式，'portable' 為跨平台格式，'embedded' 為輸出檔案內嵌的跨平台格式)。

# optsOptimize
source: Enable optimizations (Short form: -O)
cs: Povolit optimalizace (krátký tvar: -O)
de: Optimierungen aktivieren (Kurzform: -O)
es: Habilitar optimizaciones (forma corta: -O)
fr: Activer les optimisations (forme abrégée : -O)
it: Abilita le ottimizzazioni (forma breve: -O)
ja: 最適化を有効にします (短い形式: -O)
ko: 최적화를 사용합니다(약식: -O).
pl: Włącz optymalizacje (krótka wersja: -O)
pt_br: Habilite otimizações (Forma abreviada: -O)
ru: Включить оптимизацию (краткая форма: -O)
tr: İyileştirmeleri etkinleştir (Kısa biçimi: -O)
zh_hans: 启用优化(缩写: -O)
zh_hant: 啟用最佳化 (簡短形式: -O)

# optsTailcalls
source: Enable or disable tailcalls
cs: Zapnout nebo vypnout volání funkce Tail
de: Endeaufrufe aktivieren oder deaktivieren
es: Habilitar o deshabilitar llamadas de cola
fr: Activer ou désactiver les appels tail
it: Abilita o disabilita le chiamate tail
ja: tail の呼び出しを有効または無効にします
ko: 마무리 호출을 사용하거나 사용하지 않습니다.
pl: Włącz lub wyłącz wywołania tail
pt_br: Habilitar ou desabilitar tailcalls
ru: Включение или отключение концевых вызовов
tr: Tail çağrılarını etkinleştir veya devre dışı bırak
zh_hans: 启用或禁用尾调用
zh_hant: 啟用或停用 Tail 呼叫

# optsDeterministic
source: Produce a deterministic assembly (including module version GUID and timestamp)
cs: Vytvoří deterministické sestavení (včetně GUID verze modulu a časového razítka).
de: Deterministische Assembly erstellen (einschließlich Modulversions-GUID und Zeitstempel)
es: Generar un ensamblado determinista (con el GUID y la marca de tiempo de la versión del módulo)
fr: Produire un assembly déterministe (en incluant le GUID et l'horodateur de la version du module)
it: Produce un assembly (che include GUID e timestamp della versione del modulo)
ja: 決定論的アセンブリを作成します (モジュール バージョン GUID やタイムスタンプなど)
ko: 결정적 어셈블리(모듈 버전 GUID 및 타임스탬프 포함) 생성
pl: Utwórz zestaw deterministyczny (łącznie z sygnaturą czasową i identyfikatorem GUID wersji modułu)
pt_br: Produzir um assembly determinístico (incluindo GUID de versão de módulo e carimbo de data/hora)
ru: Создать детерминированную сборку (включая GUID версии модуля и метку времени)
tr: Belirleyici bir bütünleştirilmiş kod oluşturun (modül sürümü GUID'i ve zaman damgası dahil)
zh_hans: 产生确定性的程序集(包括模块版本 GUID 和时间戳)
zh_hant: 產生確定性組件 (包括模組版本 GUID 及時間戳記)

# optsCrossoptimize
source: Enable or disable cross-module optimizations
cs: Povoluje nebo zakazuje optimalizaci mezi moduly.
de: Modulübergreifende Optimierungen aktivieren oder deaktivieren
es: Habilitar o deshabilitar optimizaciones entre módulos
fr: Activer ou désactiver les optimisations entre modules
it: Abilita o disabilita le ottimizzazioni tra i moduli
ja: モジュール間の最適化を有効または無効にします
ko: 크로스 모듈을 최적화하거나 최적화하지 않습니다.
pl: Włącz lub wyłącz optymalizacje między modułami
pt_br: Habilite ou desabilite otimizações de módulo cruzado
ru: Включение или отключение межмодульной оптимизации
tr: Modüller arası iyileştirmeleri etkinleştir veya devre dışı bırak
zh_hans: 启用或禁用跨模块优化
zh_hant: 啟用或停用跨模組最佳化

# optsWarnaserrorPM
source: Report all warnings as errors
cs: Oznamovat všechna upozornění jako chyby
de: Alle Warnungen als Fehler melden
es: Notificar todas las advertencias como errores
fr: Signaler tous les avertissements comme des erreurs
it: Segnala tutti gli avvisi come errori
ja: すべての警告をエラーとして報告する
ko: 모든 경고를 오류로 보고합니다.
pl: Raportuj wszystkie ostrzeżenia jako błędy
pt_br: Relatar todos os avisos como erros
ru: Обрабатывать все предупреждения как ошибки
tr: Tüm uyarıları hata olarak bildir
zh_hans: 将所有警告报告为错误
zh_hant: 將所有警告回報為錯誤

# optsWarnaserror
source: Report specific warnings as errors
cs: Oznamovat konkrétní upozornění jako chyby
de: Bestimmte Warnungen als Fehler melden
es: Notificar advertencias específicas como errores
fr: Signaler des avertissements spécifiques comme des erreurs
it: Segnala determinati avvisi come errori
ja: 指定した警告をエラーとして報告する
ko: 특정 경고를 오류로 보고합니다.
pl: Raportuj określone ostrzeżenia jako błędy
pt_br: Relatar avisos específicos como erros
ru: Обрабатывать указанные предупреждения как ошибки
tr: Belirli uyarıları hata olarak bildir
zh_hans: 将特定警告报告为错误
zh_hant: 將特定的警告回報為錯誤

# optsWarn
source: Set a warning level (0-5)
cs: Nastavit úroveň pro upozornění (0–5)
de: Warnstufe (0-5) bestimmen
es: Establecer un nivel de advertencia (0-5)
fr: Définir un niveau d'avertissement (0-5)
it: Imposta un livello di avviso (0-5)
ja: 警告レベル (0 ～ 5) を設定します
ko: 경고 수준(0-5)을 설정합니다.
pl: Ustaw poziom ostrzeżeń (0-5)
pt_br: Definir um nível de aviso (0-5)
ru: Задать уровень предупреждений (0-5)
tr: Uyarı düzeyini ayarla (0-5)
zh_hans: 设置警告等级(0-5)
zh_hant: 設定警告層級 (0-5)

# optsNowarn
source: Disable specific warning messages
cs: Zakázat specifická upozornění
de: Bestimmte Warnmeldungen deaktivieren
es: Deshabilitar mensajes de advertencia específicos
fr: Désactiver des messages d'avertissement déterminés
it: Disabilita messaggi di avviso specifici
ja: 指定の警告メッセージを無効にする
ko: 특정 경고 메시지를 사용하지 않습니다.
pl: Wyłącz określone komunikaty ostrzegawcze
pt_br: Desabilitar mensagens de aviso específicas
ru: Отключить указанные предупреждения
tr: Belirli uyarı iletilerini devre dışı bırak
zh_hans: 禁用特定的警告消息
zh_hant: 停用特定的警告訊息

# optsWarnOn
source: Enable specific warnings that may be off by default
cs: Povolit specifická upozornění, která můžou být ve výchozím nastavení vypnutá
de: Spezifische Warnungen aktivieren, die möglicherweise standardmäßig deaktiviert sind
es: Habilitar advertencias específicas que pueden estar desactivadas de forma predeterminada
fr: Activer les avertissements spécifiques qui peuvent être désactivés par défaut
it: Abilita avvisi specifici che possono essere disattivati per impostazione predefinita
ja: 既定でオフにすることができる特定の警告を有効にします
ko: 특정 경고 사용(기본적으로 해제됨)
pl: Włącz określone ostrzeżenia, które domyślnie mogą być wyłączone
pt_br: Habilitar avisos específicos que podem estar desativados por padrão
ru: Включить конкретные предупреждения, которые по умолчанию могут быть отключенными
tr: Varsayılan seçenek olarak kapalı olabilen özel uyarıları etkinleştir
zh_hans: 启用默认情况下可能关闭的特定警告
zh_hant: 啟用預設可能關閉的特定警告

# optsChecked
source: Generate overflow checks
cs: Generovat kontroly přetečení
de: Überlaufprüfungen generieren
es: Generar comprobaciones de desbordamiento
fr: Générer des contrôles de dépassement de capacité
it: Genera controlli dell'overflow
ja: オーバーフロー チェックの生成
ko: 오버플로 검사를 생성합니다.
pl: Generuj operacje sprawdzenia przepełnienia
pt_br: Gerar verificações de estouro
ru: Сформировать проверки переполнений
tr: Taşma denetimleri oluştur
zh_hans: 生成溢出检查
zh_hant: 產生溢位核對

# optsDefine
source: Define conditional compilation symbols (Short form: -d)
cs: Definuje symboly podmíněné kompilace (krátký tvar: -d).
de: Bedingte Kompilierungssymbole definieren (Kurzform: -d)
es: Definir símbolos de compilación condicionales (forma corta: -d)
fr: Définir les symboles de compilation conditionnelle (forme abrégée : -d)
it: Definisce simboli di compilazione condizionale (forma breve: -d)
ja: 条件付きコンパイル シンボルを定義します (短い形式: -d)
ko: 조건부 컴파일 기호를 정의합니다(약식: -d).
pl: Definiuj symbole kompilacji warunkowej (krótka wersja: -d)
pt_br: Defina símbolos de compilação condicional (Forma abreviada: -d)
ru: Определить символы условной компиляции (краткая форма: -d)
tr: Koşullu derleme simgelerini tanımla (Kısa biçimi: -d)
zh_hans: 定义条件编译符号(缩写: -d)
zh_hant: 定義條件式編譯的符號 (簡短形式: -d)

# optsMlcompatibility
source: Ignore ML compatibility warnings
cs: Ignoruje upozornění na kompatibilitu s ML.
de: ML-Kompatibilitätswarnungen ignorieren
es: Omitir las advertencias de compatibilidad con ML
fr: Ignorer les avertissements de compatibilité ML
it: Ignora avvisi di compatibilità ML
ja: ML 互換性に関する警告を無視します
ko: ML 호환성 경고를 무시합니다.
pl: Ignoruj ostrzeżenia dotyczące zgodności z językiem ML
pt_br: Ignore avisos de compatibilidade ML
ru: Игнорировать предупреждения многоязыковой совместимости
tr: ML uyumluluk uyarılarını yoksay
zh_hans: 忽略 ML 兼容性警告
zh_hant: 忽略 ML 相容性警告

# optsNologo
source: Suppress compiler copyright message
cs: Potlačí zprávu o autorských právech kompilátoru.
de: Compiler-Copyrightmeldung unterdrücken
es: Suprimir el mensaje de copyright del compilador
fr: Supprimer le message de copyright du compilateur
it: Non visualizza il messaggio di copyright del compilatore
ja: コンパイラーの著作権メッセージを表示しません
ko: 컴파일러 저작권 메시지를 표시하지 않습니다.
pl: Pomiń komunikat kompilatora o prawach autorskich
pt_br: Suprimir a mensagem de direitos autorais do compilador
ru: Запрещает отображение сообщения компилятора об авторских правах
tr: Derleyici telif hakkı iletisini gösterme
zh_hans: 取消显示编译器版权消息
zh_hant: 隱藏編譯器著作權訊息

# optsHelp
source: Display this usage message (Short form: -?)
cs: Zobrazí tuto zprávu o použití (krátký tvar: -?).
de: Diesen Hilfetext anzeigen (Kurzform: -?)
es: Muestra este mensaje de uso (forma corta: -?)
fr: Affiche ce message d'utilisation (forme abrégée : -?)
it: Visualizza questo messaggio relativo all'uso (forma breve: -?)
ja: この使用方法に関するメッセージを表示します (短い形式: -?)
ko: 이 사용법 메시지를 표시합니다(약식: -?).
pl: Wyświetl ten komunikat dotyczący składni (krótka wersja: -?)
pt_br: Exibir esta mensagem de uso (Forma abreviada: -?)
ru: Вывод данного сообщения об использовании (краткая форма: -?)
tr: Bu kullanım iletisini görüntüle (Kısa biçimi: -?)
zh_hans: 显示此用法消息(缩写为: -?)
zh_hant: 顯示此訊息 (簡短形式: -?)

# optsResponseFile
source: Read response file for more options
cs: Další možnosti najdete v souboru odpovědi.
de: Antwortdatei lesen, um weitere Optionen zu ermitteln
es: Leer el archivo de respuesta para obtener más opciones
fr: Lire le fichier réponse pour plus d'options
it: Per ulteriori opzioni, leggere il file di risposta
ja: その他のオプションを、応答ファイルから読み取ります
ko: 추가 옵션을 보려면 지시 파일을 읽으세요.
pl: Przeczytaj plik odpowiedzi, aby uzyskać informacje na temat kolejnych opcji
pt_br: Leia o arquivo de resposta para obter mais opções
ru: Считывать файл ответа с дополнительными параметрами
tr: Daha fazla seçenek için yanıt dosyasını okuyun
zh_hans: 读取响应文件以获取更多选项
zh_hant: 如需了解更多選項，請參閱回應檔

# optsCodepage
source: Specify the codepage used to read source files
cs: Určuje znakovou stránku, která se používá ke čtení zdrojových souborů.
de: Codepage zum Lesen von Quelldateien angeben
es: Especifique la página de códigos usada para leer archivos de código fuente.
fr: Spécifier la page de codes utilisée pour lire les fichiers sources
it: Specificare la tabella codici utilizzata per leggere i file di origine
ja: ソース ファイルの読み取りに使用するコードページを指定します
ko: 소스 파일을 읽는 데 사용되는 코드 페이지를 지정합니다.
pl: Określ stronę kodową używaną do odczytu plików źródłowych
pt_br: Especifique a página de código usada para ler arquivos de origem
ru: Укажите кодовую страницу, которая будет использоваться для чтения исходных файлов
tr: Kaynak dosyaları okumak için kullanılan kod sayfasını belirtin
zh_hans: 指定用于读取源文件的代码页
zh_hant: 指定用來讀取原始程式檔的字碼頁

# optsUtf8output
source: Output messages in UTF-8 encoding
cs: Výstupní zprávy v kódování UTF-8
de: Ausgabemeldungen in UTF-8-Codierung
es: Mensajes de salida con codificación UTF-8
fr: Messages de sortie au format d'encodage UTF-8
it: Genera messaggi con codifica UTF-8
ja: UTF-8 エンコードでメッセージを出力します
ko: UTF-8 인코딩으로 메시지를 출력합니다.
pl: Wypisz komunikaty w kodowaniu UTF-8
pt_br: Mensagens de saída em codificação UTF-8
ru: Выводит сообщения в кодировке UTF-8
tr: UTF-8 kodlamasında çıkış iletileri
zh_hans: 以 UTF-8 编码格式输出消息
zh_hant: 以 UTF-8 編碼輸出訊息

# optsFullpaths
source: Output messages with fully qualified paths
cs: Výstupní zprávy s plně kvalifikovanou cestou
de: Ausgabemeldungen mit vollqualifiziertem Pfad
es: Mensajes de salida con rutas de acceso completas
fr: Messages de sortie avec chemins d'accès qualifiés complets
it: Messaggi di output con percorsi completi
ja: 完全修飾パスを含むメッセージを出力します
ko: 정규화된 경로를 사용하여 메시지를 출력합니다.
pl: Komunikaty z w pełni kwalifikowanymi ścieżkami
pt_br: Mensagens de saída com caminhos totalmente qualificados
ru: Вывод сообщений с полными путями
tr: Tam yollu çıkış iletileri
zh_hans: 使用完全限定路径输出消息
zh_hant: 輸出含完整路徑的訊息

# optsLib
source: Specify a directory for the include path which is used to resolve source files and assemblies (Short form: -I)
cs: Určuje adresář pro cestu vložených souborů, který se použije k překladu zdrojových souborů a sestavení (krátký tvar: -I).
de: Verzeichnis für den Includepfad angeben, der zum Auflösen von Quelldateien und -assemblys verwendet wird (Kurzform: -I)
es: Especifique un directorio para la ruta de acceso de inclusión que se usa para resolver los ensamblados y archivos de código fuente (forma corta: -I).
fr: Spécifier un répertoire pour le chemin d'accès Include utilisé pour résoudre les fichiers sources et les assemblys (forme abrégée : -I)
it: Specifica una directory per il percorso di inclusione utilizzato per risolvere assembly e file di origine (forma breve: -I)
ja: ソース ファイルおよびアセンブリの解決に使用する include パスのディレクトリを指定します (短い形式: -I)
ko: 소스 파일 및 어셈블리를 확인하는 데 사용되는 포함 경로의 디렉터리를 지정합니다(약식: -I).
pl: Określ katalog dla ścieżki dołączenia, która służy do rozpoznawania plików źródłowych i zestawów (krótka wersja: -I)
pt_br: Especifique um diretório para incluir o caminho que é usado para resolver arquivos de origem e assemblies (Forma abreviada: -I)
ru: Укажите каталог для поиска включаемых файлов, который будет использоваться для разрешения исходных файлов и сборок (краткая форма: -I)
tr: Kaynak dosyalarını ve bütünleştirilmiş kodları çözümlemek için kullanılan ekleme yolu için bir dizin belirtin (Kısa biçimi: -I)
zh_hans: 指定用于解析源文件和程序集的包含路径的目录(缩写: -I)
zh_hant: 指定用於 Include 路徑的目錄，它是用來解析原始程式檔和組件 (簡短形式: -I)

# optsBaseaddress
source: Base address for the library to be built
cs: Základní adresa knihovny, která se má vytvořit
de: Basisadresse für die zu erstellende Bibliothek
es: Dirección base para la biblioteca que se compilará
fr: Adresse de base de la bibliothèque à générer
it: Indirizzo di base della libreria da compilare
ja: ビルドするライブラリのベース アドレス
ko: 빌드할 라이브러리의 기준 주소
pl: Adres podstawowy biblioteki, która ma zostać skompilowana
pt_br: Endereço base para a biblioteca a ser criada
ru: Базовый адрес библиотеки, для которой будет выполнена сборка
tr: Oluşturulacak kitaplığın temel adresi
zh_hans: 要生成的库的基址
zh_hant: 要建置程式庫的基底位址

# optsNoframework
source: Do not reference the default CLI assemblies by default
cs: Neodkazovat ve výchozím nastavení na výchozí sestavení CLI
de: Standardmäßig nicht auf die CLI-Standardassemblys verweisen
es: No hacer referencia de forma predeterminada a los ensamblados de CLI predeterminados
fr: Ne pas référencer les assemblys CLI par défaut
it: Per impostazione predefinita, non fa riferimento agli assembly CLI predefiniti
ja: 既定では、既定の CLI アセンブリを参照しません
ko: 기본 CLI 어셈블리를 기본적으로 참조하지 마세요.
pl: Domyślnie nie odwołuj się do domyślnych zestawów infrastruktury CLI
pt_br: Não referencie os assemblies CLI padrões por padrão
ru: Не обращаться к сборкам CLI по умолчанию
tr: Varsayılan seçenek olarak varsayılan CLI bütünleştirilmiş kodlarına başvurma
zh_hans: 默认情况下不引用默认 CLI 程序集
zh_hant: 不預設參考預設的 CLI 組件

# optsStandalone
source: Statically link the F# library and all referenced DLLs that depend on it into the assembly being generated
cs: Staticky propojit knihovnu F# a všechny odkazované knihovny DLL, které jsou na ní závislé, do právě generovaného sestavení
de: F#-Bibliothek und alle davon abhängigen DLLs, auf die verwiesen wird, statisch mit der generierten Assembly verknüpfen
es: Vincular de forma estática la biblioteca de F# y todos los archivos DLL a los que se hace referencia que dependen de ella en el ensamblado que se va a generar
fr: Lier statiquement la bibliothèque F# et toutes les DLL référencées qui en dépendent dans l'assembly en cours de génération
it: Collega in modo statico la libreria F# e tutte le DLL da questa dipendenti a cui viene fatto riferimento nell'assembly in fase di generazione
ja: F# ライブラリと、ライブラリに依存するすべての参照 DLL を、生成されるアセンブリへ静的にリンクします
ko: F# 라이브러리 및 이 라이브러리에 종속된 모든 참조 DLL을 생성되는 어셈블리에 정적으로 링크합니다.
pl: Połącz statycznie bibliotekę języka F# i wszystkie przywoływane biblioteki DLL w generowanym zestawie
pt_br: Vincular estaticamente a biblioteca F# e todos os DLLs referenciados que dependem do assembly que está sendo gerado
ru: Статическая компоновка библиотеки F# и всех зависимых от нее библиотек DLL, на которые существуют ссылки, в создаваемую сборку
tr: F# kitaplığını ve ona bağlı tüm başvurulan DLL'leri, oluşturulmakta olan bütünleştirilmiş koda statik olarak bağla
zh_hans: 以静态方式将 F# 库与依赖于此库的所有引用的 DLL 链接到所生成的程序集中
zh_hant: 將 F# 程式庫和所有依存於它的被參考 DLL 靜態連結到所產生的組件中
