Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# parsEofInTripleQuoteString
source: End of file in triple-quote string begun at or before here
cs: Konec souboru začal v řetězci v trojitých uvozovkách na této pozici nebo před ní.
de: Dateiende in einer Zeichenfolge mit dreifachen Anführungszeichen, die an oder vor dieser Stelle begonnen wurde
es: El final del archivo en la cadena de comillas triples comenzaba aquí o antes
fr: La fin du fichier dans une chaîne à guillemets triples a commencé ici ou avant ici
it: La fine del file nella stringa con virgolette triple inizia in questa posizione o prima di essa
ja: この位置以前に始まった三重引用符文字列の途中でファイルの終わりが見つかりました
ko: 3중 따옴표 문자열의 파일 끝이 여기나 그 앞에서 시작됩니다.
pl: Koniec pliku w ciągu z potrójnym cudzysłowem rozpoczętym w tym miejscu lub przed nim
pt_br: Fim de arquivo na cadeia de caracteres com aspas triplas iniciada aqui ou antes
ru: Конец файла в строке с тройными кавычками, начавшейся здесь или ранее
tr: Üç tırnak işaretli dizede dosya sonu burada veya daha önce başlatıldı
zh_hans: 文件尾在此处或之前开始的三重引号字符串中
zh_hant: 三引號字串中的檔案結尾於此處或之前開始

# parsEofInTripleQuoteStringInComment
source: End of file in triple-quote string embedded in comment begun at or before here
cs: Konec souboru začal v řetězci v trojitých uvozovkách vloženém do komentáře na této pozici nebo před ní.
de: Dateiende in einer in den Kommentar eingebetteten Zeichenfolge mit dreifachen Anführungszeichen, die an oder vor dieser Stelle begonnen wurde
es: El final del archivo en la cadena de comillas triples incrustada en el comentario comenzaba aquí o antes.
fr: La fin du fichier dans la chaîne à guillemets triples incorporée dans un commentaire a commencé ici ou avant ici
it: La fine del file nella stringa con virgolette triple incorporata nel commento inizia in questa posizione o prima di essa
ja: この位置以前に始まったコメントに埋め込まれた三重引用符文字列の途中でファイルの終わりが見つかりました
ko: 주석에 포함된 3중 따옴표 문자열의 파일 끝이 여기나 그 앞에서 시작됩니다.
pl: Koniec pliku w ciągu z potrójnym cudzysłowem osadzonym w komentarzu rozpoczętym w tym miejscu lub przed nim
pt_br: Fim de arquivo na cadeia de caracteres com aspas triplas inserida no comentário iniciado aqui ou antes
ru: Конец файла в строке с тройными кавычками, вставленной в комментарий, который начался здесь или ранее
tr: Üç tırnak işaretli açıklamaya gömülü dizede dosya sonu burada veya daha önce başlatıldı
zh_hans: 文件尾在此处或之前开始的注释中嵌入的三重引号字符串中
zh_hant: 內嵌在註解中的三引號字串中的檔案結尾於此處或之前開始

# tcTypeTestLosesMeasures
source: This type test or downcast will ignore the unit-of-measure '{0}'
cs: Test tohoto typu nebo jeho přetypování směrem dolů bude ignorovat měrnou jednotku {0}.
de: Bei diesem Typtest oder der Typumwandlung wird die Maßeinheit '{0}' ignoriert.
es: Esta prueba de tipo o conversión hacia abajo omitirá la unidad de medida '{0}'.
fr: Ce test de type ou ce cast d'une classe de base va ignorer l'unité de mesure '{0}'
it: Questo test di tipo o downcast ignorerà l'unità di misura '{0}'
ja: この型テストまたはダウンキャストでは、測定単位 '{0}' が無視されます
ko: 이 형식 테스트 또는 다운캐스트는 '{0}' 측정 단위를 무시합니다.
pl: Ten test typu lub to przypisanie elementu podrzędnego zignoruje jednostkę miary „{0}”
pt_br: Esse teste de tipo ou downcast ignorará a unidade de medida '{0}'
ru: При такой проверке типа или нисходящем приведении единица измерения "{0}" будет проигнорирована
tr: Bu tür testi veya alt türe çevirme işlemi '{0}' ölçü birimini yok sayacak
zh_hans: 此类型测试或向下转换将忽略度量单位“{0}”
zh_hant: 這個類型測試或向下轉型將忽略測量單位 '{0}'

# parsMissingTypeArgs
source: Expected type argument or static argument
cs: Očekával se argument typu nebo statický argument.
de: Es wurde ein Typ- oder statisches Argument erwartet.
es: Se esperaba un argumento de tipo o estático.
fr: Argument de type ou argument statique attendu
it: Previsto argomento tipo o statico
ja: 型引数または静的引数が必要です
ko: 형식 인수 또는 정적 인수가 필요합니다.
pl: Oczekiwano argumentu typu lub argumentu statycznego
pt_br: Argumento de tipo ou argumento estático esperado
ru: Ожидался аргумент типа или статический аргумент
tr: Tür bağımsız değişkeni veya statik bağımsız değişken bekleniyor
zh_hans: 应为类型参数或静态参数
zh_hant: 必須是型別引數或靜態引數

# parsMissingGreaterThan
source: Unmatched '<'. Expected closing '>'
cs: Nespárovaná levá závorka <. Očekává se pravá závorka >.
de: Keine Übereinstimmung für "<". Schließendes ">"-Zeichen erwartet.
es: Falta el valor correspondiente de "<". Se esperaba el cierre ">"
fr: '<' sans correspondance. '>' fermant attendu
it: '<' senza corrispondenza. È previsto '>' di chiusura
ja: '<' が対応していません。対応する '>' が必要です
ko: '<'의 짝이 맞지 않습니다. 닫는 '>'가 필요합니다.
pl: Niedopasowany znak „<”. Oczekiwano znaku zamykającego „>”
pt_br: '<'. Fechamento esperado '>' incompatível
ru: Отсутствует парная скобка для '<'. Ожидается закрывающая скобка '>'
tr: Eşleşmeyen '<'. Expected closing '>'
zh_hans: "<" 不匹配。应为 ">" 结尾
zh_hant: '<' 不對稱。應有右方的 '>'

# parsUnexpectedQuotationOperatorInTypeAliasDidYouMeanVerbatimString
source: Unexpected quotation operator '<@' in type definition. If you intend to pass a verbatim string as a static argument to a type provider, put a space between the '<' and '@' characters.
cs: Neočekávaný operátor citace <@ v definici typu. Pokud chcete zprostředkovateli typu předávat doslovný řetězec jako statický argument, vložte mezi znaky < a @ mezeru.
de: Unerwarteter Anführungszeichen-Operator "< @" in der Typdefinition. Wenn eine ausführliche Zeichenfolge als statisches Argument an einen Typanbieter übergeben werden soll, fügen Sie zwischen den Zeichen "<" und "@" eine Leerstelle ein.
es: Operador de cita inesperada "<@" en definición de tipo. Si desea pasar una cadena textual como un argumento estático a un proveedor de tipos, ponga un espacio entre los caracteres "<" y "@".
fr: Opérateur de citation inattendu '<@' dans la définition de type. Si vous voulez passer une chaîne textuelle comme argument statique à un fournisseur de type, insérez un espace entre les caractères '<' et '@'.
it: Operatore di quotation '<@' imprevisto nella definizione di tipo. Se si vuole passare una stringa verbatim come argomento statico a un provider di tipi, mettere uno spazio tra i caratteri '<' e '@'.
ja: 型定義に予期しない引用演算子 '<@' が見つかりました。verbatim 文字列を静的引数として型プロバイダーに渡す場合は、'<' と '@' の間に空白を挿入してください。
ko: 형식 정의에 예기치 않은 인용구 연산자 '<@'가 있습니다. 축자 문자열을 정적 인수로 형식 공급자에 전달하려면 '<'와 '@' 문자 사이에 공백을 추가하세요.
pl: Nieoczekiwany operator cytatu „<@” w definicji typu. Jeśli chcesz przekazać ciąg dosłownego wyrażenia jako argument statyczny do dostawcy typów, wstaw odstęp między znakami „<” i „@”.
pt_br: Operador de cotação inesperado '<@' na definição de tipo. Se deseja passar uma cadeia de caracteres textual como um argumento estático para um provedor de tipos, coloque um espaço entre os caracteres '<' e '@'.
ru: Неожиданный оператор цитирования '<@' в определении типа. Если вы хотите передать дословную строку в качестве статического аргумента поставщику типа, разделите символы '<' и '@' пробелом.
tr: Tür tanımında beklenmeyen '<@' alıntı işleci. Bir tür sağlayıcısına bir harf dizisini statik bağımsız değişken olarak geçirmek istiyorsanız '<' ile '@' karakterinin arasına bir boşluk koyun.
zh_hans: 类型定义中出现意外的引用运算符 "<@"。如果旨在将原义字符串作为静态参数传递到类型提供程序，请在 "<" 和 "@" 字符之间加一个空格。
zh_hant: 類型定義中有未預期的引號運算子 '<@'。若您想要以靜態引數形式將逐字字串傳遞給類型提供者，請在 '<' 和 '@' 字元之間加入空格。

# parsErrorParsingAsOperatorName
source: Attempted to parse this as an operator name, but failed
cs: Proběhl pokus o analýzu jako názvu operátoru, ale tento pokus selhal.
de: Versuchte Analyse als Operatornamen, jedoch Analysefehler
es: Se intentó analizar este elemento como nombre de operador, pero se produjo un error.
fr: La tentative d'analyse de cet élément en tant que nom d'opérateur a échoué
it: Si è tentato di analizzare questo elemento come nome operatore, ma l'operazione non è riuscita
ja: これを演算子名として解析しようとしましたが、失敗しました
ko: 이 항목을 연산자 이름으로 구문 분석하려고 했지만 실패했습니다.
pl: Podjęto próbę analizy tego elementu jako nazwy operatora, ale analiza nie powiodła się
pt_br: A tentativa de analisar isto como um nome de operador falhou
ru: Предпринята попытка синтаксического анализа этого имени оператора, однако она завершилась неудачно
tr: Bu bir işleç adı olarak ayrıştırılmaya çalışıldı, ancak yapılamadı
zh_hans: 尝试将此分析为运算符名称，但未成功
zh_hant: 嘗試將此剖析為運算子名稱，但是失敗

# lexInvalidUnicodeLiteral
source: \U{0} is not a valid Unicode character escape sequence
cs: \U{0} není platná znaková řídicí sekvence Unicode.
de: \U{0} ist keine gültige Unicode-Zeichen-Escapesequenz
es: \U{0} no es una secuencia de escape de caracteres Unicode válida
fr: \U{0} n'est pas une séquence d'échappement de caractères Unicode valide
it: \U{0} non è una sequenza di escape di caratteri Unicode valida
ja: \U{0} は、無効な Unicode 文字のエスケープ シーケンスです
ko: \U{0}은(는) 유효한 유니코드 문자 이스케이프 시퀀스가 아닙니다.
pl: \U{0} nie jest prawidłową sekwencją znaku ucieczki Unicode
pt_br: \U{0} não é uma sequência de escape de caracteres Unicode válida
ru: \U{0} не является допустимой escape-последовательностью символов Юникода
tr: \U{0} geçerli bir Unicode karakter kaçış sırası değil
zh_hans: \U{0} 不是有效的 Unicode 字符转义序列
zh_hant: \U{0} 不是有效的 Unicode 字元逸出序列

# tcCallerInfoWrongType
source: '{0}' must be applied to an argument of type '{1}', but has been applied to an argument of type '{2}'
cs: {0} se musí použít pro argument typu {1}, ale použil se pro argument typu {2}.
de: "{0}" muss auf ein Argument vom Typ "{1}" angewendet werden, wurde aber auf ein Argument vom Typ "{2}" angewendet.
es: "{0}" se debe aplicar a un argumento de tipo "{1}", pero se ha aplicado a un argumento de tipo "{2}"
fr: '{0}' doit être appliqué à un argument de type '{1}', mais il a été appliqué à un argument de type '{2}'
it: '{0}' deve essere applicato a un argomento di tipo '{1}', ma è stato applicato a un argomento di tipo '{2}'
ja: '{0}' は、型が '{1}' の引数に適用する必要がありますが、型が '{2}' の引数に適用されています
ko: '{0}'은(는) '{1}' 형식의 인수에 적용되어야 하지만 '{2}' 형식의 인수에 적용되었습니다.
pl: Element „{0}” należy zastosować do argumentu typu „{1}”, jednak został on zastosowany do argumentu typu „{2}”
pt_br: '{0}' deve ser aplicado a um argumento do tipo '{1}', mas foi aplicado a um argumento do tipo '{2}'
ru: "{0}" следует применять только к аргументу типа "{1}", но этот элемент был применен к аргументу типа "{2}"
tr: '{0}', '{1}' türündeki bağımsız değişkene uygulanmalıdır, ancak '{2}' türündeki bağımsız değişkene uygulanmış
zh_hans: “{0}”必须应用于类型“{1}”的参数，但却被应用于类型“{2}”的参数
zh_hant: '{0}' 必須套用至類型 '{1}' 的引數，但卻套用至了類型 '{2}' 的引數

# tcCallerInfoNotOptional
source: '{0}' can only be applied to optional arguments
cs: {0} se dá použít jenom u volitelných argumentů.
de: {0} kann nur auf optionale Argumente angewendet werden.
es: '{0}' solo puede aplicarse a argumentos opcionales
fr: '{0}' peut uniquement être appliqué à des arguments facultatifs
it: '{0}' può essere applicato solo ad argomenti facoltativi
ja: '{0}' の適用対象にできるのはオプションの引数だけです
ko: '{0}'은(는) 선택적 인수에만 적용할 수 있습니다.
pl: Element „{0}” można stosować tylko do argumentów opcjonalnych
pt_br: '{0}' só pode ser aplicado a argumentos opcionais
ru: {0} можно применять только к дополнительным аргументам
tr: '{0}' sadece isteğe bağlı bağımsız değişkenlere uygulanabilir
zh_hans: “{0}”只能应用于可选参数
zh_hant: '{0}' 只能套用至選擇性引數

# toolLocationHelperUnsupportedFrameworkVersion
source: The specified .NET Framework version '{0}' is not supported. Please specify a value from the enumeration Microsoft.Build.Utilities.TargetDotNetFrameworkVersion.
cs: Zadaná verze rozhraní .NET Framework {0} není podporovaná. Zadejte hodnotu z výčtu Microsoft.Build.Utilities.TargetDotNetFrameworkVersion.
de: Die angegebene .NET Framework-Version "{0}" wird nicht unterstützt. Geben Sie einen Wert aus der Enumeration "Microsoft.Build.Utilities.TargetDotNetFrameworkVersion" an.
es: La versión de .NET Framework especificada "{0}" no se admite. Especifique un valor de la enumeración Microsoft.Build.Utilities.TargetDotNetFrameworkVersion.
fr: La version spécifiée du .NET Framework ('{0}') n'est pas prise en charge. Spécifiez une valeur issue de l'énumération Microsoft.Build.Utilities.TargetDotNetFrameworkVersion.
it: La versione di .NET Framework '{0}' specificata non è supportata. Specificare un valore dall'enumerazione Microsoft.Build.Utilities.TargetDotNetFrameworkVersion.
ja: 指定した .NET Framework のバージョン '{0}' はサポートされていません。列挙型 Microsoft.Build.Utilities.TargetDotNetFrameworkVersion からの値を指定してください。
ko: 지정한 .NET Framework 버전 "{0}"은(는) 지원되지 않습니다. Microsoft.Build.Utilities.TargetDotNetFrameworkVersion 열거형의 값을 지정하세요.
pl: Określona wersja platformy .NET Framework „{0}” nie jest obsługiwana. Określ wartość z wyliczenia Microsoft.Build.Utilities.TargetDotNetFrameworkVersion.
pt_br: Não há suporte para a versão especificada do .NET Framework '{0}'. Especifique um valor da enumeração Microsoft.Build.Utilities.TargetDotNetFrameworkVersion.
ru: Указанная версия платформы .NET Framework ("{0}") не поддерживается. Укажите значение из перечисления Microsoft.Build.Utilities.TargetDotNetFrameworkVersion.
tr: Belirtilen '{0}' .NET Framework sürümü desteklenmiyor. Lütfen Microsoft.Build.Utilities.TargetDotNetFrameworkVersion sabit listesinden bir değer belirtin.
zh_hans: 不支持指定的 .NET Framework 版本“{0}”。请指定来自枚举 Microsoft.Build.Utilities.TargetDotNetFrameworkVersion 的值。
zh_hant: 不支援指定的 .NET Framework 版本 '{0}'。請從列舉 Microsoft.Build.Utilities.TargetDotNetFrameworkVersion 指定值。

# ilSignInvalidMagicValue
source: Invalid Magic value in CLR Header
cs: Neplatná hodnota Magic v záhlaví CLR
de: Ungültiger Magic-Wert im CLR-Header.
es: Valor mágico no válido en encabezado CLR
fr: Valeur magique non valide dans l'en-tête CLR
it: Il valore di Magic non è valido nell'intestazione CLR
ja: CLR ヘッダーのマジック値が正しくありません
ko: CLR 헤더의 잘못된 매직 값
pl: Nieprawidłowa wartość magiczna w nagłówku CLR
pt_br: Valor Mágico Inválido no Cabeçalho CLR
ru: Недопустимое магическое значение в заголовке CLR
tr: CLR Üst Bilgisindeki Magic değeri geçersiz
zh_hans: CLR 标头中存在无效的 Magic 值
zh_hant: CLR 標頭中的 Magic 值無效

# ilSignBadImageFormat
source: Bad image format
cs: Chybný formát image
de: Ungültiges Bildformat.
es: Formato de imagen incorrecto
fr: Format d'image incorrect
it: Il formato dell'immagine non è valido
ja: イメージ形式が正しくありません
ko: 잘못된 이미지 형식
pl: Nieprawidłowy format obrazu
pt_br: Formato de imagem inválido
ru: Неправильный формат изображения
tr: Bozuk görüntü biçimi
zh_hans: 错误的图像格式
zh_hant: 錯誤的影像格式

# ilSignPrivateKeyExpected
source: Private key expected
cs: Očekává se privátní klíč
de: Ein privater Schlüssel wurde erwartet.
es: Se esperaba una clave privada
fr: Clé privée attendue
it: È prevista la chiave privata
ja: 秘密キーが必要です
ko: 개인 키가 필요합니다.
pl: Oczekiwano klucza prywatnego
pt_br: Chave privada esperada
ru: Ожидался закрытый ключ
tr: Özel anahtar bekleniyordu
zh_hans: 应使用私钥
zh_hant: 必須是私密金鑰

# ilSignRsaKeyExpected
source: RSA key expected
cs: Očekává se klíč RSA
de: Ein RSA-Schlüssel wurde erwartet.
es: Se esperaba una clave RSA
fr: Clé RSA attendue
it: È prevista la chiave RSA
ja: RSA キーが必要です
ko: RSA 키가 필요합니다.
pl: Oczekiwano klucza RSA
pt_br: Chave RSA esperada
ru: Ожидался ключ RSA
tr: RSA anahtarı bekleniyordu
zh_hans: 应使用 RSA 密钥
zh_hant: 必須是 RSA 金鑰

# ilSignInvalidBitLen
source: Invalid bit Length
cs: Neplatná bitová délka
de: Ungültige Bitlänge.
es: Longitud en bits no válida
fr: Longueur de bit non valide
it: La lunghezza in bit non è valida
ja: ビット長が正しくありません
ko: 잘못된 비트 길이
pl: Nieprawidłowa długość bitowa
pt_br: Tamanho de bit inválido
ru: Недопустимая длина в битах
tr: Bit Uzunluğu geçersiz
zh_hans: 位长度无效
zh_hant: 位元長度無效

# ilSignInvalidRSAParams
source: Invalid RSAParameters structure - '{{0}}' expected
cs: Neplatná struktura parametru RSAParameters – očekává se {{0}}
de: Ungültige RSAParameters-Struktur – "{{0}}" wurde erwartet.
es: Estructura RSAParameters no válida, se esperaba '{{0}}'
fr: Structure RSAParameters non valide - '{{0}}' attendu
it: La struttura RSAParameters non è valida. È previsto '{{0}}'
ja: RSAParameters 構造が正しくありません - '{{0}}' が必要です
ko: 잘못된 RSAParameters 구조 - '{{0}}'이(가) 필요합니다.
pl: Nieprawidłowa struktura elementu RSAParameters — oczekiwano „{{0}}”
pt_br: Estrutura RSAParameters inválida - '{{0}}' esperado
ru: Недопустимая структура RSAParameters — ожидалось "{{0}}"
tr: Geçersiz RSAParameters yapısı - ' {{0}}' bekleniyordu
zh_hans: RSAParameters 结构无效 - 应为“{{0}}”
zh_hant: RSAParameters 結構無效 - 必須是 '{{0}}'

# ilSignInvalidAlgId
source: Invalid algId - 'Exponent' expected
cs: Neplatné algId – očekává se Exponent
de: Ungültige "algId" – "Exponent" wurde erwartet.
es: algId no válido, se esperaba 'Exponent'
fr: algId non valide - 'Exponent' attendu
it: Il valore di algId non è valido. È previsto 'Exponent'
ja: algId が正しくありません - '指数' が必要です
ko: 잘못된 algId - '지수'가 필요합니다.
pl: Nieprawidłowy element algId — oczekiwano wartości „Exponent”
pt_br: algId inválido - 'Exponente' esperado
ru: Недопустимый algId — ожидалось "Exponent"
tr: Geçersiz algId - 'Üs' bekleniyordu
zh_hans: algId 无效 - 应为 "Exponent"
zh_hant: algId 無效 - 必須是 'Exponent'

# ilSignInvalidSignatureSize
source: Invalid signature size
cs: Neplatná velikost podpisu
de: Ungültige Signaturgröße.
es: Tamaño de signatura no válido
fr: Taille de signature non valide
it: Le dimensioni della firma non sono valide
ja: シグネチャのサイズが正しくありません
ko: 잘못된 서명 크기
pl: Nieprawidłowy rozmiar sygnatury
pt_br: Tamanho de assinatura inválido
ru: Недопустимый размер сигнатуры
tr: Geçersiz imza boyutu
zh_hans: 签名大小无效
zh_hant: 簽章大小無效

# ilSignNoSignatureDirectory
source: No signature directory
cs: Žádný adresář podpisu
de: Kein Signaturverzeichnis
es: No es un directorio de signaturas
fr: Aucun répertoire de signature
it: Non esiste alcuna directory delle firme
ja: シグネチャのディレクトリがありません
ko: 서명 디렉터리가 없습니다.
pl: Nie ma katalogu sygnatury
pt_br: Nenhum diretório de assinatura
ru: Нет каталога сигнатуры
tr: İmza dizini yok
zh_hans: 无签名目录
zh_hant: 沒有簽章目錄

# ilSignInvalidPKBlob
source: Invalid Public Key blob
cs: Neplatný objekt blob veřejného klíče
de: Ungültiger öffentlicher Schlüssel-BLOB.
es: Blob de clave pública no válido
fr: Objet blob de clé publique non valide
it: Il BLOB di chiave pubblica non è valido
ja: 公開キー BLOB が正しくありません
ko: 잘못된 공개 키 Blob
pl: Nieprawidłowy obiekt blob klucza publicznego
pt_br: Blob de Chave Pública Inválido
ru: Недопустимый BLOB-объект открытого ключа
tr: Ortak Anahtar blobu geçersiz
zh_hans: 公钥 Blob 无效
zh_hant: 公開金鑰 Blob 無效

# fscTooManyErrors
source: Exiting - too many errors
cs: Ukončení – příliš mnoho chyb
de: Der Vorgang wird aufgrund zu vieler Fehler beendet.
es: Saliendo, demasiados errores.
fr: Fermeture en cours : trop d'erreurs
it: Uscita in corso: troppi errori
ja: 終了しています - エラーが多すぎます
ko: 끝내는 중 - 오류가 너무 많습니다.
pl: Zakończenie — zbyt wiele błędów
pt_br: Saindo: excesso de erros
ru: Осуществляется выход - слишком много ошибок
tr: Çıkılıyor - çok fazla hata var
zh_hans: 正在退出 - 错误太多
zh_hant: 正在結束 - 錯誤太多。

# docfileNoXmlSuffix
source: The documentation file has no .xml suffix
cs: Soubor dokumentace nemá příponu .xml.
de: Die Dokumentationsdatei weist kein XML-Suffix auf.
es: El archivo de documentación no tiene el sufijo .xml.
fr: Le fichier de documentation n'a pas de suffixe .xml
it: Il file della documentazione non ha suffisso .xml
ja: ドキュメント ファイルに .xml サフィックスがありません
ko: 문서 파일에 .xml 접미사가 없습니다.
pl: Plik dokumentacji nie ma sufiksu xml
pt_br: O arquivo de documentação não possui sufixo .xml
ru: У файла документации нет суффикса .xml
tr: Belge dosyasında bir .xml son eki yok
zh_hans: 该文档文件不带 .xml 后缀
zh_hant: 此文件檔沒有 .xml 後置字元

# fscNoImplementationFiles
source: No implementation files specified
cs: Nezadali jste žádné implementační soubory.
de: Es wurden keine Implementierungsdateien angegeben.
es: No se especificaron archivos de implementación.
fr: Aucun fichier d'implémentation n'a été spécifié
it: Nessun file di implementazione specificato
ja: 実装ファイルが指定されていません
ko: 지정된 구현 파일이 없습니다.
pl: Nie określono żadnych plików implementacji
pt_br: Nenhum arquivo de implementação especificado
ru: Файлы реализации не указаны
tr: Bir uygulama dosyası belirtilmedi
zh_hans: 未指定任何实现文件
zh_hant: 未指定實作檔案

# fscBadAssemblyVersion
source: The attribute {0} specified version '{1}', but this value is invalid and has been ignored
cs: Atribut {0} určoval verzi {1}, ale tato hodnota není platná a ignoruje se.
de: Das Attribut "{0}" hat Version "{1}" angegeben, dieser Wert ist jedoch ungültig und wurde ignoriert.
es: El atributo {0} ha especificado la versión "{1}", pero este valor no es válido y se ha omitido
fr: L'attribut {0} a spécifié la version '{1}', mais cette valeur est non valide et a été ignorée
it: L'attributo {0} ha specificato la versione '{1}', ma questo valore non è valido ed è stato ignorato
ja: 属性 {0} にバージョン '{1}' を指定しましたが、この値は無効なため無視されました
ko: 특성 {0}이(가) 버전 '{1}'을(를) 지정했지만, 이 값이 잘못되어 무시되었습니다.
pl: Atrybut {0} określił wersję „{1}”, ale ta wartość jest nieprawidłowa i została zignorowana
pt_br: O atributo {0} especificou a versão '{1}', mas esse valor é inválido e foi ignorado
ru: В атрибуте {0} указана версия "{1}", однако это значение недопустимо и было проигнорировано
tr: {0} özniteliğinde '{1}' sürümü belirtildi, ancak bu değer geçersiz olduğundan yoksayıldı
zh_hans: 属性 {0} 指定版本“{1}”，但此值无效，已被忽略
zh_hant: 屬性 {0} 指定了版本 '{1}'，但該值無效，所以已忽略。

# fscTwoResourceManifests
source: Conflicting options specified: 'win32manifest' and 'win32res'. Only one of these can be used.
cs: Zadali jste kolidující možnosti: win32manifest a win32res. Dá se použít jenom jedna z nich.
de: Es wurden widersprüchliche Optionen angegeben: 'win32manifest' und 'win32res'. Nur eine dieser Optionen kann verwendet werden.
es: Se especificaron opciones en conflicto: 'win32manifest' y 'win32res'. Solo se puede usar una de ellas.
fr: Options conflictuelles spécifiées : 'win32manifest' et 'win32res'. Seule l'une de ces options peut être utilisée.
it: Specificate opzioni in conflitto: 'win32manifest' e 'win32res'. È possibile utilizzarne solo una.
ja: 競合するオプションが指定されました: 'win32manifest' および 'win32res'。これらのうち、1 つのみを使用できます。
ko: 지정된 옵션 'win32manifest'와 'win32res'가 충돌합니다. 둘 중 하나만 사용할 수 있습니다.
pl: Podano opcje powodujące konflikt: „win32manifest” i „win32res”. Może zostać użyta tylko jedna z nich.
pt_br: Opções de conflito especificadas: 'win32manifest' e 'win32res'. Somente uma delas pode ser usada.
ru: Указаны противоречащие друг другу параметры: win32manifest и win32res. Можно использовать только один из них.
tr: Çakışan seçenekler belirtildi: 'win32manifest' ve 'win32res'. Bunlardan yalnızca biri kullanılabilir.
zh_hans: 以下指定选项发生冲突: “win32manifest”和“win32res”。只能使用其中的一个选项。
zh_hant: 指定了衝突的選項: 'win32manifest' 和 'win32res'。只能使用它們其中一個。
