Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# structOrClassFieldIsNotAccessible
source: The struct or class field '{0}' is not accessible from this code location
cs: Pole struktury nebo třídy {0} není na tomto místě v kódu dostupné.
de: Auf das Struktur- oder Klassenfeld "{0}" kann von dieser Position im Code nicht zugegriffen werden.
es: El campo de clase o struct '{0}' no es accesible desde este lugar del código.
fr: Le champ de struct ou de classe '{0}' n'est pas accessible à partir de cet emplacement du code
it: Il campo di classe o struct '{0}' non è accessibile da questa posizione di codice
ja: 構造体またはクラスのフィールド '{0}' はこのコードの場所からアクセスできません
ko: 구조체 또는 클래스 필드 '{0}'은(는) 이 코드 위치에서 액세스할 수 없습니다.
pl: Nie można uzyskać dostępu do pola struktury lub klasy „{0}” z tej lokalizacji kodu
pt_br: O campo da struct ou classe '{0}' não é acessível neste local do código
ru: Поле структуры или класса "{0}" недоступно из этой точки кода
tr: '{0}' yapısına veya sınıf alanına bu kod konumundan erişilemiyor
zh_hans: 无法从此代码位置访问结构或类字段“{0}”
zh_hant: 無法從這個程式碼位置存取結構或類別欄位 '{0}'

# experimentalConstruct
source: This construct is experimental
cs: Tento konstruktor je experimentální.
de: Dieses Konstrukt ist experimentell.
es: Esta construcción es experimental.
fr: Cette construction est expérimentale
it: Questo costrutto è sperimentale
ja: このコンストラクトは試験段階です
ko: 이 구문은 실험적입니다.
pl: Ta konstrukcja jest eksperymentalna
pt_br: Este constructo é experimental
ru: Экспериментальная конструкция
tr: Bu yapı deneyseldir
zh_hans: 此构造是试验性构造
zh_hant: 這個建構是實驗性質的

# noInvokeMethodsFound
source: No Invoke methods found for delegate type
cs: Pro typ delegáta se nenašly žádné metody Invoke.
de: Es wurden keine Invoke-Methoden für den Delegattyp gefunden.
es: No se encontraron métodos Invoke para el tipo de delegado.
fr: Aucune méthode Invoke trouvée pour le type délégué
it: Nessun metodo Invoke trovato per il tipo delegato
ja: デリゲート型に Invoke メソッドが見つかりませんでした
ko: 대리자 형식에 대해 Invoke 메서드를 찾지 못했습니다.
pl: Dla typu delegata nie znaleziono metod Invoke.
pt_br: Nenhum método de invocação encontrado para o tipo delegate
ru: Отсутствуют методы Invoke для типа делегата
tr: Temsilci türü için bir Invoke metodu bulunamadı
zh_hans: 未找到委托类型的 Invoke 方法
zh_hant: 找不到委派類型的 Invoke 方法

# moreThanOneInvokeMethodFound
source: More than one Invoke method found for delegate type
cs: Pro typ delegáta se našla víc než jedna metoda Invoke.
de: Es wurde mehr als eine Invoke-Methode für den Delegattyp gefunden.
es: Se encontró más de un método Invoke para el tipo de delegado.
fr: Plusieurs méthodes Invoke trouvées pour le type délégué
it: Trovati più metodi Invoke per il tipo delegato
ja: デリゲート型に複数の Invoke メソッドが見つかりました
ko: 대리자 형식에 대해 둘 이상의 Invoke 메서드를 찾았습니다.
pl: Dla typu delegata znaleziono więcej niż jedną metodę Invoke.
pt_br: Mais de um método de chamada encontrado para o tipo delegado
ru: Обнаружено более одного метода Invoke для типа делегата
tr: Temsilci türü için birden fazla Invoke metodu bulundu
zh_hans: 已找到委托类型的多个 Invoke 方法
zh_hant: 找到委派類型的多個 Invoke 方法

# delegatesNotAllowedToHaveCurriedSignatures
source: Delegates are not allowed to have curried signatures
cs: Delegáti nemůžou mít curryfikované signatury.
de: Delegaten dürfen keine Currysignaturen aufweisen.
es: No se permite que los delegados tengan signaturas currificadas.
fr: Les délégués ne sont pas autorisés à avoir des signatures curryfiées
it: I delegati non possono disporre di firme sottoposte a currying
ja: カリー化されたシグネチャを含むデリゲートは許可されていません
ko: 대리자는 커리된 시그니처를 가질 수 없습니다.
pl: Delegaty nie mogą mieć sygnatur typu curried.
pt_br: Delegados não estão autorizados a ter assinaturas na forma curried
ru: В делегатах не поддерживаются переданные сигнатуры
tr: Temsilcilerin eksiltimli imzaları olmasına izin verilmez
zh_hans: 委托不得有扩充签名
zh_hant: 不允許委派有局部調用簽章

# tlrUnexpectedTExpr
source: Unexpected Expr.TyChoose
cs: Neočekávaný výraz Expr.TyChoose
de: Unerwartetes Expr.TyChoose
es: Expr.TyChoose inesperado.
fr: Expr.TyChoose inattendu
it: Expr.TyChoose imprevisto
ja: 予期しない Expr.TyChoose です:
ko: 예기치 않은 Expr.TyChoose입니다.
pl: Nieoczekiwany element Expr.TyChoose
pt_br: Expr.TyChoose inesperado
ru: Непредвиденное значение Expr.TyChoose
tr: Beklenmeyen Expr.TyChoose
zh_hans: 意外的 Expr.TyChoose
zh_hant: 未預期的 Expr.TyChoose

# tlrLambdaLiftingOptimizationsNotApplied
source: Note: Lambda-lifting optimizations have not been applied because of the use of this local constrained generic function as a first class value. Adding type constraints may resolve this condition.
cs: Poznámka: Optimalizace rozšiřující výraz lambda se kvůli použití této lokálně omezené obecné funkce jako hodnoty první třídy nepoužily. Tuto podmínku můžete ošetřit přidáním omezení typu.
de: Hinweis: Auf Lambda-Lifting-Optimierungen wurde verzichtet, weil diese lokal eingeschränkte generische Funktion als Wert der ersten Klasse verwendet wird. Durch Hinzufügen von Typeinschränkungen lässt sich diese Bedingung möglicherweise auflösen.
es: Nota: no se han aplicado optimizaciones de elevación de expresiones lambda debido al uso de esta función genérica restringida local como valor de primera clase. Esta condición puede resolverse agregando restricciones de tipo.
fr: Remarque : les optimisations par suppression d'expressions lambda n'ont pas été appliquées en raison de l'utilisation de cette fonction générique contrainte locale en tant que valeur de première classe. L'ajout de contraintes de type peut résoudre ce problème.
it: Nota: le ottimizzazioni lifted lambda non sono state applicate a causa dell'utilizzo di questa funzione generica vincolata locale come valore di prima classe. Questa condizione potrebbe essere risolta con l'aggiunta di vincoli di tipo.
ja: 注意: ファースト クラス値としてこのローカルの制約付きジェネリック関数が使用されているため、ラムダリフティングの最適化は適用されませんでした。型制約を追加することで、この状態を解決できる可能性があります。
ko: 참고: 로컬 제약 조건이 있는 이 제네릭 함수를 첫 번째 클래스 값으로 사용했으므로 람다 리프팅 최적화가 적용되지 않았습니다. 형식 제약 조건을 추가하면 이 상황이 해결될 수 있습니다.
pl: Uwaga: Nie zastosowano optymalizacji przenoszenia elementu lambda, ponieważ ta lokalna funkcja ogólna z ograniczeniami została użyta jako wartość pierwszoklasowa. Dodanie ograniczeń typów może rozwiązać ten problem.
pt_br: Observação: as otimizações de levantamento de lambda não foram aplicadas devido ao uso desta função genérica restrita local como um valor de primeira classe. Adicionar restrições pode resolver esta condição.
ru: Примечание. Оптимизации замыкания лямбда-выражения не были применены, так как данная локальная ограниченная универсальная функция была использована в качестве первого значения класса. Устранить эту проблему можно путем добавления ограничений типов.
tr: Not: Yerel olarak kısıtlanmış bir genel işlev olan lambda kaldırma iyileştirmelerinin birinci sınıf değer olarak kullanılması nedeniyle bu iyileştirmeler uygulanmamıştır. Tür kısıtlamaları eklemek bu durumu çözebilir.
zh_hans: 注意: 尚未应用 Lambda 提升优化，因为使用了此本地约束的泛型函数作为一类值。添加类型约束可以解析此条件。
zh_hant: 注意: 尚未套用 Lambda-lifting 最佳化，因為使用這個區域變數會將泛型函式限制為第一級值。加入類型條件約束或許可以解決這個狀況。

# lexhlpIdentifiersContainingAtSymbolReserved
source: Identifiers containing '@' are reserved for use in F# code generation
cs: Identifikátory obsahující znak @ jsou vyhrazené pro použití při generování kódu F#.
de: Bezeichner mit "@" sind für die F#-Codegenerierung reserviert.
es: Los identificadores que contienen '@' está reservados para usarlos en la generación de código de F#.
fr: Les identificateurs qui contiennent '@' sont réservés pour la génération de code F#
it: Gli identificatori contenenti '@' sono riservati per l'utilizzo nella generazione di codice F#
ja: '@' を含む識別子は、F# コードの生成で使用するために予約されています
ko: '@'을 포함하는 식별자는 F# 코드 생성에 사용할 수 있도록 예약되었습니다.
pl: Identyfikatory zawierające znak „@” są zarezerwowane do użytku podczas generowania kodu języka F#
pt_br: Identificadores que contém '@' são reservados para uso em geração de código F#
ru: Идентификаторы, содержащие "@", зарезервированы для будущего использования при создании кода на языке F#
tr: '@' içeren tanımlayıcılar F# kodunu oluşturmada kullanmak için ayrılmıştır
zh_hans: 已保留包含“@”的标识符以用于 F# 代码生成
zh_hant: 包含 '@' 的識別碼已保留供 F# 程式碼產生使用

# lexhlpIdentifierReserved
source: The identifier '{0}' is reserved for future use by F#
cs: Identifikátor {0} je vyhrazený pro budoucí použití v jazyce F#.
de: Der Bezeichner "{0}" ist für die zukünftige Verwendung durch F# reserviert.
es: El identificador '{0}' está reservado para uso futuro de F#.
fr: L'identificateur '{0}' est réservé pour un usage futur par F#
it: L'identificatore '{0}' è riservato per utilizzi futuri in F#
ja: 識別子 '{0}' は F# で将来利用するために予約されています
ko: '{0}' 식별자는 F#에서 나중에 사용할 수 있도록 예약되었습니다.
pl: Identyfikator „{0}” jest zarezerwowany do użytku w przyszłości przez język F#
pt_br: O identificador '{0}' é reservado para uso futuro por F#
ru: Идентификатор "{0}" зарезервирован для будущего использования в языке F#
tr: '{0}' tanımlayıcısı F# tarafından ileride kullanılmak üzere ayrılmıştır
zh_hans: 已保留标识符“{0}”以供 F# 将来使用
zh_hant: 識別碼 '{0}' 已保留供 F# 未來使用

# patcMissingVariable
source: Missing variable '{0}'
cs: Chybějící proměnná {0}
de: Fehlende Variable "{0}".
es: Falta la variable '{0}'.
fr: Variable manquante '{0}'
it: Variabile '{0}' mancante
ja: 変数 '{0}' が見つかりません
ko: '{0}' 변수가 없습니다.
pl: Brak zmiennej „{0}”
pt_br: Variável '{0}' ausente
ru: Отсутствует переменная "{0}"
tr: Eksik değişken: '{0}'
zh_hans: 缺少变量“{0}”
zh_hant: 遺漏變數 '{0}'

# patcPartialActivePatternsGenerateOneResult
source: Partial active patterns may only generate one result
cs: Částečné aktivní vzory můžou generovat jenom jeden výsledek.
de: Teilweise aktive Muster können nur ein Ergebnis erzeugen.
es: Los patrones activos parciales solo pueden generar un resultado.
fr: Les modèles actifs partiels ne peuvent générer qu'un seul résultat
it: Criteri attivi parziali possono generare un solo risultato
ja: パーシャル アクティブ パターンで生成できる結果は 1 個のみです
ko: 부분 활성 패턴은 하나의 결과만 생성할 수 있습니다.
pl: Częściowe aktywne wzorce mogą generować tylko jeden wynik
pt_br: Padrões ativos parciais só podem gerar um resultado
ru: Частично активные шаблоны могут возвращать только один результат
tr: Kısmen etkin desenler yalnızca bir sonuç oluşturabilir
zh_hans: 部分激活的模式只能生成一个结果
zh_hant: 部分現用模式只能產生一個結果

# impTypeRequiredUnavailable
source: The type '{0}' is required here and is unavailable. You must add a reference to assembly '{1}'.
cs: Tady se vyžaduje typ {0}, který ale není dostupný. Je potřeba přidat odkaz na sestavení {1}.
de: Der Typ "{0}" ist hier erforderlich, aber nicht verfügbar. Sie müssen einen Verweis auf Assembly "{1}" hinzufügen.
es: Aquí se requiere el tipo '{0}' y no está disponible. Debe agregar una referencia al ensamblado '{1}'.
fr: Le type '{0}' est requis ici et n'est pas disponible. Vous devez ajouter une référence à l'assembly '{1}'.
it: In questa posizione è necessario il tipo '{0}', il quale non è disponibile. Aggiungere un riferimento all'assembly '{1}'.
ja: ここでは型 '{0}' が必要ですが使用できません。アセンブリ '{1}' に参照を追加する必要があります。
ko: {0}' 형식이 여기에 필요하지만 사용할 수 없습니다. '{1}' 어셈블리에 대한 참조를 추가해야 합니다.
pl: Typ „{0}” jest tutaj wymagany i niedostępny. Musisz dodać odwołanie do zestawu „{1}”.
pt_br: O tipo '{0}' é requerido aqui e não está disponível. Você deve adicionar uma referência ao assembly '{1}'.
ru: Требуемый здесь тип "{0}" недоступен. Следует добавить ссылку на сборку "{1}".
tr: Burada '{0}' türü gerekiyor ancak tür bulunamıyor. '{1}' bütünleştirilmiş koduna başvuru eklemeniz gerekiyor.
zh_hans: 此处需要类型“{0}”，但此类型不可用。必须添加对程序集“{1}”的引用。
zh_hant: 此處需要類型 '{0}'，但無法取得。您必須加入組件 '{1}' 的參考。

# impReferencedTypeCouldNotBeFoundInAssembly
source: A reference to the type '{0}' in assembly '{1}' was found, but the type could not be found in that assembly
cs: Odkaz na typ {0} se v sestavení {1} našel, ale tento typ se v něm najít nepovedlo.
de: Ein Verweis auf den Typ "{0}" in Assembly "{1}" wurde gefunden, der Typ ist aber nicht in der Assembly vorhanden.
es: Se encontró una referencia al tipo '{0}' en el ensamblado '{1}', pero no se encontró el tipo en ese ensamblado.
fr: Une référence au type '{0}' a été trouvée dans l'assembly '{1}', mais le type est introuvable dans cet assembly
it: Nell'assembly '{1}' è stato trovato un riferimento al tipo '{0}', ma non è stato trovato il tipo
ja: アセンブリ '{1}' 内の型 '{0}' に対する参照が見つかりましたが、型はそのアセンブリ内に見つかりませんでした
ko: {1}' 어셈블리에서 '{0}' 형식에 대한 참조를 찾았지만 이 어셈블리에서 해당 형식을 찾을 수 없습니다.
pl: Znaleziono odwołanie do typu „{0}” w zestawie „{1}”, ale nie można znaleźć typu w tym zestawie
pt_br: A referência para o tipo '{0}' no assembly '{1}' foi encontrada, mas o tipo não pôde ser encontrado neste assembly
ru: Обнаружена ссылка на тип "{0}" в сборке "{1}", который отсутствует в этой сборке
tr: {1}' bütünleştirilmiş kodunda '{0}' türüne başvuru bulundu, ancak bu tür o bütünleştirilmiş kodda bulunamadı
zh_hans: 在程序集“{1}”中找到了对类型“{0}”的引用，但在该程序集中未能找到此类型
zh_hant: 發現組件 '{1}' 中類型 '{0}' 的參考，但在該組件中找不到該類型

# impNotEnoughTypeParamsInScopeWhileImporting
source: Internal error or badly formed metadata: not enough type parameters were in scope while importing
cs: Vnitřní chyba nebo chybně vytvořená metadata: při importu byl v rozsahu nedostatečný počet parametrů typu.
de: Interner Fehler oder falsch formatierte Metadaten: Während des Imports befanden sich nicht genügend Typparameter im Bereich.
es: Error interno o metadatos mal formados: no había suficientes parámetros de tipo en el ámbito durante la importación.
fr: Erreur interne ou métadonnées incorrectes : nombre insuffisant de paramètres de type dans la portée lors de l'importation
it: Errore interno o metadati in formato non valido: parametri di tipo insufficienti nell'ambito durante l'importazione
ja: 内部エラーまたはメタデータの形式エラー: インポート中のスコープに含まれる型パラメーターが足りません
ko: 내부 오류 또는 잘못된 형식의 메타데이터: 가져오기 작업을 수행하는 동안 범위 내의 형식 매개 변수가 부족했습니다.
pl: Błąd wewnętrzny lub źle sformułowane metadane: podczas importowania w zakresie była niewystarczająca liczba parametrów typu
pt_br: Erro interno ou metadado malformado: os parâmetros de tipo que estavam no escopo durante a importação não são suficientes
ru: Внутренняя ошибка или поврежденные метаданные: недостаточно параметров типа в области видимости в процессе импорта
tr: İç hata veya hatalı oluşturulmuş meta veri: içeri aktarma sırasında kapsamda yeterli tür parametresi yoktu
zh_hans: 内部错误或元数据格式不正确: 导入时范围内没有足够多的类型参数
zh_hant: 內部錯誤或形式不正確的中繼資料: 匯入時範圍中的型別參數不足

# impReferenceToDllRequiredByAssembly
source: A reference to the DLL {0} is required by assembly {1}. The imported type {2} is located in the first assembly and could not be resolved.
cs: Sestavení {1} vyžaduje odkaz na knihovnu DLL {0}. Importovaný typ {2} se nachází v prvním sestavení a nedal se přeložit.
de: Ein Verweis auf die DLL "{0}" ist für die Assembly "{1}" erforderlich. Der importierte Typ "{2}" befindet sich in der ersten Assembly und konnte nicht aufgelöst werden.
es: El ensamblado {1} requiere una referencia al archivo DLL {0}. El tipo {2} importado se encuentra en el primer ensamblado y no se pudo resolver.
fr: Une référence à la DLL {0} est requise par l'assembly {1}. Le type importé {2} se trouve dans le premier assembly et n'a pas pu être résolu.
it: È necessario un riferimento alla DLL {0} per l'assembly {1}. Il tipo importato {2} si trova nel primo assembly e non è stato possibile risolverlo.
ja: アセンブリ {1} には DLL {0} に対する参照が必要です。インポートされた型 {2} は最初のアセンブリにあり、解決できませんでした。
ko: {1} 어셈블리에 {0} DLL에 대한 참조가 필요합니다. 가져온 형식 {2}은(는) 첫 번째 어셈블리에 있으며 확인할 수 없습니다.
pl: Odwołanie do biblioteki DLL {0} jest wymagane przez zestaw {1}. Zaimportowany typ {2} znajduje się w pierwszym zestawie i nie można go rozpoznać.
pt_br: Uma referência ao DLL {0} é requerida pelo assembly {1}. O tipo importado {2} está localizado no primeiro assembly e não pôde ser resolvido.
ru: Ссылка на библиотеку DLL {0} требуется для сборки {1}. Импортированный тип {2} расположен в первой сборке и не может быть разрешен.
tr: {1} bütünleştirilmiş kodu için {0} DLL'sine başvuru gerekli oldu. İçeri aktarılan {2} türü ilk bütünleştirilmiş kodda bulunuyordu ve çözümlenemedi.
zh_hans: 程序集 {1} 需要对 DLL {0} 的引用。导入的类型 {2} 位于第一个程序集中，未能解析此类型。
zh_hant: 組件 {1} 需要 DLL {0} 的參考。匯入的類型 {2} 位在第一個組件中，但無法解析。

# impImportedAssemblyUsesNotPublicType
source: An imported assembly uses the type '{0}' but that type is not public
cs: Importované sestavení používá typ {0}, který ale není veřejný.
de: Eine importierte Assembly verwendet den Typ "{0}"; dieser Typ ist aber nicht öffentlich.
es: Un ensamblado importado usa el tipo '{0}', pero el tipo no es público.
fr: Un assembly importé utilise le type '{0}' mais ce type n'est pas public
it: Un assembly importato usa il tipo '{0}', il quale tuttavia non è pubblico
ja: インポートされたアセンブリでは型 '{0}' を使用していますが、その型はパブリックではありません
ko: 가져온 어셈블리가 '{0}' 형식을 사용하지만 해당 형식이 public이 아닙니다.
pl: Zaimportowany zestaw używa typu „{0}”, który nie jest publiczny
pt_br: Um assembly importado usa o tipo '{0}', mas este tipo não é público
ru: В импортированной сборке используется тип "{0}", который не является открытым
tr: İçeri aktarılmış bir bütünleştirilmiş kod '{0}' türünü kullanıyor bu tür ortak değil
zh_hans: 导入的程序集使用类型“{0}”，但该类型不是公共类型
zh_hant: 匯入的組件使用類型 '{0}'，但該類型不是公用類型

# optValueMarkedInlineButIncomplete
source: The value '{0}' was marked inline but its implementation makes use of an internal or private function which is not sufficiently accessible
cs: Hodnota {0} má označení inline, ale její implementace využívá interní nebo privátní funkci, ke které není dostatečný přístup.
de: Der Wert "{0}" war als inline markiert, die Implementierung verwendet aber eine interne oder private Funktion, die keine ausreichende Zugreifbarkeit bietet.
es: El valor '{0}' estaba marcado como inline pero su implementación hace uso de una función interna o privada que no es lo suficientemente accesible.
fr: La valeur '{0}' a été marquée comme inline mais son implémentation utilise une fonction interne ou privée qui n'est pas suffisamment accessible
it: Il valore '{0}' è stato contrassegnato come inline, tuttavia la relativa implementazione utilizza una funzione interna o privata con accessibilità insufficiente
ja: 値 '{0}' は 'inline' とマークされましたが、実装ではアクセシビリティが低い内部関数またはプライベート関数を使用しています
ko: 값 '{0}'이(가) inline으로 표시되었지만 해당 구현이 충분히 액세스할 수 없는 내부 또는 개인 함수를 사용합니다.
pl: Wartość „{0}” została oznaczona jako śródwierszowa, ale jej implementacja używa funkcji wewnętrznej lub prywatnej, która jest niewystarczająco dostępna
pt_br: O valor '{0}' foi marcado como embutido, mas sua implementação faz uso de uma função interna ou privada que não é suficientemente acessível
ru: Значение "{0}" отмечено как "inline", однако в его реализации используется недостаточно доступная внутренняя или закрытая функция
tr: '{0}' değeri satır içi olarak işaretlenmiş ancak uygulamasında yeterince erişilemeyen bir iç veya özel işlev kullanılıyor
zh_hans: 值“{0}”已标记为“inline”，而该值的实现使用了一个无法充分访问的内部或私有函数
zh_hant: 值 '{0}' 已標記為內嵌，但它的實作利用到無法存取的內部或私用函式

# optValueMarkedInlineButWasNotBoundInTheOptEnv
source: The value '{0}' was marked inline but was not bound in the optimization environment
cs: Hodnota {0} má označení inline, ale není svázaná s prostředím optimalizace.
de: Der Wert "{0}" war als inline markiert, aber nicht in der Optimierungsumgebung gebunden.
es: El valor '{0}' estaba marcado como inline pero no estaba enlazado en el entorno de optimización.
fr: La valeur '{0}' a été marquée comme inline mais n'a pas été liée dans l'environnement d'optimisation
it: Il valore '{0}' è stato contrassegnato come inline, tuttavia non è stato associato nell'ambiente di ottimizzazione
ja: 値 '{0}' は 'inline' とマークされましたが、最適化環境ではバインドされません
ko: 값 '{0}'이(가) inline으로 표시되었지만 최적화 환경에 바인딩되지 않았습니다.
pl: Wartość „{0}” została oznaczona jako śródwierszowa, ale nie powiązano jej w środowisku optymalizacji
pt_br: O valor '{0}' foi marcado como embutido, mas não está associado no ambiente de otimização
ru: Значение "{0}" отмечено как "inline", однако не было привязано в среде оптимизации
tr: '{0}' değeri satır içi olarak işaretlenmiş ancak iyileştirme ortamında bağlanmamış
zh_hans: 值“{0}”已标记为“inline”，但其未在优化环境中绑定
zh_hant: 值 '{0}' 已標記為內嵌，但是未在最佳化環境中繫結

# optLocalValueNotFoundDuringOptimization
source: Local value {0} not found during optimization
cs: Lokální hodnota {0} se během optimalizace nenašla.
de: Der lokale Wert "{0}" wurde während der Optimierung nicht gefunden.
es: No se encontró el valor local {0} durante la optimización.
fr: Valeur locale {0} introuvable durant l'optimisation
it: Valore locale {0} non trovato durante l'ottimizzazione
ja: 最適化中にローカルの値 {0} が見つかりませんでした
ko: 최적화하는 동안 로컬 값 {0}을(를) 찾을 수 없습니다.
pl: Nie znaleziono wartości lokalnej {0} podczas optymalizacji
pt_br: O valor local {0} não foi encontrado durante a otimização
ru: В процессе оптимизации не найдено локальное значение {0}
tr: İyileştirme sırasında {0} yerel değeri bulunamadı
zh_hans: 优化过程中未找到本地值 {0}
zh_hant: 最佳化期間找不到區域數值 {0}

# optValueMarkedInlineHasUnexpectedValue
source: A value marked as 'inline' has an unexpected value
cs: Hodnota s označením inline má neočekávanou hodnotu.
de: Ein als "inline" markierter Wert hat einen unerwarteten Wert.
es: Un valor marcado como 'inline' tiene un valor inesperado.
fr: Une valeur marquée comme 'inline' a une valeur inattendue
it: Valore imprevisto contrassegnato come 'inline'
ja: 'inline' とマークされた値に予期しない値が含まれます
ko: 'inline'으로 표시된 값에 예기치 않은 값이 있습니다.
pl: Wartość oznaczona jako „inline” ma nieoczekiwaną wartość
pt_br: Um valor marcado como 'embutido' possui um valor inesperado
ru: Недопустимое значение для значения, отмеченного как "inline"
tr: 'inline' olarak işaretlenmiş değerde beklenmeyen bir değer var
zh_hans: 标记为“inline”的值具有意外的值
zh_hant: 標記為 'inline' 的值有未預期的值

# optValueMarkedInlineCouldNotBeInlined
source: A value marked as 'inline' could not be inlined
cs: Hodnota s označením inline se nedá vložit.
de: Ein als "inline" markierter Wert konnte nicht inline gestellt werden.
es: No se pudo insertar un valor marcado como 'inline'.
fr: Impossible d'effectuer l'incorporation (inlining) d'une valeur marquée comme 'inline'
it: Non è stato possibile impostare come inline un valore contrassegnato come 'inline'
ja: 'inline' とマークされた値をインライン展開できませんでした
ko: 'inline'으로 표시된 값은 인라인할 수 없습니다.
pl: Nie można użyć konstrukcji śródwierszowej dla wartości oznaczonej jako „inline”
pt_br: Um valor marcado como 'embutido' não pôde ser embutido
ru: Не удалось встроить значение, отмеченное как "inline"
tr: 'inline' olarak işaretlenmiş bir değer satır içine alınamadı
zh_hans: 未能内联标记为“inline”的值
zh_hant: 無法內嵌標記為 'inline' 的值
