Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# optsResponseFileNameInvalid
source: Response file name '{0}' is empty, contains invalid characters, has a drive specification without an absolute path, or is too long
cs: Název souboru odpovědi {0} je prázdný, obsahuje neplatné znaky, má jednotku zadanou bez absolutní cesty nebo je moc dlouhý.
de: Der Antwortdateiname "{0}" ist leer, enthält ungültige Zeichen, weist eine Laufwerkspezifikation ohne einen absoluten Pfad auf oder ist zu lang.
es: El nombre del archivo de respuesta '{0}' está vacío, contiene caracteres no válidos, tiene una especificación de unidad sin ruta de acceso absoluta o es demasiado largo.
fr: Le nom du fichier réponse '{0}' est vide, contient des caractères non valides, spécifie un lecteur sans chemin absolu, ou est trop long
it: Il nome del file di risposta '{0}' è vuoto, contiene caratteri non validi, include una specifica di unità senza percorso assoluto oppure è troppo lungo
ja: 応答ファイル名 '{0}' は、空であるか、正しくない文字が含まれているか、ドライブ指定があるが絶対パスがないか、あるいは長すぎます
ko: 지시 파일 이름 '{0}'이(가) 비어 있거나, 잘못된 문자를 포함하거나, 드라이브 사양에 절대 경로가 없거나, 길이가 너무 깁니다.
pl: Nazwa pliku odpowiedzi „{0}” jest pusta, zawiera nieprawidłowe znaki, ma oznaczenie dysku bez ścieżki bezwzględnej lub jest zbyt długa
pt_br: O nome do arquivo de resposta '{0}' está vazio, contém caracteres inválidos, tem uma especificação de unidade sem um caminho absoluto ou é muito longo
ru: Имя файла ответа "{0}" пустое, содержит недопустимые символы, имеет имя диска без абсолютного пути или слишком длинное.
tr: Yanıt dosyası adı '{0}' boş, geçersiz karakter içeriyor, mutlak yolu olmayan bir sürücüyü belirtiyor veya çok uzun
zh_hans: 响应文件名“{0}”为空，包含无效字符，具有没有绝对路径的驱动器规格，或过长
zh_hant: 回應檔名稱 '{0}' 為空白、包含無效的字元、未使用絕對路徑指定磁碟機或太長

# fsharpCoreNotFoundToBeCopied
source: Cannot find FSharp.Core.dll in compiler's directory
cs: Nepovedlo se najít FSharp.Core.dll v adresáři kompilátoru.
de: FSharp.Core.dll wurde im Verzeichnis des Compilers nicht gefunden.
es: No se encuentra FSharp.Core.dll en el directorio del compilador.
fr: FSharp.Core.dll est introuvable dans le répertoire du compilateur
it: Il file FSharp.Core.dll non è stato trovato nella directory del compilatore
ja: コンパイラのディレクトリ内に FSharp.Core.dll が見つかりませんでした
ko: 컴파일러의 디렉터리에서 FSharp.Core.dll을 찾을 수 없습니다.
pl: Nie można znaleźć pliku FSharp.Core.dll w katalogu kompilatora
pt_br: Não é possível localizar FSharp.Core.dll no diretório do compilador
ru: Не удается найти FSharp.Core.dll в каталоге компилятора.
tr: Derleyici dizininde FSharp.Core.dll bulunamıyor
zh_hans: 在编译器目录中找不到 FSharp.Core.dll
zh_hant: 在編譯器的目錄中找不到 FSharp.Core.dll

# tcTupleStructMismatch
source: One tuple type is a struct tuple, the other is a reference tuple
cs: Jeden typ řazené kolekce členů je struktura, ten druhý je řazená kolekce členů odkazu.
de: Ein Tupeltyp ist ein Strukturtupel, der andere Typ ein Verweistupel.
es: Un tipo de tupla es una tupla de struct, el otro es una tupla de referencia
fr: L'un des tuples est de type struct, l'autre tuple est de type référence
it: Un tipo di tupla è una tupla di struttura, mentre l'altra è una tupla di riferimento
ja: 片方のタプル型は構造体タプルで、もう一方は参照タプルです
ko: 한 튜플 형식은 구조체 튜플이고 다른 튜플 형식은 참조 튜플입니다.
pl: Jednym typem krotki jest krotka struktury, innym — krotka odwołania
pt_br: Um tipo de tupla é uma tupla de struct, o outro é uma tupla de referência
ru: Один тип кортежа является кортежем структуры, другой — эталонным кортежем
tr: Demetlerden biri yapı demeti, diğeri ise başvuru demeti
zh_hans: 有一个元组类型是结构元组，而另一个则是引用元组
zh_hant: 一個元組類型為結構元組，另一個則為參考元組

# etMissingStaticArgumentsToMethod
source: This provided method requires static parameters
cs: Tato zadaná metoda vyžaduje statické parametry.
de: Diese angegebene Methode erfordert statische Parameter.
es: El método proporcionado requiere parámetros estáticos
fr: La méthode fournie nécessite des paramètres statiques
it: Con il metodo specificato sono richiesti parametri statici
ja: 指定されたこのメソッドには静的パラメーターが必要です
ko: 이 제공된 메서드는 정적 매개 변수가 필요합니다.
pl: Ta udostępniona metoda wymaga parametrów statycznych
pt_br: Esse método fornecido requer parâmetros estáticos
ru: Этому предоставленному методу требуются статические параметры
tr: Sağlanan bu metot statik parametreler gerektirir
zh_hans: 所提供方法需要静态参数
zh_hant: 此提供的方法需要靜態參數

# considerUpcast
source: The conversion from {0} to {1} is a compile-time safe upcast, not a downcast. Consider using 'upcast' instead of 'downcast'.
cs: Převod z {0} na {1} je přetypování nahoru bezpečné v době kompilace, ne přetypování dolů. Zvažte použití parametru upcast namísto downcast.
de: Die Konvertierung aus {0} in {1} ist ein sicherer Ausdruck zur Umwandlung in eine Basisklasse zur Kompilierungszeit und kein Ausdruck zur Umwandlung in eine abgeleitet Klasse. Verwenden Sie ggf. "upcast" anstelle von "downcast".
es: La conversión de {0} a {1} es una conversión a tipo básico segura en tiempo de compilación, no una conversión a tipo heredado. Considere la posibilidad de usar "upcast" en lugar de "downcast".
fr: La conversion de {0} en {1} est un cast sécurisé d'un type dérivé en l'une de ses classes de base au moment de la compilation, et non un cast d'une classe de base en une classe dérivée. Utilisez 'upcast' à la place de 'downcast'.
it: La conversione da {0} a {1} è un'espressione upcast sicura della fase di compilazione e non di downcast. Provare a usare 'upcast' invece di 'downcast'.
ja: {0} から {1} への変換は、コンパイル時のダウンキャストではなく、セーフ アップキャストです。'downcast' の代わりに 'upcast' を使うことを検討してください。
ko: {0}에서 {1}(으)로의 변환은 컴파일 시간에 안전한 업캐스트이며 다운캐스트가 아닙니다. '다운캐스트'가 아닌 '업캐스트'를 사용해 보세요.
pl: Konwersja z {0} do {1} jest przypisaniem elementu nadrzędnego bezpiecznym w czasie kompilacji, a nie przypisaniem elementu podrzędnego. Rozważ użycie słowa kluczowego „upcast” zamiast „downcast”.
pt_br: A conversão de {0} para {1} é um upcast de segurança de tempo de compilação, não um downcast. Considere usar 'upcast' em vez de 'downcast'.
ru: Преобразование {0} в {1} является безопасным повышением времени компиляции, а не понижением. Рекомендуется использовать "upcast" вместо "downcast".
tr: {0} türünden {1} türüne dönüştürme, bir alt türe çevirme değil, derleme zamanında güvenli bir üst türe çevirmedir. 'downcast' yerine 'upcast' kullanmayı düşünün.
zh_hans: 从 {0} 到 {1} 的转换是编译时安全的向上转换，而非向下转换。考虑使用 "upcast"，而非 "downcast"。
zh_hant: 從 {0} 轉換為 {1} 屬於編譯時間安全的向上轉換，而非向下轉換。請考慮使用 'upcast' 而不使用 'downcast'。

# considerUpcastOperator
source: The conversion from {0} to {1} is a compile-time safe upcast, not a downcast. Consider using the :> (upcast) operator instead of the :?> (downcast) operator.
cs: Převod z {0} na {1} je přetypování nahoru bezpečné v době kompilace, ne přetypování dolů. Zvažte použití operátoru :> (přetypování nahoru) namísto :?> (přetypování dolů).
de: Die Konvertierung aus {0} in {1} ist ein sicherer Ausdruck zur Umwandlung in eine Basisklasse zur Kompilierungszeit und kein Ausdruck zur Umwandlung in eine abgeleitet Klasse. Verwenden Sie ggf. den Operator :> (Ausdruck zur Umwandlung in eine Basisklasse) anstelle des Operators :?> (Ausdruck zur Umwandlung in eine abgeleitet Klasse).
es: La conversión de {0} a {1} es una conversión de tipo básico segura en tiempo de compilación, no una conversión de tipo heredado. Considere la posibilidad de usar el operador :> (conversión de tipo básico) en lugar del operador :?> (conversión de tipo heredado).
fr: La conversion de {0} en {1} est un hyperonyme sécurisé et non un hyponyme. Utilisez l'opérateur :> (hyperonyme) au lieu de l'opérateur :?> (hyponyme).
it: La conversione da {0} a {1} è un'espressione upcast sicura della fase di compilazione e non di downcast. Provare a usare l'operatore :> (upcast) invece di quello :?> (downcast).
ja: {0} から {1} への変換はコンパイル時のダウンキャストではなく、セーフ アップキャストです。?> (downcast) 演算子ではなく、:> (upcast) 演算子を使用してください。
ko: {0}에서 {1}(으)로의 변환은 컴파일 시간에 안전한 업캐스트이며 다운캐스트가 아닙니다. :?> (다운캐스트) 연산자가 아닌 :?> (업캐스트) 연산자를 사용하세요.
pl: Konwersja z {0} do {1} jest przypisaniem elementu nadrzędnego bezpiecznym w czasie kompilacji, a nie przypisaniem elementu podrzędnego. Rozważ użycie operatora :> (przypisanie elementu nadrzędnego) zamiast :?> (przypisanie elementu podrzędnego).
pt_br: A conversão de {0} para {1} é um upcast seguro em tempo de compilação, não um downcast. Use o operador:> (upcast) em vez do operador :?> (downcast).
ru: Преобразование {0} в {1} является безопасным повышением времени компиляции, а не понижением. Рекомендуется использовать :> (upcast) вместо :?> (downcast).
tr: {0}-{1} dönüşümü bir alt türe çevirme değil, derleme zamanında güvenli bir üst türe çevirmedir. :?> (alt türe çevirme) işleci yerine :> (üst türe çevirme) işlecini kullanmayı göz önünde bulundurun.
zh_hans: 从 {0} 到 {1} 的转换是编译时安全的向上转换，而非向下转换。请考虑使用 :> (upcast) 运算符而非 :?> (downcast) 运算符。
zh_hant: 從 {0} 到 {1} 的轉換在編譯時間會是安全的向上轉換，而不是向下轉換。請考慮使用 :> (向上轉換) 運算子，而不要使用 :?> (向下轉換) 運算子。

# tcRecImplied
source: The 'rec' on this module is implied by an outer 'rec' declaration and is being ignored
cs: Klíčové slovo rec je v tomto modulu odvozené od vnější deklarace rec a ignoruje se.
de: rec für dieses Modul wird implizit durch eine äußere rec-Deklaration angegeben und daher ignoriert.
es: La palabra clave 'rec' en este módulo se da por supuesta en una declaración 'rec' externa y se omitirá
fr: Le mot clé 'rec' sur ce module étant impliqué par une déclaration 'rec' externe, il est ignoré
it: La dichiarazione 'rec' in questo modulo è specificata implicitamente da una dichiarazione 'rec' esterna e verrà ignorata
ja: このモジュールの 'rec' は外側の 'rec' 宣言で暗黙的に示されており、無視されます
ko: 이 모듈에 대한 'rec'는 외부 'rec' 선언에 의해 암시되며 무시됩니다.
pl: Deklaracja „rec” tego modułu jest określona niejawnie przez zewnętrzną deklarację „rec” i zostanie zignorowana
pt_br: O 'rec' neste módulo é implícito por uma declaração 'rec' externa e está sendo ignorado
ru: Ключевое слово "rec" в этом модуле подразумевается согласно внешнему объявлению "rec" и будет пропущено
tr: Bu modüldeki 'rec', bir dış 'rec' bildirimi tarafından kapsanıyor ve yoksayılıyor
zh_hans: 此模块上的 "rec" 由外部 "rec" 声明暗示，正被忽略
zh_hant: 此模組上的 'rec' 是由外部 'rec' 宣告所默示，已略過

# tcOpenFirstInMutRec
source: In a recursive declaration group, 'open' declarations must come first in each module
cs: Ve skupině rekurzivních deklarací musí být deklarace open v každém modulu první.
de: In einer rekursiven Deklarationsgruppe müssen open-Deklarationen in jedem Modul an erster Stelle auftreten.
es: En un grupo de declaraciones recursivas, las declaraciones 'abiertas' deben situarse primero en cada módulo
fr: Dans un groupe de déclarations récursives, les déclarations 'open' doivent figurer en premier dans chaque module
it: In un gruppo di dichiarazioni ricorsive le dichiarazioni 'open' devono essere inserite per prime in ogni modulo
ja: 再帰的な宣言グループでは、'open' 宣言は各モジュールの先頭になければなりません
ko: 재귀 선언 그룹에서 'open' 선언은 각 모듈에서 맨 앞에 있어야 합니다.
pl: W cyklicznej grupie deklaracji deklaracje „open” muszą występować jako pierwsze w każdym module
pt_br: Em um grupo de declaração recursivo, as declarações 'open' devem vir antes em cada módulo
ru: В группе рекурсивных объявлений объявления "open" должны стоять первыми в каждом модуле
tr: Özyinelemeli bir bildirim grubunda, 'open' bildirimleri her modülde en başta olmalıdır
zh_hans: 在递归声明组中，"open" 声明必须位于每个模块的首位
zh_hant: 在遞迴宣告群組中，'open' 宣告必須優先出現在每個模組中

# tcModuleAbbrevFirstInMutRec
source: In a recursive declaration group, module abbreviations must come after all 'open' declarations and before other declarations
cs: Ve skupině rekurzivních deklarací se musí zkratky modulu nacházet za deklaracemi open a před ostatními deklaracemi.
de: In einer rekursiven Deklarationsgruppe müssen Modulabkürzungen nach allen open-Deklarationen und vor anderen Deklarationen auftreten.
es: En un grupo de declaraciones recursivas, las abreviaturas del módulo deben situarse después de todas las declaraciones 'abiertas' y antes que otras declaraciones
fr: Dans un groupe de déclarations récursives, les abréviations de module doivent figurer après toutes les déclarations 'open' et avant les autres déclarations
it: In un gruppo di dichiarazioni ricorsive le abbreviazioni dei moduli devono essere inserite dopo tutte le dichiarazioni 'open' e prima di altre dichiarazioni
ja: 再帰的な宣言グループでは、モジュールの省略形は、すべての 'open' 宣言の後、その他の宣言の前になければなりません
ko: 재귀 선언 그룹에서 모듈 약어는 모든 'open' 선언의 뒤에 있으면서 다른 선언의 앞에 있어야 합니다.
pl: W cyklicznej grupie deklaracji skróty modułu muszą następować po wszystkich deklaracjach „open” i przed innymi deklaracjami
pt_br: Em um grupo de declaração recursivo, as abreviações de módulo devem vir após todas as declarações 'open' e antes de outras declarações
ru: В группе рекурсивных объявлений сокращенные формы модулей должны следовать после всех объявлений "open" и до других объявлений
tr: Özyinelemeli bir bildirim grubunda modül kısaltmaları, tüm 'open' bildirimleri ve diğer bildirimlerden sonra gelmelidir
zh_hans: 在递归声明组中，模块缩写必须处于所有 "open" 声明之后，并且在其他声明之前
zh_hant: 在遞迴宣告群組中，模組縮寫必須出現在所有 'open' 宣告之後、其他宣告之前

# tcUnsupportedMutRecDecl
source: This declaration is not supported in recursive declaration groups
cs: Tato deklarace se ve skupinách rekurzivních deklarací nepodporuje.
de: Diese Deklaration wird in rekursiven Deklarationsgruppen nicht unterstützt.
es: Esta declaración no se admite en grupos de declaraciones recursivas
fr: Cette déclaration n'est pas prise en charge dans les groupes de déclarations récursives
it: Questa dichiarazione non è supportata nei gruppi di dichiarazioni ricorsive
ja: この宣言は、再帰的な宣言グループではサポートされていません
ko: 이 선언은 재귀 선언 그룹에서는 지원되지 않습니다.
pl: Ta deklaracja nie jest obsługiwana w cyklicznych grupach deklaracji
pt_br: Não há suporte para esta declaração em grupos de declaração recursivos
ru: Это объявление не поддерживается в группах рекурсивных объявлений
tr: Bu bildirim, özyinelemeli bildirim gruplarında desteklenmez
zh_hans: 递归声明组中不支持此声明
zh_hant: 遞迴宣告群組中不支援此宣告

# parsInvalidUseOfRec
source: Invalid use of 'rec' keyword
cs: Neplatné použití klíčového slova rec
de: Ungültige Verwendung des Schlüsselworts "rec".
es: Uso no válido de la palabra clave 'rec'
fr: Utilisation non valide du mot clé 'rec'
it: Uso non valido della parola chiave 'rec'
ja: 'rec' キーワードの使用法が無効です
ko: 'rec' 키워드를 잘못 사용했습니다.
pl: Nieprawidłowe użycie słowa kluczowego „rec”
pt_br: Uso inválido da palavra-chave 'rec'
ru: Недопустимое использование ключевого слова "rec"
tr: 'rec' anahtar sözcüğü geçersiz şekilde kullanıldı
zh_hans: 无效的 "rec" 关键字使用
zh_hant: 不當使用 'rec' 關鍵字

# tcStructUnionMultiCaseDistinctFields
source: If a union type has more than one case and is a struct, then all fields within the union type must be given unique names.
cs: Pokud je typ sjednocení struktura a obsahuje více než jeden případ, všem polím v tomto typu sjednocení se musí přiřadit jedinečný název.
de: Wenn ein Union-Typ mehrere case-Anweisungen aufweist und eine Struktur ist, müssen für alle Felder im Union-Typ eindeutige Namen angegeben werden.
es: Si un tipo de unión tiene más de un caso y un struct, a todos los campos dentro del tipo de unión se les deben dar nombres únicos.
fr: Si un type union a plusieurs étiquettes case, et s'il s'agit d'un struct, tous les champs du type union doivent avoir des noms uniques.
it: Se un tipo di unione contiene più di un case ed è una struttura, è necessario assegnare nomi univoci a tutti i campi all'interno del tipo di unione.
ja: 共用体型が複数のケースを持つ 1 つの構造体である場合は、共用体型内のすべてのフィールドに一意の名前を付ける必要があります。
ko: 공용 구조체 형식이 둘 이상의 case를 포함하고 구조체인 경우 공용 구조체 형식 내의 모든 필드에 고유한 이름을 지정해야 합니다.
pl: Jeśli typ unii ma więcej niż jeden przypadek i jest strukturą, wszystkim polom w typie unii należy nadać unikatowe nazwy.
pt_br: Se um tipo de união tiver mais de um caso e for struct, então todos os campos dentro do tipo de união deverão ter nomes exclusivos.
ru: Если тип объединения имеет более одного варианта и является структурой, всем полям в типе объединения необходимо присвоить уникальные имена.
tr: Bir birleşim türü büyük ve küçük harfler içeriyorsa ve bir yapıysa, birleşim türü içindeki tüm alanlara benzersiz adlar verilmelidir.
zh_hans: 如果联合类型有多个用例且为结构，则必须赋予此联合类型中的所有字段唯一的名称。
zh_hant: 如果等位型別有一個以上的案例並且為結構，等位型別內所有欄位的名稱就都不得重複。

# CallerMemberNameIsOverriden
source: The CallerMemberNameAttribute applied to parameter '{0}' will have no effect. It is overridden by the CallerFilePathAttribute.
cs: Atribut CallerMemberNameAttribute použitý pro parametr {0} nebude mít žádný účinek. Přepisuje ho atribut CallerFilePathAttribute.
de: Das auf Parameter "{0}" angewendete CallerMemberNameAttribute hat keine Auswirkung. Es wird vom CallerFilePathAttribute überschrieben.
es: El CallerMemberNameAttribute aplicado al parámetro '{0}' no tendrá ningún efecto. Este se reemplaza por CallerFilePathAttribute.
fr: CallerMemberNameAttribute, qui est appliqué au paramètre '{0}', n'aura aucun effet. Il est remplacé par CallerFilePathAttribute.
it: CallerMemberNameAttribute applicato al parametro '{0}' non avrà alcun effetto. CallerFilePathAttribute ne eseguirà l'override.
ja: パラメーター '{0}' に適用された CallerMemberNameAttribute は、CallerFilePathAttribute.によってオーバーライドされるため無効となります。
ko: {0}' 매개 변수에 적용되는 CallerMemberNameAttribute는 효과가 없습니다. CallerFilePathAttribute에서 재정의합니다.
pl: Zastosowanie elementu CallerMemberNameAttribute do parametru „{0}” nie odniesie żadnego skutku. Jest on przesłaniany przez element CallerFilePathAttribute.
pt_br: O CallerMemberNameAttribute aplicado ao parâmetro "{0}" não terá efeito. Ele é substituído pelo CallerFilePathAttribute.
ru: Атрибут CallerMemberNameAttribute, примененный для параметра "{0}", не будет действовать. Он будет переопределен атрибутом CallerFilePathAttribute.
tr: {0}' parametresi için geçerli olan CallerMemberNameAttribute öğesinin hiçbir etkisi olmaz. CallerFilePathAttribute tarafından geçersiz kılındı.
zh_hans: 应用于参数“{0}”的 CallerMemberNameAttribute 不会起作用。它已由 CallerFilePathAttribute 替代。
zh_hant: 套用至參數 '{0}' 的 CallerMemberNameAttribute 將不會有作用。CallerFilePathAttribute 會加以覆寫。

# tcFixedNotAllowed
source: Invalid use of 'fixed'. 'fixed' may only be used in a declaration of the form 'use x = fixed expr' where the expression is an array, the address of a field, the address of an array element or a string'
cs: Neplatné použití fixed. fixed se dá použít jenom v deklaraci ve tvaru use x = fixed expr, kde výraz je pole, adresa pole nebo adresa prvku pole nebo řetězce.
de: Ungültige Verwendung von "fixed". "fixed" darf ausschließlich in einer Deklaration der Form "use x = fixed expr" verwendet werden. Dabei ist der Ausdruck ein Array, die Adresse eines Felds, die Adresse eines Arrayelements oder eine Zeichenfolge.
es: Uso no válido de 'fixed'. 'fixed' debe utilizarse solo en una declaración del formulario 'use x = fixed expr' donde la expresión es una matriz, la dirección de un campo, la dirección de un elemento de matriz o una cadena'
fr: Utilisation non valide de 'fixed'. Utilisez uniquement 'fixed' dans une déclaration de la forme 'use x = fixed expr' où l'expression est un tableau, l'adresse d'un champ, l'adresse d'un élément de tableau ou une chaîne
it: Uso non valido di 'fixed'. 'fixed' può essere usato solo in una dichiarazione in formato 'use x = fixed expr', in cui l'espressione è una matrice, l'indirizzo di un campo, l'indirizzo di un elemento di matrice oppure una stringa
ja: 'fixed' の使い方が正しくありません。'fixed' を使用できるのは書式 'use x = fixed expr' の宣言内だけで、この式は配列、フィールドのアドレス、配列要素のアドレス、または文字列です
ko: 'fixed'를 잘못 사용했습니다. 'fixed'는 식이 배열, 필드의 주소, 배열 요소 또는 문자열의 주소인 경우 'use x = fixed expr' 형식의 선언에만 사용할 수 있습니다.
pl: Nieprawidłowe użycie wyrażenia „fixed”. Wyrażenia „fixed” można użyć tylko w deklaracji w postaci „use x = fixed expr”, gdzie wyrażenie jest tablicą, adresem pola, adresem elementu tablicy lub ciągiem
pt_br: Uso inválido da 'fixed'. 'fixed' somente pode ser usada em uma declaração no formato 'use x = fixed expr', em que a expressão é uma matriz, o endereço de um campo, o endereço de um elemento de matriz ou uma cadeia de caracteres
ru: Недопустимое использование выражения "fixed". Выражение "fixed" можно использовать только в объявлении формы "use x = fixed expr", где выражение является массивом, адресом поля, адресом элемента массива или строки.
tr: Geçersiz 'fixed' kullanımı. 'fixed' yalnızca 'use x = fixed expr' biçimindeki bir bildirimde kullanılabilir. Burada ifade bir dizi, bir alanın adresi, bir dizi öğesinin adresi veya bir dizedir
zh_hans: 无效的 "fixed" 使用。"fixed" 只能用在 "use x = fixed expr" 形式的声明中，其中表达式为数组、字段的地址、数组元素或字符串的地址
zh_hant: 使用 'fixed' 無效。'fixed' 僅能用於格式為 'use x = fixed expr' 的宣告中，其中運算式為陣列、欄位的位址、陣列元素的位址或字串

# tcCouldNotFindOffsetToStringData
source: Could not find method System.Runtime.CompilerServices.OffsetToStringData in references when building 'fixed' expression.
cs: Při sestavování výrazu fixed se mezi odkazy nepovedlo najít metodu System.Runtime.CompilerServices.OffsetToStringData.
de: Die Methode "System.Runtime.CompilerServices.OffsetToStringData" wurde beim Erstellen des fixed-Ausdrucks in den Verweisen nicht gefunden.
es: No se pudo encontrar el método System.Runtime.CompilerServices.OffsetToStringData en las referencias al generar expresión 'fixed'.
fr: Méthode System.Runtime.CompilerServices.OffsetToStringData introuvable dans les références durant la construction d'une expression 'fixed'.
it: Il metodo System.Runtime.CompilerServices.OffsetToStringData non è stato trovato nei riferimenti durante la compilazione dell'espressione 'fixed'.
ja: 'fixed' 式のビルド時に、参照内でメソッド System.Runtime.CompilerServices.OffsetToStringData が見つかりませんでした。
ko: 'fixed' 식을 빌드할 때 참조에서 System.Runtime.CompilerServices.OffsetToStringData 메서드를 찾을 수 없습니다.
pl: Nie można odnaleźć metody System.Runtime.CompilerServices.OffsetToStringData w odwołaniach podczas kompilowania wyrażenia „fixed”.
pt_br: Não foi possível encontrar o método System.Runtime.CompilerServices.OffsetToStringData nas referências ao compilar a expressão 'fixed'.
ru: Не удалось найти в ссылках метод System.Runtime.CompilerServices.OffsetToStringData при создании выражения "fixed".
tr: 'fixed' ifadesi derlenirken başvurularda System.Runtime.CompilerServices.OffsetToStringData metodu bulunamadı.
zh_hans: 生成 "fixed" 表达式时，在引用中找不到方法 System.Runtime.CompilerServices.OffsetToStringData。
zh_hant: 建置 'fixed' 運算式時，在參考中找不到方法 System.Runtime.CompilerServices.OffsetToStringData。

# tcNamedActivePattern
source: {0} is an active pattern and cannot be treated as a discriminated union case with named fields.
cs: {0} je aktivní vzorek a není možné s ním zacházet jako s rozlišeným případem typu union s pojmenovanými poli.
de: {0} ist ein aktives Muster und kann nicht als ein diskriminierter Union-Fall mit benannten Feldern behandelt werden.
es: {0} es un modelo activo y no se puede tratar como un caso de unión discriminada con campos con nombre.
fr: {0} est un modèle actif. Il ne peut pas être traité comme un cas d'union discriminé avec des champs nommés.
it: {0} è un criterio attivo e non può essere considerato come un case di unione discriminato con campi denominati.
ja: {0} はアクティブ パターンで、名前付きフィールドのある判別された共用体ケースとしては扱えません。
ko: {0}은(는) 활성 패턴이며 명명된 필드가 있는 구분된 공용 구조체 케이스로 처리될 수 없습니다.
pl: {0} jest wzorcem aktywnym i nie można go traktować jako przypadku unii rozłącznej z nazwanymi polami.
pt_br: {0} é um padrão ativo e não pode ser tratado como um caso de união discriminada com campos nomeados.
ru: {0} является активным шаблоном и не может обрабатываться как различаемая ветвь объединения с именованными полями.
tr: {0} etkin bir desen ve adlandırılmış alanlar içeren bir ayırt edici birleşim durumu olarak değerlendirilemez.
zh_hans: {0} 为活动模式，不能将其作为带命名字段的可区分联合用例。
zh_hant: {0} 是現用模式，無法視為具名欄位的差別聯集。
