Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# parsSetterAtMostTwoArguments
source: A setter property may have at most two argument groups
cs: Vlastnost setter může mít maximálně dvě skupiny argumentů.
de: Eine Setter-Eigenschaft darf maximal zwei Argumentgruppen aufweisen.
es: Una propiedad de establecedor puede tener como máximo dos grupos de argumentos.
fr: Une propriété de méthode setter peut avoir au maximum deux groupes d'arguments
it: Una proprietà di setter può contenere al massimo due gruppi di argomenti
ja: Set アクセス操作子のプロパティに指定できる引数グループの数は 2 以下です
ko: setter 속성에는 최대 2개의 인수 그룹이 있을 수 있습니다.
pl: Właściwość metody ustawiającej może mieć co najwyżej dwie grupy argumentów
pt_br: Uma propriedade setter pode ter no máximo dois grupos de argumento
ru: Свойство метода присваивания значения может иметь не более двух групп аргументов
tr: Ayarlayıcı özelliğinin en çok iki bağımsız değişken grubu olabilir
zh_hans: setter 属性最多可以有两个参数组
zh_hant: 屬性 setter 最多可以有兩個引數群組

# parsInvalidProperty
source: Invalid property getter or setter
cs: Neplatná metoda getter nebo setter vlastnosti
de: Ungültiger Getter oder Setter für Eigenschaft.
es: Captador o establecedor de propiedad no válido.
fr: Méthode getter ou setter de propriété non valide
it: Getter o setter della proprietà non valido
ja: プロパティのゲッターまたはセッターが無効です
ko: 속성 getter 또는 setter가 잘못되었습니다.
pl: Nieprawidłowa metoda ustawiająca lub metoda pobierająca właściwość
pt_br: Propriedade getter ou setter inválida
ru: Недопустимый метод получения или задания свойства
tr: Geçersiz özellik alıcı veya ayarlayıcı
zh_hans: 属性 Getter 或 Setter 无效
zh_hant: 無效的屬性 getter 或 setter

# parsIndexerPropertyRequiresAtLeastOneArgument
source: An indexer property must be given at least one argument
cs: Vlastnosti indexeru se musí předávat aspoň jeden argument.
de: Eine Indexereigenschaft muss mindestens ein Argument erhalten.
es: A una propiedad de indizador se le debe proporcionar al menos un argumento.
fr: Une propriété d'indexeur doit être définie avec au moins un argument
it: A una proprietà di indicizzatore deve essere assegnato almeno un argomento
ja: インデクサーのプロパティに 1 つ以上の引数を指定する必要があります
ko: 인덱서 속성에는 하나 이상의 인수가 지정되어야 합니다.
pl: Wymagane jest podanie co najmniej jednego argumentu dla właściwości indeksatora
pt_br: Uma propriedade do indexador deve receber pelo menos um argumento
ru: Свойству индексатора необходимо присвоить как минимум один аргумент
tr: Dizin erişimcisi özelliğine en az bir bağımsız değişken verilmelidir
zh_hans: 必须为索引器属性给定至少一个参数
zh_hant: 必須至少為索引子屬性指定一個引數

# tastInvalidAddressOfMutableAcrossAssemblyBoundary
source: This operation accesses a mutable top-level value defined in another assembly in an unsupported way. The value cannot be accessed through its address. Consider copying the expression to a mutable local, e.g. 'let mutable x = ...', and if necessary assigning the value back after the completion of the operation
cs: Tato operace přistupuje k proměnlivé hodnotě na nejvyšší úrovni definované v jiném sestavení nepodporovaným způsobem. K hodnotě se nedá přistupovat prostřednictvím její adresy. Zvažte následující postup: zkopírujte výraz do lokální proměnné, třeba let mutable x = ..., a po dokončení operace přiřaďte v případě potřeby znovu původní hodnotu.
de: Bei diesem Vorgang wird auf eine nicht unterstützte Weise auf einen nicht änderbaren Wert der obersten Ebene zugegriffen, der in einer anderen Assembly definiert ist. Der Zugriff auf den Wert über seine Adresse ist nicht möglich. Kopieren Sie den Ausdruck in eine änderbare lokale Variable, z.B. "let mutable x = ...", und weisen Sie den Wert ggf. im Anschluss an diesen Vorgang erneut zu.
es: Esta operación obtiene acceso a un valor de nivel superior mutable definido en otro ensamblado de forma no admitida. No se puede obtener acceso al valor con su dirección. Considere copiar la expresión en una varibale local mutable (por ejemplo, 'let mutable x = ...') y, si es necesario, asignar el valor de nuevo una vez completada la operación.
fr: Cette opération accède à une valeur de niveau supérieur mutable définie dans un autre assembly d'une manière non prise en charge. Impossible d'accéder à la valeur via son adresse. Copiez l'expression dans une variable locale mutable, par exemple 'let mutable x = ...', et si nécessaire, réassignez la valeur une fois l'opération terminée
it: Questa operazione accede a un valore di livello superiore modificabile definito in un altro assembly in un modo non supportato. Non è possibile accedere al valore tramite il relativo indirizzo. Provare a copiare l'espressione in un valore locale modificabile, ad esempio 'let mutable x = ...' e, se necessario, ad assegnare nuovamente il valore dopo il completamento dell'operazione
ja: この操作は、別のアセンブリに定義されている変更可能な最上位の値にアクセスしていますが、サポートされないアクセス方法です。アドレスでは値にアクセスできません。変更可能なローカル変数に式をコピーし (たとえば、'let mutable x = ...')、必要に応じて、操作の完了後に値を割り当て直してください。
ko: 이 작업은 다른 어셈블리에 정의된 변경할 수 있는 최상위 값에 지원되지 않는 방식으로 액세스합니다. 이 값은 해당 주소를 통해 액세스할 수 없습니다. 식을 변경할 수 있는 로컬 변수로 복사하고(예: 'let mutable x = ...') 필요한 경우 작업이 완료된 후에 값을 다시 할당하세요.
pl: Ta operacja uzyskuje dostęp do modyfikowalnej wartości najwyższego poziomu zdefiniowanej w innym zestawie w nieobsługiwany sposób. Nie można uzyskiwać dostępu do wartości za pośrednictwem jej adresu. Rozważ skopiowanie wyrażenia do modyfikowalnej wartości lokalnej, na przykład „let mutable x = ...”, i w razie potrzeby ponowne przypisanie wartości po ukończeniu operacji
pt_br: Esta operação acessa um valor de alto nível mutável definido em outro assembly de uma forma não suportada. O valor não pode ser acessado através de seu endereço. Considere copiar a expressão ao local mutável, por exemplo: 'let mutable x = ...', e se for necessário atribuir o valor de volta após a conclusão da operação
ru: Эта операция обращается к изменяемому значению верхнего уровня, определенному в другой сборке неподдерживаемым способом. Не удается получить доступ к значению по его адресу. Рекомендуется скопировать выражение в локальную изменяемую переменную, например, "let mutable x = ...", и, при необходимости, снова присвоить это значение по завершении операции
tr: Bu işlem, başka bir bütünleştirilmiş kodda desteklenmeyen bir şekilde tanımlanmış değiştirilebilen bir üst düzey değere erişiyor. Değere adresi üzerinden erişilemiyor. İfadeyi değiştirilebilen bir yerel değere kopyalamayı, örn. 'let mutable x = ...' ve gerekirse işlem tamamlandıktan sonra değeri geri atamayı düşünün
zh_hans: 此操作用于访问在另一个程序集中定义的可变顶级值的方式不受支持。无法通过该值的地址来访问该值。请考虑将该表达式复制到一个可变本地变量，例如“let mutable x = ...”，另外如果需要，可在完成此操作后赋回该值
zh_hant: 這項作業以不支援的方式存取另一個組件中定義的可變動最上層值。值無法透過其位址存取。請考慮將運算式複製到可變動的區域變數，例如 'let mutable x = ...'，並視需要在作業完成後將值指派回來

# parsNonAdjacentTypars
source: Remove spaces between the type name and type parameter, e.g. \"type C<'T>\", not type \"C <'T>\". Type parameters must be placed directly adjacent to the type name.
cs: Odeberte mezery mezi názvem a parametrem typu, například \"type C<'T>\", ne type \"C <'T>\". Parametry typu je potřeba zadat bezprostředně za název typu.
de: Entfernen Sie die Leerzeichen zwischen dem Typnamen und dem Typparameter, z.B. "\"type C<'T>\"", statt "type \"C <'T>\"". Typparameter müssen direkt an den Typnamen angeschlossen werden.
es: Quite los espacios entre el nombre de tipo y el parámetro de tipo, por ejemplo, \"type C<'T>\", no tipo \"C <'T>\". Los parámetros de tipo deben colocarse justo al lado del nombre de tipo.
fr: Supprimez les espaces entre le nom et le paramètre de type, par ex. \"type C<'T>\" et non \"C <'T>\". Les paramètres de type doivent être juxtaposés au nom de type.
it: Rimuovere gli spazi tra il nome del tipo e il parametro di tipo, ad esempio \"type C<'T>\", non \"type C <'T>\". I parametri di tipo devono essere direttamente adiacenti al nome del tipo.
ja: 型名と型パラメーターの間のスペースを削除します。たとえば、\"C <'T>\" ではなく \"C<'T>\" とします。型パラメーターは型名に隣接して配置する必要があります。
ko: 형식 이름과 형식 매개 변수 사이의 공백을 제거하세요(예: type \"C <'T>\"가 아니라 \"type C<'T>\"). 형식 매개 변수는 형식 이름 바로 옆에 배치해야 합니다.
pl: Usuń spacje między nazwą i parametrem typu, np. \"type C<'T>\", a nie type \"C <'T>\". Parametry typów muszą bezpośrednio przylegać do nazw typów.
pt_br: Remova os espaços entre o nome de tipo e o parâmetro de tipo, ex.: \"digite C<'T>\", não digite \"C <'T>\". Parâmetros de tipo devem ser colocados diretamente adjacentes ao nome de tipo.
ru: Удалите пробелы между именем типа и параметром типа, например, \"type C<'T>\" вместо \"C <'T>\". Параметры типа должны размещаться рядом с именем типа.
tr: Tür adı ile tür parametresi arasındaki boşlukları kaldırın, ör. \"C <'T>\" değil \"type C<'T>\". Tür parametreleri doğrudan tür adına bitişik olarak yerleştirilmelidir.
zh_hans: 删除类型名称和类型参数之间的空格，例如使用 \"type C<'T>\" 而不是 type \"C <'T>\"。类型参数必须直接放在类型名称的旁边。
zh_hant: 請移除類型名稱和類型參數之間的空格，例如 \"type C<'T>\" 而非 \"C <'T>\"。類型參數必須緊接著類型名稱。

# parsNonAdjacentTyargs
source: Remove spaces between the type name and type parameter, e.g. \"C<'T>\", not \"C <'T>\". Type parameters must be placed directly adjacent to the type name.
cs: Odeberte mezery mezi názvem a parametrem typu, například \"C<'T>\", ne \"C <'T>\". Parametry typu je potřeba zadat bezprostředně za název typu.
de: Entfernen Sie die Leerzeichen zwischen dem Typnamen und Typparameter, z.B. "\"C<'T>\"" statt "\"C <'T>\"". Typparameter müssen direkt an den Typnamen angeschlossen werden.
es: Quite los espacios entre el nombre de tipo y el parámetro de tipo, por ejemplo, \"C<'T>\", not \"C <'T>\". Los parámetros de tipo deben colocarse justo al lado del nombre de tipo.
fr: Supprimez les espaces entre le nom et le paramètre de type, par ex. \"C<'T>\" et non \"C <'T>\". Les paramètres de type doivent être juxtaposés au nom de type.
it: Rimuovere gli spazi tra il nome del tipo e il parametro di tipo, ad esempio \"C<'T>\", non \"C <'T>\". I parametri di tipo devono essere direttamente adiacenti al nome del tipo.
ja: 型名と型パラメーターの間のスペースを削除します。たとえば、\"C <'T>\" ではなく \"C<'T>\" とします。型パラメーターは型名に隣接して配置する必要があります。
ko: 형식 이름과 형식 매개 변수 사이의 공백을 제거하세요(예: \"C <'T>\"가 아니라 \"C<'T>\"). 형식 매개 변수는 형식 이름 바로 옆에 배치해야 합니다.
pl: Usuń spacje między nazwą i parametrem typu, np. \"C<'T>\", a nie \"C <'T>\". Parametry typów muszą bezpośrednio przylegać do nazw typów.
pt_br: Remova os espaços entre o nome de tipo e o parâmetro de tipo, ex.: \"C<'T>\", not \"C <'T>\". Os parâmetros de tipo devem ser colocados diretamente adjacentes ao nome do tipo.
ru: Удалите пробелы между именем типа и параметром типа, например, \"C<'T>\" вместо \"C <'T>\". Параметры типа должны указываться рядом с названием типа.
tr: Tür adı ile tür parametresi arasındaki boşlukları kaldırın (ör. \"C <'T>\" değil \"C<'T>\". Tür parametreleri doğrudan tür adına bitişik olarak yerleştirilmelidir.
zh_hans: 删除类型名称和类型参数之间的空格，例如要使用 \"C<'T>\" 而不是 \"C <'T>\"。类型参数必须直接放置在类型名称旁边。
zh_hant: 請移除類型名稱和類型參數之間的空格，例如 \"C<'T>\" 而非 \"C <'T>\"。類型參數必須緊接著類型名稱。

# parsNonAtomicType
source: The use of the type syntax 'int C' and 'C <int>' is not permitted here. Consider adjusting this type to be written in the form 'C<int>'
cs: Použití syntaxe typu int C nebo C <int> tady není povolené. Zvažte zapsání tohoto typu v podobě C<int>.
de: Die Verwendung der Typsyntax "int C" und "C <int>" ist hier nicht zulässig. Passen Sie den Typ an das Format "C<int>" an.
es: El uso de la sintaxis de tipo "int C" y "C <int>" no se permite aquí. Considere el ajuste de este tipo para que se escriba en el formato "C<int>"
fr: L'utilisation de la syntaxe de type 'int C' et 'C <int>' n'est pas autorisée ici. Ajustez ce type en l'écrivant de la forme 'C<int>'
it: Uso della sintassi di tipo 'int C' e 'C <int>' non consentito in questa posizione. Provare a modificare il tipo in modo che sia scritto nel formato 'C<int>'
ja: ここでは、型構文 'int C' と 'C <int>' を使用することはできません。この型を 'C<int>' という形式に調整することを検討してください。
ko: 형식 구문 'int C' 및 'C <int>'는 여기에 허용되지 않습니다. 이 형식이 'C<int>' 형식으로 작성되도록 조정하세요.
pl: Użycie składni typu „int C” i „C <int>” nie jest tutaj dozwolone. Rozważ dopasowanie tego typu w celu zapisania go w postaci „C<int>”
pt_br: O uso da sintaxe dos tipos 'int C' e 'C <int>' não é permitido aqui. Ajuste este tipo para ser escrito na forma 'C<int>'
ru: Использование синтаксиса типа 'int C' и 'C <int>' не допускается. Измените этот тип на 'C<int>'
tr: Burada 'int C' ve 'C <int>' tür söz diziminin kullanılmasına izin verilmiyor. Bu türü şu biçimde yazılacak şekilde değiştirmeyi göz önünde bulundurun: 'C<int>'
zh_hans: 此处不允许使用类型语法 "int C" 和 "C <int>"。请考虑调整此类型，使其按 "C<int>" 形式进行编写
zh_hant: 此處不允許使用類型語法 'int C' 和 'C <int>'。請考慮將此類型調整為以 'C<int>' 形式撰寫

# tastUndefinedItemRefModuleNamespace
source: The module/namespace '{0}' from compilation unit '{1}' did not contain the module/namespace '{2}'
cs: Modul nebo obor názvů {0} z kompilační jednotky {1} neobsahoval modul nebo obor názvů {2}.
de: Das Modul bzw. der Namespace "{0}" aus der Kompilierungseinheit "{1}" enthielt nicht das Modul bzw. den Namespace "{2}".
es: El módulo o espacio de nombres '{0}' de la unidad de compilación '{1}' no contenía el módulo o espacio de nombres '{2}'.
fr: Le module/l'espace de noms '{0}' de l'unité de compilation '{1}' ne contenait pas le module/l'espace de noms '{2}'
it: Il modulo/spazio dei nomi '{0}' dell'unità di compilazione '{1}' non contiene il modulo/spazio dei nomi '{2}'
ja: コンパイル ユニット '{1}' のモジュール/名前空間 '{0}' には、モジュール/名前空間 '{2}' が含まれません
ko: 컴파일 단위 '{1}'의 '{0}' 모듈/네임스페이스에 '{2}' 모듈/네임스페이스가 없습니다.
pl: Moduł/przestrzeń nazw „{0}” z jednostki kompilacji „{1}” nie zawiera modułu/przestrzeni nazw „{2}”
pt_br: O módulo/namespace '{0}' da unidade de compilação '{1}' não contém o módulo/namespace '{2}'
ru: Модуль или пространство имен "{0}" из блока компиляции "{1}" не содержит модуль или пространство имен "{2}"
tr: {1}' derleme birimindeki '{0}' modülü/ad alanı '{2}' modülünü/ad alanını içermiyordu
zh_hans: 编译单元“{1}”中的模块/命名空间“{0}”未包含模块/命名空间“{2}”
zh_hant: 來自編譯單位 '{1}' 的模組/命名空間 '{0}' 不包含模組/命名空間 '{2}'

# tastUndefinedItemRefVal
source: The module/namespace '{0}' from compilation unit '{1}' did not contain the val '{2}'
cs: Modul nebo obor názvů {0} z kompilační jednotky {1} neobsahoval hodnotu {2}.
de: Das Modul bzw. der Namespace "{0}" aus der Kompilierungseinheit "{1}" enthielt nicht den Wert "{2}".
es: El módulo o espacio de nombres '{0}' de la unidad de compilación '{1}' no contenía el val '{2}'.
fr: Le module/l'espace de noms '{0}' de l'unité de compilation '{1}' ne contenait pas la valeur '{2}'
it: Il modulo/spazio dei nomi '{0}' dell'unità di compilazione '{1}' non contiene il valore '{2}'
ja: コンパイル ユニット '{1}' のモジュール/名前空間 '{0}' には、val '{2}' が含まれません
ko: 컴파일 단위 '{1}'의 '{0}' 모듈/네임스페이스에 val '{2}'이(가) 없습니다.
pl: Moduł/przestrzeń nazw „{0}” z jednostki kompilacji „{1}” nie zawiera wartości „{2}”
pt_br: O módulo/namespace '{0}' da unidade de compilação '{1}' não contém o val '{2}'
ru: Модуль или пространство имен "{0}" из блока компиляции "{1}" не содержит значение "{2}"
tr: {1}' derleme birimindeki '{0}' modülü/ad alanı '{2}' değerini içermiyordu
zh_hans: 编译单元“{1}”中的模块/命名空间“{0}”未包含值“{2}”
zh_hant: 來自編譯單位 '{1}' 的模組/命名空間 '{0}' 不包含 val '{2}'

# tastUndefinedItemRefModuleNamespaceType
source: The module/namespace '{0}' from compilation unit '{1}' did not contain the namespace, module or type '{2}'
cs: Modul nebo obor názvů {0} z kompilační jednotky {1} neobsahoval obor názvů, modul nebo typ {2}.
de: Das Modul bzw. der Namespace "{0}" aus der Kompilierungseinheit "{1}" enthielt nicht den Namespace, das Modul oder den Typ "{2}".
es: El módulo o espacio de nombres '{0}' de la unidad de compilación '{1}' no contenía el espacio de nombres, módulo o tipo '{2}'.
fr: Le module/l'espace de noms '{0}' de l'unité de compilation '{1}' ne contenait pas l'espace de noms, le module ou le type '{2}'
it: Il modulo/spazio dei nomi '{0}' dell'unità di compilazione '{1}' non contiene lo spazio dei nomi, il modulo o il tipo '{2}'
ja: コンパイル ユニット '{1}' のモジュール/名前空間 '{0}' には、名前空間、モジュール、または型の '{2}' が含まれません
ko: 컴파일 단위 '{1}'의 '{0}' 모듈/네임스페이스에 '{2}' 네임스페이스, 모듈 또는 형식이 없습니다.
pl: Moduł/przestrzeń nazw „{0}” z jednostki kompilacji „{1}” nie zawiera modułu, przestrzeni nazw lub typu „{2}”
pt_br: O módulo/namespace '{0}' da unidade de compilação '{1}' não contém o namespace, módulo ou tipo '{2}'
ru: Модуль или пространство имен "{0}" из блока компиляции "{1}" не содержит пространство имен, модуль или тип "{2}"
tr: {1}' derleme birimindeki '{0}' modülü/ad alanı '{2}' ad alanını, modülünü veya türünü içermiyordu
zh_hans: 编译单元“{1}”中的模块/命名空间“{0}”未包含命名空间、模块或类型“{2}”
zh_hant: 來自編譯單位 '{1}' 的模組/命名空間 '{0}' 不包含命名空間、模組或類型 '{2}'

# tcInvalidUseNullAsTrueValue
source: The 'UseNullAsTrueValue' attribute flag may only be used with union types that have one nullary case and at least one non-nullary case
cs: Příznak atributu UseNullAsTrueValue se dá použít jenom s typy sjednocení, které mají jeden prázdný případ a aspoň jeden neprázdný případ.
de: Das UseNullAsTrueValue-Attributflag darf nur für Union-Typen verwendet werden, die einen nullären Fall und mindestens einen nicht nullären Fall aufweisen.
es: La marca de atributo 'UseNullAsTrueValue' se puede usar solo con tipos de unión que tengan un caso que acepte valores NULL y al menos un caso que no acepte valores NULL.
fr: L'indicateur d'attribut 'UseNullAsTrueValue' ne peut être utilisé qu'avec des types union qui ont un cas nullaire et au moins un cas non nullaire
it: Il flag di attributo 'UseNullAsTrueValue' può essere utilizzato solo con tipi di unione che hanno un case nullary e almeno un case non nullary
ja: 'UseNullAsTrueValue' 属性フラグを使用できるのは、引数がないケース 1 つと、引数があるケース 1 つ以上を持つ共用体型のみです
ko: 'UseNullAsTrueValue' 특성 플래그는 하나의 nullary 케이스와 하나 이상의 nullary가 아닌 케이스를 포함하는 공용 구조체 형식에만 사용할 수 있습니다.
pl: Flaga atrybutu „UseNullAsTrueValue” może być używana tylko z typami unii, które mają jeden przypadek o wartości null i co najmniej jeden przypadek o wartości innej niż null
pt_br: O sinalizador de atributo 'UseNullAsTrueValue' só podem ser usados com tipos de união que possuem um caso nulário e pelo menos um caso não nulário
ru: Флаг атрибута "UseNullAsTrueValue" может использоваться только с типами объединений, имеющими один нулевой случай и по меньшей мере один ненулевой случай.
tr: 'UseNullAsTrueValue' öznitelik bayrağı yalnızca bir adet işlenensiz durumu ve en az bir adet işlenenli durumu olan birleşim türleriyle kullanılabilir
zh_hans: “UseNullAsTrueValue”特性标志只能用于具有一个空用例和至少一个非空用例的联合类型
zh_hant: 'UseNullAsTrueValue' 屬性旗標只能搭配等位型別一起使用，該等位型別有一個零元案例和至少一個非零元案例

# tcParameterInferredByref
source: The parameter '{0}' was inferred to have byref type. Parameters of byref type must be given an explicit type annotation, e.g. 'x1: byref<int>'. When used, a byref parameter is implicitly dereferenced.
cs: Parametr {0} je odvozený jako parametr typu byref. Parametrům typu byref se musí předávat explicitní anotace typu, třeba x1: byref<int>. V případě jejího použití se k parametru typu byref přistoupí implicitně přes ukazatel.
de: Der Parameter "{0}" wurde mit dem Typ "byref" abgeleitet. Parametern vom Typ "byref" muss eine explizite Typanmerkung hinzugefügt werden, z.B. "x1: byref<int>". Wenn ein byref-Parameter verwendet wird, wird dieser explizit dereferenziert.
es: Se infirió que el parámetro "{0}" tiene un tipo byref. Los parámetros de tipo byref deben recibir una anotación de tipo explícita, por ejemplo,"x1: byref<int>". Cuando se usa, la referencia de un parámetro byref se elimina de forma implícita.
fr: Le type byref a été attribué au paramètre '{0}' par déduction. Les paramètres de type byref doivent recevoir une annotation de type explicite, par ex. 'x1: byref<int>'. Quand il est utilisé, un paramètre byref est implicitement déréférencé.
it: Per il parametro '{0}' è stato dedotto il tipo byref. Ai parametri di tipo byref deve essere associata un'annotazione di tipo esplicita, ad esempio 'x1: byref<int>'. Se usato, un parametro byref viene dereferenziato in modo implicito.
ja: byre 型に設定するためにパラメーター '{0}' が継承されました。byref 型のパラメーターには明示的な型注釈を指定する必要があります (例: 'x1: byref<int>')。使用すると、byref パラメーターが暗黙的に逆参照されます。
ko: '{0}' 매개 변수가 byref 형식으로 유추되었습니다. byref 형식의 매개 변수에는 명시적인 형식 주석(예: 'x1: byref<int>')이 지정되어야 합니다. byref 매개 변수는 사용될 경우 암시적으로 역참조됩니다.
pl: Wywnioskowano, że parametr „{0}” ma typ byref. Parametry typu byref muszą mieć jawną adnotację typu, na przykład „x1: byref<int>”. Parametr typu byref zostanie niejawnie wyłuskany, jeśli zostanie użyty.
pt_br: O parâmetro '{0}' foi inferido para ter o tipo byref. Os parâmetros do tipo byref devem receber uma anotação de tipo explícito, ex.: 'x1: byref<int>'. Quando usado, um parâmetro byref é implicitamente desreferenciado.
ru: Для параметра '{0}' был определен тип byref. Для параметров типа byref необходимо явно объявить тип, например, 'x1: byref<int>'. При использовании параметра byref выполняется разрешение ссылки неявным образом.
tr: '{0}' parametresinin byref türüne sahip olduğu çıkarsandı. Byref türündeki parametrelere açık bir tür ek açıklaması verilmelidir, ör. 'x1: byref<int>'. Bir byref parametresi kullanılırsa parametre başvurusu örtük olarak kaldırılır.
zh_hans: 据推断，参数“{0}”具有 byref 类型。必须向 byref 类型的参数提供一个显式类型注释，例如 "x1: byref<int>"。使用时，隐式取消对 byref 类型的引用。
zh_hant: 已推斷出參數 '{0}' 擁有 byref 類型。必須為 byref 類型的參數提供明確的類型註釋，例如 'x1: byref<int>'。使用時，會對 byref 參數隱含取值。
