Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# etErrorApplyingStaticArgumentsToType
source: An error occured applying the static arguments to a provided type
cs: Při použití statických argumentů u poskytnutého typu došlo k chybě.
de: Fehler beim Anwenden des statischen Arguments auf einen angegebenen Typ.
es: Error al aplicar los argumentos estáticos a un tipo proporcionado.
fr: Une erreur s'est produite lors de l'application des arguments statiques à un type fourni
it: Errore durante l'applicazione degli argomenti statici a un tipo fornito
ja: 指定された型に静的引数を適用する際にエラーが発生しました
ko: 제공된 형식에 정적 인수를 적용하는 동안 오류가 발생했습니다.
pl: Wystąpił błąd podczas stosowania argumentów statycznych do udostępnionego typu
pt_br: Erro ao aplicar os argumentos estáticos a um tipo fornecido
ru: Ошибка при применении статических аргументов к предоставленному типу
tr: Sağlanan türe statik bağımsız değişkenler uygulanırken bir hata oluştu
zh_hans: 将静态参数应用于所提供类型时发生错误
zh_hant: 將靜態引數套用至提供的類型時發生錯誤

# etUnknownStaticArgumentKind
source: Unknown static argument kind '{0}' when resolving a reference to a provided type or method '{1}'
cs: Při překladu odkazu na poskytnutý typ nebo metodu {1} se objevil neznámý druh statického argumentu {0}.
de: Unbekannte Art des statischen Arguments "{0}" beim Auflösen eines Verweises zum angegebenen Typ oder zur angegebenen Methode "{1}".
es: Tipo de argumento estático "{0}" desconocido al resolver una referencia a un tipo o un método "{1}" proporcionado
fr: Genre d'argument statique inconnu '{0}' durant la résolution d'une référence à un type ou une méthode fournie '{1}'
it: Tipo di argomento statico '{0}' sconosciuto durante la risoluzione di un riferimento a un tipo o a un metodo fornito '{1}'
ja: 指定された型またはメソッド '{1}' への参照を解決する際に、不明な静的引数の種類 '{0}' が検出されました
ko: 제공된 형식 또는 메서드 '{1}'에 대한 참조를 확인할 때 알 수 없는 정적 인수 종류('{0}')가 발견되었습니다.
pl: Nieznany rodzaj argumentu statycznego „{0}” podczas rozpoznawania odwołania do podanego typu lub podanej metody „{1}”
pt_br: Tipo de argumento estático desconhecido '{0}' ao resolver uma referência a um método ou tipo fornecido '{1}'
ru: Неизвестный вид статического аргумента "{0}" при разрешении ссылки на предоставленный тип или метод "{1}"
tr: Sağlanan '{1}' türüne yapılan bir başvuru çözümlenirken '{0}' türünde bilinmeyen statik bağımsız değişken
zh_hans: 解析对所提供类型或方法“{1}”的引用时出现未知静态参数类型“{0}”
zh_hant: 為所提供的類型或方法 '{1}' 解析參考時，發現未知的靜態引數類型 '{0}'

source: invalid namespace for provided type
cs: Neplatný obor názvů pro poskytnutý typ
de: Ungültiger Namespace für den angegebenen Typ
es: espacio de nombres no válido para el tipo proporcionado
fr: espace de noms non valide pour le type fourni
it: spazio dei nomi non valido per il tipo fornito
ja: 指定された型の名前空間が無効です
ko: 제공된 형식의 네임스페이스가 잘못되었습니다.
pl: nieprawidłowa przestrzeń nazw udostępnionego typu
pt_br: namespace inválido para tipo fornecido
ru: недопустимое пространство имен для предоставленного типа
tr: sağlanan tür için geçersiz ad alanı
zh_hans: 所提供类型的命名空间无效
zh_hant: 提供之類型的命名空間無效

source: invalid full name for provided type
cs: Neplatný úplný název poskytnutého typu
de: Ungültiger vollständiger Name für den angegebenen Typ
es: nombre completo no válido para el tipo proporcionado
fr: nom complet non valide pour le type fourni
it: nome completo non valido per il tipo fornito
ja: 指定された型の完全名が無効です
ko: 제공된 형식의 전체 이름이 잘못되었습니다.
pl: nieprawidłowa pełna nazwa udostępnionego typu
pt_br: nome completo inválido para tipo fornecido
ru: недопустимое полное имя для предоставленного типа
tr: sağlanan tür için geçersiz tam ad
zh_hans: 所提供类型的全名无效
zh_hant: 提供之類型的完整名稱無效

# etProviderReturnedNull
source: The type provider returned 'null', which is not a valid return value from '{0}'
cs: Zprostředkovatel typu vrátil hodnotu null, která není platnou návratovou hodnotou {0}.
de: Der Typanbieter hat NULL zurückgegeben, wobei es sich nicht um einen gültigen Rückgabewert von '{0}' handelt.
es: El proveedor de tipos devolvió 'null', que no es un valor devuelto válido de '{0}'.
fr: Le fournisseur de type a retourné 'null', qui n'est pas une valeur de retour valide de '{0}'
it: Il provider di tipi ha restituito 'null', che non è un valore restituito valido per '{0}'
ja: 型プロバイダーが 'null' を返しましたが、これは '{0}' からの戻り値としては無効です
ko: 형식 공급자가 'null'을 반환했습니다. 이 값은 '{0}'(으)로부터의 올바른 반환 값이 아닙니다.
pl: Dostawca typów zwrócił wartość „null”, która nie jest prawidłową wartością zwracaną z „{0}”
pt_br: O provedor de tipos retornou 'null', o que não é um valor retornado válido de '{0}'.
ru: Поставщик типов вернул значение NULL, которое не является допустимым возвращаемым значением для "{0}"
tr: Tür sağlayıcısı 'null' döndürdü; bu '{0}' öğesinden gelen geçerli bir dönüş değeri değil
zh_hans: 类型提供程序返回了“null”，这不是来自“{0}”的有效返回值
zh_hant: 型別提供者傳回的 'null' 不是 '{0}' 中的有效傳回值

# etTypeProviderConstructorException
source: The type provider constructor has thrown an exception: {0}
cs: Konstruktor zprostředkovatele typu vyvolal výjimku: {0}
de: Der Typanbieterkonstruktor hat eine Ausnahme ausgelöst: {0}
es: El constructor de proveedores de tipos produjo una excepción: {0}
fr: Le constructeur du fournisseur de type a levé une exception : {0}
it: Eccezione generata dal costruttore del provider di tipi: {0}
ja: 型プロバイダー コンストラクターが例外をスローしました: {0}
ko: 형식 공급자 생성자에서 예외가 발생했습니다. {0}
pl: Konstruktor dostawcy typów zgłosił wyjątek: {0}
pt_br: O construtor do provedor de tipos gerou uma exceção: {0}
ru: Конструктор поставщика типов создал исключение: {0}
tr: Tür sağlayıcısı oluşturucu bir özel durum oluşturdu: {0}
zh_hans: 类型提供程序构造函数引发异常: {0}
zh_hant: 型別提供者建構函式擲回例外狀況: {0}

# etNullProvidedExpression
source: Type provider '{0}' returned null from GetInvokerExpression.
cs: Zprostředkovatel typu {0} vrátil u metody GetInvokerExpression hodnotu null.
de: Typanbieter '{0}' hat von GetInvokerExpression NULL zurückgegeben.
es: El proveedor de tipos '{0}' devolvió NULL de GetInvokerExpression.
fr: Le fournisseur de type '{0}' a retourné Null de GetInvokerExpression.
it: Valore Null restituito da GetInvokerExpression dal provider di tipi '{0}'.
ja: 型プロバイダー '{0}' が、GetInvokerExpression から null を返しました。
ko: '{0}' 형식 공급자가 GetInvokerExpression에서 null을 반환했습니다.
pl: Dostawca typów „{0}” zwrócił wartość null z metody GetInvokerExpression.
pt_br: O provedor de tipos '{0}' retornou nulo de GetInvokerExpression.
ru: Поставщик типов "{0}" вернул значение NULL в результате вызова метода GetInvokerExpression.
tr: '{0}' tür sağlayıcısı GetInvokerExpression yönteminden null döndürdü.
zh_hans: 类型提供程序“{0}”从 GetInvokerExpression 返回了 null。
zh_hant: 型別提供者 '{0}' 從 GetInvokerExpression 傳回 null。

# etProvidedAppliedTypeHadWrongName
source: The type provider '{0}' returned an invalid type from 'ApplyStaticArguments'. A type with name '{1}' was expected, but a type with name '{2}' was returned.
cs: Zprostředkovatel typu {0} vrátil u metody ApplyStaticArguments neplatný typ. Očekával se typ s názvem {1}, ale vrácený typ má název {2}.
de: Der Typanbieter '{0}' hat von 'ApplyStaticArguments' einen ungültigen Typ zurückgegeben. Es wurde ein Typ mit dem Namen '{1}' erwartet, es wurde jedoch ein Typ mit dem Namen '{2}' zurückgegeben.
es: El proveedor de tipos '{0}' devolvió un tipo no válido de 'ApplyStaticArguments'. Se esperaba un tipo con el nombre '{1}', pero se devolvió uno denominado '{2}'.
fr: Le fournisseur de type '{0}' a retourné un type non valide de 'ApplyStaticArguments'. Un type nommé '{1}' était attendu, mais un type nommé '{2}' a été retourné.
it: Tipo non valido restituito da 'ApplyStaticArguments' dal provider di tipi '{0}'. Era previsto un tipo con nome '{1}', mentre è stato restituito un tipo con nome '{2}'.
ja: 型プロバイダー '{0}' が 'ApplyStaticArguments' から無効な型を返しました。'{1}' という名前の型が返される必要がありましたが、返されたのは '{2}' という名前の型でした。
ko: 형식 공급자 '{0}'이(가) 'ApplyStaticArguments'에서 잘못된 형식을 반환했습니다. 이름이 '{1}'인 형식이 필요한데 이름이 '{2}'인 형식이 반환되었습니다.
pl: Dostawca typów „{0}” zwrócił nieprawidłowy typ z metody „ApplyStaticArguments”. Oczekiwano typu o nazwie „{1}”, ale został zwrócony typ o nazwie „{2}”.
pt_br: O provedor de tipos '{0}' retornou um tipo inválido de 'ApplyStaticArguments'. Um tipo com nome '{1}' era esperado, mas um tipo com nome '{2}' foi retornado.
ru: Поставщик типов "{0}" вернул недопустимый тип из метода ApplyStaticArguments. Ожидался тип с именем "{1}", но был возвращен тип с именем "{2}".
tr: {0}' tür sağlayıcısı 'ApplyStaticArguments' yönteminden geçersiz bir tür döndürdü. '{1}' adlı tür bekleniyordu, ancak '{2}' adlı tür döndürüldü.
zh_hans: 类型提供程序“{0}”从“ApplyStaticArguments”返回了无效类型。需要名称为“{1}”的类型，但返回了名称为“{2}”的类型。
zh_hant: 型別提供者 '{0}' 從 'ApplyStaticArguments' 傳回的型別無效。必須是名為 '{1}' 的型別，但傳回名為 '{2}' 的型別。

# etProvidedAppliedMethodHadWrongName
source: The type provider '{0}' returned an invalid method from 'ApplyStaticArgumentsForMethod'. A method with name '{1}' was expected, but a method with name '{2}' was returned.
cs: Zprostředkovatel typu {0} vrátil z metody ApplyStaticArgumentsForMethod neplatnou metodu. Očekávala se metoda s názvem {1}, ale vrátila se metoda s názvem {2}.
de: Der Typanbieter "{0}" hat von "ApplyStaticArgumentsForMethod" eine ungültige Methode zurückgegeben. Es wurde eine Methode mit dem Namen "{1}" erwartet, es wurde jedoch eine Methode mit dem Namen "{2}" zurückgegeben.
es: El proveedor de tipos "{0}" devolvió un método no válido de "ApplyStaticArgumentsForMethod". Se esperaba un método con el nombre "{1}", pero se devolvió un método con el nombre "{2}".
fr: Le fournisseur de type '{0}' a retourné une méthode non valide à partir de 'ApplyStaticArgumentsForMethod'. La méthode nommée '{1}' était attendue, mais la méthode nommée '{2}' a été retournée.
it: Il provider di tipi '{0}' ha restituito un metodo non valido da 'ApplyStaticArgumentsForMethod'. Era previsto un metodo con nome '{1}', mentre ne è stato restituito uno con nome '{2}'.
ja: 型プロバイダー '{0}' が、'ApplyStaticArgumentsForMethod' から無効なメソッドを返しました。名前が '{1}' のメソッドが必要ですが、名前が '{2}' のメソッドが返されました。
ko: {0}' 형식 공급자가 잘못된 메서드를 'ApplyStaticArgumentsForMethod'에서 반환했습니다. '{1}'라는 메서드를 예상했지만 '{2}'라는 메서드가 반환되었습니다.
pl: Dostawca typów „{0}” zwrócił nieprawidłową metodę z funkcji „ApplyStaticArgumentsForMethod”. Oczekiwano metody o nazwie „{1}”, lecz zwrócono metodę o nazwie „{2}”.
pt_br: O provedor de tipos '{0}' retornou um método inválido de 'AplicarArgumentosEstáticosParaMétodo'. Um método com o nome '{1}' era esperado, mas um método com o nome '{2}' foi retornado.
ru: Поставщик типов "{0}" вернул недействительный метод из ApplyStaticArgumentsForMethod. Предполагалось, что вернется метод "{1}" , но был возвращен метод "{2}".
tr: Tür sağlayıcısı '{0}', 'ApplyStaticArgumentsForMethod' öğesinden geçersiz bir metot döndürdü. '{1}' adlı bir metot bekleniyordu ancak '{2}' adlı bir metot döndürüldü.
zh_hans: 类型提供程序“{0}”从 "ApplyStaticArgumentsForMethod" 返回了无效方法。需要名称为“{1}”的方法，但返回了名称为“{2}”的方法。
zh_hant: 型別提供者 '{0}' 從 'ApplyStaticArgumentsForMethod' 傳回的方法無效。必須是名為 '{1}' 的方法，但傳回名為 '{2}' 的方法。

# tcTypeTestLossy
source: This type test or downcast will erase the provided type '{0}' to the type '{1}'
cs: Test tohoto typu nebo jeho přetypování směrem dolů vymaže poskytnutý typ {0} na typ {1}.
de: Mit diesem Typtest oder der Typumwandlung wird der angegebene Typ '{0}' in den Typ '{1}' geändert.
es: Esta prueba de tipo o conversión hacia abajo borrará el tipo '{0}' proporcionado para el tipo '{1}'.
fr: Ce test de type ou ce cast d'une classe de base va effacer le type fourni '{0}' et le remplacer par le type '{1}'
it: Questo test di tipo o downcast cancellerà il tipo fornito '{0}' nel tipo '{1}'
ja: この型テストまたはダウンキャストによって、指定された型 '{0}' が型 '{1}' に消去されます
ko: 이 형식 테스트 또는 다운캐스트는 제공된 '{0}' 형식을 '{1}' 형식으로 지웁니다.
pl: Ten test typu lub to przypisanie elementu podrzędnego spowoduje wymazanie podanego typu „{0}” w typie „{1}”
pt_br: Esse teste de tipo ou downcast irá apagar o tipo fornecido '{0}' para o tipo '{1}'
ru: Это нисходящее приведение или проверка типа сотрет предоставленный тип "{0}" до типа "{1}".
tr: Bu tür testi veya alt türe çevirme işlemi '{0}' sağlanan türünü '{1}' türüne silecek
zh_hans: 此类型测试或向下转换会将提供的类型“{0}”清除为类型“{1}”
zh_hant: 這個類型測試或向下轉型會將提供的類型 '{0}' 清除為類型 '{1}'。

# tcTypeCastErased
source: This downcast will erase the provided type '{0}' to the type '{1}'.
cs: Toto přetypování směrem dolů vymaže typ {0} poskytnutý typu {1}.
de: Mit dieser Typumwandlung wird der angegebene Typ '{0}' in den Typ '{1}' geändert.
es: Esta conversión a tipo heredado borrará el tipo '{0}' proporcionado para el tipo '{1}'.
fr: Ce cast d'une classe de base va effacer le type fourni '{0}' et le remplacer par le type '{1}'.
it: Questo downcast cancellerà il tipo fornito '{0}' nel tipo '{1}'.
ja: このダウンキャストによって、指定された型 '{0}' が型 '{1}' に消去されます。
ko: 이 다운캐스트는 제공된 '{0}' 형식을 '{1}' 형식으로 지웁니다.
pl: To przypisanie elementu podrzędnego spowoduje wymazanie podanego typu „{0}” w typie „{1}”.
pt_br: Este downcast apagará o tipo fornecido '{0}' para o tipo '{1}'.
ru: Это нисходящее приведение типа сотрет предоставленный тип "{0}" до типа "{1}".
tr: Bu alt türe çevirme işlemi '{0}' sağlanan türünü '{1}' türüne siler.
zh_hans: 此向下转换会将所提供类型“{0}”清除到类型“{1}”。
zh_hant: 這個向下轉型會將提供的類型 '{0}' 清除為類型 '{1}'。

# tcTypeTestErased
source: This type test with a provided type '{0}' is not allowed because this provided type will be erased to '{1}' at runtime.
cs: Test tohoto typu s poskytnutým typem {0} není povolený, protože tento poskytnutý typ se při běhu vymaže na {1}.
de: Dieser Typetest mit dem angegeben Typ '{0}' ist nicht zulässig, da dieser angegebene Typ zur Laufzeit in '{1}' gelöscht wird.
es: Esta prueba de tipo con un tipo '{0}' proporcionado no se permite porque el tipo proporcionado se borrará para '{1}' en tiempo de ejecución.
fr: Ce test de type avec un type fourni '{0}' n'est pas autorisé, car ce type fourni sera effacé et remplacé par '{1}' au moment de l'exécution.
it: Questo test di tipo con un tipo fornito '{0}' non è consentito perché il tipo fornito verrà cancellato in '{1}' in fase di esecuzione.
ja: 指定された型 '{0}' は実行時に '{1}' に消去されるため、この型を使用して型テストを実行することはできません。
ko: 제공된 형식 '{0}'이(가) 포함된 이 형식 테스트는 허용되지 않습니다. 이 제공된 형식은 런타임에 '{1}'(으)로 지워집니다.
pl: Ten test typu z udostępnionym typem „{0}” nie jest dozwolony, ponieważ ten udostępniony typ zostanie wymazany do typu „{1}” w środowisku uruchomieniowym.
pt_br: Este teste de tipo com um tipo fornecido '{0}' não é permitido porque este tipo fornecido será apagado para '{1}' no tempo de execução.
ru: Такая проверка предоставленного типа "{0}" запрещена, поскольку при этом предоставленный тип будет во время выполнения стерт до типа "{1}".
tr: {0}' sağlanan türü çalışma zamanında '{1}' olarak silineceği için bu sağlanan türe sahip bu tür testine izin verilmez.
zh_hans: 不允许对提供的类型“{0}”执行此类型测试，因为该提供的类型在运行时将清除为“{1}”。
zh_hant: 不允許這個含有提供之類型 '{0}' 的類型測試，因為這個提供的類型將在執行階段清除為 '{1}'。

# tcCannotInheritFromErasedType
source: Cannot inherit from erased provided type
cs: Nejde dědit z vymazaného poskytnutého typu.
de: Von einem gelöschten angegebenen Typ kann nicht geerbt werden.
es: No se puede heredar de un tipo proporcionado borrado.
fr: Impossible d'hériter d'un type fourni effacé
it: Non è possibile ereditare dal tipo fornito cancellato
ja: 指定された型が消去されている場合、継承することはできません
ko: 지워진 제공된 형식에는 상속될 수 없습니다.
pl: Nie można dziedziczyć po dostarczonym wymazanym typie
pt_br: Não é possível herdar de um tipo fornecido apagado
ru: Невозможно наследование от удаленного предоставленного типа
tr: Silinmiş sağlanan türden devralınamıyor
zh_hans: 无法从已清除的提供的类型中继承
zh_hant: 無法繼承自清除的提供類型

# etInvalidTypeProviderAssemblyName
source: Assembly '{0}' hase TypeProviderAssembly attribute with invalid value '{1}'. The value should be a valid assembly name
cs: Základní atribut TypeProviderAssembly sestavení {0} má neplatnou hodnotu {1}. Hodnotou by měl být platný název sestavení.
de: Assembly '{0}' verfügt über ein TypeProviderAssembly-Attribut mit dem ungültigen Wert '{1}'. Beim Wert sollte es sich um einen gültigen Assemblynamen handeln.
es: El ensamblado '{0}' tiene el atributo TypeProviderAssembly con el valor '{1}' no válido. El valor debe ser un nombre de ensamblado válido.
fr: L'assembly '{0}' a un attribut TypeProviderAssembly comportant la valeur non valide '{1}'. La valeur doit être un nom d'assembly valide
it: Valore '{1}' non valido dell'attributo TypeProviderAssembly nell'assembly '{0}'. Il valore deve essere un nome di assembly valido.
ja: アセンブリ '{0}' の TypeProviderAssembly 属性に、無効な値 '{1}' が含まれています。この値は有効なアセンブリ名であることが必要です
ko: {0}' 어셈블리에 포함된 TypeProviderAssembly 특성의 값('{1}')이 잘못되었습니다. 값은 올바른 어셈블리 이름이어야 합니다.
pl: Zestaw „{0}” ma atrybut TypeProviderAssembly z nieprawidłową wartością „{1}”. Wartość powinna być prawidłową nazwą zestawu
pt_br: O assembly '{0}' possui um atributo TypeProviderAssembly com valor inválido '{1}'. O valor deve ser um nome de assembly válido
ru: У сборки "{0}" имеется атрибут TypeProviderAssembly с недопустимым значением "{1}". Значение должно представлять собой допустимое имя сборки
tr: {0}' bütünleştirilmiş kodunun geçersiz '{1}' değerli TypeProviderAssembly özniteliği var. Bu değer geçerli bir bütünleştirilmiş kod adı olmalıdır
zh_hans: 程序集“{0}”的 TypeProviderAssembly 特性具有无效值“{1}”。该值应为有效的程序集名称
zh_hant: 組件 '{0}' 的 TypeProviderAssembly 屬性值 '{1}' 無效。此值必須是有效的屬性名稱

# tcInvalidMemberNameCtor
source: Invalid member name. Members may not have name '.ctor' or '.cctor'
cs: Neplatný název člena. Členové nemůžou mít název .ctor nebo .cctor.
de: Ungültiger Membername. Member dürfen nicht die Namen '.ctor' oder '.cctor' haben.
es: Nombre de miembro no válido. Los miembros no pueden tener el nombre '.ctor' o '.cctor'
fr: Nom de membre non valide. Les membres ne peuvent pas être appelés '.ctor' ou '.cctor'
it: Nome del membro non valido. I membri non possono avere '.ctor' o '.cctor' come nome.
ja: メンバー名が無効です。メンバーに '.ctor' または '.cctor' という名前を付けることはできません
ko: 멤버 이름이 잘못되었습니다. 멤버 이름은 '.ctor' 또는 '.cctor'일 수 없습니다.
pl: Nieprawidłowa nazwa elementu członkowskiego. Elementy członkowskie nie mogą mieć nazw „.ctor” i „.cctor”
pt_br: Nome de membro inválido. Os membros não podem ter os nomes '.ctor' ou '.cctor'
ru: Недопустимое имя элемента. Элементы не могут иметь имя ".ctor" или ".cctor"
tr: Geçersiz üye adı. Üyelerin adı '.ctor' veya '.cctor' olamaz
zh_hans: 成员名称无效。成员名称不能为“.ctor”或“.cctor”
zh_hant: 無效的成員名稱。成員不能有名稱 '.ctor' 或 '.cctor'

# tcInferredGenericTypeGivesRiseToInconsistency
source: The function or member '{0}' is used in a way that requires further type annotations at its definition to ensure consistency of inferred types. The inferred signature is '{1}'.
cs: Funkce nebo člen {0} se používá způsobem, který vyžaduje, aby se k jeho definici doplnily další poznámky typu. Je to kvůli zajištění konzistence odvozených typů. Odvozená signatura je {1}.
de: Die Funktion oder der Member '{0}' wird auf eine Weise verwendet, die in den Definitionen zusätzliche Typanmerkungen erfordert, um die Konsistenz der abgeleiteten Typen sicherzustellen. Die abgeleitete Signatur lautet '{1}'.
es: La función o miembro '{0}' se usa de forma que requiere más anotaciones de tipo en su definición para garantizar la coherencia de los tipos inferidos. La signatura inferida es '{1}'.
fr: La fonction ou le membre '{0}' est utilisé d'une manière qui nécessite d'autres annotations de type au niveau de sa définition pour garantir la cohérence des types déduits. La signature déduite est '{1}'.
it: La funzione o il membro '{0}' viene usato in un modo che richiede ulteriori annotazioni di tipo in corrispondenza della relativa definizione per garantire la coerenza dei tipi dedotti. La firma dedotta è '{1}'.
ja: 現在使用されている関数またはメンバー '{0}' では、推論された型の一貫性を確保するために、さらに型の注釈が必要です。推論されたシグネチャは '{1}' です。
ko: {0}' 함수 또는 멤버는 유추된 형식의 일관성을 유지하기 위해 해당 정의에서 형식 주석을 더 추가해야 하는 방식으로 사용됩니다. 유추된 서명은 '{1}'입니다.
pl: Element członkowski funkcji „{0}” jest używany w sposób wymagający dodatkowych adnotacji typów w definicji w celu zapewnienia spójności wywnioskowanych typów. Wywnioskowana sygnatura: „{1}”.
pt_br: A função ou o membro '{0}' é usado de uma forma que requer anotações de tipo adicionais em sua definição para garantir a consistência de tipos deduzidos. A assinatura deduzida é '{1}'.
ru: Функция или элемент "{0}" используются таким образом, что для подтверждения согласованности выводимых типов требуются дополнительные аннотации типов при их определении. Выводимая сигнатура: "{1}".
tr: {0}' işlevi veya üyesi, çıkartılan türlerin tutarlı olmasını sağlamak için tanımında başka tür ek açıklamaları gerektirecek şekilde kullanılmış. Çıkartılan imza: '{1}'.
zh_hans: 函数或成员“{0}”的使用方式要求其在定义中提供进一步的类型批注，以确保推理类型的一致性。推理签名为“{1}”。
zh_hant: 函式或成員 '{0}' 的使用方式要求在定義處必須有進一步的類型註釋，才能確保推斷類型的一致性。推斷的簽章為 '{1}'。

# tcInvalidTypeArgumentCount
source: The number of type arguments did not match: '{0}' given, '{1}' expected. This may be related to a previously reported error.
cs: Počet argumentů typu se neshodoval: počet předaných je {0}, ale počet očekávaných je {1}. Může to souviset s dřív hlášenou chybou.
de: Die Anzahl der Typargumente stimmte nicht überein: Es wurde {1} erwartet, jedoch {0} ausgegeben. Dies kann mit einem zuvor gemeldeten Fehler zusammenhängen.
es: El número de argumentos de tipo no coincide. Argumentos proporcionados: '{0}'; se esperaban: '{1}'. Esto puede estar relacionado con un error notificado anteriormente.
fr: Le nombre d'arguments de type ne correspond pas : '{0}' fournis, '{1}' attendus. Ceci peut-être dû à une erreur signalée précédemment.
it: Il numero di argomenti tipo non corrisponde: '{0}' specificati, '{1}' previsti. Tale condizione potrebbe essere correlata a un errore segnalato in precedenza.
ja: 型引数の数が一致しません: 指定されているのは '{0}' 個ですが、'{1}' 個にする必要があります。このエラーは、前に報告されたエラーに関係する場合があります。
ko: 형식 인수의 수가 일치하지 않습니다. '{0}'개가 제공되었는데 '{1}'개가 필요합니다. 이전에 보고된 오류와 관련된 현상일 수 있습니다.
pl: Liczba argumentów typu nie jest zgodna. Podana liczba: „{0}”; oczekiwana liczba: „{1}”. Może to być związane z wcześniej zgłoszonym błędem.
pt_br: O número de argumentos de tipo não corresponde: '{0}' fornecido, '{1}' esperado. Isso pode estar relacionado a um erro relatado anteriormente.
ru: Число аргументов типа не совпадает. Задано: {0}, ожидалось: {1}. Это может быть связано с ошибкой, о которой сообщалось ранее.
tr: Tür bağımsız değişkenlerinin sayısı eşleşmedi: '{0}' verildi, '{1}' bekleniyordu. Bu, önceden bildirilmiş bir hatayla ilişkili olabilir.
zh_hans: 类型参数的数量不匹配: 提供了“{0}”个，应是“{1}”个。这可能与以前报告的错误有关。
zh_hant: 型別引數的數目不符: 提供了 '{0}'，但必須是 '{1}'。這可能與先前報告的錯誤有關。

# tcCannotOverrideSealedMethod
source: Cannot override inherited member '{0}' because it is sealed
cs: Zděděný člen {0} se nedá přepsat, protože je zapečetěný.
de: Der geerbte Member '{0}' kann nicht überschrieben werden, da er versiegelt ist.
es: No se puede invalidar el miembro heredado “{0}” porque está sellado.
fr: Impossible de remplacer le membre hérité '{0}', car il est sealed
it: Non è possibile eseguire l'override del membro ereditato '{0}' perché è sealed
ja: 継承されたメンバー '{0}' はシールされているため、オーバーライドできません
ko: 상속된 '{0}' 멤버는 봉인되어 있으므로 재정의할 수 없습니다.
pl: Nie można przesłonić dziedziczonego elementu członkowskiego „{0}”, ponieważ jest on zapieczętowany
pt_br: Não é possível substituir o membro herdado '{0}' porque ele é sealed
ru: Невозможно переопределить унаследованный элемент "{0}", поскольку он является запечатанным
tr: Devralınan üye '{0}' mühürlü olduğu için geçersiz kılınamıyor
zh_hans: 无法重写继承的成员“{0}”，因为该成员是密封的
zh_hant: 無法覆寫繼承的成員 '{0}'，因為它已密封
