Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# optsTargetProfile
source: Specify target framework profile of this assembly. Valid values are mscorlib, netcore or netstandard. Default - mscorlib
cs: Zadejte profil cílové architektury tohoto sestavení. Platné hodnoty jsou mscorlib, netcore nebo netstandard. Výchozí je mscorlib.
de: Geben Sie das Profil des Zielframeworks dieser Assembly an. Gültige Werte sind "mscorlib", "netcore" oder "netstandard". Standard – "mscorlib".
es: Especifique el perfil de la plataforma de destino de este ensamblado. Los valores válidos son mscorlib, netcore o netstandard. Valor predeterminado: mscorlib.
fr: Spécifiez le profil de la version cible du .NET Framework de cet assembly. Les valeurs valides sont mscorlib, netcore et netstandard. Valeur par défaut : mscorlib
it: Consente di specificare il profilo del framework di destinazione di questo assembly. I valori validi sono mscorlib, netcore o netstandard. Impostazione predefinita: mscorlib
ja: このアセンブリのターゲット フレームワーク プロファイルを指定します。有効な値は、mscorlib、netcore、netstandard のいずれかです。既定 - mscorlib
ko: 이 어셈블리의 대상 프레임워크 프로필을 지정하세요. 올바른 값은 mscorlib, netcore 또는 netstandard입니다. 기본값은 - mscorlib입니다.
pl: Określ profil platformy docelowej tego zestawu. Prawidłowe wartości to mscorlib, netcore lub netstandard. Wartość domyślna to mscorlib
pt_br: Especifique o perfil da estrutura de destino deste assembly. Os valores válidos são mscorlib, netcore ou netstandard. O padrão é mscorlib
ru: Укажите профиль целевой платформы этой сборки. Допустимые значения: mscorlib, netcore и netstandard. Значение по умолчанию — mscorlib.
tr: Bu bütünleştirilmiş kodun hedef çerçeve profilini belirtin. Geçerli değerler: mscorlib, netcore veya netstandard. Varsayılan: - mscorlib
zh_hans: 指定此程序集的目标框架配置文件。有效值为 mscorlib、netcore 或 netstandard。默认值为 - mscorlib
zh_hant: 指定此組件的目標 Framework 設定檔。有效值為 mscorlib 或 netcore 或 netstandard。預設值 - mscorlib

# optsEmitDebugInfoInQuotations
source: Emit debug information in quotations
cs: Generovat ladicí informace v uvozovkách
de: Debugginginformationen in Anführungszeichen ausgeben
es: Emitir información de depuración en expresiones de código delimitadas
fr: Émettre les informations de débogage entre quotations
it: Crea informazioni di debug in quotation
ja: デバッグ情報を引用符で囲んで生成します
ko: 인용구의 디버그 정보를 내보냅니다.
pl: Emituj informacje debugowania w cudzysłowach
pt_br: Emitir informações de depuração entre aspas
ru: Вывод отладочной информации в кавычках
tr: Tırnak içindeki hata ayıklama bilgilerini yay
zh_hans: 发出用引号引起来的调试信息
zh_hant: 發出在引號內的偵錯資訊

# optsPreferredUiLang
source: Specify the preferred output language culture name (e.g. es-ES, ja-JP)
cs: Zadejte preferovaný název jazykové verze (např. es-ES, ja-JP).
de: Namen der bevorzugten Ausgabesprachenkultur angeben (z. B. "es-ES", "ja-JP")
es: Especifique la referencia cultural del idioma de salida que prefiera (por ejemplo, es-ES, ja-JP)
fr: Spécifiez le nom de culture de la langue de sortie par défaut (exemple : es-ES, ja-JP)
it: Consente di specificare il nome delle impostazioni cultura di output preferite, ad esempio es-ES, it-IT
ja: 優先する出力用言語のカルチャ名を指定します (例: es-ES, ja-JP)
ko: 기본 출력 언어 문화권 이름 지정(예: es-ES, ja-JP)
pl: Określ nazwę kultury preferowanego języka wyjściowego (np. es-ES, ja-JP)
pt_br: Especifique o nome de cultura de idioma de saída preferencial (por exemplo, es-ES, ja-JP)
ru: Укажите предпочитаемое имя языка и региональных параметров (например, es-ES, ja-JP)
tr: Tercih edilen çıkış dili kültür adını (örn. es-ES, ja-JP) belirtin
zh_hans: 指定首选输出语言区域性名称(例如 es-ES、ja-JP)
zh_hant: 指定慣用輸出語言的文化特性名稱 (例如 es-ES、ja-JP)

# optsNoCopyFsharpCore
source: Don't copy FSharp.Core.dll along the produced binaries
cs: Nekopírujte FSharp.Core.dll k vytvářeným binárním souborům.
de: FSharp.Core.dll nicht zusammen mit den generierten Binärdateien kopieren
es: No copiar FSharp.Core.dll con los archivos binarios producidos
fr: Ne pas copier FSharp.Core.dll avec les fichiers binaires produits
it: Non copia FSharp.Core.dll con i file binari prodotti
ja: 生成したバイナリと共に FSharp.Core.dll をコピーしないでください
ko: FSharp.Core.dll을 생성된 바이너리와 함께 복사하지 않음
pl: Nie kopiuj pliku FSharp.Core.dll wraz z utworzonymi plikami binarnymi
pt_br: Não copiar FSharp.Core.dll nos binários produzidos
ru: Не копировать FSharp.Core.dll вместе с созданными двоичными файлами
tr: FSharp.Core.dll dosyasını üretilen ikili dosyalarla birlikte kopyalama
zh_hans: 请勿从已生成的二进制文件中复制 FSharp.Core.dll
zh_hant: 不同時複製 FSharp.Core.dll 及所產生的二進位檔案

# optsInvalidSubSystemVersion
source: Invalid version '{0}' for '--subsystemversion'. The version must be 4.00 or greater.
cs: Neplatná verze {0} pro --subsystemversion. Správná verze je 4.00 nebo vyšší.
de: Ungültige Version '{0}' für '--subsystemversion'. Die Version muss 4.00 oder höher sein.
es: Versión '{0}' no válida de '--subsystemversion'. La versión debe ser 4.00 o posterior.
fr: Version '{0}' non valide pour '--subsystemversion'. La version doit être 4.00 ou supérieure.
it: Versione '{0}' non valida per '--subsystemversion'. La versione deve essere 4.00 o successiva.
ja: '--subsystemversion' のバージョン '{0}' が無効です。バージョンは 4.00 以上でなければなりません。
ko: '--subsystemversion'의 버전 '{0}'이(가) 잘못되었습니다. 버전은 4.00 이상이어야 합니다.
pl: Nieprawidłowa wersja „{0}” dla opcji „--subsystemversion”. Wymagana jest wersja 4.00 lub nowsza.
pt_br: Versão inválida '{0}' para '--subsystemversion'. A versão deve ser 4.00 ou posterior.
ru: Недопустимая версия "{0}" для "--subsystemversion". Должна быть версия 4.00 или больше.
tr: '--subsystemversion' için geçersiz sürüm '{0}'. Sürümün 4.00 veya üzeri olması gerekir.
zh_hans: “--subsystemversion”的版本“{0}”无效。版本必须为 4.00 或更高版本。
zh_hant: '--subsystemversion' 的版本 '{0}' 無效。版本必須是 4.00 (含) 以上版本。

# optsInvalidTargetProfile
source: Invalid value '{0}' for '--targetprofile', valid values are 'mscorlib', 'netcore' or 'netstandard'.
cs: Neplatná hodnota {0} pro --targetprofile. Platné hodnoty jsou mscorlib, netcore nebo netstandard.
de: Ungültiger Wert "{0}" für "--targetprofile", gültige Werte sind "mscorlib", "netcore" oder "netstandard".
es: Valor "{0}" no válido para "--targetprofile", los valores válidos son "mscorlib", "netcore" o "netstandard".
fr: Valeur non valide '{0}' pour '--targetprofile'. Les valeurs valides sont 'mscorlib', 'netcore' et 'netstandard'.
it: Valore '{0}' non valido per '--targetprofile'. I valori validi sono 'mscorlib', 'netcore' o 'netstandard'.
ja: '--targetprofile' の値 '{0}' が無効です。有効な値は 'mscorlib'、'netcore'、'netstandard' のいずれかです。
ko: '--targetprofile'에 대한 값 '{0}'이(가) 잘못되었습니다. 올바른 값은 'mscorlib', 'netcore' 또는 'netstandard'입니다.
pl: Nieprawidłowa wartość „{0}” dla opcji „--targetprofile”. Prawidłowe wartości to „mscorlib”, „netcore” lub „netstandard”.
pt_br: Valor inválido '{0}' para '--targetprofile', os valores válidos são 'mscorlib', 'netcore' ou 'netstandard'.
ru: Недопустимое значение "{0}" параметра --targetprofile; допустимые значения: mscorlib, netcore и netstandard.
tr: '--targetprofile' için geçersiz değer: '{0}'; geçerli değerler: 'mscorlib', 'netcore' veya 'netstandard'.
zh_hans: --targetprofile 的值“{0}”无效，有效值为 "mscorlib"、"netcore" 或 "netstandard"。
zh_hant: '--targetprofile' 的值 '{0}' 無效。有效值為 'mscorlib'、'netcore' 或 'netstandard'。

# typeInfoFullName
source: Full name
cs: Úplný název
de: Vollständiger Name
es: Nombre completo
fr: Nom complet
it: Nome completo
ja: 完全名
ko: 전체 이름
pl: Pełna nazwa
pt_br: Nome completo
ru: Полное имя
tr: Tam ad
zh_hans: 全名
zh_hant: 完整名稱

# typeInfoOtherOverloads
source: and {0} other overloads
cs: a další přetížení ({0})
de: und {0} weitere Überladungen
es: y otras {0} sobrecargas
fr: et {0} autres surcharges
it: e altri {0} overload
ja: およびその他の {0} 個のオーバーロード
ko: 및 기타 오버로드 {0}개
pl: i inne przeciążenia ({0})
pt_br: e {0} outras sobrecargas
ru: и {0} других перегрузок
tr: ve {0} başka aşırı yükleme
zh_hans: 和 {0} 个其他重载
zh_hant: 和 {0} 個其他多載

# typeInfoUnionCase
source: union case
cs: případ typu union
de: Union-Fall
es: caso de unión
fr: cas d'union
it: case di unione
ja: 共用体ケース
ko: 공용 구조체 케이스
pl: przypadek unii
pt_br: caso união
ru: ветвь объединения
tr: birleşim durumu
zh_hans: 联合用例
zh_hant: 聯集

# typeInfoActivePatternResult
source: active pattern result
cs: výsledek aktivního vzoru
de: aktives Musterergebnis
es: resultado de patrón activo
fr: résultat du modèle actif
it: risultato criteri attivi
ja: アクティブ パターンの結果
ko: 활성 패턴 결과
pl: wynik aktywnego wzorca
pt_br: resultado padrão ativo
ru: активный результат шаблона
tr: etkin desen sonucu
zh_hans: 活动模式结果
zh_hant: 現用模式結果

# typeInfoActiveRecognizer
source: active recognizer
cs: aktivní rozlišovač
de: aktive Erkennung
es: reconocedor activo
fr: module de reconnaissance actif
it: riconoscimento attivo
ja: アクティブ レコグナイザー
ko: 활성 인식기
pl: aktywny aparat rozpoznawania
pt_br: reorganizador ativo
ru: активный распознаватель
tr: etkin tanıyıcı
zh_hans: 活动识别器
zh_hant: 現用辨識器

# typeInfoField
source: field
cs: pole
de: Feld
es: Campo
fr: Champ
it: campo
ja: フィールド
ko: 필드
pl: pole
pt_br: Campo
ru: Поле
tr: alan
zh_hans: 字段
zh_hant: 欄位

# typeInfoEvent
source: event
cs: událost
de: Ereignis
es: evento
fr: événement
it: evento
ja: イベント
ko: 이벤트
pl: zdarzenie
pt_br: evento
ru: событие
tr: olay
zh_hans: 事件
zh_hant: 事件

# typeInfoProperty
source: property
cs: vlastnost
de: Eigenschaft
es: Propiedad
fr: propriété
it: proprietà
ja: プロパティ
ko: 속성
pl: właściwość
pt_br: Propriedade.
ru: Свойство
tr: özellik
zh_hans: 属性
zh_hant: 屬性

# typeInfoExtension
source: extension
cs: rozšíření
de: Erweiterung
es: Extensión
it: Estensione
ja: 拡張子
ko: 확장
pl: rozszerzenie
pt_br: Extensão
ru: Расширение
tr: uzantı
zh_hans: 扩展
zh_hant: 擴充功能

# typeInfoCustomOperation
source: custom operation
cs: vlastní operace
de: Benutzerdefinierter Vorgang
es: operación personalizada
fr: opération personnalisée
it: operazione personalizzata
ja: カスタム操作
ko: 사용자 지정 연산
pl: operacja niestandardowa
pt_br: operação personalizada
ru: пользовательская операция
tr: özel işlem
zh_hans: 自定义运算
zh_hant: 自訂作業

# typeInfoPatternVariable
source: patvar
cs: proměnná vzoru
pl: zmienna wzorca

# typeInfoNamespace
source: namespace
cs: obor názvů
es: espacio de nombres
fr: espace de noms
it: spazio dei nomi
ja: 名前空間
ko: 네임스페이스
pl: przestrzeń nazw
ru: пространство имен
tr: ad alanı
zh_hans: 命名空间
zh_hant: 命名空間

# typeInfoModule
source: module
cs: modul
de: Modul
es: módulo
it: modulo
ja: モジュール
ko: 모듈
pl: moduł
pt_br: módulo
ru: модуль
tr: modül
zh_hans: 模块
zh_hant: 模組

# typeInfoNamespaceOrModule
source: namespace/module
cs: obor názvů nebo modul
de: Namespace/Modul
es: espacio de nombres o módulo
fr: espace de noms/module
it: spazio dei nomi/modulo
ja: 名前空間/モジュール
ko: 네임스페이스/모듈
pl: przestrzeń nazw/moduł
pt_br: namespace/módulo
ru: пространство имен/модуль
tr: ad alanı/modül
zh_hans: 命名空间/模块
zh_hant: 命名空間/模組

# typeInfoFromFirst
source: from {0}
cs: z: {0}
de: aus {0}
es: desde {0}
fr: de {0}
it: da {0}
ja: {0} から
ko: 소스: {0}
pl: z {0}
pt_br: de {0}
ru: из {0}
tr: Şuradan: {0}
zh_hans: 自 {0}
zh_hant: 來自 {0}

# typeInfoFromNext
source: also from {0}
cs: taky z: {0}
de: ebenfalls von {0}
es: también desde {0}
fr: également de {0}
it: anche da {0}
ja: また、{0} から
ko: 공동 소스: {0}
pl: również z {0}
pt_br: também de {0}
ru: также из {0}
tr: ayrıca {0} öğesinden
zh_hans: 也自 {0}
zh_hant: 也來自 {0}

# typeInfoGeneratedProperty
source: generated property
cs: generovaná vlastnost
de: Generierte Eigenschaft
es: propiedad generada
fr: propriété générée
it: proprietà generata
ja: 生成されたプロパティ
ko: 생성된 속성
pl: wygenerowana właściwość
pt_br: propriedade gerada
ru: созданное свойство
tr: oluşturulan özellik
zh_hans: 生成的属性
zh_hant: 產生的屬性

# typeInfoGeneratedType
source: generated type
cs: generovaný typ
de: Generierter Typ
es: tipo generado
fr: type généré
it: tipo generato
ja: 生成された型
ko: 생성된 형식
pl: wygenerowany typ
pt_br: tipo gerado
ru: созданный тип
tr: oluşturulan tür
zh_hans: 生成的类型
zh_hant: 產生的類型

# assemblyResolutionFoundByAssemblyFoldersKey
source: Found by AssemblyFolders registry key
cs: Nalezené klíčem registru AssemblyFolders
de: Von AssemblyFolders-Registrierungsschlüssel gefunden
es: Encontrado por la clave del Registro AssemblyFolders.
fr: Trouvée par la clé de Registre AssemblyFolders
it: Trovata mediante la chiave del Registro di sistema AssemblyFolders
ja: AssemblyFolders レジストリ キーによって検出されました
ko: AssemblyFolders 레지스트리 키로 찾았습니다.
pl: Znalezione przez klucz rejestru AssemblyFolders
pt_br: Localizada pela chave de registro AssemblyFolders
ru: Найдено по разделу реестра AssemblyFolders
tr: AssemblyFolders kayıt defteri anahtarı ile bulunur
zh_hans: 已由 AssemblyFolders 注册表项找到
zh_hant: 依 AssemblyFolders 登錄機碼找到

# assemblyResolutionFoundByAssemblyFoldersExKey
source: Found by AssemblyFoldersEx registry key
cs: Nalezené klíčem registru AssemblyFoldersEx
de: Von AssemblyFoldersEx-Registrierungsschlüssel gefunden
es: Encontrado por la clave del Registro AssemblyFoldersEx.
fr: Trouvée par la clé de Registre AssemblyFoldersEx
it: Trovata mediante chiave del Registro di sistema AssemblyFoldersEx
ja: AssemblyFoldersEx レジストリ キーによって検出されました
ko: AssemblyFoldersEx 레지스트리 키로 찾았습니다.
pl: Znalezione przez klucz rejestru AssemblyFoldersEx
pt_br: Localizada pela chave de registro AssemblyFoldersEx
ru: Найдено по разделу реестра AssemblyFoldersEx
tr: AssemblyFoldersEx kayıt defteri anahtarı ile bulunur
zh_hans: 已由 AssemblyFoldersEx 注册表项找到
zh_hant: 依 AssemblyFoldersEx 登錄機碼找到

# assemblyResolutionGAC
source: Global Assembly Cache
cs: Globální mezipaměť sestavení
de: Globaler Assemblycache
es: Caché global de ensamblados
ja: グローバル アセンブリ キャッシュ
ko: 전역 어셈블리 캐시
pl: Globalna pamięć podręczna zestawów
pt_br: Cache de Assembly Global
ru: Глобальный кэш сборок
tr: Genel Bütünleştirilmiş Kod Önbelleği
zh_hans: 全局程序集缓存
zh_hant: 全域組件快取

# recursiveClassHierarchy
source: Recursive class hierarchy in type '{0}'
cs: Rekurzivní hierarchie tříd u typu {0}
de: Rekursive Klassenhierarchie in Typ "{0}".
es: Jerarquía de clases recursiva en el tipo '{0}'.
fr: Hiérarchie de classes récursive dans le type '{0}'
it: Gerarchia di classi ricorsiva nel tipo '{0}'
ja: 型 '{0}' の再帰的クラス階層
ko: '{0}' 형식에 재귀적 클래스 계층 구조가 있습니다.
pl: Cykliczna hierarchia klas w typie „{0}”
pt_br: Hierarquia de classe recursiva no tipo '{0}'
ru: Рекурсивная иерархия классов в типе "{0}"
tr: '{0}' türünde özyinelemeli sınıf hiyerarşisi
zh_hans: 类型“{0}”中的递归类层次结构
zh_hant: 類型 '{0}' 中有遞迴的類別階層

# InvalidRecursiveReferenceToAbstractSlot
source: Invalid recursive reference to an abstract slot
cs: Neplatný rekurzivní odkaz na abstraktní datovou oblast
de: Ungültiger rekursiver Verweis auf einen abstrakten Umsetzungsplatz.
es: Referencia recursiva no válida a una ranura abstracta.
fr: Référence récursive non valide à un emplacement abstrait
it: Riferimento ricorsivo non valido a uno slot astratto
ja: 抽象スロットに対する再帰的参照が無効です
ko: 추상 슬롯에 대한 재귀 참조가 잘못되었습니다.
pl: Nieprawidłowe odwołanie cykliczne do miejsca abstrakcyjnego
pt_br: Referência recursiva inválida para um slot abstrato
ru: Недопустимая рекурсивная ссылка на абстрактный слот
tr: Soyut yuvaya geçersiz özyinelemeli başvuru
zh_hans: 对抽象槽的递归引用无效
zh_hant: 抽象位置的遞迴參考無效

# eventHasNonStandardType
source: The event '{0}' has a non-standard type. If this event is declared in another CLI language, you may need to access this event using the explicit {1} and {2} methods for the event. If this event is declared in F#, make the type of the event an instantiation of either 'IDelegateEvent<_>' or 'IEvent<_,_>'.
cs: Událost {0} je nestandardního typu. Pokud je tato událost deklarovaná v jiném jazyce CLI, bude možná potřeba k této události přistoupit pomocí jejích explicitních metod {1} a {2}. Pokud je tato událost deklarovaná v jazyce F#, vytvořte její typ jako instanci IDelegateEvent<_> nebo IEvent<_,_>.
de: Das Ereignis "{0}" enthält einen Nichtstandardtyp. Wenn dieses Ereignis in einer anderen CLI-Sprache deklariert ist, müssen Sie auf dieses Ereignis über die expliziten {1}- und {2}-Methoden für das Ereignis zugreifen. Wenn dieses Ereignis in F# deklariert ist, sollten Sie den Typ des Ereignisses auf eine Instanziierung von "IDelegateEvent<_>" oder "IEvent<_,_>" festlegen.
es: El evento "{0}" tiene un tipo no estándar. Si este evento se declara en otro lenguaje CLI, puede que necesite acceder a este evento con los métodos {1} y {2} explícitos para el evento. Si este evento se declara en F#, cree instancias del evento de "IDelegateEvent<_>" o "IEvent<_,_>".
fr: L'événement '{0}' a un type non standard. Si cet événement est déclaré dans un autre langage CLI, vous pouvez avoir besoin d'y accéder à l'aide des méthodes explicites {1} et {2} pour l'événement. Si cet événement est déclaré en F#, le type de l'événement doit être une instanciation de 'IDelegateEvent<_>' ou 'IEvent<_,_>'.
it: L'evento '{0}' ha un tipo non standard. Se l'evento è dichiarato in un altro linguaggio CLI, potrebbe essere necessario accedere all'evento mediante i metodi espliciti {1} e {2} per l'evento stesso. Se l'evento è dichiarato in F#, rendere il tipo dell'evento una creazione di istanza di 'IDelegateEvent<_>' o 'IEvent<_,_>'.
ja: イベント '{0}' には非標準の型が含まれています。このイベントが別の CLI 言語で宣言されると、イベントの明示的な {1} メソッドと {2} メソッドを使用してこのイベントにアクセスしなければならない場合があります。このイベントが F# で宣言される場合には、イベントの種類を 'IDelegateEvent<_>' または 'IEvent<_,_>' のどちらかのインスタンスにします。
ko: '{0}' 이벤트에 비표준 형식이 있습니다. 이 이벤트가 다른 CLI 언어로 선언된 경우 이벤트에 대한 명시적 {1} 및 {2} 메서드를 사용하여 이 이벤트에 액세스해야 할 수 있습니다. 이 이벤트가 F#으로 선언된 경우에는 이벤트의 형식을 'IDelegateEvent<_>' 또는 'IEvent<_,_>'의 인스턴스로 만드세요.
pl: Zdarzenie „{0}” ma niestandardowy typ. Jeśli to zdarzenie zadeklarowano w innym języku interfejsu CLI, może być konieczne uzyskanie dostępu do tego zdarzenia przy użyciu jawnych metod {1} i {2} zdarzenia. Jeśli to zdarzenie zadeklarowano w języku F#, określ typ zdarzenia jako wystąpienie interfejsu „IDelegateEvent<_>” lub „IEvent<_,_>”.
pt_br: O evento '{0}' tem um tipo não padrão. Se este evento for declarado em outra linguagem CLI, você poderá precisar acessar este evento com o uso de {1} explícito e métodos {2} para ele. Se este evento estiver declarado em F#, faça o tipo de evento também ser uma instanciação de 'IDelegateEvent<_>' ou 'IEvent<_,_>'.
ru: Событие "{0}" имеет нестандартный тип. Если это событие объявлено на другом языке CLI, для доступа к этому событию могут потребоваться явные методы {1} и {2}. Если это событие объявлено на языке F #, укажите тип инициализации события 'IDelegateEvent<_>' или 'IEvent<_,_>'.
tr: '{0}' olayının standart olmayan bir türü var. Bu olay başka bir CLI dilinde bildirilmişse, bu olaya olay için açık {1} ve {2} metotlarını kullanarak erişmeniz gerekebilir. Bu olay F# dilinde belirtilmişse olayın türünü 'IDelegateEvent<_>' veya 'IEvent<_,_>' örnek oluşturması yapın.
zh_hans: 事件“{0}”具有非标准类型。如果此事件是在另一种 CLI 语言中声明的，则你可能需要使用此事件的显式 {1} 和 {2} 方法来访问此事件。如果此事件是在 F# 中声明的，则使此事件的类型成为 "IDelegateEvent<_>" 或 "IEvent<_,_>" 的实例化。
zh_hant: 事件 '{0}' 有非標準的類型。若使用了另一種 CLI 語言宣告這個事件，您可能必須對這個事件使用明確的 {1} 和 {2} 方法加以存取。若使用了 F# 宣告這個事件，請讓事件類型成為 'IDelegateEvent<_>' 或 'IEvent<_,_>' 的具現化。

# typeIsNotAccessible
source: The type '{0}' is not accessible from this code location
cs: Typ {0} není z tohoto místa v kódu dostupný.
de: Auf den Typ "{0}" kann von dieser Position im Code nicht zugegriffen werden.
es: El tipo '{0}' no es accesible desde este lugar del código.
fr: Le type '{0}' n'est pas accessible à partir de cet emplacement du code
it: Il tipo '{0}' non è accessibile da questa posizione di codice
ja: 型 '{0}' はこのコードの場所からアクセスできません
ko: '{0}' 형식은 이 코드 위치에서 액세스할 수 없습니다.
pl: Nie można uzyskać dostępu do typu „{0}” z tej lokalizacji kodu
pt_br: O tipo '{0}' não é acessível deste local do código
ru: Тип "{0}" недоступен из данного расположения в коде
tr: Bu '{0}' türüne bu kod konumundan erişilemiyor
zh_hans: 无法从此代码位置访问类型“{0}”
zh_hant: 無法從這個程式碼位置存取類型 '{0}'

# unionCasesAreNotAccessible
source: The union cases or fields of the type '{0}' are not accessible from this code location
cs: Případy typu union nebo pole typu {0} nejsou z tohoto místa v kódu dostupné.
de: Auf die Union-Fälle oder Felder des Typs "{0}" kann von dieser Position im Code nicht zugegriffen werden.
es: Los casos de unión o campos del tipo '{0}' no son accesibles desde este lugar del código.
fr: Les cas d'union ou champs du type '{0}' ne sont pas accessibles à partir de cet emplacement du code
it: I campi o i case di unione del tipo '{0}' non sono accessibili da questa posizione di codice
ja: 型 '{0}' の共用体ケースまたはフィールドは、このコードの場所からアクセスできません
ko: '{0}' 형식의 공용 구조체 케이스 또는 필드는 이 코드 위치에서 액세스할 수 없습니다.
pl: Nie można uzyskać dostępu do przypadków unii lub pól typu „{0}” z tej lokalizacji kodu
pt_br: Os casos união ou campos do tipo '{0}' não são acessíveis deste local de código
ru: Случаи объединения или поля типа "{0}" недоступны из данного расположения в коде
tr: '{0}' türünün birleşim durumlarına veya alanlarına bu kod konumundan erişilemiyor
zh_hans: 无法从此代码位置访问类型“{0}”的联合用例或字段
zh_hant: 無法從這個程式碼位置存取類型 '{0}' 的聯集或欄位

# valueIsNotAccessible
source: The value '{0}' is not accessible from this code location
cs: Hodnota {0} není z tohoto místa v kódu dostupná.
de: Auf den Wert "{0}" kann von dieser Position im Code nicht zugegriffen werden.
es: El valor '{0}' no es accesible desde este lugar del código.
fr: La valeur '{0}' n'est pas accessible à partir de cet emplacement du code
it: Il valore '{0}' non è accessibile da questa posizione di codice
ja: 値 '{0}' はこのコードの場所からアクセスできません
ko: 값 '{0}'은(는) 이 코드 위치에서 액세스할 수 없습니다.
pl: Nie można uzyskać dostępu do wartości „{0}” z tej lokalizacji kodu
pt_br: O valor '{0}' não é acessível deste local de código
ru: Значение "{0}" недоступно из данного расположения в коде
tr: '{0}' değerine bu kod konumundan erişilemiyor
zh_hans: 无法从此代码位置访问值“{0}”
zh_hant: 無法從這個程式碼位置存取值 '{0}'

# unionCaseIsNotAccessible
source: The union case '{0}' is not accessible from this code location
cs: Případ typu union {0} není z tohoto místa v kódu dostupný.
de: Auf den Union-Fall "{0}" kann von dieser Position im Code nicht zugegriffen werden.
es: El caso de unión '{0}' no es accesible desde este lugar del código.
fr: Le cas d'union '{0}' n'est pas accessible à partir de cet emplacement du code
it: Il case di unione '{0}' non è accessibile da questa posizione di codice
ja: 共用体ケース '{0}' はこのコードの場所からアクセスできません
ko: 공용 구조체 케이스 '{0}'은(는) 이 코드 위치에서 액세스할 수 없습니다.
pl: Nie można uzyskać dostępu do przypadku unii „{0}” z tej lokalizacji kodu
pt_br: O caso união '{0}' não está acessível deste local de código
ru: Случай объединения "{0}" недоступен из данного расположения в коде
tr: '{0}' birleşim durumuna bu kod konumundan erişilemiyor
zh_hans: 无法从此代码位置访问联合用例“{0}”
zh_hant: 無法從這個程式碼位置存取聯集 '{0}'

# fieldIsNotAccessible
source: The record, struct or class field '{0}' is not accessible from this code location
cs: Pole záznamu, struktury nebo třídy {0} není z tohoto místa v kódu dostupné.
de: Auf das Datensatz-, Struktur- oder Klassenfeld "{0}" kann von dieser Position im Code nicht zugegriffen werden.
es: El campo de clase, registro o struct '{0}' no es accesible desde este lugar del código.
fr: Le champ de type enregistrement, struct ou classe '{0}' n'est pas accessible à partir de cet emplacement du code
it: Il campo di classe, record o struct '{0}' non è accessibile da questa posizione di codice
ja: レコード、構造体、またはクラスのフィールド '{0}' はこのコードの場所からアクセスできません
ko: 레코드, 구조체 또는 클래스 필드 '{0}'은(는) 이 코드 위치에서 액세스할 수 없습니다.
pl: Pole rekordu, struktury lub klasy „{0}” jest niedostępne w tej lokalizacji kodu
pt_br: O campo de registro, struct ou classe '{0}' não está acessível neste local de código
ru: Поле записи, структуры или класса "{0}" недоступно из этой точки кода
tr: Record, struct veya class alanı '{0}' öğesine bu kod konumundan erişilemiyor
zh_hans: 无法从此代码位置访问记录、结构或类字段“{0}”
zh_hant: 無法從這個程式碼位置存取記錄、結構或類別欄位 '{0}'
