Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# optsNameOfOutputFile
source: Name of the output file (Short form: -o)
cs: Název výstupního souboru (krátký tvar: -o)
de: Name der Ausgabedatei (Kurzform: -o)
es: Nombre del archivo de salida (forma corta: -o)
fr: Nom du fichier de sortie (forme abrégée : -o)
it: Nome del file di output (forma breve: -o)
ja: 出力ファイルの名前 (短い形式: -o)
ko: 출력 파일의 이름입니다(약식: -o).
pl: Nazwa pliku wyjściowego (krótka wersja: -o)
pt_br: Nome do arquivo de saída (Forma abreviada: -o)
ru: Имя выходного файла (краткая форма: -o)
tr: Çıkış dosyasının adı (Kısa biçimi: -o)
zh_hans: 输出文件的名称(缩写: -o)
zh_hant: 輸出檔的名稱 (簡短形式: -o)

# optsBuildConsole
source: Build a console executable
cs: Vytvoří spustitelný soubor konzoly.
de: Ausführbare Konsolendatei erstellen
es: Compilar un archivo ejecutable de consola
fr: Générer un fichier exécutable console
it: Compila un file eseguibile da console
ja: コンソール実行可能ファイルをビルドします
ko: 콘솔 실행 파일을 빌드합니다.
pl: Kompiluj plik wykonywalny konsoli
pt_br: Criar um executável de console
ru: Собрать консольный исполняемый файл
tr: Çalıştırılabilir konsol dosyası oluştur
zh_hans: 生成控制台可执行文件
zh_hant: 建置主控台可執行檔

# optsBuildWindows
source: Build a Windows executable
cs: Vytvoří spustitelný soubor systému Windows.
de: Ausführbare Windows-Datei erstellen
es: Compilar un archivo ejecutable de Windows
fr: Générer un fichier exécutable Windows
it: Compila un file eseguibile Windows
ja: Windows 実行可能ファイルをビルドします
ko: Windows 실행 파일을 빌드합니다.
pl: Kompiluj plik wykonywalny systemu Windows
pt_br: Criar um executável do Windows
ru: Выполнить сборку исполняемого файла Windows
tr: Windows yürütülebilir dosyası oluştur
zh_hans: 生成 Windows 可执行文件
zh_hant: 建置 Windows 可執行檔

# optsBuildLibrary
source: Build a library (Short form: -a)
cs: Vytvoří knihovnu (krátký tvar: -a).
de: Bibliothek erstellen (Kurzform: -a)
es: Compilar una biblioteca (forma corta: -a)
fr: Générer une bibliothèque (forme abrégée : -a)
it: Compila una libreria (forma breve: -a)
ja: ライブラリをビルドします (短い形式: -a)
ko: 라이브러리를 빌드합니다(약식: -a).
pl: Kompiluj bibliotekę (krótka wersja: -a)
pt_br: Criar uma biblioteca (Forma abreviada: -a)
ru: Собрать библиотеку (краткая форма: -a)
tr: Kitaplık oluştur (Kısa biçimi: -a)
zh_hans: 生成库(缩写: -a)
zh_hant: 建置程式庫 (簡短形式: -a)

# optsBuildModule
source: Build a module that can be added to another assembly
cs: Vytvoří modul, který se dá přidat do jiného sestavení
de: Modul erstellen, das einer anderen Assembly hinzugefügt werden kann
es: Compilar un módulo que se pueda agregar a otro ensamblado
fr: Générer un module qui peut être ajouté à un autre assembly
it: Compila un modulo che può essere aggiunto ad altro assembly
ja: 別のアセンブリに追加できるモジュールをビルドします
ko: 다른 어셈블리에 추가될 수 있는 모듈을 빌드합니다.
pl: Kompiluj moduł, który można będzie dodać do innego zestawu
pt_br: Criar um módulo que possa ser adicionado a outro assembly
ru: Сборка модуля, который может быть добавлен в другую сборку
tr: Başka bir derlemeye eklenebilir bir modül oluştur
zh_hans: 生成可添加到其他程序集的模块
zh_hant: 建置可以加入至其他組件的模組

# optsDelaySign
source: Delay-sign the assembly using only the public portion of the strong name key
cs: Vytvoří zpožděný podpis sestavení jenom s využitím veřejné části klíče silného názvu.
de: Assembly nur mit dem öffentlichen Teil des Schlüssels für einen starken Namen verzögert signieren
es: Retrasar la signatura del ensamblado usando solo la parte pública de la clave de nombre seguro
fr: Différer la signature de l'assembly en utilisant uniquement la partie publique de la clé de nom fort
it: Ritarda la firma dell'assembly utilizzando solo la parte pubblica della chiave con nome sicuro
ja: 厳密名キーのパブリックな部分のみを使ってアセンブリを遅延署名します
ko: 강력한 이름 키의 공개 부분만 사용하여 어셈블리 서명을 연기합니다.
pl: Podpisz zestaw z opóźnieniem, używając tylko publicznej części klucza o silnej nazwie
pt_br: Assinatura atrasada do assembly usando somente a parte pública da chave de nome forte
ru: Использовать отложенную подпись для сборки, используя только открытую часть ключа строгого имени
tr: Derlemeyi tanımlayıcı ad anahtarının yalnızca ortak kısmını kullanarak gecikmeli imzala
zh_hans: 仅使用强名称密钥的公共部分对程序集进行延迟签名
zh_hant: 只使用強式名稱金鑰的公開金鑰延遲簽署組件

# optsPublicSign
source: Public-sign the assembly using only the public portion of the strong name key, and mark the assembly as signed
cs: Vytvoří veřejný podpis sestavení jenom s využitím veřejné části klíče silného názvu a označí sestavení jako podepsané.
de: Assembly mithilfe nur des öffentlichen Teils des Schlüssels für einen starken Namen öffentlich signieren und als signiert markieren
es: Firmar el ensamblado usando solo la parte pública de la clave de nombre seguro y marcarlo como firmado
fr: Signer publiquement l'assembly en utilisant uniquement la partie publique de la clé de nom fort, et marquer l'assembly comme signé
it: Firma pubblicamente l'assembly usando solo la parte pubblica della chiave con nome sicuro e contrassegna l'assembly come firmato
ja: 厳密な名前のキーの公開部分のみを使ってアセンブリを公開署名し、アセンブリを署名済みとしてマークします
ko: 강력한 이름 키의 공개 부분만 사용하여 어셈블리를 공개 서명하고, 어셈블리를 서명됨으로 표시합니다.
pl: Podpisz zestaw na użytek publiczny za pomocą tylko publicznej części klucza o silnej nazwie i oznacz zestaw jako podpisany
pt_br: Assine de forma pública o assembly usando a única parte pública da chave de nome forte e marque o assembly como assinado
ru: Выполнить общедоступную подпись сборки, используя только открытую часть ключа строгого имени, и пометить сборку как подписанную
tr: Tanımlayıcı ad anahtarının yalnızca genel bölümünü kullanarak, bütünleştirilmiş kodu genel olarak imzala ve bütünleştirilmiş kodu imzalanmış olarak işaretle
zh_hans: 仅使用强名称密钥的公用部分对该程序集进行公开签名, 并将该程序集标记为已签名
zh_hant: 僅使用強式名稱金鑰的公開金鑰公開簽署組件，並將組件標記為已簽署

# optsWriteXml
source: Write the xmldoc of the assembly to the given file
cs: Zapsat xmldoc sestavení do daného souboru
de: XmlDoc der Assembly in angegebene Datei schreiben
es: Escribir el xmldoc del ensamblado en el archivo dado
fr: Écrire le xmldoc de l'assembly dans le fichier donné
it: Scrive lo xmldoc dell'assembly nel file specificato
ja: 指定したファイルにアセンブリの xmldoc を書き込みます
ko: 지정한 파일에 어셈블리의 xmldoc를 씁니다.
pl: Zapisz dokument XML zestawu w podanym pliku
pt_br: Gravar o xmldoc do assembly para o arquivo especificado
ru: Запись xmldoc сборки в заданный файл
tr: Bütünleştirilmiş kodun xmldoc dosyasını verilen dosyaya yaz
zh_hans: 将程序集的 xmldoc 写入到给定文件
zh_hant: 將組件的 xmldoc 寫入指定檔案

# optsStrongKeyFile
source: Specify a strong name key file
cs: Určuje soubor klíče se silným názvem.
de: Datei mit einem Schlüssel für einen starken Namen angeben
es: Especificar un archivo de clave de nombre seguro
fr: Spécifier un fichier de clé de nom fort
it: Specifica un file di chiave con nome sicuro
ja: 厳密名キー ファイルを指定します
ko: 강력한 이름의 키 파일을 지정합니다.
pl: Określ plik klucza o silnej nazwie
pt_br: Especificar um arquivo de chave de nome forte
ru: Укажите файл ключей строгого имени
tr: Tanımlayıcı ad anahtarı dosyası belirtin
zh_hans: 指定强名称密钥文件
zh_hant: 指定強式名稱金鑰檔

# optsStrongKeyContainer
source: Specify a strong name key container
cs: Určuje kontejner klíče se silným názvem.
de: Container mit einem Schlüssel für einen starken Namen angeben
es: Especificar un contenedor de claves de nombre seguro
fr: Spécifier un conteneur de clé de nom fort
it: Specifica un contenitore di chiavi con nome sicuro
ja: 厳密名キー コンテナーを指定します
ko: 강력한 이름의 키 컨테이너를 지정합니다.
pl: Określ kontener kluczy o silnej nazwie
pt_br: Especificar um contêiner de chave de nome forte
ru: Укажите контейнер ключей строгого имени
tr: Tanımlayıcı ad anahtarı kapsayıcısı belirtin
zh_hans: 指定强名称密钥容器
zh_hant: 指定強式名稱金鑰容器

# optsPlatform
source: Limit which platforms this code can run on: x86, Itanium, x64, anycpu32bitpreferred, or anycpu. The default is anycpu.
cs: Omezuje platformy, na kterých je možné tento kód spustit: x86, Itanium, x64, anycpu32bitpreferred a anycpu. Výchozí je anycpu.
de: Schränken Sie ein, auf welchen Plattformen dieser Code ausgeführt werden kann: "x86", "Itanium", "x64", "anycpu32bitpreferred" oder "anycpu". Der Standard ist "anycpu".
es: Limitar las plataformas en las que se puede ejecutar este código: x86, Itanium, x64, anycpu32bitpreferred o anycpu. El valor predeterminado es anycpu.
fr: Limiter les plateformes sur lesquelles ce code peut s'exécuter : x86, Itanium, x64, anycpu32bitpreferred ou anycpu. La valeur par défaut est anycpu.
it: Limita le piattaforme in cui è possibile eseguire il codice: x86, Itanium, x64, anycpu32bitpreferred o anycpu. Il valore predefinito è anycpu.
ja: このコードが実行されるプラットフォームの制限: x86、Itanium、x64、anycpu32bitpreferred、または anycpu。既定は anycpu です。
ko: 이 코드를 실행할 수 있는 플랫폼을 x86, Itanium, x64, anycpu32bitpreferred 또는 anycpu로 제한합니다. 기본값은 anycpu입니다.
pl: Ogranicz platformy, na jakich można uruchomić ten kod: x86, Itanium, x64, anycpu32bitpreferred lub anycpu. Domyślna platforma to anycpu.
pt_br: Limite em quais plataformas este código pode ser executado: x86, Itanium, x64, anycpu32bitpreferred ou anycpu. O padrão é anycpu.
ru: Выберите платформы, на которых может выполняться этот код: x86, Itanium, x64, anycpu32bitpreferred или anycpu. По умолчанию используется любой процессор (anycpu).
tr: Bu kodun üzerinde çalışabileceği platformları sınırlandırın: x86, Itanium, x64, anycpu32bitpreferred veya anycpu. Varsayılan: anycpu.
zh_hans: 限制可以运行此代码的平台: x86、Itanium、x64、anycpu32bitpreferred 或 anycpu。默认值为 anycpu。
zh_hant: 限制這個程式碼可以在哪些平台執行: x86、Itanium、x64、anycpu32bitpreferred 或 anycpu。預設為 anycpu。

# optsNoOpt
source: Only include optimization information essential for implementing inlined constructs. Inhibits cross-module inlining but improves binary compatibility.
cs: Zahrňte jenom informace o optimalizaci nutné k implementaci vložených konstruktorů. Deaktivuje se vkládání napříč moduly, ale zlepší se kompatibilita binárních souborů.
de: Binden Sie nur Optimierungsinformationen ein, die für die Implementierung von Inlinekonstrukten unbedingt erforderlich sind. Dies verhindert zwar modulübergreifende Inlinekonstrukte, verbessert aber die Binärkompatibilität.
es: Incluir solo información de optimización esencial para implementar construcciones inline. Inhibe la inserción entre módulos pero mejora la compatibilidad binaria.
fr: Inclure uniquement les informations d'optimisation essentielles à l'implémentation de constructions inline. Empêche l'incorporation (inlining) entre modules mais améliore la compatibilité binaire.
it: Include solo informazioni di ottimizzazione essenziali per l'implementazione dei costrutti inline. Impedisce l'incorporamento tra moduli ma migliora la compatibilità binaria.
ja: インライン コンストラクトの実装に必要な最適化情報のみを含めてください。モジュール間のインライン処理を禁止し、バイナリの互換性を改善してください。
ko: 인라인 구문을 구현하는 데 반드시 필요한 최적화 정보만 포함합니다. 크로스 모듈 인라인 처리가 금지되지만 이진 호환성은 개선됩니다.
pl: Dołącz tylko informacje o optymalizacji, które są istotne dla implementacji konstrukcji śródwierszowych. Uniemożliwia używanie konstrukcji śródwierszowych między modułami, ale zwiększa zgodność binarną.
pt_br: Inclua somente informações de otimização essenciais para a implementação de constructos embutidos. Isso inibe a integração dos módulos cruzados, mas aumenta a compatibilidade binária.
ru: Включать только данные оптимизации, необходимые для реализации встроенных конструкций. Отключение межмодульного встраивания и повышение совместимости на уровне двоичного кода.
tr: Yalnızca satır içindeki yapıları uygulamak için gerekli iyileştirme bilgilerini ekleyin. Modüller arasında satır içine yerleştirmeyi kısıtlar ancak ikili uyumluluğunu geliştirir.
zh_hans: 仅包含实现内联构造所必需的优化信息。禁止跨模块内联，但会提高二进制兼容性。
zh_hant: 只包含實作內嵌建構必要的最佳化資訊。禁止跨模組內嵌，但改進了二進位碼相容性。

# optsNoInterface
source: Don't add a resource to the generated assembly containing F#-specific metadata
cs: Nepřidávat prostředek do generovaného sestavení, které obsahuje metadata specifická pro F#
de: Der generierten Assembly mit F#-spezifischen Metadaten keine Ressource hinzufügen
es: No agregar un recurso al ensamblado generado que contiene metadatos específicos de F#
fr: N'ajouter aucune ressource à l'assembly généré contenant les métadonnées spécifiques F#
it: Non aggiunge una risorsa all'assembly generato contenente metadati specifici di F#
ja: F# 固有のメタデータを含む生成済みアセンブリにリソースを追加しないでください
ko: F# 관련 메타데이터를 포함하는 생성 어셈블리에 리소스를 추가하지 마세요.
pl: Nie dodawaj zasobu do wygenerowanego zestawu zawierającego metadane specyficzne dla języka F#
pt_br: Não adicione um recurso ao assembly gerado que contenha metadados específicos a F#
ru: Не добавлять ресурс к создаваемой сборке, содержащей специальные метаданные F#
tr: F#-özel meta verilerini içeren oluşturulmuş bütünleştirilmiş koda kaynak ekleme
zh_hans: 不向包含 F# 特定元数据的生成程序集中添加资源
zh_hant: 不將資源加入包含 F# 特有中繼資料的產生組件

# optsSig
source: Print the inferred interface of the assembly to a file
cs: Vytisknout odvozené rozhraní sestavení do souboru
de: Per Rückschluss abgeleitete Schnittstelle der Assembly in Datei ausgeben
es: Imprimir la interfaz inferida del ensamblado en un archivo
fr: Imprimer l'interface déduite de l'assembly dans un fichier
it: Stampa l'interfaccia dedotta dell'assembly in un file
ja: アセンブリの推論されたインターフェイスをファイルに出力します
ko: 어셈블리의 유추된 인터페이스를 파일에 출력합니다.
pl: Zapisz w pliku wnioskowany interfejs zestawu
pt_br: Imprimir interface deduzida do assembly para um arquivo
ru: Печатать выведенный интерфейс сборки в файл
tr: Bütünleştirilmiş kodun çıkartılan arabirimini dosyaya yazdır
zh_hans: 将推理出的程序集接口输出到文件
zh_hant: 將組件的推斷介面列印到檔案

# optsReference
source: Reference an assembly (Short form: -r)
cs: Odkazovat na sestavení (krátký tvar: -r)
de: Auf eine Assembly verweisen (Kurzform: -r)
es: Referencia a un ensamblado (forma corta: -r)
fr: Référencer un assembly (forme abrégée : -r)
it: Fa riferimento a un assembly (forma breve: -r)
ja: アセンブリを参照します (短い形式: -r)
ko: 어셈블리를 참조합니다(약식: -r).
pl: Utwórz odwołanie do zestawu (krótka wersja: -r)
pt_br: Referenciar um assembly (Forma abreviada: -r)
ru: Ссылка на сборку (краткая форма: -r)
tr: Bütünleştirilmiş koda başvur (Kısa biçimi: -r)
zh_hans: 引用一个程序集(缩写: -r)
zh_hant: 參考組件 (簡短形式: -r)

# optsWin32res
source: Specify a Win32 resource file (.res)
cs: Určuje soubor prostředků Win32 (.res).
de: Win32-Ressourcendatei (.res) angeben
es: Especificar el archivo de recursos Win32 (.res)
fr: Spécifier un fichier de ressources Win32 (.res)
it: Specifica un file di risorse Win32 (.res)
ja: Win32 リソース ファイル (.res) を指定します
ko: Win32 리소스 파일(.res)을 지정합니다.
pl: Określ plik zasobów Win32 (.res)
pt_br: Especificar um arquivo de recursos do Win32 (.res)
ru: Укажите файл ресурсов Win32 (.res)
tr: Win32 kaynak dosyası (.res) belirtin
zh_hans: 指定 Win32 资源文件(.res)
zh_hant: 指定 Win32 資源檔 (.res)

# optsWin32manifest
source: Specify a Win32 manifest file
cs: Zadat soubor manifestu Win32
de: Win32-Manifestdatei angeben
es: Especificar un archivo de manifiesto Win32
fr: Spécifier un fichier manifeste Win32
it: Specifica un file manifesto Win32
ja: Win32 マニフェスト ファイルを指定します
ko: Win32 매니페스트 파일을 지정합니다.
pl: Określ plik manifestu biblioteki Win32
pt_br: Especificar um arquivo de manifesto Win32
ru: Задать файл манифеста Win32
tr: Win32 bildirim dosyası belirt
zh_hans: 指定 Win32 清单文件
zh_hant: 指定 Win32 資訊清單檔案

# optsNowin32manifest
source: Do not include the default Win32 manifest
cs: Nezahrnovat výchozí manifest Win32
de: Win32-Standardmanifest nicht einschließen
es: No incluir el manifiesto Win32 predeterminado
fr: Ne pas inclure le manifeste Win32 par défaut
it: Non includere il manifesto Win32 predefinito
ja: 既定の Win32 マニフェストを含めないでください
ko: 기본 Win32 매니페스트를 포함하지 마세요.
pl: Nie dołączaj domyślnego manifestu Win32
pt_br: Não inclua o manifesto Win32 padrão
ru: Не включать манифест Win32 по умолчанию
tr: Varsayılan Win32 bildirimini eklemeyin
zh_hans: 不包括默认的 Win32 清单
zh_hant: 不要包含預設的 Win32 資訊清單

# optsEmbedAllSource
source: Embed all source files in the portable PDB file
cs: Vložit všechny zdrojové soubory do souboru PDB typu Portable
de: Alle Quelldateien in der portierbaren PDB-Datei einbetten
es: Inserta todos los archivos de código fuente en el archivo PDB portable.
fr: Incorporer tous les fichiers sources dans le fichier PDB portable
it: Incorpora tutti i file di origine nel file PDB portabile
ja: 移植可能な PDB ファイル内にすべてのソース ファイルを埋め込む
ko: 이식 가능한 PDB 파일에 모든 소스 파일 포함
pl: Osadź wszystkie pliki źródłowe w przenośnym pliku PDB
pt_br: Inserir todos os arquivos de origem no arquivo PDB portátil
ru: Внедрить все исходные файлы в переносимый PDB-файл
tr: Tüm kaynak dosyaları taşınabilir PDB dosyasına ekle
zh_hans: 将所有源文件嵌入可移植 PDB 文件
zh_hant: 內嵌可攜式 PDB 檔案中的所有來源檔案

# optsEmbedSource
source: Embed specific source files in the portable PDB file
cs: Vloží konkrétní zdrojové soubory do přenosného souboru PDB.
de: Bestimmte Quelldateien in der portierbaren PDB-Datei einbetten
es: Inserta archivos de código fuente específicos en el archivo PDB portable
fr: Incorporer des fichiers sources spécifiques dans le fichier PDB portable
it: Incorpora file di origine specifici nel file PDB portabile
ja: 移植可能な PDB ファイル内に特定のソース ファイルを埋め込む
ko: 이식 가능한 PDB 파일에 특정 소스 파일을 포함합니다.
pl: Osadź określone pliki źródłowe w przenośnym pliku PDB
pt_br: Inserir os arquivos de origem específicos no arquivo PDB portátil
ru: Внедрить конкретные исходные файлы в переносимый PDB-файл
tr: Belirli kaynak dosyaları taşınabilir PDB dosyasına ekle
zh_hans: 将特定源文件嵌入可移植 PDB 文件
zh_hant: 內嵌可攜式 PDB 檔案中的特定來源檔案

# optsSourceLink
source: Source link information file to embed in the portable PDB file
cs: Informační soubor zdrojového odkazu, který se má vložit do souboru PDB typu Portable
de: Die Datei mit Quelllinkinformationen, die in die portierbare PDB-Datei eingebettet werden soll
es: Archivo de información de vínculos de origen para insertar en el archivo PDB portable
fr: Fichier d'informations sur le lien source à incorporer dans le fichier PDB portable
it: File di informazioni sul collegamento all'origine da incorporare nel file PDB portabile
ja: 移植可能な PDB ファイルに埋め込むソース リンク情報ファイル
ko: 이식 가능한 PDB 파일에 포함할 소스 링크 정보 파일
pl: Plik informacji o linku kodu źródłowego do osadzenia w przenośnym pliku PDB
pt_br: O arquivo de informações do link de origem para inserir em um arquivo PDB portátil
ru: Файл со сведениями о компоновке источников, внедряемый в переносимый PDB-файл
tr: Taşınabilir PDB dosyasına eklenecek kaynak bağlantı bilgileri dosyası
zh_hans: 要嵌入可移植 PDB 文件中的源链接信息文件
zh_hant: 要內嵌於可攜式 PDB 檔案中的來源連結資訊檔案

# optsEmbeddedSourceRequirePortablePDBs
source: --embed switch only supported when emitting a Portable PDB (--debug:portable or --debug:embedded)
cs: Přepínač --embed se podporuje jenom při generování souboru PDB typu Portable (--debug:portable nebo --debug:embedded).
de: Die Option "--embed" wird nur bei der Ausgabe einer portierbaren PDB unterstützt (--debug:portable oder --debug:embedded).
es: El modificador --embed solo se admite cuando se emite un archivo PDB portátil (--debug:portable o --debug:embedded)
fr: Commutateur --embed uniquement pris en charge durant l'émission d'un fichier PDB portable (--debug:portable ou --debug:embedded)
it: Opzione --embed supportata solo quando si crea un file PDB portabile (--debug:portable o --debug:embedded)
ja: --embed スイッチは、移植可能な PDB の生成時にのみサポートされます (--debug:portable または --debug:embedded)
ko: --embed 스위치는 이식 가능한 PDB를 내보낼 때만 지원됩니다(--debug:portable 또는 --debug:embedded).
pl: Przełącznik --embed jest obsługiwany tylko dla emitowania przenośnego pliku PDB (--debug:portable lub --debug:embedded)
pt_br: o comutador --embed tem suporte somente ao emitir um PDB Portátil (--debug:portable ou --debug:embedded)
ru: Параметр --embed поддерживается только при создании переносимого PDB-файла (--debug:portable или --debug:embedded).
tr: --embed anahtarı yalnızca Taşınabilir PDB gösterilirken desteklenir (--debug:portable veya --debug:embedded)
zh_hans: --仅在发出可移植 PDB 时才支持嵌入开关(--debug:portable or --debug:embedded)
zh_hant: 僅在發出可攜式 PDB 時才支援 --embed 參數 (--debug:portable 或 --debug:embedded)

# optsSourceLinkRequirePortablePDBs
source: --sourcelink switch only supported when emitting a Portable PDB (--debug:portable or --debug:embedded)
cs: Přepínač --sourcelink se podporuje jenom při generování souboru PDB typu Portable (--debug:portable nebo --debug:embedded).
de: Die Option "--sourcelink" wird nur bei der Ausgabe einer portierbaren PDB unterstützt (--debug:portable oder --debug:embedded).
es: El modificador --sourcelink solo se admite cuando se emite un archivo PDB portátil (--debug:portable o --debug:embedded)
fr: Commutateur --sourcelink uniquement pris en charge durant l'émission d'un fichier PDB portable (--debug:portable ou --debug:embedded)
it: Opzione --sourcelink supportata solo quando si crea un file PDB portatile (--debug:portable o --debug:embedded)
ja: --sourcelink スイッチは、移植可能な PDB の生成時にのみサポートされます (--debug:portable または --debug:embedded)
ko: --sourcelink 스위치는 이식 가능한 PDB를 내보낼 때만 지원됩니다(--debug:portable 또는 --debug:embedded).
pl: Przełącznik --sourcelink jest obsługiwany tylko dla emitowania przenośnego pliku PDB (--debug:portable lub --debug:embedded)
pt_br: o comutador --sourcelink tem suporte somente ao emitir um PDB Portátil (--debug:portable ou --debug:embedded)
ru: Параметр --sourcelink поддерживается только при создании переносимого PDB-файла (--debug:portable или --debug:embedded).
tr: --sourcelink anahtarı yalnızca Taşınabilir PDB gösterilirken desteklenir (--debug:portable veya --debug:embedded)
zh_hans: --仅在发出可移植 PDB 时才支持源链接开关(--debug:portable or --debug:embedded)
zh_hant: 僅在發出可攜式 PDB 時才支援 --sourcelink 參數 (--debug:portable 或 --debug:embedded)

# srcFileTooLarge
source: Source file is too large to embed in a portable PDB
cs: Zdrojový soubor je příliš velký pro vložený do souboru PDB typu Portable.
de: Die Quelldatei ist zu groß, um in eine portierbare PDB eingebettet zu werden.
es: El archivo de código fuente es demasiado grande para insertarlo en un archivo PDB portable
fr: Le fichier source est trop grand pour être incorporé dans un fichier PDB portable
it: Le dimensioni del file di origine sono eccessive per consentirne l'incorporamento in un PDB portabile
ja: ソース ファイルが大きすぎるので、移植可能な PDB 内に埋め込めません
ko: 소스 파일이 너무 커서 이식 가능한 PDB에 포함할 수 없습니다.
pl: Plik źródłowy jest za duży, aby osadzić go w przenośnym pliku PDB
pt_br: O arquivo de origem é muito grande para ser inserido em um PDB portátil
ru: Исходный файл слишком велик для внедрения в переносимый PDB-файл.
tr: Kaynak dosya, taşınabilir PDB dosyasına eklemek için çok büyük
zh_hans: 源文件太大，无法嵌入可移植 PDB
zh_hant: 來源檔案過大，無法內嵌於可攜式 PDB 中

# optsResource
source: Embed the specified managed resource
cs: Vložit zadaný spravovaný prostředek
de: Angegebene verwaltete Ressource einbetten
es: Incrustar el recurso administrado especificado
fr: Incorporer la ressource managée spécifiée
it: Incorpora la risorsa gestita specificata
ja: 指定したマネージド リソースを埋め込みます
ko: 지정한 관리되는 리소스를 포함합니다.
pl: Osadź określony zasób zarządzany
pt_br: Inserir o recurso gerenciado especificado
ru: Внедрить указанный управляемый ресурс
tr: Belirtilen yönetilen kaynağı katıştır
zh_hans: 嵌入指定的受管理资源
zh_hant: 嵌入指定的受控資源
