Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# impInvalidMeasureArgument1
source: Invalid value '{0}' for unit-of-measure parameter '{1}'
cs: Neplatná hodnota {0} pro parametr měrné jednotky {1}
de: Ungültiger Wert '{0}' für Maßeinheitenparameter '{1}'
es: Valor '{0}' no válido para el parámetro '{1}' de unidad de medida.
fr: Valeur non valide '{0}' pour le paramètre d'unité de mesure '{1}'
it: Valore '{0}' non valido per il parametro di unità di misura '{1}'
ja: 測定単位のパラメーター '{1}' の値 '{0}' は無効です
ko: 측정 단위 매개 변수 '{1}'의 값 '{0}'이(가) 잘못되었습니다.
pl: Nieprawidłowa wartość „{0}” parametru „{1}” jednostki miary
pt_br: Valor inválido '{0}' para parâmetro de unidade de medida '{1}'
ru: Недопустимое значение "{0}" параметра единицы измерения "{1}"
tr: Ölçü birimi parametresi '{1}' için geçersiz '{0}' değeri
zh_hans: 度量单位参数“{1}”的值“{0}”无效
zh_hant: 測量單位參數 '{1}' 的值 '{0}' 無效

# impInvalidMeasureArgument2
source: Invalid value unit-of-measure parameter '{0}'
cs: Neplatná hodnota parametru měrné jednotky {0}
de: Ungültiger Wert für Maßeinheitenparameter '{0}'
es: Valor no válido del parámetro '{0}' de unidad de medida.
fr: Valeur de paramètre d'unité de mesure non valide '{0}'
it: Valore non valido per il parametro di unità di misura '{0}'
ja: 測定単位のパラメーター '{0}' の値が無効です
ko: 측정 단위 매개 변수 '{0}'의 값이 잘못되었습니다.
pl: Nieprawidłowa wartość parametru „{0}” jednostki miary
pt_br: Valor inválido do parâmetro de unidade de medida '{0}'
ru: Недопустимое значение параметра единицы измерения "{0}"
tr: Geçersiz değerli ölçü birimi parametresi '{0}'
zh_hans: 值度量单位参数“{0}”无效
zh_hant: 無效的測量單位參數 '{0}' 值

# etPropertyNeedsCanWriteOrCanRead
source: Property '{0}' on provided type '{1}' is neither readable nor writable as it has CanRead=false and CanWrite=false
cs: Vlastnost {0} u poskytnutého typu {1} není ani čitelná ani zapisovatelná, protože má CanRead s hodnotou false a CanWrite s hodnotou false.
de: Die '{0}'-Eigenschaft des angegebenen Typs '{1}' kann weder gelesen noch geschrieben werden, da sie auf CanRead=false und CanWrite=false festgelegt ist.
es: La propiedad '{0}' del tipo '{1}' proporcionado no se puede leer ni escribir, ya que tiene los valores CanRead=false y CanWrite=false.
fr: La propriété '{0}' sur le type fourni '{1}' ne peut être ni lue ni écrite, car CanRead=false et CanWrite=false
it: La proprietà '{0}' nel tipo fornito '{1}' non è né leggibile né scrivibile perché contiene CanRead=false e CanWrite=false
ja: 指定された型 '{1}' のプロパティ '{0}' で CanRead=false および CanWrite=false とされているため、読み取りも書き込みもできません
ko: 제공된 '{1}' 형식의 '{0}' 속성은 CanRead=false이고 CanWrite=false이므로 읽거나 쓸 수 없습니다.
pl: Właściwość „{0}” w udostępnionym typie „{1}” nie jest ani odczytywalna ani zapisywalna, ponieważ ma właściwości CanRead=false i CanWrite=false
pt_br: A propriedade '{0}' no tipo fornecido '{1}' não é legível nem gravável, pois possui CanRead=false e CanWrite=false
ru: Свойство "{0}" предоставленного типа "{1}" не доступно ни для чтения, ни для записи, поскольку у него CanRead=false и CanWrite=false
tr: {1}' sağlanan türündeki '{0}' özelliğinde CanRead=false ve CanWrite=false olduğu için özellik okunabilir veya yazılabilir değil
zh_hans: 所提供的类型“{1}”的属性“{0}”即不可读也不可写，因为该属性的 CanRead 为 false，且 CanWrite 也为 false
zh_hant: 提供之類型 '{1}' 上的屬性 '{0}' 不是可讀取的，也不是可寫入的，因為它具有 CanRead=false 和 CanWrite=false

# tcIntoNeedsRestOfQuery
source: A use of 'into' must be followed by the remainder of the computation
cs: Za použitím into musí následovat zbytek výpočtu.
de: Bei der Verwendung von 'into' muss der Rest der Berechnung folgen.
es: El uso de 'into' debe ir seguido del resto del cómputo.
fr: L'utilisation de 'into' doit être suivie du reste du calcul
it: L'uso di 'into' deve essere seguito dal resto del calcolo
ja: 'into' を使用する場合、その後に残りの計算を配置する必要があります
ko: 'into'를 사용하는 경우 뒤에 나머지 계산 부분이 와야 합니다.
pl: Po elemencie „into” należy użyć pozostałej części obliczenia
pt_br: O uso de 'into' deve ser seguido pelo restante da computação
ru: После использования into должна располагаться оставшаяся часть вычислений
tr: 'into' kullanımını hesaplamanın geri kalanı izlemelidir
zh_hans: “into”的使用必须后跟计算的剩余部分
zh_hant: 使用 'into' 時，之後必須接計算的其餘部分

# tcOperatorDoesntAcceptInto
source: The operator '{0}' does not accept the use of 'into'
cs: Operátor {0} nepodporuje použití klíčového slova into.
de: Der Operator '{0}' lässt die Verwendung von 'into' nicht zu.
es: El operador '{0}' no acepta el uso de 'into'.
fr: L'opérateur '{0}' n'accepte pas l'utilisation de 'into'
it: L'operatore '{0}' non accetta l'utilizzo di 'into'
ja: 演算子 '{0}' では、'into' を使用することはできません
ko: '{0}' 연산자에서는 'into'를 사용할 수 없습니다.
pl: Operator „{0}” nie akceptuje elementu „into”
pt_br: O operador '{0}' não aceita o uso de 'into'
ru: Оператор "{0}" не принимает использование into
tr: '{0}' işleci 'into' kullanımını kabul etmez
zh_hans: 运算符“{0}”不接受“into”的用法
zh_hant: 運算子 '{0}' 不接受使用 'into'

# tcCustomOperationInvalid
source: The definition of the custom operator '{0}' does not use a valid combination of attribute flags
cs: Definice vlastního operátoru {0} nepoužívá platnou kombinaci příznaků atributu.
de: Für die Definition des benutzerdefinierten Operatoren '{0}' wird keine gültige Kombination von Attributflags verwendet.
es: La definición del operador personalizado '{0}' no usa una combinación válida de marcas de atributo.
fr: La définition de l'opérateur personnalisé '{0}' n'utilise pas de combinaison d'indicateurs d'attributs valide
it: Nella definizione dell'operatore personalizzato '{0}' non viene usata una combinazione valida di flag di attributo
ja: カスタム演算子 '{0}' の定義で使用されている属性フラグの組み合わせが無効です
ko: 사용자 지정 연산자 '{0}'의 정의에서 올바른 특성 플래그 조합을 사용하지 않습니다.
pl: Definicja operatora niestandardowego „{0}” nie używa prawidłowej kombinacji flag atrybutów
pt_br: A definição do operador personalizado '{0}' não usa uma combinação válida de sinalizadores de atributos
ru: В определении пользовательского оператора "{0}" используется недопустимое сочетание флагов атрибутов
tr: '{0}' özel işlecinin tanımı geçerli bir öznitelik bayrakları bileşimi kullanmıyor
zh_hans: 自定义运算符“{0}”的定义未使用有效的特性标志组合
zh_hant: 自訂運算子 '{0}' 的定義未使用屬性旗標的有效組合

# tcThisTypeMayNotHaveACLIMutableAttribute
source: This type definition may not have the 'CLIMutable' attribute. Only record types may have this attribute.
cs: Tato definice typu nemůže mít atribut CLIMutable. Ten můžou mít jenom typy záznamu.
de: Diese Typdefinition darf nicht über das 'CLIMutable'-Attribut verfügen. Nur Datensatztypen dürfen über dieses Attribut verfügen.
es: Esta definición de tipo no puede tener el atributo 'CLIMutable'. Solamente los tipos de registro pueden tener este atributo.
fr: Cette définition de type ne peut pas avoir d'attribut 'CLIMutable'. Seuls les types d'enregistrements peuvent avoir cet attribut.
it: Questa definizione di tipo non può contenere l'attributo 'CLIMutable'. Solo i tipi di record possono contenere tale attributo.
ja: この型定義には 'CLIMutable' 属性を含めることができません。この属性を含めることができるのはレコード型のみです。
ko: 이 형식 정의는 'CLIMutable' 특성을 포함할 수 없습니다. 레코드 형식만 이 특성을 포함할 수 있습니다.
pl: Ta definicja typu może nie zawierać atrybutu „CLIMutable”. Tylko typy rekordów mogą zawierać ten atrybut.
pt_br: Esta definição de tipo pode não ter o atributo CLIMutable'. Somente tipos de registro podem ter este atributo.
ru: Определение этого типа не может содержать атрибута CLIMutable. Этот атрибут можно использовать только в типах записей.
tr: Bu tür tanımının 'CLIMutable' özniteliği olamaz. Yalnızca kayıt türleri bu özniteliğe sahip olabilir.
zh_hans: 此类型定义不能具有“CLIMutable”特性。只有记录类型可以有此特性。
zh_hant: 這個類型定義不能有 'CLIMutable' 屬性。只有記錄類型可以有這個屬性。

# tcAutoPropertyRequiresImplicitConstructionSequence
source: 'member val' definitions are only permitted in types with a primary constructor. Consider adding arguments to your type definition, e.g. 'type X(args) = ...'.
cs: Definice member val jsou povolené jenom u typů s primárním konstruktorem. Zvažte možnost přidat do definice typu argumenty, třeba type X(args) = ...
de: 'member val'-Definitionen sind nur in Typen mit einem primären Konstruktor zulässig. Möglicherweise sollten Sie Ihrer Typdefinition Argumente hinzufügen, z.B. 'type X(args) = ...'.
es: Las definiciones 'member val' se permiten únicamente en tipos con un constructor principal. Considere agregar argumentos a la definición de tipo, por ejemplo, 'type X(args) = ...'.
fr: Les définitions 'member val' sont uniquement autorisées dans les types avec un constructeur principal. Ajoutez des arguments à votre définition de type, par exemple 'type X(args) =…'.
it: Le definizioni 'member val' sono consentite solo nei tipi con un costruttore primario. Provare ad aggiungere argomenti alla definizione di tipo utilizzata, ad esempio 'type X(args) = ...'.
ja: 'member val' 定義は、プライマリ コンストラクターを含む型でのみ使用できます。型定義に引数を追加してください (たとえば、'type X(args) = ...')。
ko: 'member val' 정의는 기본 생성자가 포함된 형식에서만 허용됩니다. 'type X(args) = ...'와 같이 형식 정의에 인수를 추가해 보세요.
pl: Definicje „member val” są dozwolone tylko w typach z podstawowym konstruktorem. Rozważ dodanie argumentów do definicji typu, na przykład „type X(args) = ...”.
pt_br: As definições de 'member val' são permitidas apenas em tipos com um construtor primário. Considere adicionar argumentos à sua definição de tipo, por exemplo, 'type X(args) = ...'.
ru: Определения "member val" разрешены только в типах с первичным конструктором. Попробуйте добавить в определение типа аргументы, напр. "type X(args) = ...".
tr: 'member val' tanımlarına yalnızca birincil oluşturucusu olan türlerde izin verilir. Tür tanımınıza bağımsız değişkenler eklemeyi düşünün, örn. 'type X(args) = ...'.
zh_hans: “member val”定义仅允许用于具有主构造函数的类型中。请考虑向您的类型定义添加参数，例如“type X(args) = ...”。
zh_hant: 'member val' 定義只能用於含有主要建構函式的類型中。請考慮在您的類型定義加入引數，例如 'type X(args) = ...'。

# parsMutableOnAutoPropertyShouldBeGetSet
source: Property definitions may not be declared mutable. To indicate that this property can be set, use 'member val PropertyName = expr with get,set'.
cs: Definice vlastností se nedají deklarovat jako měnitelné. Pokud chcete tuto vlastnost definovat jako nastavitelnou, použijte syntaxi member val PropertyName = expr with get,set.
de: Eigenschaftsdefinitionen können nicht änderbar deklariert werden. Um anzugeben, dass diese Eigenschaft festgelegt werden kann, verwenden Sie 'member val PropertyName = expr with get,set'.
es: Las definiciones de propiedades no se pueden declarar como mutables. Para indicar que esta propiedad se puede establecer, use 'member val PropertyName = expr with get,set'.
fr: Les définitions de propriété ne doivent pas être déclarées comme étant mutables. Pour indiquer que cette propriété peut être définie, utilisez 'member val PropertyName = expr with get,set'.
it: Le definizioni di proprietà non possono essere dichiarate modificabili. Per indicare che questa proprietà può essere impostata, utilizzare 'member val PropertyName = expr with get,set'.
ja: プロパティの定義は変更可能として宣言することはできません。このプロパティが設定できることを示すには、'member val PropertyName = expr with get,set' を使用します。
ko: 속성 정의는 mutable로 선언할 수 없습니다. 이 속성을 설정할 수 있도록 표시하려면 'member val PropertyName = expr with get,set'을 사용하세요.
pl: Definicje właściwości nie mogą być deklarowane jako modyfikowalne. Aby wskazać, że można ustawić tę właściwość, użyj konstrukcji „member val NazwaWłaściwości = wyrażenie with get,set”.
pt_br: As definições de propriedades podem não ser declaradas mutáveis. Para indicar que esta propriedade pode ser definida, use 'member val PropertyName = expr com get,set'.
ru: Определения свойств не могут объявляться как изменяемые. Чтобы показать, что свойство можно задавать, используйте конструкцию "member val PropertyName = expr with get,set".
tr: Özellik tanımları değişebilir olarak tanımlanamaz. Bu özelliğin ayarlanabileceğini belirtmek için 'member val PropertyName = expr with get,set' kullanın.
zh_hans: 属性定义不能声明为可变。若要指示此属性可以进行设置，请使用“member val PropertyName = expr with get,set”。
zh_hant: 屬性定義不可以宣告為可變動。若要表示這個屬性可以設定，請使用 'member val PropertyName = expr with get,set'。

# parsMutableOnAutoPropertyShouldBeGetSetNotJustSet
source: To indicate that this property can be set, use 'member val PropertyName = expr with get,set'.
cs: Pokud chcete tuto vlastnost definovat jako nastavitelnou, použijte syntaxi member val PropertyName = expr with get,set.
de: Um anzugeben, dass diese Eigenschaft festgelegt werden kann, verwenden Sie "'member val PropertyName = expr with get,set".
es: Para indicar que esta propiedad se puede establecer, use 'member val PropertyName = expr with get,set'.
fr: Pour indiquer que cette propriété peut être définie, utilisez 'member val PropertyName = expr with get,set'.
it: Per indicare che questa proprietà può essere impostata, utilizzare 'member val PropertyName = expr with get,set'.
ja: このプロパティを設定できることを示すには、'member val PropertyName = expr with get,set' を使用します。
ko: 이 속성을 설정할 수 있도록 표시하려면 'member val PropertyName = expr with get,set'을 사용하세요.
pl: Aby wskazać, że można ustawić tę właściwość, użyj konstrukcji „member val NazwaWłaściwości = wyrażenie with get,set”.
pt_br: Para indicar que esta propriedade pode ser definida, use 'member val PropertyName = expr com get,set'.
ru: Чтобы показать, что свойство можно задавать, используйте конструкцию "member val PropertyName = expr with get,set".
tr: Bu özelliğin ayarlanabileceğini belirtmek için 'member val PropertyName = expr with get,set' kullanın.
zh_hans: 若要指示此属性可以进行设置，请使用“member val PropertyName = expr with get,set”。
zh_hant: 若要表示這個屬性可以設定，請使用 'member val PropertyName = expr with get,set'。

# chkNoByrefsOfByrefs
source: Type '{0}' is illegal because in byref<T>, T cannot contain byref types.
cs: Typ {0} je neplatný, protože T v byref<T> nemůže obsahovat typy byref.
de: Der Typ "{0}" ist nicht zulässig, da "T" in "byref<T>" keine byref-Typen enthalten kann.
es: El tipo "{0}" no es válido porque en byref<T>, T no puede contener tipos byref.
fr: Le type '{0}' n'est pas autorisé, car il se trouve dans byref<T>, T ne peut pas contenir de types byref.
it: Il tipo '{0}' non è valido perché in byref<T> T non può contenere tipi byref.
ja: 型 '{0}' が正しくありません。byref<T> では、T は byref 型を含めることができません。
ko: '{0}' 형식은 byref<T>에서 안에 있을 수 없습니다. T는 byref 형식을 포함할 수 없기 때문입니다.
pl: Typ „{0}” jest niedozwolony, ponieważ w konstrukcji byref<T> typ T nie może zawierać typów byref.
pt_br: O tipo '{0}' é ilegal porque o byref<T>, não pode conter tipos byref.
ru: Тип '{0}' является недопустимым, так как byref<T>, T не может содержать типы byref.
tr: byref<T>, içindeki T byref türleri içeremeyeceğinden '{0}' türü geçersizdir.
zh_hans: 类型“{0}”是非法的，应为在 byref<T> 中，T 不能包含 byref 类型。
zh_hant: 因為在 byref<T> 中，T 不能包含 byref 類型，所以 '{0}' 類型不合法。

# tastopsMaxArrayThirtyTwo
source: F# supports array ranks between 1 and 32. The value {0} is not allowed.
cs: F# podporuje rozměry polí od 1 do 32. Hodnota {0} není povolená.
de: F# unterstützt einen Arrayrang zwischen 1 und 32. Der Wert {0} ist nicht zulässig.
es: F# admite rangos de matrices entre 1 y 32. El valor {0} no se permite.
fr: F# prend en charge les rangs de tableau compris entre 1 et 32. La valeur {0} n'est pas autorisée.
it: F# supporta dimensioni matrice comprese tra 1 e 32. Il valore {0} non è consentito.
ja: F# は、1 から 32 の配列ランクをサポートしています。値 {0} は使用できません。
ko: F#에서는 1에서 32까지의 배열 순위를 지원합니다. {0} 값은 사용할 수 없습니다.
pl: Język F# obsługuje rangi tablicy między 1 i 32. Wartość {0} jest niedozwolona.
pt_br: F# dá suporte a classificações de matriz entre 1 e 32. O valor {0} não é permitido.
ru: F# поддерживает массивы рангом от 1 до 32. Значение {0} не допускается.
tr: F#, 1 ile 32 arasındaki dizi derecelerini destekler. {0} değeri kullanılamaz.
zh_hans: F# 支持 1 到 32 之间的数组秩。不允许使用值 {0}。
zh_hant: F# 支援 1 至 32 個陣列陣序。不允許值 {0}。

# tcNoIntegerForLoopInQuery
source: In queries, use the form 'for x in n .. m do ...' for ranging over integers
cs: V dotazech použijte notaci for x in n ... m do ..., která zajistí rozsah napříč celočíselnými typy.
de: Verwenden Sie in Abfragen die Form 'for x in n .. m do ...' für bereichsübergreifende Integer.
es: En las consultas, use el formato 'for x in n .. m do ...' para abarcar los enteros.
fr: Dans les requêtes, utilisez la forme 'for x in n .. m do …' pour couvrir les entiers
it: Nelle query usare il formato 'for x in n .. m do ...' per gestire interi
ja: クエリで整数の範囲を扱う場合は、'for x in n .. m do ...' という形式を使用してください
ko: 쿼리에서 정수 범위를 지정하려면 'for x in n .. m do ...' 형식을 사용하세요.
pl: W zapytaniach użyj formy „for x in n .. m do ...” w celu określenia zakresu liczb całkowitych
pt_br: Em consultas, use o formato 'for x in n .. m do ...' para inteiros abrangentes
ru: В запросах используйте для перебора интервала целых чисел форму "for x in n .. m do ..."
tr: Sorgularda, tamsayı aralığını belirlemek için 'for x in n .. m do ...' biçimini kullanın
zh_hans: 在查询中，应使用“for x in n .. m do ...”的形式处理整数范围
zh_hant: 在查詢中，請針對涵蓋的整數使用 'for x in n .. m do ...' 格式

# tcNoWhileInQuery
source: 'while' expressions may not be used in queries
cs: Výraz while se v dotazu použít nedá.
de: 'while'-Ausdrücke dürfen in Abfragen nicht verwendet werden.
es: Las expresiones 'while' no se pueden usar en las consultas.
fr: Les expressions 'while' ne peuvent pas être utilisées dans les requêtes
it: Le espressioni 'while' non possono essere utilizzate nelle query
ja: 'while' 式は、クエリ内で使用できません
ko: 'while' 식은 쿼리에서 사용할 수 없습니다.
pl: Wyrażenia „while” nie mogą być używane w zapytaniach
pt_br: As expressões 'while' não podem ser usadas em consultas
ru: В запросах нельзя использовать выражения while
tr: 'while' ifadeleri sorgularda kullanılamaz
zh_hans: “while”表达式不能在查询中使用
zh_hant: 'while' 運算式不可用於查詢中

# tcNoTryFinallyInQuery
source: 'try/finally' expressions may not be used in queries
cs: Výraz try/finally se nedá použít v dotazech.
de: 'try/finally'-Ausdrücke dürfen in Abfragen nicht verwendet werden.
es: Las expresiones 'try/finally' no se pueden usar en las consultas.
fr: Les expressions 'try/finally' ne peuvent pas être utilisées dans les requêtes
it: Le espressioni 'try/finally' non possono essere utilizzate nelle query
ja: 'try/finally' 式は、クエリ内で使用できません
ko: 'try/finally' 식은 쿼리에서 사용할 수 없습니다.
pl: Wyrażenia „try/finally” nie mogą być używane w zapytaniach
pt_br: As expressões 'try/finally' não podem ser usadas em consultas
ru: В запросах нельзя использовать выражения try/finally
tr: 'try/finally' ifadeleri sorgularda kullanılamaz
zh_hans: “try/finally”表达式不能在查询中使用
zh_hant: 'try/finally' 運算式不可用於查詢中

# tcUseMayNotBeUsedInQueries
source: 'use' expressions may not be used in queries
cs: Výrazy use se v dotazech použít nedají.
de: 'use'-Ausdrücke dürfen in Abfragen nicht verwendet werden.
es: Las expresiones 'use' no se pueden usar en las consultas.
fr: Les expressions 'use' ne peuvent pas être utilisées dans les requêtes
it: Le espressioni 'use' non possono essere utilizzate nelle query
ja: 'use' 式はクエリ内で使用できません
ko: 'use' 식은 쿼리에서 사용할 수 없습니다.
pl: Wyrażenia „use” nie mogą być używane w zapytaniach
pt_br: As expressões 'use' não podem ser usadas em consultas
ru: В запросах нельзя использовать выражения use
tr: 'use' ifadeleri sorgularda kullanılamaz
zh_hans: “use”表达式不能在查询中使用
zh_hant: 'use' 運算式不可用於查詢中

# tcBindMayNotBeUsedInQueries
source: 'let!', 'use!' and 'do!' expressions may not be used in queries
cs: Výrazy let!, use! a do! se v dotazech použít nedají.
de: Die 'let!'-, 'use!'- und 'do!'-Ausdrücke dürfen in Abfragen nicht verwendet werden.
es: Las expresiones 'let!', 'use!' y 'do!' no se pueden usar en las consultas.
fr: Les expressions 'let!', 'use!' et 'do!' ne sont pas utilisées dans les requêtes
it: Le espressioni 'let!', 'use!' e 'do!' non possono essere utilizzate nelle query
ja: クエリで 'let!'、'use!'、および 'do!' 式を使用することはできません
ko: 'let!', 'use!' 및 'do!' 식은 쿼리에서 사용할 수 없습니다.
pl: Nie można używać wyrażeń „let!”, „use!” i „do!” w zapytaniach
pt_br: As expressões 'let!', 'use!' e 'do!' não podem ser usadas em consultas
ru: В запросах нельзя использовать выражения "let!", "'use!" и "do!"
tr: 'let!', 'use!' ve 'do!' ifadeleri sorgularda kullanılamaz
zh_hans: “let!”、“use!”和“do!”表达式不能用于查询中
zh_hant: 'let!'、'use!' 和 'do!' 運算式不可用於查詢

# tcReturnMayNotBeUsedInQueries
source: 'return' and 'return!' may not be used in queries
cs: V dotazech se nedá použít return! ani return.
de: 'return'- und 'return!'-Ausdrücke dürfen in Abfragen nicht verwendet werden.
es: 'return' y 'return!' no se pueden usar en las consultas.
fr: 'return' et 'return!' ne peuvent pas être utilisés dans les requêtes
it: 'return' e 'return!' non possono essere usati nelle query
ja: 'return' および 'return!' は、クエリ内で使用できません
ko: 'return' 및 'return!'은 쿼리에서 사용할 수 없습니다.
pl: Elementy „return” i „return!” nie mogą być używane w zapytaniach
pt_br: 'return' e 'return!' não podem ser usados em consultas
ru: В запросах нельзя использовать "return" и "return!"
tr: 'return' ve 'return!' sorgularda kullanılamaz
zh_hans: “return”和“return!”不能在查询中使用
zh_hant: 'return' 和 'return!' 不可用於查詢中
