Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# augNoRefEqualsOnStruct
source: The 'ReferenceEquality' attribute cannot be used on structs. Consider using the 'StructuralEquality' attribute instead, or implement an override for 'System.Object.Equals(obj)'.
cs: Atribut ReferenceEquality se u struktur použít nedá. Zvažte, jestli byste místo něho neměli použít atribut StructuralEquality nebo implementovat přepsání pro System.Object.Equals(obj).
de: Das ReferenceEquality-Attribut darf nicht für Strukturen verwendet werden. Verwenden Sie stattdessen das StructuralEquality-Attribut, oder implementieren Sie eine Überschreibung für "System.Object.Equals(obj)".
es: El atributo 'ReferenceEquality' no puede usarse en structs. Considere el uso del atributo 'StructuralEquality' en su lugar o implemente una invalidación para 'System.Object.Equals(obj)'.
fr: Impossible d'utiliser l'attribut 'ReferenceEquality' sur des structs. Utilisez l'attribut 'StructuralEquality' à la place, ou implémentez une substitution pour 'System.Object.Equals(obj)'.
it: Non è possibile usare l'attributo 'ReferenceEquality' in struct. Provare a usare invece l'attributo 'StructuralEquality' oppure a implementare un override per 'System.Object.Equals(obj)'.
ja: 構造体で 'ReferenceEquality' 属性は使用できません。代わりに 'StructuralEquality' 属性を使用するか、'System.Object.Equals(obj)' のオーバーライドを実装してください。
ko: 'ReferenceEquality' 특성은 구조체에 대해 사용할 수 없습니다. 대신 'StructuralEquality' 특성을 사용하거나 'System.Object.Equals(obj)'의 재정의를 구현하세요.
pl: Atrybut „ReferenceEquality” nie może być używany w strukturach. Rozważ użycie atrybutu „StructuralEquality” lub implementację przesłonięcia metody „System.Object.Equals(obiekt)”.
pt_br: O atributo 'ReferenceEquality' não pode ser usado em structs. Considere usar o atributo 'StructuralEquality' em seu lugar, ou implemente uma substituição para 'System.Object.Equals(obj)'.
ru: Атрибут "ReferenceEquality" не может использоваться в структурах. Вместо этого рекомендуется использовать атрибут "StructuralEquality" или реализовать переопределение метода "System.Object.Equals(obj)".
tr: 'ReferenceEquality' özniteliği struct öğelerinde kullanılamaz. Onun yerine 'StructuralEquality' özniteliğini kullanın veya 'System.Object.Equals(obj)' için geçersiz kılma uygulayın.
zh_hans: 不能对结构使用 "ReferenceEquality" 特性。请考虑改用 "StructuralEquality" 特性，或实现对 "System.Object.Equals(obj)" 的重写。
zh_hant: 'ReferenceEquality' 屬性無法用在結構上。請考慮改用 'StructuralEquality' 屬性，或實作 'System.Object.Equals(obj)' 的覆寫。

# augInvalidAttrs
source: This type uses an invalid mix of the attributes 'NoEquality', 'ReferenceEquality', 'StructuralEquality', 'NoComparison' and 'StructuralComparison'
cs: Tento typ používá neplatnou kombinaci atributů NoEquality, ReferenceEquality, StructuralEquality, NoComparison a StructuralComparison.
de: Dieser Typ verwendet eine unzulässige Kombination der Attribute "NoEquality", "ReferenceEquality", "StructuralEquality", "NoComparison" und "StructuralComparison".
es: Este tipo usa una combinación no válida de los atributos "NoEquality", "ReferenceEquality", "StructuralEquality", "NoComparison" y "StructuralComparison".
fr: Ce type utilise un mélange non valide des attributs 'NoEquality', 'ReferenceEquality', 'StructuralEquality', 'NoComparison' et 'StructuralComparison'
it: Questo tipo usa una combinazione non valida degli attributi 'NoEquality', 'ReferenceEquality', 'StructuralEquality', 'NoComparison' e 'StructuralComparison'
ja: この型には、'NoEquality' 属性、'ReferenceEquality' 属性、'StructuralEquality' 属性、'NoComparison' 属性、および 'StructuralComparison' 属性の無効な組み合わせが使用されています
ko: 이 형식은 잘못된 'NoEquality', 'ReferenceEquality', 'StructuralEquality', 'NoComparison' 및 'StructuralComparison' 특성의 조합을 사용합니다.
pl: Ten typ używa nieprawidłowej kombinacji atrybutów „NoEquality”, „ReferenceEquality”, „StructuralEquality”, „NoComparison” i „StructuralComparison”
pt_br: Este tipo usa uma combinação inválida dos atributos 'NoEquality', 'ReferenceEquality', 'StructuralEquality', 'NoComparison' e 'StructuralComparison'
ru: В этом типе используется недопустимое сочетание атрибутов "NoEquality", "ReferenceEquality", "StructuralEquality", "NoComparison" и "StructuralComparison"
tr: Bu tür, 'NoEquality', 'ReferenceEquality', 'StructuralEquality', 'NoComparison' ve 'StructuralComparison' özniteliklerini geçersiz bir karışımda kullanıyor
zh_hans: 此类型使用的 "NoEquality"、"ReferenceEquality"、"StructuralEquality"、"NoComparison" 和 "StructuralComparison" 特性组合无效
zh_hant: 這個類型使用屬性 'NoEquality'、'ReferenceEquality'、'StructuralEquality'、'NoComparison' 和 'StructuralComparison' 的無效混合

# augNoEqualityNeedsNoComparison
source: The 'NoEquality' attribute must be used in conjunction with the 'NoComparison' attribute
cs: Atribut NoEquality je potřeba použít ve spojení s atributem NoComparison.
de: Das NoEquality-Attribut muss in Verbindung mit dem NoComparison-Attribut verwendet werden.
es: El atributo 'NoEquality' debe usarse junto con el atributo 'NoComparison'.
fr: L'attribut 'NoEquality' doit être utilisé conjointement avec l'attribut 'NoComparison'
it: L'attributo 'NoEquality' deve essere utilizzato insieme all'attributo 'NoComparison'
ja: 'NoEquality' 属性は、'NoComparison' 属性と組み合わせて使用する必要があります
ko: 'NoEquality' 특성은 'NoComparison' 특성과 함께 사용해야 합니다.
pl: Atrybut „NoEquality” musi być używany w połączeniu z atrybutem „NoComparison”
pt_br: O atributo 'NoEquality' deve ser usado em conjunto com o atributo 'NoComparison'
ru: Атрибут "NoEquality" необходимо использовать в сочетании с атрибутом "NoComparison"
tr: 'NoEquality' özniteliği, 'NoComparison' özniteliği ile bağlantılı kullanılmalıdır
zh_hans: "NoEquality" 特性必须与 "NoComparison" 特性结合使用
zh_hant: 'NoEquality' 屬性必須搭配 'NoComparison' 屬性一起使用

# augStructCompNeedsStructEquality
source: The 'StructuralComparison' attribute must be used in conjunction with the 'StructuralEquality' attribute
cs: Atribut StructuralComparison je potřeba použít ve spojení s atributem StructuralEquality.
de: Das StructuralComparison-Attribut muss in Verbindung mit dem StructuralEquality-Attribut verwendet werden.
es: El atributo 'StructuralComparison' debe usarse junto con el atributo 'StructuralEquality'.
fr: L'attribut 'StructuralComparison' doit être utilisé conjointement avec l'attribut 'StructuralEquality'
it: L'attributo 'StructuralComparison' deve essere utilizzato insieme all'attributo 'StructuralEquality'
ja: 'StructuralComparison' 属性は、'StructuralEquality' 属性と組み合わせて使用する必要があります
ko: 'StructuralComparison' 특성은 'StructuralEquality' 특성과 함께 사용해야 합니다.
pl: Atrybut „StructuralComparison” musi być używany w połączeniu z atrybutem „StructuralEquality”
pt_br: O atributo 'StructuralComparison' deve ser usado em conjunto com o atributo 'StructuralEquality'
ru: Атрибут "StructuralComparison" необходимо использовать в сочетании с атрибутом "StructuralEquality"
tr: 'StructuralComparison' özniteliği, 'StructuralEquality' özniteliği ile bağlantılı kullanılmalıdır
zh_hans: "StructuralComparison" 特性必须与 "StructuralEquality" 特性结合使用
zh_hant: 'StructuralComparison' 屬性必須搭配 'StructuralEquality' 屬性一起使用

# augStructEqNeedsNoCompOrStructComp
source: The 'StructuralEquality' attribute must be used in conjunction with the 'NoComparison' or 'StructuralComparison' attributes
cs: Atribut StructuralEquality je potřeba použít ve spojení s atributem NoComparison nebo StructuralComparison.
de: Das StructuralEquality-Attribut muss in Verbindung mit den Attributen "NoComparison" oder "StructuralComparison" verwendet werden.
es: El atributo 'StructuralEquality' debe usarse junto con los atributos 'NoComparison' o 'StructuralComparison'.
fr: L'attribut 'StructuralEquality' doit être utilisé conjointement avec les attributs 'NoComparison' ou 'StructuralComparison'
it: L'attributo 'StructuralEquality' deve essere utilizzato insieme agli attributi 'NoComparison' o 'StructuralComparison'
ja: 'StructuralEquality' 属性は、'NoComparison' 属性または 'StructuralComparison' 属性と組み合わせて使用する必要があります
ko: 'StructuralEquality' 특성은 'NoComparison' 또는 'StructuralComparison' 특성과 함께 사용해야 합니다.
pl: Atrybut „StructuralEquality” musi być używany w połączeniu z atrybutami „NoComparison” lub „StructuralComparison”
pt_br: O atributo 'StructuralEquality' deve ser usado junto com os atributos 'NoComparison' ou 'StructuralComparison'
ru: Атрибут "StructuralEquality" необходимо использовать в сочетании с атрибутами "NoComparison" или "StructuralComparison"
tr: 'StructuralEquality' özniteliği, 'NoComparison' veya 'StructuralComparison' öznitelikleriyle bağlantılı kullanılmalıdır
zh_hans: "StructuralEquality" 特性必须与 "NoComparison" 或 "StructuralComparison" 特性结合使用
zh_hant: 'StructuralEquality' 屬性必須搭配 'NoComparison' 或 'StructuralComparison' 屬性一起使用

# augTypeCantHaveRefEqAndStructAttrs
source: A type cannot have both the 'ReferenceEquality' and 'StructuralEquality' or 'StructuralComparison' attributes
cs: Typ nemůže mít zároveň atribut ReferenceEquality a StructuralEquality nebo StructuralComparison.
de: Ein Typ darf nicht gleichzeitig das ReferenceEquality-Attribut und die Attribute "StructuralEquality" oder "StructuralComparison" aufweisen.
es: Un tipo no puede tener los atributos 'ReferenceEquality' y 'StructuralEquality' o 'StructuralComparison' a la vez.
fr: Un type ne peut pas avoir à la fois les attributs 'ReferenceEquality' et 'StructuralEquality' ou 'StructuralComparison'
it: Un tipo non può avere sia l'attributo 'ReferenceEquality' sia 'StructuralEquality' o 'StructuralComparison'
ja: 1 つの型に 'ReferenceEquality' 属性および 'StructuralEquality' 属性、または 'ReferenceEquality' 属性および 'StructuralComparison' 属性を同時に使用することはできません
ko: 형식에 'ReferenceEquality' 특성과 'StructuralEquality' 또는 'StructuralComparison' 특성을 모두 지정할 수는 없습니다.
pl: Typ nie może mieć jednocześnie atrybutu „ReferenceEquality” i atrybutów „StructuralEquality” lub „StructuralComparison”
pt_br: Um tipo não pode ter, ao mesmo tempo, os atributos 'ReferenceEquality' e 'StructuralEquality' ou 'StructuralComparison'
ru: Тип не может содержать одновременно атрибуты "ReferenceEquality" и "StructuralEquality" или "StructuralComparison"
tr: Bir türde 'ReferenceEquality' ile 'StructuralEquality' veya 'StructuralComparison' öznitelikleri aynı anda olamaz
zh_hans: 一个类型不能同时具有 "ReferenceEquality" 特性和 "StructuralEquality" 或 "StructuralComparison" 特性
zh_hant: 類型不能同時具有 'ReferenceEquality' 和 'StructuralEquality' 或 'StructuralComparison' 屬性

# augOnlyCertainTypesCanHaveAttrs
source: Only record, union, exception and struct types may be augmented with the 'ReferenceEquality', 'StructuralEquality' and 'StructuralComparison' attributes
cs: O atributy ReferenceEquality, StructuralEquality a StructuralComparison se dají rozšířit jenom typy záznam, sjednocení, výjimka a struktura.
de: Nur Datensatz-, Union-, Ausnahme- und Strukturtypen können mit den Attributen "ReferenceEquality", "StructuralEquality" und "StructuralComparison" augmentiert werden.
es: Solo los tipos de registro, unión, excepción y struct se pueden aumentar con los atributos 'ReferenceEquality', 'StructuralEquality' y 'StructuralComparison'.
fr: Seuls les types enregistrement, union, exception et struct peuvent être augmentés avec les attributs 'ReferenceEquality', 'StructuralEquality' et 'StructuralComparison'
it: Con gli attributi 'ReferenceEquality', 'StructuralEquality' e 'StructuralComparison' è possibile aumentare solo tipi di struct, record, unione ed eccezione
ja: 'ReferenceEquality' 属性、'StructuralEquality' 属性、および 'StructuralComparison' 属性を使用して拡張できるのは、レコード型、共用体型、例外型、および構造体型のみです
ko: 레코드, 공용 구조체, 예외 및 구조체 형식만 'ReferenceEquality', 'StructuralEquality' 및 'StructuralComparison' 특성으로 확대할 수 있습니다.
pl: Za pomocą atrybutów „ReferenceEquality”, „StructuralEquality” i „StructuralComparison” mogą być rozszerzane tylko typy rekordu, unii, wyjątku i struktury
pt_br: Somente tipos registro, união, exceção e struct podem ser aumentados com os atributos 'ReferenceEquality', 'StructuralEquality' e 'StructuralComparison'
ru: Атрибуты "ReferenceEquality", "StructuralEquality" и "StructuralComparison" можно использовать только для приращения типов записи, объединения, исключения и структуры
tr: Yalnızca kayıt, birleşim, özel durum ve yapı türleri 'ReferenceEquality', 'StructuralEquality' ve 'StructuralComparison' öznitelikleriyle büyütülebilir
zh_hans: 只可以利用 "ReferenceEquality"、"StructuralEquality" 和 "StructuralComparison" 特性来扩大记录、联合、异常和结构类型
zh_hant: 只有記錄、等位、例外狀況和結構類型可以用 'ReferenceEquality'、'StructuralEquality' 和 'StructuralComparison' 屬性增強

# augRefEqCantHaveObjEquals
source: A type with attribute 'ReferenceEquality' cannot have an explicit implementation of 'Object.Equals(obj)', 'System.IEquatable<_>' or 'System.Collections.IStructuralEquatable'
cs: Typ s atributem ReferenceEquality nemůže mít explicitní implementaci Object.Equals(obj), System.IEquatable<_> nebo System.Collections.IStructuralEquatable.
de: Ein Typ mit dem Attribut "ReferenceEquality" darf keine explizite Implementierung von "Object.Equals(obj)", "System.IEquatable<_>" oder "System.Collections.IStructuralEquatable" aufweisen.
es: Un tipo con el atributo "ReferenceEquality" no puede tener una implementación explícita de "Object.Equals(obj)", "System.IEquatable<_>" o "System.Collections.IStructuralEquatable"
fr: Un type avec l'attribut 'ReferenceEquality' ne peut pas avoir d'implémentation explicite de 'Object.Equals(obj)', 'System.IEquatable<_>' ou 'System.Collections.IStructuralEquatable'
it: Un tipo con attributo 'ReferenceEquality' non può avere un'implementazione esplicita di 'Object.Equals(obj)', 'System.IEquatable<_>' o 'System.Collections.IStructuralEquatable'
ja: 'ReferenceEquality' 属性が含まれる型に 'Object.Equals(obj)'、'System.IEquatable<_>'、または 'System.Collections.IStructuralEquatable' の明示的な実装を含めることはできません
ko: 특성 'ReferenceEquality'가 지정된 형식에는 'Object.Equals(obj)', 'System.IEquatable<_>' 또는 'System.Collections.IStructuralEquatable'에 대한 명시적 구현이 있을 수 없습니다.
pl: Typ z atrybutem „ReferenceEquality” nie może mieć jawnej implementacji metody „Object.Equals(obiekt)”, interfejsu „System.IEquatable<_>” ani interfejsu „System.Collections.IStructuralEquatable”
pt_br: Um tipo com o atributo 'ReferenceEquality' não pode ter uma implementação explícita de 'Object.Equals(obj)', 'System.IEquatable<_>' ou 'System.Collections.IStructuralEquatable'
ru: Тип с атрибутом 'ReferenceEquality' не может иметь явную реализацию 'Object.Equals(obj)', 'System.IEquatable<_>' или 'System.Collections.IStructuralEquatable'
tr: 'ReferenceEquality' özniteliğine sahip bir tür, açık bir 'Object.Equals(obj)', 'System.IEquatable<_>' veya 'System.Collections.IStructuralEquatable' uygulamasına sahip olamaz
zh_hans: 具有 "ReferenceEquality" 属性的类型不能具有 "Object.Equals(obj)"、"System.IEquatable<_>" 或 "System.Collections.IStructuralEquatable" 的显式实现
zh_hant: 屬性為 'ReferenceEquality' 的類型不能有 'Object.Equals(obj)'、'System.IEquatable<_>' 或 'System.Collections.IStructuralEquatable' 的明確實作

# augCustomEqNeedsObjEquals
source: A type with attribute 'CustomEquality' must have an explicit implementation of at least one of 'Object.Equals(obj)', 'System.IEquatable<_>' or 'System.Collections.IStructuralEquatable'
cs: Typ s atributem CustomEquality musí mít explicitní implementaci aspoň jednoho z následujících: Object.Equals(obj), System.IEquatable<_> nebo System.Collections.IStructuralEquatable.
de: Ein Typ mit dem CustomEquality-Attribut erfordert die explizite Implementierung von "Object.Equals(obj)" , "System.IEquatable<_>" und/oder " System.Collections.IStructuralEquatable".
es: Un tipo con atributo "CustomEquality" debe tener una implementación explícita de al menos uno de "Object.Equals (obj)", "System.IEquatable<_>"' o "System.Collections.IStructuralEquatable"
fr: Un type avec l'attribut 'CustomEquality' doit avoir une implémentation explicite d'au moins un des éléments 'Object.Equals(obj)', 'System.IEquatable<_>' ou 'System.Collections.IStructuralEquatable'
it: Un tipo con attributo 'CustomEquality' deve avere un'implementazione esplicita di almeno uno degli elementi 'Object.Equals(obj)', 'System.IEquatable<_>' o 'System.Collections.IStructuralEquatable'
ja: 'CustomEquality' 属性が含まれる型には、'Object.Equals(obj)'、'System.IEquatable<_>'、'System.Collections.IStructuralEquatable' の少なくとも 1 つの明示的な実装が含まれていなければなりません
ko: 'CustomEquality' 특성이 지정된 형식에는 'Object.Equals(obj)', 'System.IEquatable<_>' 또는 'System.Collections.IStructuralEquatable' 중 하나 이상에 대한 명시적 구현이 있어야 합니다.
pl: Typ z atrybutem „CustomEquality” musi mieć jawną implementację co najmniej jednego z następujących elementów: metody „Object.Equals(obiekt)”, interfejsu „System.IEquatable<_>” lub interfejsu „System.Collections.IStructuralEquatable”
pt_br: Um tipo com o atributo 'CustomEquality' deve ter uma implementação explícita de pelo menos um dos 'Object.Equals(obj)', 'System.IEquatable<_>' ou 'System.Collections.IStructuralEquatable'
ru: Тип с атрибутом 'CustomEquality' должен иметь явную реализацию с одним из выражений 'Object.Equals(obj)', 'System.IEquatable<_>' или 'System.Collections.IStructuralEquatable'
tr: 'CustomEquality' özniteliğine sahip bir aracın en az bir 'Object.Equals(obj)', 'System.IEquatable<_>' veya 'System.Collections.IStructuralEquatable' için açık bir uygulaması olmalıdır
zh_hans: 带有 "CustomEquality" 属性必须至少具有 "Object.Equals(obj)"、"System.IEquatable<_>" 或 "System.Collections.IStructuralEquatable" 三者之一的显式实现
zh_hant: 屬性為 'CustomEquality' 的類型必須至少有 'Object.Equals(obj)'、'System.IEquatable<_>' 或 'System.Collections.IStructuralEquatable' 其中之一的明確實作

# augCustomCompareNeedsIComp
source: A type with attribute 'CustomComparison' must have an explicit implementation of at least one of 'System.IComparable' or 'System.Collections.IStructuralComparable'
cs: Typ s atributem CustomComparison musí mít explicitní implementaci buď aspoň System.IComparable, nebo aspoň System.Collections.IStructuralComparable.
de: Ein Typ mit dem CustomComparison-Attribut erfordert die explizite Implementierung von "System.IComparable" und/oder "System.Collections.IStructuralComparable".
es: Un tipo con el atributo 'CustomComparison' debe tener una implementación explícita de al menos uno de 'System.IComparable' o 'System.Collections.IStructuralComparable'.
fr: Un type avec l'attribut 'CustomComparison' doit avoir au moins une implémentation explicite de 'System.IComparable' ou 'System.Collections.IStructuralComparable'
it: Un tipo con attributo 'CustomComparison' deve avere un'implementazione esplicita di almeno uno degli elementi 'System.IComparable' o 'System.Collections.IStructuralComparable'
ja: 'CustomComparison' 属性を持つ型には、'System.IComparable' または 'System.Collections.IStructuralComparable' の少なくとも 1 つの明示的な実装が必要です
ko: 특성 'CustomComparison'이 지정된 형식에는 'System.IComparable' 또는 'System.Collections.IStructuralComparable' 중 하나 이상에 대한 명시적 구현이 있어야 합니다.
pl: Typ z atrybutem „CustomComparison” musi mieć jawną implementację co najmniej jednego z następujących interfejsów: „System.IComparable” lub „System.Collections.IStructuralComparable”
pt_br: Um tipo com atributo 'CustomComparison' deve ter uma implementação explícita de pelo menos 'System.IComparable' ou 'System.Collections.IStructuralComparable'
ru: Тип с атрибутом "CustomComparison" должен как минимум содержать явную реализацию интерфейса "System.IComparable" или "System.Collections.IStructuralComparable"
tr: 'CustomComparison' özniteliği olan bir türde, 'System.IComparable' veya 'System.Collections.IStructuralComparable' yöntemlerinden en az biri açık olarak uygulanmış olmalıdır
zh_hans: 具有特性 "CustomComparison" 的类型必须至少显式实现 "System.IComparable" 或 "System.Collections.IStructuralComparable" 中的一个
zh_hant: 具 'CustomComparison' 屬性的類型必須至少有 'System.IComparable' 或 'System.Collections.IStructuralComparable' 其中之一的明確實作

# augNoEqNeedsNoObjEquals
source: A type with attribute 'NoEquality' should not usually have an explicit implementation of 'Object.Equals(obj)'. Disable this warning if this is intentional for interoperability purposes
cs: Není běžné, aby typ s atributem NoEquality měl explicitní implementaci Object.Equals(obj). Pokud je to záměr s cílem dosáhnout interoperability, pak toto upozornění vypněte.
de: Ein Typ mit dem NoEquality-Attribut sollte in der Regel keine explizite Implementierung von "Object.Equals(obj)" aufweisen. Deaktivieren Sie diese Warnung, wenn diese Implementierung aus Interoperabilitätsgründen beabsichtigt ist.
es: Normalmente, un tipo con el atributo 'NoEquality' no debe tener una implementación explícita de 'Object.Equals(obj)'. Deshabilite esta advertencia si esto es intencionado con fines de interoperabilidad.
fr: Un type avec l'attribut 'NoEquality' ne doit généralement pas avoir une implémentation explicite de 'Object.Equals(obj)'. Désactivez cet avertissement s'il résulte d'une action intentionnelle à des fins d'interopérabilité
it: Un tipo con attributo 'NoEquality' non deve avere in genere un'implementazione esplicita di 'Object.Equals(obj)'. Disabilitare questo avviso se ciò è intenzionale a fini di interoperabilità
ja: 通常、'NoEquality' 属性を持つ型には、'Object.Equals(obj)' を明示的に実装しません。相互運用性のために意図的に実装した場合、この警告は無効にしてください。
ko: 특성 'NoEquality'가 지정된 형식에는 일반적으로 'Object.Equals(obj)'에 대한 명시적 구현이 있으면 안 됩니다. 상호 운용성을 위해 의도적으로 이러한 구현을 사용한 경우에는 이 경고를 사용하지 마세요.
pl: Typ z atrybutem „NoEquality” nie powinien zwykle mieć jawnej implementacji metody„Object.Equals(obiekt)”. Wyłącz to ostrzeżenie, jeśli jest to zamierzone do celów związanych z międzyoperacyjnością
pt_br: Geralmente um tipo com atributo 'NoEquality' não deve ter uma implementação explícita de 'Object.Equals(obj)'. Desabilite este aviso caso a intenção seja obter interoperabilidade
ru: Тип с атрибутом "NoEquality" обычно не должен содержать явную реализацию метода "Object.Equals(obj)". Если эта операция выполняется в целях обеспечения совместимости, отключите это предупреждение
tr: 'NoEquality' özniteliği olan bir türde, genellikle açık olarak uygulanmış 'Object.Equals(obj)' metodu olmamalıdır. Bu birlikte çalışabilme amacıyla bilerek yapılmışsa bu uyarıyı devre dışı bırakın
zh_hans: 具有特性 "NoEquality" 通常不应显式实现 "Object.Equals(obj)"。如果这是为了实现互操作性而特意这样做的，请禁用此警告
zh_hant: 具 'NoEquality' 屬性的類型通常不應該有 'Object.Equals(obj)' 的明確實作。如果是為了互通性，請停用這個警告
