Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# xmlDocUnresolvedCrossReference
source: This XML comment is invalid: unresolved cross-reference '{0}'
cs: Tento komentář XML není platný: nepřeložený křížový odkaz {0}
de: Dieser XML-Kommentar ist ungültig: nicht aufgelöster Querverweis "{0}".
es: El comentario XML no es válido: la referencia cruzada "{0}" no se ha resuelto
fr: Ce commentaire XML est non valide : référence croisée non résolue '{0}'
it: Questo commento XML non è valido: il riferimento incrociato '{0}' non è stato risolto
ja: この XML コメントは無効です: 相互参照 '{0}' が未解決です
ko: 이 XML 주석이 잘못됨: 확인되지 않은 상호 참조 '{0}'
pl: Ten komentarz XML jest nieprawidłowy: nierozpoznany odsyłacz „{0}”
pt_br: Este comentário XML é inválido: referência cruzada não resolvida '{0}'
ru: Недопустимый XML-комментарий: неразрешенная перекрестная ссылка "{0}"
tr: Bu XML açıklaması geçersiz: '{0}' çapraz başvurusu çözümlenmemiş
zh_hans: 此 XML 注释无效: 交叉引用“{0}”无法解析
zh_hant: 此 XML 註解無效: 未解析的交互參照 '{0}'

# yieldUsedInsteadOfYieldBang
source: Consider using 'yield!' instead of 'yield'.
cs: Zvažte použití parametru yield! namísto yield.
de: Verwenden Sie ggf. "yield!" anstelle von "yield".
es: Considere la posibilidad de usar "yield!" en lugar de "yield".
fr: Utilisez 'yield!' à la place de 'yield'.
it: Provare a usare 'yield!' invece di 'yield'.
ja: 'yield' の代わりに 'yield!' を使うことを検討してください。
ko: 'yield'가 아닌 'yield!'를 사용하세요.
pl: Rozważ użycie polecenia „yield!” zamiast „yield”.
pt_br: Considere usar 'yield!' em vez de 'yield'.
ru: Рекомендуется использовать "yield!" вместо "yield".
tr: 'yield' yerine 'yield!' kullanmayı deneyin.
zh_hans: 考虑使用 "yield!"，而非 "yield"。
zh_hant: 請考慮使用 'yield!' 而不使用 'yield'。

# tupleRequiredInAbstractMethod
source: \nA tuple type is required for one or more arguments. Consider wrapping the given arguments in additional parentheses or review the definition of the interface.
cs: \nPro jeden nebo více argumentů se vyžaduje typ řazené kolekce členů. Zvažte možnost uzavřít dané argumenty do dodatečných závorek nebo zkontrolovat definici rozhraní.
de: \nEin Tupeltyp ist für mindestens ein Argument erforderlich. Schließen Sie die angegebenen Argumente ggf. in zusätzliche Klammern ein, oder überprüfen Sie die Definition der Schnittstelle.
es: \nSe requiere un tipo de tupla para uno o varios argumentos. Considere la posibilidad de incluir los argumentos dados entre paréntesis adicionales o revise la definición de la interfaz.
fr: \nUn type de tuple est nécessaire pour un ou plusieurs arguments. Mettez des parenthèses supplémentaires autour des arguments fournis, ou passez en revue la définition de l'interface.
it: \nPer uno o più argomenti è necessario un tipo di tupla. Provare a racchiudere gli argomenti specificati tra parentesi aggiuntive o a rivedere la definizione dell'interfaccia.
ja: \n1 つ以上の引数についてタプル型を指定する必要があります。指定した引数を追加のかっこ内にラップすることを検討するか、インターフェイスの定義を確認してください。
ko: \n하나 이상의 인수에 튜플 형식이 필요합니다. 지정된 인수를 추가 괄호로 래핑하거나 인터페이스의 정의를 검토하세요.
pl: \nDla co najmniej jednego argumentu jest wymagany typ krotki. Rozważ ujęcie danych argumentów w dodatkowy nawias lub przejrzenie definicji interfejsu.
pt_br: \nUm tipo de tupla é exigido para um ou mais argumentos. Considere agrupar os argumentos fornecidos em parênteses adicionais ou revisar a definição da interface.
ru: \nНеобходимо указать тип кортежа для одного аргумента (или нескольких). Рекомендуется заключить эти аргументы в дополнительные скобки или проверить определение интерфейса.
tr: \nBir veya daha çok bağımsız değişken için demet türü gerekli. Verilen bağımsız değişkenleri ek parantezlerle sarmalamanız veya arabirimin tanımını gözden geçirmeniz önerilir.
zh_hans: \n一个或多个参数需要元组类型。请考虑在额外的括号中换行给定的参数或评审接口的定义。
zh_hant: \n有一或多個引數需要元組類型。請考慮用額外的括弧括住提供的引數，或檢閱介面定義。

# buildInvalidWarningNumber
source: Invalid warning number '{0}'
cs: Neplatné číslo upozornění {0}
de: Ungültige Warnungsnummer "{0}".
es: Número de advertencia '{0}' no válido.
fr: Numéro d'avertissement non valide '{0}'
it: Numero di avviso '{0}' non valido
ja: 警告番号 '{0}' が無効です
ko: 경고 번호 '{0}'이(가) 잘못되었습니다.
pl: Nieprawidłowy numer ostrzeżenia „{0}”
pt_br: Número de aviso inválido '{0}'
ru: Недопустимый номер предупреждения "{0}".
tr: Geçersiz uyarı numarası '{0}'
zh_hans: 警告编号“{0}”无效
zh_hant: 無效的警告編號 '{0}'

# buildInvalidVersionString
source: Invalid version string '{0}'
cs: Neplatný řetězec verze {0}
de: Ungültige Versionszeichenfolge "{0}".
es: Cadena de versión '{0}' no válida.
fr: Chaîne de version non valide '{0}'
it: Stringa di versione '{0}' non valida
ja: バージョン文字列 '{0}' が無効です
ko: 버전 문자열 '{0}'이(가) 잘못되었습니다.
pl: Nieprawidłowy ciąg wersji „{0}”
pt_br: Cadeia de caracteres de versão inválida '{0}'
ru: Недопустимая строка версии "{0}"
tr: Geçersiz sürüm dizesi '{0}'
zh_hans: 版本字符串“{0}”无效
zh_hant: 無效的版本字串 '{0}'

# buildInvalidVersionFile
source: Invalid version file '{0}'
cs: Neplatný soubor verze {0}
de: Ungültige Versionsdatei "{0}".
es: Archivo de versión '{0}' no válido.
fr: Fichier de version non valide '{0}'
it: File di versione '{0}' non valido
ja: バージョン ファイル '{0}' が無効です
ko: 버전 파일 '{0}'이(가) 잘못되었습니다.
pl: Nieprawidłowy plik wersji „{0}”
pt_br: Arquivo de versão inválida '{0}'
ru: Недопустимый файл версии "{0}"
tr: Geçersiz dosya sürümü '{0}'
zh_hans: 版本文件“{0}”无效
zh_hant: 無效的版本檔案 '{0}'

# buildProblemWithFilename
source: Problem with filename '{0}': {1}
cs: Problém s názvem souboru {0}: {1}
de: Problem mit Dateinamen "{0}": {1}
es: Problema con el nombre de archivo '{0}': {1}.
fr: Problème avec le nom de fichier '{0}' : {1}
it: Problema con il nome di file '{0}': {1}
ja: ファイル名 '{0}' に問題があります: {1}
ko: 파일 이름 '{0}'에 문제가 있습니다. {1}
pl: Problem z nazwą pliku „{0}”: {1}
pt_br: Problema com nome de arquivo '{0}': {1}
ru: Ошибка в имени файла "{0}": {1}
tr: Dosya adında hata: '{0}': {1}
zh_hans: 文件名“{0}”存在问题: {1}
zh_hant: 檔名 '{0}' 有問題: {1}

# buildNoInputsSpecified
source: No inputs specified
cs: Nezadali jste žádné vstupy.
de: Keine Eingaben angegeben.
es: No se especificaron entradas
fr: Absence d'entrée spécifiée
it: Nessun input specificato
ja: 入力が指定されていません
ko: 지정한 입력이 없습니다.
pl: Nie określono danych wejściowych
pt_br: Nenhuma entrada especificada
ru: Не указаны входные данные
tr: Bir giriş belirtilmedi
zh_hans: 未指定输入
zh_hant: 未指定輸入

# buildPdbRequiresDebug
source: The '--pdb' option requires the '--debug' option to be used
cs: Možnost --pdb vyžaduje použití možnosti --debug.
de: Die Option "--pdb" macht die Verwendung der Option "--debug" erforderlich.
es: La opción '--pdb' requiere el uso de la opción '--debug'.
fr: L'option '--pdb' requiert l'utilisation de l'option '--debug'
it: L'opzione '--pdb' richiede l'utilizzo dell'opzione '--debug'
ja: '--pdb' オプションでは '--debug' オプションを使用する必要があります
ko: '--pdb' 옵션을 사용하려면 '--debug' 옵션을 사용해야 합니다.
pl: Opcja „--pdb” wymaga użycia opcji „--debug”
pt_br: A opção '--pdb' requer que seja usada a opção '--debug'
ru: Для параметра "--pdb" требуется использовать параметр "--debug"
tr: '--pdb' seçeneği '--debug' seçeneğinin kullanılmasını gerektirir
zh_hans: “--pdb”选项要求使用“--debug”选项
zh_hant: '--pdb' 選項要求必須使用 '--debug' 選項

# buildInvalidSearchDirectory
source: The search directory '{0}' is invalid
cs: Adresář hledání {0} není platný.
de: Das Suchverzeichnis "{0}" ist ungültig.
es: El directorio de búsqueda '{0}' no es válido.
fr: Le répertoire de recherche '{0}' n'est pas valide
it: Directory di ricerca '{0}' non valida
ja: 検索ディレクトリ '{0}' が無効です
ko: 검색 디렉터리 '{0}'이(가) 잘못되었습니다.
pl: Katalog wyszukiwania „{0}” jest nieprawidłowy
pt_br: O diretório de pesquisa '{0}' é inválido
ru: Недопустимый каталог поиска "{0}".
tr: Arama dizini '{0}' geçersiz
zh_hans: 搜索目录“{0}”无效
zh_hant: 搜尋目錄 '{0}' 無效。

# buildSearchDirectoryNotFound
source: The search directory '{0}' could not be found
cs: Adresář hledání {0} se nedal najít.
de: Das Suchverzeichnis "{0}" wurde nicht gefunden.
es: No se encontró el directorio de búsqueda '{0}'.
fr: Le répertoire de recherche '{0}' est introuvable
it: La directory di ricerca '{0}' non è stata trovata
ja: 検索ディレクトリ '{0}' が見つかりませんでした
ko: 검색 디렉터리 '{0}'을(를) 찾을 수 없습니다.
pl: Nie można znaleźć katalogu wyszukiwania „{0}”
pt_br: Não foi possível encontrar o diretório de pesquisa '{0}'
ru: Не удалось найти каталог поиска "{0}".
tr: Arama dizini '{0}' bulunamadı
zh_hans: 未能找到搜索目录“{0}”
zh_hant: 找不到搜尋目錄 '{0}'

# buildInvalidFilename
source: '{0}' is not a valid filename
cs: {0} není platný název souboru.
de: {0} ist kein gültiger Dateiname.
es: '{0}' no es un nombre de archivo válido.
fr: '{0}' n'est pas un nom de fichier valide
it: '{0}' non è un nome di file valido
ja: '{0}' は有効なファイル名ではありません
ko: '{0}'은(는) 올바른 파일 이름이 아닙니다.
pl: Nazwa „{0}” nie jest prawidłową nazwą pliku
pt_br: '{0}' não é um nome de arquivo válido
ru: {0} не является допустимым именем файла
tr: '{0}' geçerli bir dosya adı değil
zh_hans: “{0}”不是有效的文件名
zh_hant: '{0}' 不是有效的檔名

# buildInvalidAssemblyName
source: '{0}' is not a valid assembly name
cs: {0} není platný název sestavení.
de: {0} ist kein gültiger Assemblyname.
es: '{0}' no es un nombre de ensamblado válido.
fr: '{0}' n'est pas un nom d'assembly valide
it: '{0}' non è un nome di assembly valido
ja: '{0}' は有効なアセンブリ名ではありません
ko: '{0}'은(는) 올바른 어셈블리 이름이 아닙니다.
pl: Nazwa „{0}” nie jest prawidłową nazwą zestawu
pt_br: '{0}' não é um nome de assembly válido
ru: {0} не является допустимым именем сборки
tr: '{0}' geçerli bir bütünleştirilmiş kod adı değil
zh_hans: “{0}”不是有效的程序集名称
zh_hant: '{0}' 不是有效的組件名稱

# buildInvalidPrivacy
source: Unrecognized privacy setting '{0}' for managed resource, valid options are 'public' and 'private'
cs: Nerozpoznané nastavení ochrany osobních údajů {0} pro spravovaný prostředek. Platné možnosti jsou public a private.
de: Unbekannte Datenschutzeinstellung "{0}" für verwaltete Ressource; gültige Optionen sind "public" und "private".
es: Configuración de privacidad '{0}' no reconocida para un recurso administrado. Las opciones válidas son 'public' y 'private'.
fr: Paramètre de confidentialité '{0}' non reconnu pour la ressource managée, les options valides sont 'public' et 'private'
it: Impostazione di privacy '{0}' non riconosciuta per una risorsa gestita. Le opzioni valide sono 'public' e 'private'
ja: マネージド リソースの認識されないプライバシー設定 '{0}'。有効なオプションは 'public' および 'private' です。
ko: 관리되는 리소스에 대해 인식할 수 없는 개인 정보 보호 설정 '{0}'입니다. 올바른 옵션은 'public' 및 'private'입니다.
pl: Nierozpoznane ustawienie prywatności „{0}” dla zasobu zarządzanego. Prawidłowe opcje to „public” i „private”
pt_br: A configuração de privacidade '{0}' não foi reconhecida pelo recurso gerenciado, as opções válidas são 'public' e 'private'
ru: Нераспознанный параметр конфиденциальности "{0}" для управляемого ресурса. Допускается использование параметров "public" и "private"
tr: Yönetilen kaynak için tanınmayan gizlilik ayarı '{0}'; geçerli seçenekler: 'public' ve 'private'
zh_hans: 无法识别的受管理资源隐私设置“{0}”，有效的选项为 "public" 和 "private"
zh_hant: 受控資源的無法辨識隱私設定 '{0}'，有效的選項是 'public' 和 'private'

# buildCannotReadAssembly
source: Unable to read assembly '{0}'
cs: Sestavení {0} se nedá přečíst.
de: Assembly "{0}" kann nicht gelesen werden.
es: No se puede leer el ensamblado '{0}'.
fr: Impossible de lire l'assembly '{0}'
it: Non è possibile leggere l'assembly '{0}'
ja: アセンブリ '{0}' を読み取れません
ko: '{0}' 어셈블리를 읽을 수 없습니다.
pl: Nie można odczytać zestawu „{0}”
pt_br: Não é possível ler o assembly '{0}'
ru: Не удается прочитать сборку "{0}"
tr: '{0}' bütünleştirilmiş kodu okunamıyor
zh_hans: 无法读取程序集“{0}”
zh_hant: 無法讀取組件 '{0}'

# buildAssemblyResolutionFailed
source: Assembly resolution failure at or near this location
cs: Došlo k selhání překladu sestavení na této pozici nebo blízko ní.
de: Fehler bei Assemblyauflösung an dieser Position oder in ihrer Nähe.
es: Error de resolución de ensamblado en esta ubicación o cerca de ella.
fr: Échec de la résolution de l'assembly à cet emplacement ou à proximité
it: Errore di risoluzione assembly in questa posizione o in prossimità di essa
ja: この場所またはこの場所付近でアセンブリ解決エラーが発生しました
ko: 이 위치 또는 이 위치 근처에서 어셈블리를 확인하지 못했습니다.
pl: Niepowodzenie rozpoznania zestawu w tej lokalizacji lub w jej pobliżu
pt_br: Falha na resolução do assembly neste local ou próximo a ele
ru: Сбой при разрешении сборки в этой или близлежащих строках
tr: Bu konumda veya yakınında bütünleştirilmiş kod çözme hatası
zh_hans: 程序集解析在此位置或此位置附近失败
zh_hant: 組件解析在這個位置或附近失敗

# buildImplicitModuleIsNotLegalIdentifier
source: The declarations in this file will be placed in an implicit module '{0}' based on the file name '{1}'. However this is not a valid F# identifier, so the contents will not be accessible from other files. Consider renaming the file or adding a 'module' or 'namespace' declaration at the top of the file.
cs: Deklarace z tohoto souboru se umístí do implicitního modulu {0} založeného na názvu souboru {1}. To ale není platný identifikátor F#, takže obsah nebude dostupný z jiných souborů. Zvažte přejmenování souboru nebo přidání deklarace modulu nebo oboru názvů na jeho začátek.
de: Die Deklarationen in dieser Datei werden anhand des Dateinamens "{1}" im impliziten Modul "{0}" platziert. Dies ist jedoch kein gültiger F#-Bezeichner, sodass von anderen Dateien aus kein Zugriff auf die Inhalte möglich ist. Benennen Sie die Datei um, oder fügen Sie oben in der Datei eine module- oder namespace-Deklaration hinzu.
es: Las declaraciones de este archivo se pondrán en un módulo implícito '{0}' basado en el nombre de archivo '{1}'. Sin embargo, este no es un identificador de F# válido; por tanto, el contenido no será accesible desde otros archivos. Considere cambiar el nombre del archivo o agregar una declaración 'module' o 'namespace' al principio del archivo.
fr: Les déclarations de ce fichier vont être placées dans un module implicite '{0}' en fonction du nom de fichier '{1}'. Toutefois, il ne s'agit pas d'un identificateur F# valide ; par conséquent, le contenu ne sera pas accessible à partir des autres fichiers. Renommez le fichier ou ajoutez une déclaration 'module' ou 'namespace' en haut du fichier.
it: Le dichiarazioni presenti in questo file verranno inserite in un modulo implicito '{0}' in base al nome di file '{1}'. Questo non è tuttavia un identificatore F# valido, pertanto i contenuti non saranno accessibili da altri file. Provare a rinominare il file o ad aggiungere una dichiarazione 'module' o 'namespace' all'inizio del file.
ja: このファイルの宣言は、ファイル名 '{1}' に基づいて、暗黙的なモジュール '{0}' に配置されます。ただし、これは有効な F# 識別子ではないため、その内容には他のファイルからアクセスできません。ファイル名を変更するか、ファイルの一番上に 'module' または 'namespace' の宣言を追加してください。
ko: 이 파일의 선언은 파일 이름 '{1}'을(를) 기반으로 암시적 모듈 '{0}'에 배치됩니다. 그러나 이는 올바른 F# 식별자가 아니므로 다른 파일에서 내용에 액세스할 수 없게 됩니다. 파일의 이름을 바꾸거나 파일의 맨 위에 'module' 또는 'namespace' 선언을 추가하세요.
pl: Deklaracje w tym pliku będą umieszczane w niejawnym module „{0}” na podstawie nazwy pliku „{1}”. Nie jest to jednak prawidłowy identyfikator języka F#, dlatego zawartość nie będzie dostępna z innych plików. Rozważ zmianę nazwy pliku lub dodanie deklaracji „module” lub „namespace” na początku pliku.
pt_br: As declarações neste arquivo serão localizadas em um módulo implícito '{0}' com base no nome do arquivo '{1}'. Entretanto este não é um identificador F# válido, de maneira que os conteúdos não estarão acessíveis de outros arquivos. Considere renomear o arquivo ou adicionar uma declaração 'module' ou 'namespace' na parte superior do arquivo.
ru: Объявления, содержащиеся в этом файле, будут помещены в неявный модуль "{0}" на основе имени файла "{1}". Тем не менее, поскольку этот идентификатор не является допустимым идентификатором F#, содержимое будет недоступно из других файлов. Рекомендуется переименовать файл либо добавить объявление "module" или "namespace" в начало файла.
tr: Bu dosyadaki bildirimler, '{1}' dosya adı temelinde örtük '{0}' modülüne yerleştirilecek. Ancak bu geçerli bir F# tanımlayıcısı olmadığından, içeriğine diğer dosyalardan erişilemeyecek. Dosyayı yeniden adlandırmayı veya dosyanın başına 'modül' ya da 'ad alanı' bildirimi eklemeyi düşünün.
zh_hans: 此文件中的声明将置于基于文件名“{1}”的隐式模块“{0}”中。但由于这不是一个有效的 F# 标识符，因此将无法从其他文件访问该内容。请考虑重命名此文件或在文件的顶部添加 "module" 或 "namespace" 声明。
zh_hant: 這個檔案中的宣告將根據檔案名稱 '{1}' 放在隱含模組 '{0}' 中。但因為這並不是有效的 F# 識別碼，所以無法從其他檔案存取其內容。請考慮重新命名檔案，或在檔案最上方加入 'module' 或 'namespace' 宣告。

# buildMultiFileRequiresNamespaceOrModule
source: Files in libraries or multiple-file applications must begin with a namespace or module declaration, e.g. 'namespace SomeNamespace.SubNamespace' or 'module SomeNamespace.SomeModule'. Only the last source file of an application may omit such a declaration.
cs: Soubory v knihovnách nebo aplikacích s víc soubory musí začínat deklarací oboru názvů nebo modulu, třeba namespace SomeNamespace.SubNamespace nebo module SomeNamespace.SomeModule. Tato deklarace se dá vynechat jenom u posledního zdrojového souboru aplikace.
de: Dateien in Bibliotheken oder Anwendungen mit mehreren Dateien müssen mit einer Namespace- oder Moduldeklaration beginnen. Beispiel: "namespace SomeNamespace.SubNamespace" oder "module SomeNamespace.SomeModule". Nur in der letzten Quelldatei einer Anwendung darf eine solche Deklaration ausgelassen werden.
es: Los archivos en bibliotecas o aplicaciones de varios archivos deben comenzar con una declaración de espacio de nombres o de módulo; por ejemplo, 'namespace SomeNamespace.SubNamespace' o 'module SomeNamespace.SomeModule'. Solamente el último archivo de código fuente de una aplicación puede omitir tal declaración.
fr: Les fichiers situés dans les bibliothèques ou les applications contenant plusieurs fichiers doivent commencer par une déclaration d'espace de noms ou de module, par exemple 'namespace SomeNamespace.SubNamespace' ou 'module SomeNamespace.SomeModule'. Seul le dernier fichier source d'une application peut omettre une telle déclaration.
it: I file delle librerie o delle applicazioni con più file devono iniziare con una dichiarazione di spazio dei nomi o di modulo, ad esempio 'namespace SomeNamespace.SubNamespace' o 'module SomeNamespace.SomeModule'. Solo l'ultimo file di origine di un'applicazione può omettere tale dichiarazione.
ja: ライブラリまたは複数ファイル アプリケーション内のファイルは、名前空間またはモジュールの宣言から開始する必要があります (例: 'namespace SomeNamespace.SubNamespace' or 'module SomeNamespace.SomeModule')。アプリケーションの最後のソース ファイルのみ、このような宣言を省略できます。
ko: 라이브러리 또는 다중 파일 애플리케이션의 파일은 네임스페이스 또는 모듈 선언으로 시작해야 합니다(예: 'namespace SomeNamespace.SubNamespace' 또는 'module SomeNamespace.SomeModule'). 애플리케이션의 마지막 소스 파일만 선언이 없어도 됩니다.
pl: Pliki w bibliotekach lub aplikacjach z wieloma plikami muszą rozpoczynać się od deklaracji przestrzeni nazw lub modułu (np. „namespace PrzestrzenNazw.PodrzednaPrzestrzenNazw” lub „module PrzestrzenNazw.Modul”). Taka deklaracja może zostać pominięta tylko w ostatnim pliku źródłowym aplikacji.
pt_br: Arquivos em bibliotecas ou aplicativos com arquivos múltiplos devem começar com uma declaração de namespace ou módulo, por exemplo, 'namespace SomeNamespace.SubNamespace' ou 'module SomeNamespace.SomeModule'. Somente o último arquivo de origem de um aplicativo pode omitir tal declaração.
ru: Файлы в библиотеках или многофайловых приложениях должны начинаться с объявления пространства имен или модуля, например, "namespace SomeNamespace.SubNamespace" или "module SomeNamespace.SomeModule". Такое объявление может отсутствовать только в последнем файле исходного кода приложения.
tr: Kitaplıklardaki veya çok dosyalı uygulamalardaki dosyalar ad alanı veya modül bildirimiyle başlamalıdır, örn. 'namespace SomeNamespace.SubNamespace' veya 'module SomeNamespace.SomeModule'. Bir uygulamanın yalnızca son kaynak dosyasında böyle bir bildirim atlanabilir.
zh_hans: 库或多文件应用程序中的文件必须以命名空间或模块声明开头，例如 "namespace SomeNamespace.SubNamespace" 或 "module SomeNamespace.SomeModule"。仅应用程序的最后一个源文件可以忽略此类声明。
zh_hant: 程式庫或多檔案應用程式中的檔案應該以命名空間或模組宣告開頭，例如 'namespace SomeNamespace.SubNamespace' 或 'module SomeNamespace.SomeModule'。只有應用程式的最後一個原始程式檔可以省略這樣的宣告。

# noEqualSignAfterModule
source: Files in libraries or multiple-file applications must begin with a namespace or module declaration. When using a module declaration at the start of a file the '=' sign is not allowed. If this is a top-level module, consider removing the = to resolve this error.
cs: Soubory v knihovnách nebo aplikacích s víc soubory musí začínat deklarací oboru názvů nebo modulu. Pokud na začátku souboru použijete deklaraci modulu, není povolený znak =. Pokud to je modul nejvyšší úrovně, zvažte odebrání znaku = pro vyřešení této chyby.
de: Dateien in Bibliotheken oder Anwendungen mit mehreren Dateien müssen mit einem Namespace oder einer Moduldeklaration beginnen. Wenn eine Moduldeklaration am Anfang einer Datei verwendet wird, ist das Zeichen "=" unzulässig. Wenn es sich um ein Modul der obersten Ebene handelt, sollten Sie ggf. das Zeichen "=" entfernen, um diesen Fehler zu beheben.
es: Los archivos en bibliotecas o aplicaciones de varios archivos deben comenzar con una declaración de espacio de nombres o de módulo. Cuando se usa una declaración de módulo al principio de un archivo, el signo "=" no se permite. Si se trata de un módulo de nivel superior, considere la posibilidad de quitar el signo = para resolver el error.
fr: Les fichiers situés dans les bibliothèques ou les applications contenant plusieurs fichiers doivent commencer par une déclaration d'espace de noms ou de module. Quand vous utilisez une déclaration de module au début d'un fichier, le signe '=' n'est pas autorisé. S'il s'agit d'un module de niveau supérieur, supprimez le signe = pour résoudre l'erreur.
it: I file in librerie o in applicazioni con più file devono iniziare con una dichiarazione di modulo o di spazio dei nomi. Quando si usa una dichiarazione di modulo all'inizio del file, il segno '=' non è consentito. Se questo è un modulo di primo livello, provare a rimuovere il segno = per risolvere l'errore.
ja: ライブラリ内のファイル、または複数ファイル アプリケーション内のファイルでは、先頭に名前空間宣言またはモジュール宣言を置く必要があります。ファイルの先頭にモジュール宣言を置く場合、'=' 記号は指定できません。これが最上位レベルのモジュールである場合は、このエラーを解決するために = を削除することを検討してください。
ko: 라이브러리 또는 다중 파일 애플리케이션의 파일은 네임스페이스 또는 모듈 선언으로 시작해야 합니다. 파일 시작에 모듈 선언을 사용하는 경우 '=' 기호를 사용할 수 없습니다. 최상위 모듈인 경우 =를 제거하여 이 오류를 해결하세요.
pl: Pliki w bibliotekach lub aplikacje złożone z wielu plików muszą rozpoczynać się od deklaracji przestrzeni nazw lub modułu. W przypadku użycia deklaracji modułu na początku pliku nie dopuszcza się zastosowania znaku „=”. Jeśli jest to moduł najwyższego poziomu, rozważ usunięcie znaku = w celu usunięcia tego błędu.
pt_br: Arquivos em bibliotecas ou aplicativos de múltiplos arquivos devem começar com um namespace ou declaração de módulo. Ao usar uma declaração de módulo no início de um arquivo, o sinal '=' não é permitido. Se esse for um módulo de nível superior, considere remover o = para resolver esse erro.
ru: Файлы в библиотеках или многофайловых приложениях должны начинаться с объявления пространства имен или модуля. При использовании объявления модуля в начале файла знак "=" не разрешен. Если это модуль верхнего уровня, рекомендуется удалить "=", чтобы устранить эту ошибку.
tr: Kitaplıklar veya çok dosyalı uygulamalardaki dosyalar bir ad alanı veya modül bildirimiyle başlamalıdır. Bir dosyanın başında modül bildirimi kullanılırken '=' işaretine izin verilmez. Bu bir üst düzey modülse, bu hatayı çözmek için = işaretini kaldırmayı düşünün.
zh_hans: 库或多文件应用程序中的文件必须以命名空间或模块声明开头。当在文件开头使用模块声明时，"=" 号不被允许。如果这是顶级模块，请考虑删除 = 来解决此错误。
zh_hant: 程式庫或多檔案應用程式中的檔案必須以命名空間或模組宣告為開頭。在檔案開頭使用模組宣告時，不允許 '=' 符號。如果這是頂層模組，請考慮移除 = 以解決此錯誤。
