Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# tcMethodNotAccessible
source: Method '{0}' is not accessible from this code location
cs: Metoda {0} není na tomto místě v kódu dostupná.
de: Auf die {0}-Methode kann von dieser Position im Code nicht zugegriffen werden.
es: El método '{0}' no es accesible desde este lugar del código.
fr: La méthode '{0}' n'est pas accessible à partir de cet emplacement du code
it: Il metodo '{0}' non è accessibile da questa posizione di codice
ja: メソッド '{0}' はこのコードの場所からアクセスできません
ko: '{0}' 메서드는 이 코드 위치에서 액세스할 수 없습니다.
pl: Nie można uzyskać dostępu do tej metody „{0}” z tej lokalizacji kodu
pt_br: O método '{0}' não é acessível no local deste código
ru: Метод "{0}" недоступен из данного расположения в коде
tr: '{0}' metoduna bu kod konumundan erişilemiyor
zh_hans: 无法从此代码位置访问方法“{0}”
zh_hant: 無法從這個程式碼位置存取方法 '{0}'

# tcImplicitMeasureFollowingSlash
source: Implicit product of measures following /
cs: Za lomítkem (/) následuje implicitní vytvoření míry.
de: Implizites Produktmaß nach "/".
es: Producto de medidas implícito después de /.
fr: Produit implicite de mesures après /
it: Prodotto di misure implicito dopo /
ja: / に続く暗黙的な単位の積
ko: / 다음의 측정값에 대한 암시적 곱입니다.
pl: Niejawny iloczyn miar poprzedzony znakiem /
pt_br: Produto de medida implícito seguindo /
ru: Далее неявный результат измерений /
tr: / sonrasındaki ölçülerin örtük çarpımı
zh_hans: / 后的度量值的隐式乘积
zh_hant: 在 / 後有隱含的測量乘積

# tcUnexpectedMeasureAnon
source: Unexpected SynMeasure.Anon
cs: Neočekávalo se SynMeasure.Anon.
de: Unerwartetes SynMeasure.Anon
es: SynMeasure.Anon inesperado.
fr: SynMeasure.Anon inattendu
it: SynMeasure.Anon imprevisto
ja: 予期しない SynMeasure.Anon です:
ko: 예기치 않은 SynMeasure.Anon입니다.
pl: Nieoczekiwany element SynMeasure.Anon
pt_br: SynMeasure.Anon Inesperado
ru: Непредвиденное значение SynMeasure.Anon
tr: Beklenmeyen SynMeasure.Anon
zh_hans: 意外的 SynMeasure.Anon
zh_hant: 未預期的 SynMeasure.Anon

# tcNonZeroConstantCannotHaveGenericUnit
source: Non-zero constants cannot have generic units. For generic zero, write 0.0<_>.
cs: U nenulových konstant nemůžou být obecné jednotky. Obecný nulový zápis je 0.0<_>.
de: Konstanten, deren Wert ungleich 0 ist, dürfen keine generischen Einheiten enthalten. Schreiben Sie "0.0<_>" für generische Nullen.
es: Las constantes diferentes de cero no pueden tener unidades genéricas. Para cero genérico, escriba 0.0<_>.
fr: Les constantes non nulles ne peuvent pas avoir d'unités génériques. Pour un zéro générique, écrivez 0.0<_>.
it: Le costanti non zero non possono avere unità generiche. Per lo zero generico, scrivere 0.0<_>.
ja: ゼロではない定数に汎用ユニットを含めることはできません。汎用ゼロの場合、0.0<_> とします。
ko: 0이 아닌 상수에는 제네릭 단위를 지정할 수 없습니다. 제네릭 0을 사용하려면 0.0<_>을 작성하세요.
pl: Stałe inne niż zero nie mogą mieć jednostek ogólnych. W przypadku ogólnej wartości zero użyj formy 0.0<_>.
pt_br: Constantes não nulas não podem ter unidades genéricas. Para um zero genérico, grave 0.0<_>.
ru: Ненулевые константы не могут иметь универсальных единиц измерения. Для универсальных нулевых констант используйте 0.0<_>.
tr: Sıfır olmayan sabit değerlerin genel birimleri olamaz. Genel sıfır için 0.0<_> yazın.
zh_hans: 非零常量不能具有泛型单位。对于泛型零，请编写 0.0<_>。
zh_hant: 非零常數不能有泛型單位。如需泛型的零，請寫成 0.0<_>。

# tcSeqResultsUseYield
source: In sequence expressions, results are generated using 'yield'
cs: Ve výrazech pořadí se výsledky generují pomocí yield.
de: In Sequenzausdrücken werden Ergebnisse mithilfe von "yield" erzeugt.
es: En expresiones de secuencia, los resultados se generan con 'yield'.
fr: Dans les expressions de séquence, les résultats sont générés à l'aide de 'yield'
it: Nelle espressioni sequenza i risultati sono generati mediante 'yield'
ja: シーケンス式の結果は、'yield' を使用して生成されます
ko: 시퀀스 식에서는 'yield'를 사용하여 결과가 생성됩니다.
pl: W wyrażeniach sekwencji wyniki są generowane przy użyciu elementu „yield”
pt_br: Em expressões de sequência, os resultados são gerados com o uso de 'yield'
ru: В выражениях последовательности результаты создаются с помощью "yield"
tr: Dizi ifadelerinde, sonuçlar 'yield' kullanılarak oluşturulur
zh_hans: 在序列表达式中，使用“yield”生成结果
zh_hant: 在循序項運算式中，結果是使用 'yield' 產生的

# tcUnexpectedBigRationalConstant
source: Unexpected big rational constant
cs: Neočekávaná rozměrná racionální konstanta
de: Unerwartete große rationale Konstante.
es: Constante racional grande inesperada.
fr: Constante rationnelle importante inattendue
it: Costante razionale grande non prevista
ja: 有理定数が大きすぎます:
ko: 예기치 않은 큰 유리 상수입니다.
pl: Nieoczekiwana duża stała wymierna
pt_br: Constante racional grande inesperada
ru: Недопустимая большая рациональная константа
tr: Beklenmeyen büyüklükte oran sabiti
zh_hans: 意外的大有理常数
zh_hant: 未預期的大型有理數常數

# tcInvalidTypeForUnitsOfMeasure
source: Units-of-measure are only supported on float, float32, decimal, and integer types.
cs: Měrné jednotky se podporují jenom u typů float, float32, decimal a signed integer.
de: Maßeinheiten werden nur für die Typen "float", "float32", "decimal" und "signed integer" unterstützt.
es: Solo se admiten unidades de medida en los tipos float, float32, decimal y de entero firmado.
fr: Unités de mesure prises en charge uniquement pour les types float, float32, decimal et integer signés
it: Unità di misura supportata solo in tipi float, float32, decimal e Integer con segno
ja: float 型、float32 型、decimal 型、および符号付き整数型でのみサポートされる単位です
ko: 측정 단위는 float, float32, decimal 및 부호 있는 정수 형식에 대해서만 지원됩니다.
pl: Jednostki miary są obsługiwane tylko w przypadku typów float, float32, decimal i signed integer
pt_br: Unidades de medida só são suportadas em tipos float, float32, decimal e inteiro com sinal
ru: Единицы измерения поддерживаются только с типами float, float32, decimal и signed integer
tr: Ölçü birimleri yalnızca kayan, float32, ondalık ve işaretli tamsayı türlerinde desteklenir
zh_hans: 仅 float、float32、decimal 和带符号整数类型支持度量单位
zh_hant: 只有 float、float32、decimal 和有正負號的整數類型支援測量單位

# tcUnexpectedConstUint16Array
source: Unexpected Const_uint16array
cs: Const_uint16array se neočekávalo.
de: Unerwartetes "Const_uint16array".
es: Const_uint16array inesperado.
fr: Const_uint16array inattendu
it: Const_uint16array non previsto
ja: 予期しない Const_uint16array です:
ko: 예기치 않은 Const_uint16array입니다.
pl: Nieoczekiwana wartość Const_uint16array
pt_br: Const_uint16array inesperado
ru: Недопустимый Const_uint16array
tr: Beklenmeyen Const_uint16array
zh_hans: 意外的 Const_uint16array
zh_hant: 未預期的 Const_uint16array

# tcUnexpectedConstByteArray
source: Unexpected Const_bytearray
cs: Const_bytearray se neočekávalo.
de: Unerwartetes "Const_bytearray".
es: Const_bytearray inesperado.
fr: Const_bytearray inattendu
it: Const_bytearray non previsto
ja: 予期しない Const_bytearray です:
ko: 예기치 않은 Const_bytearray입니다.
pl: Nieoczekiwana wartość Const_bytearray
pt_br: Const_bytearray inesperado
ru: Недопустимый Const_bytearray
tr: Beklenmeyen Const_bytearray
zh_hans: 意外的 Const_bytearray
zh_hant: 未預期的 Const_bytearray

# tcParameterRequiresName
source: A parameter with attributes must also be given a name, e.g. '[<Attribute>] Name : Type'
cs: Parametr s atributy vyžaduje také název, třeba [<Atribut>] Název : Typ.
de: Ein Parameter mit Attributen muss auch einen Namen besitzen, z.B. "[<Attribute>] Name : Type"
es: Un parámetro con atributos debe también tener un nombre, por ejemplo "[<Attribute>] Name : Type"
fr: Un paramètre avec des attributs doit aussi avoir un nom, par ex. '[<Attribute>] Name : Type'
it: A un parametro con attributi deve essere inoltre assegnato un nome, ad esempio '[<Attribute>] Name : Type'
ja: 属性のパラメーターにも名前を指定する必要があります。例: '[<Attribute>] Name : Type'
ko: 특성이 지정된 매개 변수에는 이름도 지정해야 합니다(예: '[<Attribute>] Name : Type').
pl: Parametrowi z atrybutami należy również nadać nazwę, np. „[<atrybut>] nazwa : typ”
pt_br: Um parâmetro com atributos também deve receber um nome, ex.: '[<Attribute>] Name : Type'
ru: Необходимо также указать имя параметра с атрибутами, например, '[<Атрибут>] имя : тип'
tr: Öznitelikleri olan bir parametreye ad da verilmelidir, ör. '[<Attribute>] Name : Type'
zh_hans: 带属性的参数还必须具有名称，例如 "[<Attribute>] Name : Type"
zh_hant: 具有屬性的參數也必須有名稱，例如 '[<Attribute>] Name : Type'

# tcReturnValuesCannotHaveNames
source: Return values cannot have names
cs: Návratové hodnoty nemůžou mít názvy.
de: Rückgabetypen dürfen keinen Namen aufweisen.
es: Los valores devueltos no pueden tener nombre.
fr: Les valeurs de retour ne peuvent pas avoir de noms
it: I valori restituiti non possono avere nomi
ja: 戻り値には名前を指定できません
ko: 반환 값에는 이름을 지정할 수 없습니다.
pl: Zwracane wartości nie mogą mieć nazw
pt_br: Valores retornados não podem ter nomes
ru: Значения возврата не могут иметь имен
tr: Dönüş değerlerinin adları olamaz
zh_hans: 返回值不能具有名称
zh_hant: 傳回值不能有名稱

# tcMemberKindPropertyGetSetNotExpected
source: MemberKind.PropertyGetSet only expected in parse trees
cs: MemberKind.PropertyGetSet se očekává jenom ve stromech pro analýzu.
de: MemberKind.PropertyGetSet wird nur in Analysestrukturen erwartet.
es: MemberKind.PropertyGetSet se espera solo en árboles de análisis.
fr: MemberKind.PropertyGetSet attendu uniquement dans les arborescences d'analyse
it: MemberKind.PropertyGetSet previsto solo in strutture ad albero di analisi
ja: 解析ツリーに使用できるのは MemberKind.PropertyGetSet のみです
ko: MemberKind.PropertyGetSet은 구문 분석 트리에만 필요합니다.
pl: Element MemberKind.PropertyGetSet jest oczekiwany tylko w drzewach analizy
pt_br: MemberKind.PropertyGetSet só é esperado em árvores de análise
ru: MemberKind.PropertyGetSet требуется только в деревьях синтаксического анализа
tr: MemberKind.PropertyGetSet yalnızca ayrıştırma ağaçlarında beklenir
zh_hans: 仅分析树中需要 MemberKind.PropertyGetSet
zh_hant: 只有剖析樹狀目錄中需要 MemberKind.PropertyGetSet

# tcNamespaceCannotContainValues
source: Namespaces cannot contain values. Consider using a module to hold your value declarations.
cs: Obory názvů nemůžou obsahovat hodnoty. K uložení deklarací hodnot můžete použít modul.
de: Namespaces dürfen keine Werte enthalten. Verwenden Sie ein eigenes Modul für Ihre Wertdeklarationen.
es: Los espacios de nombres no pueden contener valores. Considere el uso de un módulo para albergar las declaraciones de valor.
fr: Les espaces de noms ne peuvent pas contenir de valeurs. Utilisez un module pour conserver vos déclarations de valeur.
it: Gli spazi dei nomi non possono contenere valori. Provare a utilizzare un modulo che contenga le dichiarazioni dei valori.
ja: 名前空間に値を含めることはできません。値の宣言を保持するモジュールを使用してください。
ko: 네임스페이스에는 값을 포함할 수 없습니다. 모듈을 사용하여 값 선언을 저장하세요.
pl: Przestrzenie nazw nie mogą zawierać wartości. Rozważ użycie modułu zawierającego deklaracje wartości.
pt_br: Namespaces não podem conter valores. Considere usar um módulo para isentar suas declarações de valores.
ru: Пространство имен не может содержать значений. Рекомендуется использовать модуль для удержания объявлений значений.
tr: Ad alanları değer içeremez. Değer bildirimlerinizi tutmak için modül kullanmayı düşünün.
zh_hans: 命名空间不能包含值。请考虑使用模块来包含值声明。
zh_hant: 命名空間不能包含值。請考慮使用模組來存放值宣告。

# tcNamespaceCannotContainExtensionMembers
source: Namespaces cannot contain extension members except in the same file and namespace declaration group where the type is defined. Consider using a module to hold declarations of extension members.
cs: Obory názvů nemůžou obsahovat členy rozšíření (to jde jenom ve stejném souboru a skupině deklarací oboru názvů, kde je definovaný i typ). K uložení deklarací členů rozšíření můžete použít modul.
de: Namespaces dürfen Erweiterungsmember nur in der gleichen Datei und Namespace-Deklarationsgruppe enthalten, in denen der Typ definiert ist. Verwenden Sie ggf. ein eigenes Modul für Deklarationen von Erweiterungsmembern.
es: Los espacios de nombres no pueden contener miembros de extensión, excepto en el mismo archivo y grupo de declaración del espacio de nombres donde se define el tipo. Considere la posibilidad de usar un módulo para albergar declaraciones de miembros de extensión.
fr: Les espaces de noms ne peuvent pas contenir de membres d'extension sauf dans le groupe de déclarations de fichiers et d'espaces de noms où le type est défini. Utilisez un module pour conserver les déclarations des membres d'extension.
it: Gli spazi dei nomi non possono contenere membri di estensione, tranne che nello stesso gruppo di dichiarazione di file e spazio dei nomi in cui è definito il tipo. Provare a usare un modulo che contenga le dichiarazioni dei membri di estensione.
ja: 型を定義したファイルおよび名前空間宣言グループの場合を除き、名前空間に拡張メンバーを含めることはできません。拡張メンバーの宣言を保持するモジュールを使用してください。
ko: 형식이 정의된 것과 같은 파일 및 네임스페이스 선언 그룹을 제외하고 네임스페이스는 확장 멤버를 포함할 수 없습니다. 모듈을 사용하여 확장 멤버의 선언을 저장하세요.
pl: Przestrzenie nazw nie mogą zawierać elementów członkowskich rozszerzeń, z wyjątkiem grupy deklaracji pliku i przestrzeni nazw, w których zdefiniowano dany typ. Rozważ użycie modułu zawierającego deklaracje elementów członkowskich rozszerzeń.
pt_br: Namespaces não podem conter membros de extensão, exceto no mesmo arquivo e grupo de declaração de namespace, em que o tipo é definido. Considere o uso de um módulo para reter declarações de membros de extensão.
ru: Пространства имен не могут содержать элементы расширения, кроме элементов в том же файле и группе объявлений пространства имен, где определен тип. Рекомендуется использовать модуль для объявлений элементов расширения.
tr: Ad alanları, türün tanımlandığı dosya ve ad alanı bildirim grubundakiler dışında uzantı üyeleri içeremez. Uzantı üyesi bildirimlerini tutmak için bir modül kullanmayı düşünün.
zh_hans: 命名空间不能包含扩展成员(在定义类型的同一文件和命名空间声明组中除外)。请考虑使用模块来包含扩展成员的声明。
zh_hant: 命名空間不能包含擴充成員，除非在已定義類型的相同檔案和命名空間宣告群組內。請考慮使用模組來保留擴充成員的宣告。

# tcMultipleVisibilityAttributes
source: Multiple visibility attributes have been specified for this identifier
cs: Pro tento identifikátor jste zadali víc atributů viditelnosti.
de: Für diesen Bezeichner wurden mehrere Sichtbarkeitsattribute angegeben.
es: Se han especificado varios atributos de visibilidad para este identificador.
fr: Plusieurs attributs de visibilité ont été spécifiés pour cet identificateur
it: Più attributi di visibilità specificati per l'identificatore
ja: この識別子に複数の表示範囲属性が指定されました
ko: 이 식별자에 대해 다중 표시 유형 특성이 지정되었습니다.
pl: Określono wiele atrybutów widoczności dla tego identyfikatora
pt_br: Atributos de visibilidade múltipla foram especificados por este identificador
ru: Для данного идентификатора были указаны множественные атрибуты видимости
tr: Bu tanımlayıcı için birden çok görünürlük özniteliği belirtilmiş
zh_hans: 已为此标识符指定多个可见性特性
zh_hant: 已經為這個識別碼指定多個可見度屬性

# tcMultipleVisibilityAttributesWithLet
source: Multiple visibility attributes have been specified for this identifier. 'let' bindings in classes are always private, as are any 'let' bindings inside expressions.
cs: Pro tento identifikátor jste zadali víc atributů viditelnosti. Vazby let ve třídách jsou vždycky privátní, stejně jako kterákoli vazba let ve výrazu.
de: Für diesen Bezeichner wurden mehrere Sichtbarkeitsattribute angegeben. Bindungen vom Typ 'let' in Klassen sind immer privat, wie alle Bindungen vom Typ 'let' innerhalb von Ausdrücken.
es: Se han especificado varios atributos de visibilidad para este identificador. Los enlaces 'let' en clases son siempre privados, igual que los enlaces 'let' en expresiones.
fr: Plusieurs attributs de visibilité ont été spécifiés pour cet identificateur. Les liaisons 'let' dans les classes sont toujours privées, à l'instar des liaisons 'let' dans les expressions.
it: Sono stati specificati più attributi di visibilità per l'identificatore. I binding 'let' nelle classi sono sempre privati, così come eventuali binding 'let' nelle espressioni.
ja: この識別子に複数の表示範囲属性が指定されました。式内のすべての 'let' 束縛と同様に、クラス内の 'let' 束縛は常にプライベートです。
ko: 이 식별자에 대해 다중 표시 유형 특성이 지정되었습니다. 클래스의 'let' 바인딩은 식 안의 모든 'let' 바인딩과 마찬가지로 항상 Private입니다.
pl: Określono wiele atrybutów widoczności dla tego identyfikatora. Powiązania „let” w klasach są zawsze prywatne, tak jak powiązania „let” w wyrażeniach.
pt_br: Atributos de visibilidade múltipla foram especificados por este identificador. Associações 'let' em classes são sempre privadas, como quaisquer associações 'let' nestas expressões.
ru: Для данного идентификатора были указаны множественные атрибуты видимости. привязки "let" в классах всегда являются закрытыми, так же, как и привязки "let" внутри выражений.
tr: Bu tanımlayıcı için birden çok görünürlük özniteliği belirtilmiş. İfade içlerindeki tüm 'let' bağlamaları her zaman özel olduğu gibi sınıflardaki 'let' bağlamaları da her zaman özeldir.
zh_hans: 已为此标识符指定多个可见性特性。与表达式中的任何“let”绑定一样，类中的“let”绑定总是私有的。
zh_hant: 已經為這個識別碼指定多個可見度屬性。類別中的 'let' 繫結一定是私用的，就如同運算式內的任何 'let' 繫結一樣。

# tcInvalidMethodNameForRelationalOperator
source: The name '({0})' should not be used as a member name. To define comparison semantics for a type, implement the 'System.IComparable' interface. If defining a static member for use from other CLI languages then use the name '{1}' instead.
cs: ({0}) není vhodný název pro člena. Pokud chcete definovat sémantiku porovnání pro typ, implementujte rozhraní System.IComparable. Pokud definujete statického člena, který se má použít z jiných jazyků CLI, použijte místo toho název {1}.
de: Der Name "({0})" sollte nicht als Membername verwendet werden. Implementieren Sie zum Definieren der Vergleichssemantik für einen Typ die System.IComparable-Schnittstelle. Verwenden Sie zum Definieren eines statischen Members für die Verwendung durch andere CLI-Sprachen stattdessen den Namen "{1}".
es: El nombre '({0})' no debe usarse como un nombre de miembro. Para definir semántica de comparación para un tipo, implemente la interfaz 'System.IComparable'. Si define un miembro estático para usarlo desde otros lenguajes CLI, use el nombre '{1}' en su lugar.
fr: Le nom '({0})' ne doit pas être utilisé en tant que nom de membre. Pour définir une sémantique de comparaison pour un type, implémentez l'interface 'System.IComparable'. Si vous définissez un membre statique à utiliser à partir d'autres langages CLI, utilisez le nom '{1}' à la place.
it: Il nome '({0})' non può essere utilizzato come nome di membro. Per definire semantica di confronto per un tipo, implementare l'interfaccia 'System.IComparable'. Se si definisce un membro statico per l'utilizzo da parte di altri linguaggi CLI, utilizzare il nome '{1}'.
ja: 名前 '({0})' はメンバー名として使用しないでください。型の比較セマンティクスを定義するには、'System.IComparable' インターフェイスを実装してください。他の CLI 言語から使用するために静的メンバーを定義する場合、代わりに '{1}' という名前を使用してください。
ko: 이름 '({0})'은(는) 멤버 이름으로 사용하면 안 됩니다. 형식에 대한 비교 의미 체계를 정의하려면 'System.IComparable' 인터페이스를 구현하세요. 다른 CLI 언어를 통해 사용할 정적 멤버를 정의하는 경우에는 이름 '{1}'을(를) 대신 사용하세요.
pl: Nazwa „({0})” nie powinna być używana jako nazwa elementu członkowskiego. Aby zdefiniować semantykę porównania dla typu, zaimplementuj interfejs „System.IComparable”. W przypadku definiowania statycznego elementu członkowskiego do użycia z innych języków infrastruktury CLI użyj nazwy „{1}”.
pt_br: O nome '({0})' não deve ser usado como um nome de membro. Para definir semânticas de comparação para um tipo, implemente a interface 'System.IComparable'. Se for definir um membro estático para uso em outras linguagens CLI use o nome '{1}'.
ru: Имя "({0})" не может использоваться в качестве имени элемента. Чтобы определить для типа семантику сравнения, реализуйте интерфейс "System.IComparable". При определении статического элемента для использования из других языков CLI, используйте имя "{1}".
tr: ({0})' adı üye adı olarak kullanılmamalıdır. Türe yönelik karşılaştırma semantiğini tanımlamak için 'System.IComparable' arabirimini uygulayın. Diğer CLI dillerinden kullanılacak statik bir üye tanımlıyorsanız onun yerine '{1}' adını kullanın.
zh_hans: 名称“({0})”不应用作成员名称。若要为类型定义比较语义，请实现“System.IComparable”接口。如果从其他 CLI 语言中定义了要使用的静态成员，请改用名称“{1}”。
zh_hant: 名稱 '({0})' 不應該做為成員名稱使用。若要定義類型的比較語意，請實作 'System.IComparable' 介面。如果要定義靜態成員以用於其他 CLI 語言，請改用名稱 '{1}'。

# tcInvalidMethodNameForEquality
source: The name '({0})' should not be used as a member name. To define equality semantics for a type, override the 'Object.Equals' member. If defining a static member for use from other CLI languages then use the name '{1}' instead.
cs: ({0}) není vhodný název pro člena. Pokud chcete definovat sémantiku rovnosti pro typ, přepište člena Object.Equals. Pokud definujete statického člena, který se má použít z jiných jazyků CLI, použijte místo toho název {1}.
de: Der Name "({0})" sollte nicht als Membername verwendet werden. Überschreiben Sie zum Definieren der Gleichheitssemantik für einen Typ den Object.Equals-Member. Verwenden Sie zum Definieren eines statischen Members für die Verwendung durch andere CLI-Sprachen stattdessen den Namen "{1}".
es: El nombre '({0})' no debe usarse como un nombre de miembro. Para definir semántica de igualdad para un tipo, invalide el miembro 'Object.Equals'. Si define un miembro estático para usarlo desde otros lenguajes CLI, use el nombre '{1}' en su lugar.
fr: Le nom '({0})' ne doit pas être utilisé en tant que nom de membre. Pour définir une sémantique d'égalité pour un type, substituez le membre 'Object.Equals'. Si vous définissez un membre statique à utiliser à partir d'autres langages CLI, utilisez le nom '{1}' à la place.
it: Il nome '({0})' non può essere utilizzato come nome di membro. Per definire semantica di uguaglianza per un tipo, eseguire l'override del membro 'Object.Equals'. Se si definisce un membro statico per l'utilizzo da parte di altri linguaggi CLI, utilizzare il nome '{1}'.
ja: 名前 '({0})' はメンバー名として使用しないでください。型の等値セマンティクスを定義するには、'Object.Equals' メンバーをオーバーライドしてください。他の CLI 言語から使用するために静的メンバーを定義する場合、代わりに '{1}' という名前を使用してください。
ko: 이름 '({0})'은(는) 멤버 이름으로 사용하면 안 됩니다. 형식에 대한 같음 의미 체계를 정의하려면 'Object.Equals' 멤버를 재정의하세요. 다른 CLI 언어를 통해 사용할 정적 멤버를 정의하는 경우에는 이름 '{1}'을(를) 대신 사용하세요.
pl: Nazwa „({0})” nie powinna być używana jako nazwa elementu członkowskiego. Aby zdefiniować semantykę równości dla typu, przesłoń element członkowski „Object.Equals”. W przypadku definiowania statycznego elementu członkowskiego do użycia z innych języków infrastruktury CLI użyj nazwy „{1}”.
pt_br: O nome '({0})' não deve ser usado como um nome de membro. Para definir a semântica de igualdade substitua o membro 'Object.Equals'. Se for definir um membro estático para uso em outras linguagens CLI, use o nome '{1}'.
ru: Имя "({0})" не может использоваться в качестве имени элемента. Чтобы определить для типа семантику равенства, переопределите элемент "Object.Equals". При определении статического элемента для использования из других языков CLI, используйте имя "{1}".
tr: ({0})' adı üye adı olarak kullanılmamalıdır. Türe yönelik eşitlik semantiğini tanımlamak için 'Object.Equals' üyesini geçersiz kılın. Diğer CLI dillerinden kullanılacak statik bir üye tanımlıyorsanız onun yerine '{1}' adını kullanın.
zh_hans: 名称“({0})”不应用作成员名称。若要为类型定义相等语义，请重写“Object.Equals”成员。如果从其他 CLI 语言中定义了要使用的静态成员，请改用名称“{1}”。
zh_hant: 名稱 '({0})' 不應該做為成員名稱使用。若要定義類型的相等語意，請覆寫 'Object.Equals' 成員。如果要定義靜態成員以用於其他 CLI 語言，請改用名稱 '{1}'。
