Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# couldNotLoadDependencyManagerExtension
source: The dependency manager extension {0} could not be loaded. Message: {1}
cs: Rozšíření správce závislostí {0} nešlo načíst. Zpráva: {1}
de: Die Abhängigkeits-Manager-Erweiterung "{0}" konnte nicht geladen werden. Meldung: {1}
es: No se pudo cargar la extensión del administrador de dependencias {0}. Mensaje: {1}
fr: Impossible de charger l'extension du gestionnaire de dépendances {0}. Message : {1}
it: Non è stato possibile caricare l'estensione {0} di gestione delle dipendenze. Messaggio: {1}
ja: 依存関係マネージャーの拡張機能 {0} を読み込むことができませんでした。メッセージ: {1}
ko: 종속성 관리자 확장 {0}을(를) 로드할 수 없습니다. 메시지: {1}
pl: Nie można załadować rozszerzenia menedżera zależności {0}. Komunikat: {1}
pt_br: Não foi possível carregar a extensão do gerenciador de dependências {0}. Mensagem: {1}
ru: Не удалось загрузить расширение диспетчера зависимостей {0}. Сообщение: {1}
tr: {0} bağımlılık yöneticisi uzantısı yüklenemedi. İleti: {1}
zh_hans: 无法加载依赖项管理器扩展 {0}。消息: {1}
zh_hant: 無法載入相依性管理員延伸模組 {0}。訊息: {1}

# typeInfoArgument
source: argument
es: Argumento
it: Argomento
ja: 引数
ko: 인수
pt_br: Argumento
ru: Аргумент
tr: Bağımsız değişken
zh_hans: 参数
zh_hant: 引數
