Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# tcOptionalArgsMustComeAfterNonOptionalArgs
source: Optional arguments must come at the end of the argument list, after any non-optional arguments
cs: Nepovinné argumenty musí být uvedené na konci seznamu argumentů, tj. až po všech povinných argumentech.
de: Optionale Argumente müssen am Ende der Argumentliste stehen, ggf. nach den nicht optionalen Argumenten.
es: Los argumentos opcionales deben estar al final de la lista de argumentos, después de todos los argumentos no opcionales.
fr: Les arguments facultatifs doivent se trouver à la fin de la liste d'arguments, après les arguments non facultatifs
it: Gli argomenti facoltativi devono essere aggiungi alla fine dell'elenco degli argomenti, dopo quelli obbligatori
ja: オプションの引数は、オプションではないすべての引数の後で、引数リストの末尾に指定する必要があります。
ko: 선택적 인수는 비선택적 인수 다음의 인수 목록 끝에 와야 합니다.
pl: Argumenty opcjonalne muszą występować na końcu listy argumentów po argumentach nieopcjonalnych
pt_br: Argumentos opcionais devem vir no final da lista de argumentos, depois dos argumentos não opcionais
ru: Необязательные аргументы должны следовать в конце списка аргументов, после обязательных
tr: İsteğe bağlı bağımsız değişkenler bağımsız değişken listesinin sonunda, isteğe bağlı olmayan tüm bağımsız değişkenlerden sonra gelmelidir
zh_hans: 可选参数必须位于参数列表结尾的任何非可选参数的后面
zh_hant: 選擇性引數必須位於引數清單末端，在所有非選擇性引數之後

# tcConditionalAttributeUsage
source: Attribute 'System.Diagnostics.ConditionalAttribute' is only valid on methods or attribute classes
cs: Atribut System.Diagnostics.ConditionalAttribute je platný jenom u metod nebo tříd atributů.
de: Das Attribut "System.Diagnostics.ConditionalAttribute" ist nur bei Methoden oder Attributklassen gültig.
es: El atributo 'System.Diagnostics.ConditionalAttribute' es válido sólo en métodos o clases de atributos.
fr: L'attribute 'System.Diagnostics.ConditionalAttribute' n'est valide que sur les méthodes ou les classes d'attributs
it: L'attributo 'System.Diagnostics.ConditionalAttribute' è valido solo in classi di attributi o metodi
ja: 属性 'System.Diagnostics.ConditionalAttribute' はメソッド クラスまたは属性クラスでのみ有効です
ko: 'System.Diagnostics.ConditionalAttribute' 특성은 메서드 또는 특성 클래스에만 사용할 수 있습니다.
pl: Atrybut „System.Diagnostics.ConditionalAttribute” jest prawidłowy tylko w przypadku metod lub klas atrybutów
pt_br: O atributo 'System.Diagnostics.ConditionalAttribute' somente é válido em classes de métodos ou atributos
ru: Атрибут System.Diagnostics.ConditionalAttribute допустим только в методах или классах атрибутов
tr: 'System.Diagnostics.ConditionalAttribute' özniteliği yalnızca metotlarda veya öznitelik sınıflarında geçerlidir
zh_hans: 特性“System.Diagnostics.ConditionalAttribute”仅对方法或特性类有效
zh_hant: 屬性 'System.Diagnostics.ConditionalAttribute' 只有在方法或屬性類別上才有效

# tcMemberOperatorDefinitionInExtrinsic
source: Extension members cannot provide operator overloads. Consider defining the operator as part of the type definition instead.
cs: Členové rozšíření nemůžou poskytovat přetížení operátorů. Zvažte možnost definovat místo toho operátor v definici typu.
de: Erweiterungsmember können keine Operatorüberladungen bereitstellen. Definieren Sie den Operator stattdessen als Teil der Typdefinition.
es: Los miembros de extensión no pueden proporcionar sobrecargas de operador. En su lugar, considere definir el operador como parte de la definición de tipo.
fr: Les membres d'extension ne peuvent pas fournir de surcharges d'opérateur. Définissez l'opérateur comme faisant partie de la définition de type.
it: I membri di estensione non possono fornire overload di operatori. Provare a definire l'operatore come parte della definizione del tipo.
ja: 拡張メンバーでは演算子のオーバーロードを実行できません。代わりに型定義の一部として演算子を定義してください。
ko: 확장 멤버가 연산자 오버로드를 제공할 수 없습니다. 대신 연산자를 형식 정의의 일부분으로 정의하세요.
pl: Elementy członkowskie rozszerzeń nie mogą udostępniać przeciążeń operatorów. Zamiast tego rozważ zdefiniowanie operatora jako części definicji typu.
pt_br: Membros de extensão não podem fornecer sobrecargas de operadores. Considere definir o operador como parte da definição de tipo.
ru: Элементы расширения не могут предоставлять перегрузку операторов. Вместо этого рекомендуется определить оператор как часть определения типа.
tr: Uzantı üyeleri işleç aşırı yüklemeleri sağlayamaz. Bunun yerine işleci tür tanımının parçası olarak tanımlamayı düşünün.
zh_hans: 扩展成员无法提供运算符重载。 请考虑改为将运算符定义为类型定义的一部分。
zh_hant: 擴充成員無法提供運算子多載。請考慮將運算子改成定義為類型定義的一部分。

# ilwriteMDBFileNameCannotBeChangedWarning
source: The name of the MDB file must be <assembly-file-name>.mdb. The --pdb option will be ignored.
cs: Název souboru MDB musí být <název-souboru-sestavení>.mdb. Parametr --pdb se bude ignorovat.
de: Der Name der MDB-Datei muss "<assembly-file-name>.mdb" lauten. Die Option "--pdb" wird ignoriert.
es: El nombre del archivo MDB debe ser <nombre de archivo de ensamblado>.mdb. Se omitirá la opción--pdb.
fr: Le nom du fichier MDB doit être <nom_fichier_assembly>.mdb. L'option --pdb est ignorée.
it: Il nome del file MDB deve essere <nome-file-assembly>.mdb. L'opzione --pdb verrà ignorata.
ja: MDB ファイルの名前は <assembly-file-name>.mdb でなければなりません、--pdb オプションは無視されます。
ko: MDB 파일의 이름은 <어셈블리 파일 이름>.mdb여야 합니다. --pdb 옵션은 무시됩니다.
pl: Plik MDB musi mieć nazwę <nazwa-pliku-zestawu>.mdb. Opcja --pdb zostanie zignorowana.
pt_br: O nome do arquivo MDB deve ser <assembly-file-name>.mdb. A opção --pdb será ignorada.
ru: MDB-файл должен иметь имя <assembly-file-name>.mdb. Параметр --pdb будет проигнорирован.
tr: MDB dosyasının adı <assembly-file-name>.mdb olmalıdır. --pdb seçeneği yoksayılacak.
zh_hans: MDB 文件的名称必须是 <程序集文件名称>.mdb。将忽略 --pdb 选项。
zh_hant: MDB 檔案的名稱必須是 <組件檔名稱>.mdb。會略過 --pdb 選項。

# ilwriteMDBMemberMissing
source: MDB generation failed. Could not find compatible member {0}
cs: Generování souboru MDB selhalo. Nenašel se kompatibilní člen {0}.
de: Fehler bei der MDB-Generierung. Kompatibler Member {0} wurde nicht gefunden.
es: Error en la generación de MDB. No se encontró un miembro {0} compatible.
fr: Échec de la génération de MDB. Le membre compatible {0} est introuvable
it: La generazione del file MDB non è riuscita. Il membro compatibile {0} non è stato trovato
ja: MDB を生成できませんでした。互換性のあるメンバー {0} が見つかりませんでした
ko: MDB를 생성하지 못했습니다. 호환 멤버 {0}을(를) 찾을 수 없습니다.
pl: Generowanie pliku MDB nie powiodło się. Nie można znaleźć zgodnego elementu członkowskiego {0}
pt_br: Falha ao gerar MDB. Não foi possível encontrar o membro compatível {0}
ru: Сбой при создании MDB-файла. Не удалось найти совместимый элемент {0}
tr: MDB oluşturulamadı. Uyumlu üye {0} bulunamadı
zh_hans: MDB 生成失败。找不到兼容成员 {0}
zh_hant: MDB 產生失敗。找不到相容的成員 {0}

# ilwriteErrorCreatingMdb
source: Cannot generate MDB debug information. Failed to load the 'MonoSymbolWriter' type from the 'Mono.CompilerServices.SymbolWriter.dll' assembly.
cs: Nedají se vygenerovat ladicí informace MDB. Načtení typu MonoSymbolWriter ze sestavení Mono.CompilerServices.SymbolWriter.dll selhalo.
de: Es können keine MDB-Debuginformationen generiert werden. Fehler beim Laden des Typs 'MonoSymbolWriter' aus der 'Mono.CompilerServices.SymbolWriter.dll'-Assembly.
es: No se puede generar información de depuración de MDB. No se pudo cargar el tipo 'MonoSymbolWriter' del ensamblado 'Mono.CompilerServices.SymbolWriter.dll'.
fr: Impossible de générer les informations de débogage de MDB. Le chargement du type 'MonoSymbolWriter' depuis l'assembly 'Mono.CompilerServices.SymbolWriter.dll' a échoué.
it: Non è possibile generare informazioni di debug MDB. Non è stato possibile caricare il tipo 'MonoSymbolWriter' dall'assembly 'Mono.CompilerServices.SymbolWriter.dll'.
ja: MDB デバッグ情報を生成できません。'Mono.CompilerServices.SymbolWriter.dll' アセンブリから 'MonoSymbolWriter' 型を読み込むことができませんでした。
ko: MDB 디버그 정보를 생성할 수 없습니다. 'Mono.CompilerServices.SymbolWriter.dll' 어셈블리에서 'MonoSymbolWriter' 형식을 로드하지 못했습니다.
pl: Nie można wygenerować informacji o debugowaniu pliku MDB. Nie można załadować typu „MonoSymbolWriter” z zestawu „Mono.CompilerServices.SymbolWriter.dll”.
pt_br: Não é possível gerar informações de depuração de MDB. Falha ao carregar o tipo 'MonoSymbolWriter' do assembly 'Mono.CompilerServices.SymbolWriter.dll'.
ru: Невозможно создать сведения об отладке MDB. Не удалось загрузить тип MonoSymbolWriter из сборки Mono.CompilerServices.SymbolWriter.dll.
tr: MDB hata ayıklama bilgileri oluşturulamıyor. 'MonoSymbolWriter' türü 'Mono.CompilerServices.SymbolWriter.dll' bütünleştirilmiş kodundan yüklenemedi.
zh_hans: 无法生成 MDB 调试信息。未能从“Mono.CompilerServices.SymbolWriter.dll”程序集加载“MonoSymbolWriter”类型。
zh_hant: 無法產生 MDB 偵錯資訊。無法從 'Mono.CompilerServices.SymbolWriter.dll' 組件載入 'MonoSymbolWriter' 類型。

# tcUnionCaseNameConflictsWithGeneratedType
source: The union case named '{0}' conflicts with the generated type '{1}'
cs: Případ typu union s názvem {0} koliduje s generovaným typem {1}.
de: Der Union-Fall mit dem Namen '{0}' befindet sich in einem Konflikt mit dem generierten Typ '{1}'.
es: El caso de unión denominado '{0}' entra en conflicto con el tipo generado '{1}'.
fr: Le cas d'union nommé '{0}' est en conflit avec le type généré '{1}'
it: Il case di unione denominato '{0}' è in conflitto con il tipo generato '{1}'
ja: {0}' という名前の共用体ケースが、生成された型 '{1}' と競合します
ko: 이름이 '{0}'인 공용 구조체가 생성된 형식 '{1}'과(와) 충돌합니다.
pl: Przypadek unii o nazwie „{0}” powoduje konflikt z wygenerowanym typem „{1}”
pt_br: O caso união chamado '{0}' conflita com o tipo gerado '{1}'
ru: Ветвь объединения с именем "{0}" вступает в конфликт с созданным типом "{1}"
tr: {0}' adlı birleşim durumu oluşturulan '{1}' türüyle çakışıyor
zh_hans: 名为“{0}”的联合用例与生成的类型“{1}”冲突
zh_hant: 名為 '{0}' 的聯集與產生的類型 '{1}' 衝突

# chkNoReflectedDefinitionOnStructMember
source: ReflectedDefinitionAttribute may not be applied to an instance member on a struct type, because the instance member takes an implicit 'this' byref parameter
cs: ReflectedDefinitionAttribute se nedá použít pro člena instance u typu struktura, protože člen instance přebírá implicitní parametr this typu ByRef.
de: ReflectedDefinitionAttribute kann nicht auf einen Instanzmember eines struct-Typs angewendet werden, da der Instanzmember einen impliziten 'this'-byref-Parameter akzeptiert.
es: ReflectedDefinitionAttribute no se puede aplicar a un miembro de instancia en un tipo struct porque dicho miembro toma un parámetro byref 'this' implícito.
fr: ReflectedDefinitionAttribute ne peut pas être appliqué à un membre d'instance sur un type struct, car le membre d'instance utilise un paramètre byref 'this' implicite
it: ReflectedDefinitionAttribute non può essere applicato a un membro di istanza in un tipo di struct perché il membro di istanza accetta un parametro byref implicito 'this'
ja: ReflectedDefinitionAttribute は、構造体型でインスタンス メンバーに適用することはできません。これは、このインスタンス メンバーが暗黙的な 'this' byref パラメーターを受け取るためです。
ko: ReflectedDefinitionAttribute를 구조체 형식 인스턴스 멤버에 적용할 수 없습니다. 해당 인스턴스 멤버가 암시적 'this' byref 매개 변수를 사용합니다.
pl: Atrybut ReflectedDefinitionAttribute nie może być stosowany do elementu członkowskiego wystąpienia w typie struktury, ponieważ element członkowski wystąpienia pobiera niejawny parametr „this” typu byref
pt_br: O ReflectedDefinitionAttribute não pode ser aplicado a um membro de instância em um tipo struct porque o membro da instância assume um parâmetro byref 'this' implícito
ru: Атрибут ReflectedDefinitionAttribute не может применяться к элементам экземпляров типа struct, поскольку элемент экземпляра принимает неявный параметр this byref
tr: Örnek üyesi örtük 'this' byref parametresini aldığı için ReflectedDefinitionAttribute, yapı türündeki bir örnek üyesine uygulanamaz
zh_hans: ReflectedDefinitionAttribute 不能应用于结构类型的实例成员，因为该实例成员采用隐式“this”byref 参数
zh_hant: ReflectedDefinitionAttribute 不能套用到結構類型上的執行個體成員，因為執行個體成員接受隱含 'this' byref 參數

# tcDllImportNotAllowed
source: DLLImport bindings must be static members in a class or function definitions in a module
cs: Vazby DLLImport musí být statickými členy v definici třídy nebo funkce v modulu.
de: Bei DLLImport-Bindungen muss es sich um statische Member von Klassen- oder Funktionsdefinitionen eines Moduls handeln.
es: Los enlaces DLLImport deben ser miembros estáticos en definiciones de función o clase dentro de un módulo.
fr: Les liaisons DLLImport doivent être des membres statiques dans une classe ou des définitions de fonction dans un module
it: I binding DLLImport devono essere membri statici in una classe o definizioni di funzione in un modulo
ja: DLLImport 束縛はモジュール内のクラスまたは関数定義の静的メンバーであることが必要です
ko: DLLImport 바인딩은 모듈의 클래스 또는 함수 정의에서 정적 멤버여야 합니다.
pl: Powiązania DLLImport muszą być statycznymi elementami członkowskimi w definicjach klas lub funkcji w module
pt_br: As associações DLLImport devem ser membros estáticos em uma classe ou definições de função em um módulo
ru: Привязки DLLImport должны быть статическими элементами в определениях класса или функции в модуле
tr: DLLImport bağlamaları bir sınıf içinde statik üyeler veya bir modül içinde işlev tanımları olmalıdır
zh_hans: DLLImport 绑定必须是类中的静态成员或模块中的函数定义
zh_hant: DLLImport 繫結必須是類別中的靜態成員或模組中的函式定義

# buildExpectedSigdataFile
source: FSharp.Core.sigdata not found alongside FSharp.Core. File expected in {0}. Consider upgrading to a more recent version of FSharp.Core, where this file is no longer be required.
cs: V FSharp.Core se nenašel soubor FSharp.Core.sigdata. Soubor se očekával v {0}. Zvažte upgrade na novější verzi FSharp.Core, kde se tento soubor už nevyžaduje.
de: FSharp.Core.sigdata wurde nicht neben "FSharp.Core" gefunden. Die Datei wurde in {0} erwartet. Erwägen Sie ein Upgrade auf eine aktuellere Version von "FSharp.Core", in der die Datei nicht mehr erforderlich ist.
es: No se encontró FSharp.Core.sigdata junto con FSharp.Core. Archivo esperado en {0}. Considere la posibilidad de actualizar a una versión más reciente de FSharp.Core en la que ya no se requiere el archivo.
fr: FSharp.Core.sigdata introuvable avec FSharp.Core. Fichier attendu dans {0}. Effectuez une mise à niveau vers une version plus récente de FSharp.Core, où ce fichier n'est plus nécessaire.
it: Il file FSharp.Core.sigdata non è stato trovato con FSharp.Core. Il file deve trovarsi in {0}. Provare a eseguire l'aggiornamento a una versione più recente di FSharp.Core, in cui questo file non è più obbligatorio.
ja: FSharp.Core と同じ場所に FSharp.Core.sigdata が見つかりません。ファイルは {0} にある必要があります。このファイルを必要としない、より新しいバージョンの FSharp.Core にアップグレードすることをご検討ください。
ko: FSharp.Core에서 FSharp.Core.sigdata를 찾을 수 없습니다. 파일이 {0}에 있어야 합니다. 이 파일이 더 이상 필요하지 않은 최신 버전의 FSharp.Core로의 업그레이드를 고려해 보세요.
pl: Nie znaleziono zasobu FSharp.Core.sigdata z plikiem FSharp.Core. Plik oczekiwany w {0}. Rozważ uaktualnienie do nowszej wersji pliku FSharp.Core, w której ten plik nie jest już wymagany.
pt_br: FSharp.Core.sigdata não encontrado junto com FSharp.Core. Arquivo esperado em {0}. Considere atualizar para uma versão mais recente do FSharp.Corem, na qual esse arquivo não é mais necessário.
ru: Ресурс FSharp.Core.sigdata не найден вместе с FSharp.Core. Файл ожидался в {0}. Рекомендуется обновление до более новой версии FSharp.Core, где этот файл не требуется.
tr: FSharp.Core.sigdata, FSharp.Core ile birlikte bulunamadı. Dosyanın {0} içinde olması bekleniyordu. Bu dosyayı gerektirmeyen daha yeni bir FSharp.Core sürümüne yükseltmeniz önerilir.
zh_hans: 未能在 FSharp.Core 旁找到 FSharp.Core.sigdata。文件应在 {0} 中。请考虑升级到更新版本的 FSharp.Core，该版本不再需要此文件。
zh_hant: 找不到與 FSharp.Core 並存的 FSharp.Core.sigdata。檔案應位於 {0}。請考慮升級至最新版的 FSharp.Core，其中不再需要此檔案。

# buildExpectedFileAlongSideFSharpCore
source: File '{0}' not found alongside FSharp.Core. File expected in {1}. Consider upgrading to a more recent version of FSharp.Core, where this file is no longer be required.
cs: U souboru FSharp.Core se nenašel soubor {0}. Soubor se očekával v {1}. Zvažte upgrade na novější verzi souboru FSharp.Core, kde se tento soubor už nevyžaduje.
de: Die Datei "{0}" wurde nicht neben "FSharp.Core" gefunden. Die Datei wurde in {1} erwartet. Erwägen Sie ein Upgrade auf eine aktuellere Version von "FSharp.Core", in der die Datei nicht mehr erforderlich ist.
es: No se encontró el archivo "{0}" junto con FSharp.Core. Archivo esperado en {1}. Considere la posibilidad de actualizar a una versión más reciente de FSharp.Core en la que ya no se requiere el archivo.
fr: Fichier '{0}' introuvable avec FSharp.Core. Fichier attendu dans {1}. Effectuez une mise à niveau vers une version plus récente de FSharp.Core, où ce fichier n'est plus nécessaire.
it: Il file '{0}' non è stato trovato con FSharp.Core. Il file deve trovarsi in {1}. Provare a eseguire l'aggiornamento a una versione più recente di FSharp.Core, in cui questo file non è più obbligatorio.
ja: FSharp.Core と同じ場所にファイル '{0}' が見つかりません。ファイルは {1} にある必要があります。このファイルを必要としない、より新しいバージョンの FSharp.Core にアップグレードすることをご検討ください。
ko: FSharp.Core에서 '{0}' 파일을 찾을 수 없습니다. 파일이 {1}에 있어야 합니다. 이 파일이 더 이상 필요하지 않은 최신 버전의 FSharp.Core로의 업그레이드를 고려해 보세요.
pl: Nie znaleziono pliku „{0}” z plikiem FSharp.Core. Plik oczekiwany w {1}. Rozważ uaktualnienie do nowszej wersji pliku FSharp.Core, w której ten plik nie jest już wymagany.
pt_br: O arquivo '{0}' não foi encontrado junto com FSharp.Core. Arquivo esperado em {1}. Considere atualizar para uma versão mais recente do FSharp.Corem, na qual esse arquivo não é mais necessário.
ru: Файл "{0}" не найден вместе с FSharp.Core. Файл ожидался в {1}. Рекомендуется обновление до более новой версии FSharp.Core, где этот файл не требуется.
tr: {0}' dosyası FSharp.Core ile birlikte bulunamadı. Dosyanın {1} içinde olması bekleniyordu. Bu dosyayı gerektirmeyen daha yeni bir FSharp.Core sürümüne yükseltmeniz önerilir.
zh_hans: 未能在 FSharp.Core 旁找到文件“{0}”。文件应在 {1} 中。请考虑升级到更新版本的 FSharp.Core，该版本不再需要此文件。
zh_hant: 找不到與 FSharp.Core 並存的檔案 '{0}'。檔案應位於 {1}。請考慮升級至最新版的 FSharp.Core，其中不再需要此檔案。

# buildUnexpectedFileNameCharacter
source: Filename '{0}' contains invalid character '{1}'
cs: V názvu soboru {0} je neplatný znak {1}.
de: Der Dateiname '{0}' enthält das ungültige Zeichen '{1}'.
es: El nombre de archivo '{0}' contiene el carácter '{1}' no válido.
fr: Le nom de fichier '{0}' contient le caractère non valide '{1}'
it: Il nome file '{0}' contiene il carattere non valido '{1}'
ja: ファイル名 '{0}' に無効な文字 '{1}' が含まれています
ko: 파일 이름 '{0}'에 잘못된 문자('{1}')가 있습니다.
pl: Nazwa pliku „{0}” zawiera nieprawidłowy znak „{1}”
pt_br: O nome de arquivo '{0}' contém o caractere inválido '{1}'.
ru: Имя файла "{0}" содержит недопустимый символ "{1}"
tr: Dosya adı '{0}', geçersiz '{1}' karakterini içeriyor
zh_hans: 文件名“{0}”包含无效字符“{1}”
zh_hant: 檔名 '{0}' 包含無效的字元 '{1}'

# tcInvalidUseBangBinding
source: 'use!' bindings must be of the form 'use! <var> = <expr>'
cs: Vazby use! musí mít formát use! <proměnná> = <výraz>.
de: "use!"-Bindungen müssen das Format "use! <var> = <expr>" aufweisen.
es: Los enlaces "use!" deben tener el formato "use! <var> = <expr>".
fr: Les liaisons 'use!' doivent être de la forme 'use! <var> = <expr>'
it: Il formato dei binding 'use!' deve essere 'use! <var> = <expr>'
ja: 'use!' バインディングの形式は 'use! <var> = <expr>' でなければなりません
ko: 'use!' 바인딩은 'use! <var> = <expr>' 형식이어야 합니다.
pl: Powiązania „use!” muszą mieć format „use! <zmienna> = <wyrażenie>”
pt_br: associações 'use!' devem ser da forma 'use! <var> = <expr>'
ru: Привязки 'use!' должны иметь вид 'use! <var> = <expr>'
tr: 'use!' bağlamaları 'use! <var> = <expr>' biçiminde olmalıdır
zh_hans: "use!" 绑定必须采用 "use! <var> = <expr>" 形式
zh_hant: 'use!' 繫結的形式必須為 'use! <var> = <expr>'

# crefNoInnerGenericsInQuotations
source: Inner generic functions are not permitted in quoted expressions. Consider adding some type constraints until this function is no longer generic.
cs: Vnitřní obecné funkce nejsou ve výrazech v uvozovkách povolené. Dokud bude tato funkce obecná, zvažte přidání některých omezení typu.
de: In Ausdrücken in Anführungszeichen sind innere generische Funktionen nicht zulässig. Fügen Sie Typeinschränkungen hinzu, bis diese Funktion nicht mehr generisch ist.
es: No se permiten funciones genéricas internas en expresiones entre comillas. Considere agregar restricciones de tipo hasta que esta función deje de ser genérica.
fr: Les fonctions génériques internes ne sont pas autorisées dans les expressions quotées. Ajoutez des contraintes de type jusqu'à ce que cette fonction ne soit plus générique.
it: Nelle espressioni in quotation non sono consentite funzioni generiche interne. Provare ad aggiungere alcuni vincoli di tipo in modo che la funzione non sia più generica.
ja: 内部ジェネリック関数は引用符付きの式には使用できません。関数の型を特定できるまで、何らかの型の制約を追加してください。
ko: 내부 제네릭 함수는 따옴표 붙은 식에 허용되지 않습니다. 이 함수가 더 이상 제네릭 형식이 아닐 때까지 형식 제약 조건을 추가하세요.
pl: Wewnętrzne funkcje ogólne są niedozwolone w wyrażeniach cytowanych. Rozważ dodanie ograniczeń typów, tak aby ta funkcja nie była już ogólna.
pt_br: Funções genéricas interiores não são permitidas em expressões entre aspas. Considere adicionar algumas restrições de tipo até que esta função não seja mais genérica.
ru: Использование внутренних универсальных функций в выражениях в кавычках не допускается. Рекомендуется добавить ограничения типа, чтобы функция более не являлась универсальной.
tr: Tırnak içindeki ifadelerde iç genel işlevlere izin verilmez. Bu işlev artık genel olmayacak şekilde bazı tür kısıtlamaları eklemeyi düşünün.
zh_hans: 带引号的表达式中不允许有内部泛型函数。请考虑添加一些类型约束，直至此函数不再是泛型函数。
zh_hant: 加引號的運算式中不允許內部泛型函式。請考慮加入一些類型條件約束，直到這個函式不是泛型為止。

# tcEnumTypeCannotBeEnumerated
source: The type '{0}' is not a valid enumerator type , i.e. does not have a 'MoveNext()' method returning a bool, and a 'Current' property
cs: Typ {0} není platným výčtovým typem, to znamená, že u něj chybí metoda MoveNext(), která by vracela logickou hodnotu, a vlastnost Current.
de: Beim Typ '{0}' handelt es sich nicht um einen gültigen Enumeratortyp, d. h. er verfügt über keine 'MoveNext()'-Methode, die einen booleschen Wert zurückgibt, und keine 'Current'-Eigenschaft.
es: '{0}' no es un tipo de enumerador válido, es decir, no tiene un método 'MoveNext()' que devuelva un valor booleano y una propiedad 'Current'.
fr: Le type '{0}' n'est pas un type d'énumérateur valide, c-à-d qu'il n'a pas de méthode 'MoveNext()' qui retourne une valeur booléenne, ni de propriété 'Current'
it: Il tipo '{0}' non è un tipo di enumeratore valido, ad esempio non contiene un metodo 'MoveNext()' che restituisce un valore bool e una proprietà 'Current'
ja: 型 '{0}' は有効な列挙子の型ではありません。つまり、ブール値を返す 'MoveNext()' メソッドと 'Current' プロパティが含まれていません
ko: '{0}' 형식은 올바른 열거자 형식이 아닙니다(예: 부울을 반환하는 'MoveNext()' 메서드와 'Current' 속성이 포함되어 있지 않음).
pl: Typ „{0}” nie jest prawidłowym typem modułu wyliczającego, czyli nie zawiera metody „MoveNext()” zwracającej wartość logiczną i właściwości „Current”
pt_br: O tipo '{0}' não é um tipo de enumerador válido, ou seja, não possui um método MoveNext()' retornando um bool e uma propriedade 'Current'
ru: Тип "{0}" не является допустимым типом перечислителя, т. е. у него нет метода MoveNext(), возвращающего логическое значение, и свойства Current
tr: '{0}' türü geçerli bir numaralandırıcı türü değil, yani bool döndüren bir 'MoveNext()' metodu ve 'Current' özelliği yok
zh_hans: 类型“{0}”不是有效枚举器类型，即，没有返回布尔值的“MoveNext()”方法和“Current”属性
zh_hant: 類型 '{0}' 不是有效的列舉程式類型，例如，沒有傳回 bool 的 'MoveNext()' 方法，也沒有 'Current' 屬性
