Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# tastRecursiveValuesMayNotBeAssignedToNonMutableField
source: Recursive values cannot be directly assigned to the non-mutable field '{0}' of the type '{1}' within a recursive binding. Consider using a mutable field instead.
cs: Rekurzivní hodnoty se nedají přímo přiřadit k neproměnlivému poli {0} typu {1} v rekurzivní vazbě. Zvažte možnost použít místo toho proměnlivé pole.
de: Rekursive Werte können dem nicht änderbaren Feld "{0}" vom Typ "{1}" innerhalb einer rekursiven Bindung nicht direkt zugewiesen werden. Verwenden Sie stattdessen ein änderbares Feld.
es: Los valores recursivos no se pueden asignar directamente al campo inmutable '{0}' del tipo '{1}' en un enlace recursivo. Considere el uso de un campo mutable en su lugar.
fr: Impossible d'assigner directement les valeurs récursives au champ non mutable '{0}' du type '{1}' dans une liaison récursive. Utilisez un champ mutable à la place.
it: I valori ricorsivi non possono essere assegnati direttamente al campo non modificabile '{0}' del tipo '{1}' in un binding ricorsivo. Provare a usare un campo modificabile.
ja: 再帰的な値は、再帰的な束縛内の型 '{1}' の変更可能ではないフィールド '{0}' に直接割り当てることはできません。代わりに変更可能なフィールドを使用してください。
ko: 재귀 값은 재귀적 바인딩 내에서 '{1}' 형식의 변경할 수 없는 필드 '{0}'에 직접 할당할 수 없습니다. 대신 변경할 수 있는 필드를 사용하세요.
pl: Wartości cykliczne nie mogą być przypisywane bezpośrednio do niezmienialnego pola „{0}” typu „{1}” w powiązaniu cyklicznym. Zamiast tego rozważ użycie pola modyfikowalnego.
pt_br: Valores recursivos não podem ser atribuídos diretamente ao campo não mutável '{0}' do tipo '{1}' em uma associação recursiva. Considere usar um registro em vez disso.
ru: Не допускается непосредственное присваивание рекурсивных значений неизменяемому полю "{0}" типа "{1}" внутри рекурсивной привязки. Вместо этого рекомендуется использовать изменяемое поле.
tr: Özyinelemeli değerler, özyinelemeli bir bağlama içinde '{1}' türünün değiştirilemeyen '{0}' alanına dorudan atanamaz. Onun yerine değiştirilebilir alan kullanmayı düşünün.
zh_hans: 递归值不能直接赋给递归绑定内的类型“{1}”的不可变字段“{0}”。请考虑改用可变字段。
zh_hant: 遞迴值無法直接指派給遞迴繫結內類型 '{1}' 的不可變動欄位 '{0}'。請考慮改用可變動的欄位。

# tastUnexpectedDecodeOfAutoOpenAttribute
source: Unexpected decode of AutoOpenAttribute
cs: Neočekávané dekódování AutoOpenAttribute
de: Unerwartete Decodierung von AutoOpenAttribute.
es: Descodificación inesperada de AutoOpenAttribute.
fr: Décodage inattendu de AutoOpenAttribute
it: Decodifica non prevista di AutoOpenAttribute
ja: AutoOpenAttribute の予期しないデコードです:
ko: 예기치 않은 AutoOpenAttribute의 디코딩입니다.
pl: Nieoczekiwane dekodowanie elementu AutoOpenAttribute
pt_br: Decodificação de AutoOpenAttribute inesperada
ru: Недопустимое декодирование атрибута AutoOpenAttribute
tr: Beklenmeyen AutoOpenAttribute kod çözümü
zh_hans: 对 AutoOpenAttribute 的意外解码
zh_hant: 未預期的 AutoOpenAttribute 解碼

# tastUnexpectedDecodeOfInternalsVisibleToAttribute
source: Unexpected decode of InternalsVisibleToAttribute
cs: Neočekávané dekódování InternalsVisibleToAttribute
de: Unerwartete Decodierung von InternalsVisibleToAttribute.
es: Descodificación inesperada de InternalsVisibleToAttribute.
fr: Décodage inattendu de InternalsVisibleToAttribute
it: Decodifica non prevista di InternalsVisibleToAttribute
ja: InternalsVisibleToAttribute の予期しないデコードです:
ko: 예기치 않은 InternalsVisibleToAttribute의 디코딩입니다.
pl: Nieoczekiwane dekodowanie elementu InternalsVisibleToAttribute
pt_br: Decodificação de InternalsVisibleToAttribute inesperada
ru: Недопустимое декодирование атрибута InternalsVisibleToAttribute
tr: Beklenmeyen InternalsVisibleToAttribute kod çözümü
zh_hans: 对 InternalsVisibleToAttribute 的意外解码
zh_hant: 未預期的 InternalsVisibleToAttribute 解碼

# tastUnexpectedDecodeOfInterfaceDataVersionAttribute
source: Unexpected decode of InterfaceDataVersionAttribute
cs: Neočekávané dekódování InterfaceDataVersionAttribute
de: Unerwartete Decodierung von InterfaceDataVersionAttribute.
es: Descodificación inesperada de InterfaceDataVersionAttribute.
fr: Décodage inattendu de InterfaceDataVersionAttribute
it: Decodifica non prevista di InterfaceDataVersionAttribute
ja: InterfaceDataVersionAttribute の予期しないデコードです:
ko: 예기치 않은 InterfaceDataVersionAttribute의 디코딩입니다.
pl: Nieoczekiwane dekodowanie elementu InterfaceDataVersionAttribute
pt_br: Decodificação de InterfaceDataVersionAttribute inesperada
ru: Недопустимое декодирование атрибута InterfaceDataVersionAttribute
tr: Beklenmeyen InterfaceDataVersionAttribute kod çözümü
zh_hans: 对 InterfaceDataVersionAttribute 的意外解码
zh_hant: 未預期的 InterfaceDataVersionAttribute 解碼

# tastActivePatternsLimitedToSeven
source: Active patterns cannot return more than 7 possibilities
cs: Aktivní vzory nemůžou vracet víc než 7 možností.
de: Aktive Muster können maximal 7 Möglichkeiten zurückgeben.
es: Los patrones activos no pueden devolver más de 7 posibilidades.
fr: Les modèles actifs ne peuvent pas retourner plus de 7 possibilités
it: I criteri attivi non possono restituire più di 7 possibilità
ja: アクティブ パターンが返すことができる結果は 7 個以下です
ko: 활성 패턴은 7개가 넘는 가능성을 반환할 수 없습니다.
pl: Aktywne wzorce nie mogą zwracać więcej niż 7 możliwości
pt_br: Padrões ativos não podem retornar mais que 7 possibilidades
ru: Активные шаблоны не могут возвращать более 7 возможностей
tr: Etkin desenler 7 olasılıktan fazlasını döndüremez
zh_hans: 活动模式不能返回 7 个以上的可能结果
zh_hant: 現用模式不能傳回超過 7 種可能性

# tastNotAConstantExpression
source: This is not a valid constant expression or custom attribute value
cs: Toto není platný konstantní výraz nebo hodnota vlastního atributu.
de: Dies ist kein gültiger konstanter Ausdruck oder benutzerdefinierter Attributwert.
es: Esta no es una expresión constante o un valor de atributo personalizado válido.
fr: Il ne s'agit pas d'une expression constante valide ou d'une valeur d'attribut personnalisé valide
it: L'elemento non è un'espressione costante o un valore di attributo personalizzato valido
ja: これは有効な定数式でもカスタム属性値でもありません
ko: 올바른 상수 식 또는 사용자 지정 특성 값이 아닙니다.
pl: To nie jest prawidłowe wyrażenie stałej lub prawidłowa niestandardowa wartość atrybutu
pt_br: Esta não é uma expressão constante ou um valor de atributo personalizado válido
ru: Это выражение не является допустимым константным выражением или значением пользовательского атрибута
tr: Bu geçerli bir sabit ifade veya özel öznitelik değeri değil
zh_hans: 这不是有效的常数表达式或自定义特性值
zh_hant: 這不是有效的常數運算式或自訂屬性值

# ValueNotContainedMutabilityAttributesDiffer
source: Module '{0}' contains\n {1} \nbut its signature specifies\n {2} \nThe mutability attributes differ
cs: Modul {0} obsahuje hodnotu\n {1}, \nale jeho signatura definuje hodnotu\n {2}. \nLiší se atributy proměnlivosti.
de: Das Modul "{0}" enthält\n {1} \nDie Signatur gibt aber Folgendes an:\n {2} \nDie Änderbarkeitsattribute sind unterschiedlich.
es: El módulo '{0}' contiene\n {1} \npero su signatura especifica\n {2} \nLos atributos de mutabilidad difieren.
fr: Le module '{0}' contient\n {1} \nmais sa signature spécifie\n {2} \nLes attributs de mutabilité sont différents
it: Il modulo '{0}' contiene\n {1} \ntuttavia la relativa firma specifica\n {2} \nGli attributi di modificabilità sono diversi
ja: モジュール '{0}' には\n {1} \nが含まれますが、シグネチャには\n {2} \nを指定しています。変更可能属性が異なります。
ko: {0}' 모듈에\n {1}이(가) 포함되어 있지만 \n해당 시그니처는\n {2}을(를) 지정합니다. \n변경 가능성 특성이 서로 다릅니다.
pl: Moduł „{0}” zawiera element\n {1}, \nale jego sygnatura określa element\n {2} \nAtrybuty modyfikowalności są różne
pt_br: O módulo '{0}' contém\n {1} \n, mas sua assinatura especifica\n {2} \nOs atributos de mutabilidade são diferentes
ru: Модуль "{0}" содержит\n {1} \nоднако его сигнатура задает\n {2} \nИзменяемость атрибутов различается
tr: {0}' modülü\n {1} \niçeriyor ancak imzasında\n {2} \nbelirtiliyor. Değişebilirlik öznitelikleri farklı
zh_hans: 模块“{0}”包含\n {1} \n而其签名指定\n {2} \n可变性特性不同
zh_hant: 模組 '{0}' 包含\n {1} \n但它的簽章卻指定\n {2} \n可變動性屬性不同

# ValueNotContainedMutabilityNamesDiffer
source: Module '{0}' contains\n {1} \nbut its signature specifies\n {2} \nThe names differ
cs: Modul {0} obsahuje hodnotu\n {1}, \nale jeho signatura definuje hodnotu\n {2}. \nLiší se názvy.
de: Das Modul "{0}" enthält\n {1} \nDie Signatur gibt aber Folgendes an:\n {2} \nDie Namen sind unterschiedlich.
es: El módulo '{0}' contiene\n {1} \npero su signatura especifica\n {2} \nLos nombres difieren.
fr: Le module '{0}' contient\n {1} \nmais sa signature spécifie\n {2} \nLes noms sont différents
it: Il modulo '{0}' contiene\n {1} \ntuttavia la relativa firma specifica\n {2} \nI nomi sono diversi
ja: モジュール '{0}' には\n {1} \nが含まれますが、シグネチャには\n {2} \nを指定しています。名前が異なります。
ko: {0}' 모듈에\n {1}이(가) 포함되어 있지만 \n해당 시그니처는\n {2}을(를) 지정합니다. \n이름이 서로 다릅니다.
pl: Moduł „{0}” zawiera element\n {1}, \nale jego sygnatura określa element\n {2} \nNazwy są różne
pt_br: O módulo '{0}' contém\n {1} \n, mas sua assinatura especifica\n {2} \nOs nomes são diferentes
ru: Модуль "{0}" содержит\n {1} \nоднако его сигнатура задает\n {2} \nИмена различаются
tr: {0}' modülü\n {1} \niçeriyor ancak imzasında\n {2} \nbelirtiliyor. Adlar farklı
zh_hans: 模块“{0}”包含\n {1} \n而其签名指定\n {2} \n名称不同
zh_hant: 模組 '{0}' 包含\n {1} \n但它的簽章卻指定\n {2} \n名稱不同

# ValueNotContainedMutabilityCompiledNamesDiffer
source: Module '{0}' contains\n {1} \nbut its signature specifies\n {2} \nThe compiled names differ
cs: Modul {0} obsahuje hodnotu\n {1}, \nale jeho signatura definuje hodnotu\n {2}. \nLiší se zkompilovanými názvy.
de: Das Modul "{0}" enthält\n {1}, \n doch die Signatur gibt\n {2} an.\nDie kompilierten Namen unterscheiden sich
es: El módulo '{0}' contiene\n {1} \npero su signatura especifica\n {2} \nLos nombres compilados difieren.
fr: Le module '{0}' contient\n {1} \nmais sa signature spécifie\n {2} \nLes noms compilés sont différents
it: Il modulo '{0}' contiene\n {1} \ntuttavia la relativa firma specifica\n {2} \nI nomi compilati sono diversi
ja: モジュール '{0}' には\n {1} \nが含まれていますが、シグネチャには\n {2} \nが指定されています。コンパイル名が異なります。
ko: {0}' 모듈에는 다음이 포함되어 있습니다.\n {1} \n하지만 해당 시그니처는 다음을 지정합니다.\n {2} \n컴파일된 이름이 다릅니다.
pl: Moduł „{0}” zawiera element\n {1}, \nale jego sygnatura określa element\n {2} \nNazwy skompilowane są różne
pt_br: O módulo '{0}' contém\n {1} \n, mas sua assinatura especifica\n {2} \nOs nomes compilados são diferentes
ru: Модуль "{0}" содержит\n {1} \nоднако в его сигнатуре указано\n {2} \nСкомпилированные имена различаются
tr: {0}' modülü\n {1} \niçeriyor ancak imzasında\n {2} \nbelirtiliyor. Derlenen adlar farklı
zh_hans: 模块“{0}”包含\n {1} \n而其签名指定\n {2} \n编译的名称不同
zh_hant: 模組 '{0}' 包含\n {1} \n但它的簽章卻指定\n {2} \n編譯的名稱不同

# ValueNotContainedMutabilityDisplayNamesDiffer
source: Module '{0}' contains\n {1} \nbut its signature specifies\n {2} \nThe display names differ
cs: Modul {0} obsahuje hodnotu\n {1}, \nale jeho signatura definuje hodnotu\n {2}. \nLiší se zobrazované názvy.
de: Modul "{0}" enthält\n {1}, \ndoch die Signatur gibt\n {2} an.\nDie Anzeigenamen unterscheiden sich
es: El módulo '{0}' contiene\n {1} \npero su signatura especifica\n {2} \nLos nombres para mostrar difieren.
fr: Le module '{0}' contient\n {1} \nmais sa signature spécifie\n {2} \nLes noms complets sont différents
it: Il modulo '{0}' contiene\n {1} \ntuttavia la relativa firma specifica\n {2} \nI nomi visualizzati sono diversi
ja: モジュール '{0}' には\n {1} \nが含まれていますが、シグネチャには\n {2} \nが指定されています。表示名が異なります。
ko: {0}' 모듈에는 다음이 포함되어 있습니다.\n {1} \n하지만 해당 시그니처는 다음을 지정합니다.\n {2} \n표시 이름이 다릅니다.
pl: Moduł „{0}” zawiera element\n {1}, \nale jego sygnatura określa element\n {2} \nNazwy wyświetlane są różne
pt_br: O módulo '{0}' contém\n {1} \n, mas sua assinatura especifica\n {2} \nOs nomes para exibição são diferentes
ru: Модуль "{0}" содержит\n {1} \nоднако в его сигнатуре указано\n {2} \nОтображаемые имена различаются
tr: {0}' modülü\n {1} \niçeriyor ancak imzasında\n {2} \nbelirtiliyor. Görünen adlar farklı
zh_hans: 模块“{0}”包含\n {1} \n而其签名指定\n {2} \n显示名称不同
zh_hant: 模組 '{0}' 包含\n {1} \n但它的簽章卻指定\n {2} \n顯示名稱不同

# ValueNotContainedMutabilityAccessibilityMore
source: Module '{0}' contains\n {1} \nbut its signature specifies\n {2} \nThe accessibility specified in the signature is more than that specified in the implementation
cs: Modul {0} obsahuje hodnotu\n {1}, \nale jeho signatura definuje hodnotu\n {2}. \nDostupnost zadaná v signatuře přesahuje dostupnost zadanou v implementaci.
de: Das Modul "{0}" enthält\n {1} \nDie Signatur gibt aber Folgendes an:\n {2} \nIn der Signatur ist eine höhere Zugreifbarkeit angegeben als in der Implementierung.
es: El módulo '{0}' contiene\n {1} \npero su signatura especifica\n {2} \nLa accesibilidad especificada en la signatura es superior a la especificada en la implementación.
fr: Le module '{0}' contient\n {1} \nmais sa signature spécifie\n {2} \nL'accessibilité spécifiée dans la signature est supérieure à celle spécifiée dans l'implémentation
it: Il modulo '{0}' contiene\n {1} \ntuttavia la firma specifica\n {2} \nL'accessibilità specificata nella firma è maggiore rispetto a quella specificata nell'implementazione
ja: モジュール '{0}' には\n {1} \nが含まれますが、シグネチャでは\n {2} \nを指定しています。シグネチャに指定されたアクセシビリティの方が、実装よりも高い設定です。
ko: {0}' 모듈에\n {1}이(가) 포함되어 있지만 \n해당 시그니처는\n {2}을(를) 지정합니다. \n시그니처에 지정된 액세스 가능성이 구현에 지정된 액세스 가능성보다 높습니다.
pl: Moduł „{0}” zawiera element\n {1}, \nale jego sygnatura określa element\n {2} \nDostępność określona w sygnaturze jest większa od określonej w implementacji
pt_br: O módulo '{0}' contém\n {1} \ n, mas sua assinatura especifica\n {2} \nA acessibilidade especificada na assinatura é maior que a especificada na implementação
ru: Модуль "{0}" содержит\n {1} \nоднако его сигнатура задает\n {2} \nДоступность, заданная в сигнатуре, шире указанной в реализации
tr: {0}' modülü\n {1} \niçeriyor ancak imzasında\n {2} \nbelirtiliyor. İmzada belirtilen erişilebilirlik uygulamada belirtilenden daha fazla
zh_hans: 模块“{0}”包含\n {1} \n而其签名指定\n {2} \n签名中指定的可访问性高于实现中指定的可访问性
zh_hant: 模組 '{0}' 包含\n {1} \n但它的簽章卻指定\n {2} \n簽章中指定的存取範圍大於實作中指定的存取範圍

# ValueNotContainedMutabilityInlineFlagsDiffer
source: Module '{0}' contains\n {1} \nbut its signature specifies\n {2} \nThe inline flags differ
cs: Modul {0} obsahuje hodnotu\n {1}, \nale jeho signatura definuje hodnotu\n {2}. \nLiší se vloženými příznaky.
de: Das Modul "{0}" enthält\n {1} \nDie Signatur gibt aber Folgendes an:\n {2} \nDie inline-Flags sind unterschiedlich.
es: El módulo '{0}' contiene\n {1} \npero su signatura especifica\n {2} \nLas marcas insertadas difieren.
fr: Le module '{0}' contient\n {1} \nmais sa signature spécifie\n {2} \nLes indicateurs inline sont différents
it: Il modulo '{0}' contiene\n {1} \ntuttavia la relativa firma specifica\n {2} \nI flag inline sono diversi
ja: モジュール '{0}' には\n {1} \nが含まれますが、シグネチャには\n {2} \nを指定しています。インライン フラグが異なります。
ko: {0}' 모듈에\n {1}이(가) 포함되어 있지만 \n해당 시그니처는\n {2}을(를) 지정합니다. \n인라인 플래그가 서로 다릅니다.
pl: Moduł „{0}” zawiera element\n {1}, \nale jego sygnatura określa element\n {2} \nFlagi śródwierszowe są różne
pt_br: O módulo '{0}' contém\n {1} \n, mas sua assinatura especifica\n {2} \nOs sinalizadores embutidos são diferentes
ru: Модуль "{0}" содержит\n {1} \nоднако его сигнатура задает\n {2} \nВстроенные флаги различаются
tr: {0}' modülü\n {1} \niçeriyor ancak imzasında\n {2} \nbelirtiliyor. Satır içi bayraklar farklı
zh_hans: 模块“{0}”包含\n {1} \n而其签名指定\n {2} \n内联标志不同
zh_hant: 模組 '{0}' 包含\n {1} \n但它的簽章卻指定\n {2} \n內嵌旗標不同

# ValueNotContainedMutabilityLiteralConstantValuesDiffer
source: Module '{0}' contains\n {1} \nbut its signature specifies\n {2} \nThe literal constant values and/or attributes differ
cs: Modul {0} obsahuje hodnotu\n {1}, \nale jeho signatura definuje hodnotu\n {2}. \nHodnoty nebo atributy literálové konstanty se liší.
de: Das Modul "{0}" enthält\n {1} \nDie Signatur gibt aber Folgendes an:\n {2} \nDie Werte und/oder Attribute der literalen Konstanten sind unterschiedlich.
es: El módulo '{0}' contiene\n {1} \npero su signatura especifica\n {2} \nLos valores constantes de literal y/o los atributos difieren.
fr: Le module '{0}' contient\n {1} \nmais sa signature spécifie\n {2} \nLes valeurs et/ou attributs de constante littérale sont différents
it: Il modulo '{0}' contiene\n {1} \ntuttavia la relativa firma specifica\n {2} \nI valori costanti letterali e/o gli attributi sono diversi
ja: モジュール '{0}' には\n {1} \nが含まれますが、シグネチャには\n {2} \nを指定しています。リテラル定数値、属性、またはその両方が異なります。
ko: {0}' 모듈에\n {1}이(가) 포함되어 있지만 \n해당 시그니처는\n {2}을(를) 지정합니다. \n리터럴 상수 값 및/또는 특성이 서로 다릅니다.
pl: Moduł „{0}” zawiera element\n {1}, \nale jego sygnatura określa element\n {2} \nWartości i/lub atrybuty stałych literału są różne
pt_br: O módulo '{0}' contém\n {1} \n, mas sua assinatura especifica\n {2} \nOs valores de constantes literais e/ou atributos são diferentes
ru: Модуль "{0}" содержит\n {1} \nоднако его сигнатура задает\n {2} \nЗначения литеральных констант и (или) атрибутов различаются
tr: {0}' modülü\n {1} \niçeriyor ancak imzasında\n {2} \nbelirtiliyor. Sabit değerler ve/veya öznitelikler farklı
zh_hans: 模块“{0}”包含\n {1} \n而其签名指定\n {2} \n文本常数值和/或特性不同
zh_hant: 模組 '{0}' 包含\n {1} \n但它的簽章卻指定\n {2} \n常值常數值和/或屬性不同

# ValueNotContainedMutabilityOneIsTypeFunction
source: Module '{0}' contains\n {1} \nbut its signature specifies\n {2} \nOne is a type function and the other is not. The signature requires explicit type parameters if they are present in the implementation.
cs: Modul {0} obsahuje hodnotu\n {1}, \nale jeho signatura definuje hodnotu\n {2}. \nJedna je funkcí typu a druhá ne. Signatura vyžaduje explicitní parametry typu (pokud se v implementaci vyskytují).
de: Das Modul "{0}" enthält\n {1} \nDie Signatur gibt aber Folgendes an:\n {2} \nEine Angabe ist eine Typfunktion, die andere nicht. Die Signatur erfordert explizite Typparameter, falls diese in der Implementierung vorhanden sind.
es: El módulo '{0}' contiene\n {1} \npero su signatura especifica\n {2} \nUno es una función de tipo y el otro no. La signatura requiere parámetros de tipo explícitos si están presentes en la implementación.
fr: Le module '{0}' contient\n {1} \nmais sa signature spécifie\n {2} \nL'un est une fonction de type mais pas l'autre. La signature requiert des paramètres de type explicite s'ils sont présents dans l'implémentation.
it: Il modulo '{0}' contiene\n {1} \ntuttavia la relativa firma specifica\n {2} \nUno è una funzione di tipo, l'altro no. La firma richiede parametri di tipo esplicito se questi sono presenti nell'implementazione.
ja: モジュール '{0}' には\n {1} \nが含まれますが、シグネチャには\n {2} \nを指定しています。一方は型関数ですが、もう一方は違います。型パラメーターが実装にある場合、シグネチャには明示的な型パラメーターが必要です。
ko: {0}' 모듈에\n {1}이(가) 포함되어 있지만 \n해당 시그니처는\n {2}을(를) 지정합니다. \n하나는 형식 함수이고 다른 하나는 그렇지 않습니다. 명시적 형식 매개 변수가 구현에 있는 경우 시그니처에도 해당 형식 매개 변수가 필요합니다.
pl: Moduł „{0}” zawiera element\n {1}, \nale jego sygnatura określa element\n {2} \nJeden element jest funkcją typu, a drugi nie. Sygnatura wymaga jawnych parametrów typu, jeśli są obecne w implementacji.
pt_br: O módulo '{0}' contém\n {1} \n, mas sua assinatura especifica\n {2} \nUm é função de tipo e o outro não. A assinatura requer parâmetros de tipo explícito caso estejam presentes na implementação.
ru: Модуль "{0}" содержит\n {1} \nоднако его сигнатура задает\n {2} \nОдин является функциональным типом, другой - нет Сигнатура требует явных параметров типов, если они присутствуют в реализации.
tr: {0}' modülü\n {1} \niçeriyor ancak imzasında\n {2} \nbelirtiliyor. Biri tür işlevi, diğeri değil. Açık tür parametreleri uygulamada varsa imza için bunlar gerekiyor.
zh_hans: 模块“{0}”包含\n {1} \n而其签名指定\n {2} \n一个是类型函数，另一个不是类型函数。如果实现中存在显式类型参数，则签名需要这些显式类型参数。
zh_hant: 模組 '{0}' 包含\n {1} \n但它的簽章卻指定\n {2} \n其中一個是類型函式，另一個卻不是。如果型別參數出現在實作中，簽章就需要明確的型別參數參數。

# ValueNotContainedMutabilityParameterCountsDiffer
source: Module '{0}' contains\n {1} \nbut its signature specifies\n {2} \nThe respective type parameter counts differ
cs: Modul {0} obsahuje hodnotu\n {1}, \nale jeho signatura definuje hodnotu\n {2}. \nLiší se odpovídajícím počtem parametrů typu.
de: Das Modul "{0}" enthält\n {1} \nDie Signatur gibt aber Folgendes an:\n {2} \nDie Anzahl der entsprechenden Typparameter ist unterschiedlich.
es: El módulo '{0}' contiene\n {1} \npero su signatura especifica\n {2} \nEl recuento de parámetros de tipo respectivos difieren.
fr: Le module '{0}' contient\n {1} \nmais sa signature spécifie\n {2} \nLe nombre de paramètres de type respectifs est différent
it: Il modulo '{0}' contiene\n {1} \ntuttavia la relativa firma specifica\n {2} \nI rispettivi conteggi di parametri di tipo sono diversi
ja: モジュール '{0}' には\n {1} \nが含まれますが、シグネチャには\n {2} \nを指定しています。それぞれの型パラメーター数が異なります。
ko: {0}' 모듈에\n {1}이(가) 포함되어 있지만 \n해당 시그니처는\n {2}을(를) 지정합니다. \n각각의 형식 매개 변수 수가 서로 다릅니다.
pl: Moduł „{0}” zawiera element\n {1}, \nale jego sygnatura określa element\n {2} \nOdpowiednie liczby parametrów typu są różne
pt_br: O módulo '{0}' contém\n {1} \n, mas sua assinatura especifica\n {2} \nAs respectivas contagens de parâmetro de tipo são diferentes
ru: Модуль "{0}" содержит\n {1} \nоднако его сигнатура задает\n {2} \nСоответствующие количества параметров типов различаются
tr: {0}' modülü\n {1} \niçeriyor ancak imzasında\n {2} \nbelirtiliyor. İlgili tür parametresi sayıları farklı
zh_hans: 模块“{0}”包含\n {1} \n而其签名指定\n {2} \n各自的类型参数计数不同
zh_hant: 模組 '{0}' 包含\n {1} \n但其簽章卻指定\n {2} \n個別的型別參數計數不同

# ValueNotContainedMutabilityTypesDiffer
source: Module '{0}' contains\n {1} \nbut its signature specifies\n {2} \nThe types differ
cs: Modul {0} obsahuje hodnotu\n {1}, \nale jeho signatura definuje hodnotu\n {2}. \nLiší se typy.
de: Das Modul "{0}" enthält\n {1} \nDie Signatur gibt aber Folgendes an:\n {2} \nDie Typen sind unterschiedlich.
es: El módulo '{0}' contiene\n {1} \npero su signatura especifica\n {2} \nLos tipos difieren.
fr: Le module '{0}' contient\n {1} \nmais sa signature spécifie\n {2} \nLes types sont différents
it: Il modulo '{0}' contiene\n {1} \ntuttavia la relativa firma specifica\n {2} \nI tipi sono diversi
ja: モジュール '{0}' には\n {1} \nが含まれますが、シグネチャには\n {2} \nを指定しています。型が異なります。
ko: {0}' 모듈에\n {1}이(가) 포함되어 있지만 \n해당 시그니처는\n {2}을(를) 지정합니다. \n형식이 서로 다릅니다.
pl: Moduł „{0}” zawiera element\n {1}, \nale jego sygnatura określa element\n {2} \nTypy są różne
pt_br: O módulo '{0}' contém\n {1} \n, mas sua assinatura especifica\n {2} \nOs tipos são diferentes
ru: Модуль "{0}" содержит\n {1} \nоднако его сигнатура задает\n {2} \nТипы различаются
tr: {0}' modülü\n {1} \niçeriyor ancak imzasında\n {2} \nbelirtiliyor. Türler farklı
zh_hans: 模块“{0}”包含\n {1} \n而其签名指定\n {2} \n类型不同
zh_hant: 模組 '{0}' 包含\n {1} \n但它的簽章卻指定\n {2} \n類型不同
