Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# parsInlineAssemblyCannotHaveVisibilityDeclarations
source: Accessibility modifiers are not permitted on inline assembly code types
cs: Modifikátory dostupnosti nejsou u typů kódu vložených sestavení povolené.
de: Zugriffsmodifizierer sind für Inlineassembly-Codetypen nicht zulässig.
es: No se permiten modificadores de accesibilidad en tipos de código de ensamblado alineado.
fr: Les modificateurs d'accessibilité ne sont pas autorisés sur les types de codes assembleur inline
it: Modificatori di accessibilità non consentiti in tipi di codice assembly inline
ja: アクセシビリティ修飾子はインライン アセンブラー コード型では許可されていません
ko: 액세스 가능성 한정자는 인라인 어셈블리 코드 형식에서 허용되지 않습니다.
pl: Modyfikatory dostępności nie są dozwolone w typach śródwierszowego kodu zestawu
pt_br: Modificadores de acessibilidade não são permitidos em tipo de código de assembly embutido
ru: Использование модификаторов доступности в типах встроенного кода сборки не допускается
tr: Erişilebilirlik değiştiricilerine satır içi bütünleştirilmiş kod kodu türlerinde izin verilmez
zh_hans: 不允许对内联程序集代码类型使用可访问性修饰符
zh_hant: 不允許在內嵌組譯程式碼類型上使用存取範圍修飾詞

# parsUnexpectedIdentifier
source: Unexpected identifier: '{0}'
cs: Neočekávaný identifikátor: {0}
de: Unerwarteter Bezeichner: '{0}'
es: Identificador inesperado: '{0}'.
fr: Identificateur inattendu : '{0}'
it: Identificatore non previsto: '{0}'
ja: 予期しない識別子: '{0}':
ko: 예기치 않은 식별자입니다. '{0}'
pl: Nieoczekiwany identyfikator: „{0}”
pt_br: Identificador inesperado: '{0}'
ru: Недопустимый идентификатор: '{0}'
tr: Beklenmeyen tanımlayıcı: '{0}'
zh_hans: 意外的标识符: '{0}'
zh_hant: 未預期的識別碼: '{0}'

# parsUnionCasesCannotHaveVisibilityDeclarations
source: Accessibility modifiers are not permitted on union cases. Use 'type U = internal ...' or 'type U = private ...' to give an accessibility to the whole representation.
cs: Modifikátory dostupnosti nejsou u případů typu union povolené. Pomocí notace type U = internal ... nebo type U = private ... předejte dostupnost celé reprezentaci.
de: Zugriffsmodifizierer sind für Union-Fälle nicht zulässig. Verwenden Sie "type U = internal ..." oder "type U = private ...", um die Zugreifbarkeit für die vollständige Darstellung anzugeben.
es: No se permiten modificadores de accesibilidad en casos de unión. Use 'type U = internal ...' o 'type U = private ...' para proporcionar una accesibilidad a toda la representación.
fr: Les modificateurs d'accessibilité ne sont pas autorisés sur les cas d'union. Utilisez 'type U = internal ...' ou 'type U = private ...' pour fournir une accessibilité à l'ensemble de la représentation.
it: I modificatori di accessibilità non sono consentiti in casi di unione. Usare 'type U = internal ...' o 'type U = private ...' per assegnare un'accessibilità all'intera rappresentazione.
ja: アクセシビリティ修飾子は共用体ケースに使用できません。表現全体にアクセシビリティを付与するには、'type U = internal ...' または 'type U = private ...' を使用してください。
ko: 액세스 가능성 한정자는 공용 구조체 케이스에서 허용되지 않습니다. 표현 전체에 액세스 가능성을 지정하려면 'type U = internal ...' 또는 'type U = private ...'을 사용하세요.
pl: Modyfikatory dostępności nie są dozwolone w przypadkach unii. Użyj ciągu type U = internal ...” lub „type U = private ...”, aby dodać dostępność do całej reprezentacji.
pt_br: Modificadores de acessibilidade não são permitidos em casos união. Use ' type U = internal... ' ou ' type U = private... ' para dar uma acessibilidade à representação inteira.
ru: Использование модификаторов доступности в вариантах объединения не допускается. Чтобы обеспечить доступность всего представления, используйте синтаксис "type U = internal ..." или "type U = private ...".
tr: Birleşim durumlarında erişilebilirlik değiştiricilerine izin verilmez. Temsilin tamamına erişilebilirlik kazandırmak için 'type U = internal ...' veya 'type U = private ...' kullanın.
zh_hans: 不允许对联合用例使用可访问性修饰符。请使用“type U = internal ...”或“type U = private ...”为整个表示形式给定可访问性。
zh_hant: 不允許在聯集上使用存取範圍修飾詞。請使用 'type U = internal ...' 或 'type U = private ...' 為整個表示指定存取範圍。

# parsEnumFieldsCannotHaveVisibilityDeclarations
source: Accessibility modifiers are not permitted on enumeration fields
cs: Modifikátory dostupnosti nejsou u polí výčtového typu povolené.
de: Zugriffsmodifizierer sind für Enumerationsfelder nicht zulässig.
es: No se permiten modificadores de accesibilidad en campos de enumeración.
fr: Les modificateurs d'accessibilité ne sont pas autorisés sur les champs d'énumération
it: Modificatori di accessibilità non consentiti in campi di enumerazione
ja: 列挙型フィールドにアクセシビリティ修飾子は使用できません
ko: 액세스 가능성 한정자는 열거형 필드에서 허용되지 않습니다.
pl: Modyfikatory dostępności są niedozwolone w polach wyliczeń
pt_br: Modificadores de acessibilidade não são permitidos em campos de enumeração
ru: Использование модификаторов доступности в полях перечисления не допускается
tr: Erişilebilirlik değiştiricilerine sabit listesi alanlarında izin verilmez
zh_hans: 不允许对枚举字段使用可访问性修饰符
zh_hant: 不允許在列舉欄位上使用存取範圍修飾詞

# parsConsiderUsingSeparateRecordType
source: Consider using a separate record type instead
cs: Zvažte možnost použít místo toho samostatný typ záznamu.
de: Verwenden Sie stattdessen einen separaten Datensatztyp.
es: Considere el uso de un tipo de registro diferente en su lugar.
fr: Utilisez un autre type enregistrement à la place
it: Provare invece a utilizzare un tipo di record separato
ja: 代わりに別のレコード型を使用してください
ko: 대신 별도의 레코드 형식을 사용하세요.
pl: Rozważ użycie osobnego typu rekordu
pt_br: Considere usar um tipo de registro separado em vez disso
ru: Вместо этого рекомендуется использовать отдельный тип записи
tr: Onun yerine ayrı bir kayıt türü kullanmayı deneyin
zh_hans: 请考虑改用单独的记录类型
zh_hant: 請考慮改用不同的記錄類型

# parsRecordFieldsCannotHaveVisibilityDeclarations
source: Accessibility modifiers are not permitted on record fields. Use 'type R = internal ...' or 'type R = private ...' to give an accessibility to the whole representation.
cs: Modifikátory dostupnosti nejsou v polích záznamů povolené. Pomocí type R = internal ... nebo type R = private ... předejte dostupnost celé reprezentaci.
de: Zugriffsmodifizierer sind für Datensatzfelder nicht zulässig. Verwenden Sie "type R = internal ..." oder "type R = private ...", um die Zugreifbarkeit für die vollständige Darstellung anzugeben.
es: No se permiten modificadores de accesibilidad en campos de registro. Use 'type R = internal ...' o 'type R = private ...' para proporcionar una accesibilidad a toda la representación.
fr: Les modificateurs d'accessibilité ne sont pas autorisés sur les champs de type enregistrement. Utilisez 'type R = internal ...' ou 'type R = private ...' pour fournir une accessibilité à l'ensemble de la représentation.
it: Modificatori di accessibilità non consentiti in campi di record. Utilizzare 'type R = internal ...' o 'type R = private ...' per assegnare un'accessibilità all'intera rappresentazione.
ja: アクセシビリティ修飾子はレコード フィールドに使用できません。表現全体にアクセシビリティを付与するには、'type R = internal ...' または 'type R = private ...' を使用してください
ko: 액세스 가능성 한정자는 레코드 필드에서 허용되지 않습니다. 표현 전체에 액세스 가능성을 지정하려면 'type R = internal ...' 또는 'type R = private ...'을 사용하세요.
pl: Modyfikatory dostępności są niedozwolone w polach rekordu. Użyj konstrukcji „type R = internal ...” lub „type R = private ...”, aby zapewnić dostępność całej reprezentacji.
pt_br: Modificadores de acessibilidade não são permitidos nos campos de registros. Use 'type R = internal ...' ou 'type R = private ...' para dar uma acessibilidade à representação inteira.
ru: Использование модификаторов доступности в полях записи не допускается. Чтобы обеспечить доступность всего представления, используйте синтаксис "type R = internal ..." или "type R = private ...".
tr: Kayıt alanlarında erişilebilirlik değiştiricilerine izin verilmez. Temsilin tamamına erişilebilirlik kazandırmak için 'type R = internal ...' veya 'type R = private ...' kullanın.
zh_hans: 不允许对记录字段使用可访问性修饰符。请使用“type R = internal ...”或“type R = private ...”为整个表示形式给定可访问性。
zh_hant: 不允許在記錄欄位上使用存取範圍修飾詞。請使用 'type R = internal ...' 或 'type R = private ...' 為整個表示指定存取範圍。

# parsLetAndForNonRecBindings
source: The declaration form 'let ... and ...' for non-recursive bindings is not used in F# code. Consider using a sequence of 'let' bindings
cs: Notace deklarace let ... and ... se pro nerekurzivní vazby v kódu F# nepoužívá. Zvažte použití posloupnosti vazeb let.
de: Im F#-Code wird das Deklarationsformat "let ... and ..." für nicht rekursive Bindungen nicht verwendet. Verwenden Sie eine Reihe aus let-Bindungen.
es: El formato de declaración 'let ... and ...' para enlaces no recursivos no se usa en el código de F#. Considere el uso de una secuencia de enlaces 'let'.
fr: La forme de déclaration 'let ... and ...' pour les liaisons non récursives n'est pas utilisée dans le code F#. Utilisez une séquence de liaisons 'let'
it: Il formato di dichiarazione 'let ... and ...' per binding non ricorsivi non è usato nel codice F#. Provare a usare una sequenza di binding 'let'
ja: 非再帰的な束縛の宣言の形式 'let ... and ...' は、F# コードでは使用されません。'let' 束縛のシーケンスを使用してください。
ko: 비재귀적 바인딩을 위한 선언 형식 'let ... and ...'는 F# 코드에서 사용되지 않습니다. 대신 'let' 바인딩 시퀀스를 사용하세요.
pl: Postać deklaracji „let ... and ...” dla powiązań innych niż cykliczne nie jest używana w kodzie języka F#. Rozważ użycie sekwencji powiązań „let”
pt_br: A forma de declaração 'let ... and ...' para associações não recursivas não são usadas em código F#. Considere usar uma sequência de associações 'let'
ru: Форма объявления "let ... and ..." для нерекурсивных привязок не используется в коде F#. Рекомендуется использовать последовательность привязок "let"
tr: Özyinelemeli olmayan bağlamalar için 'let ... and ...' bildirim biçimi F# kodunda kullanılmaz. 'let' bağlama sırası kullanmayı düşünün
zh_hans: 非递归绑定的声明格式“let ... and ...”不可用于 F# 代码。请考虑使用“let”绑定序列
zh_hant: F# 程式碼中不使用非遞迴繫結的宣告形式 'let ... and ...'。請考慮使用 'let' 繫結序列

# parsUnmatchedParen
source: Unmatched '('
cs: Nespárovaná závorka (
de: Keine Entsprechung für "(".
es: '(' desemparejado.
fr: '(' non apparié
it: '(' senza corrispondenza
ja: '(' が対応しません
ko: '('의 짝이 맞지 않습니다.
pl: Niedopasowany element „(”
pt_br: '(' incompatível
ru: Несогласованный "("
tr: Eşleşmeyen '('
zh_hans: 不匹配的“(”
zh_hant: 無對應的 '('

# parsSuccessivePatternsShouldBeSpacedOrTupled
source: Successive patterns should be separated by spaces or tupled
cs: Po sobě jdoucí vzory by měly být oddělené mezerami nebo by měly být řazenou kolekcí členů.
de: Aufeinanderfolgende Muster sollten durch Leerzeichen getrennt oder als Tupel angegeben werden.
es: Patrones sucesivos deben separarse con espacios u organizarse en tuplas.
fr: Les modèles successifs doivent être séparés par des espaces ou être basés sur des tuples
it: I criteri successivi devono essere separati da spazi o inclusi in tuple
ja: 複数のパターンが連続する場合、スペースで区切るかタプル化します
ko: 연속된 패턴은 공백으로 구분하거나 튜플해야 합니다.
pl: Kolejne wzorce powinny być oddzielone spacjami lub mieć postać krotek
pt_br: Padrões sucessivos devem ser separados por espaços ou serem tuplas.
ru: Последовательные шаблоны следует разделять пробелами или включать в кортежи
tr: Ardışık desenler boşluklarla veya grup olarak tanımlayarak ayrılmalıdır
zh_hans: 应使用空格来分隔连续模式或将这些连续模式组成元组
zh_hant: 後續引數應該用空格分隔或採用 Tuple 形式

# parsNoMatchingInForLet
source: No matching 'in' found for this 'let'
cs: Pro tuto klauzuli let se nenašel žádný odpovídající výraz in.
de: Kein übereinstimmendes "in" für dieses "let" gefunden.
es: No se encontró un 'in' correspondiente a este 'let'.
fr: Impossible de trouver un 'in' correspondant pour ce 'let'
it: Nessun 'in' corrispondente trovato per 'let'
ja: この 'let' に対応する 'in' が見つかりません
ko: 이 'let'과 짝이 맞는 'in'을 찾을 수 없습니다.
pl: Nie znaleziono zgodnego tokenu „in” dla tego tokenu „let”
pt_br: Nenhum 'in' correspondente encontrado para 'let'
ru: Отсутствует маркер "in", соответствующий этому маркеру "let"
tr: Bu 'let' için eşleşen bir 'in' bulunamadı
zh_hans: 未找到与此“let”匹配的“in”
zh_hant: 找不到這個 'let' 的對應 'in'

# parsErrorInReturnForLetIncorrectIndentation
source: Error in the return expression for this 'let'. Possible incorrect indentation.
cs: Chyba ve vráceném výrazu pro tuto klauzuli let. Důvodem může být nesprávné odsazení.
de: Fehler im Rückgabeausdruck für dieses "let". Möglicherweise falscher Einzug.
es: Error en la expresión devuelta para este 'let'. Quizá tiene una sangría incorrecta.
fr: Erreur dans l'expression de retour de ce 'let'. Mise en retrait éventuellement incorrecte.
it: Errore nell'espressione restituita per 'let'. Il rientro potrebbe non essere corretto.
ja: この 'let' の return 式にエラーが見つかりました。インデントが正しくない可能性があります。
ko: 이 'let'에 대한 반환 식에 오류가 있습니다. 들여쓰기가 잘못되었을 수 있습니다.
pl: Błąd w wyrażeniu zwracanym dla tego słowa kluczowego „let”. Możliwe niepoprawne wcięcie.
pt_br: Erro na expressão de retorno para este 'let'. Possível recuo incorreto.
ru: Ошибка в выражении return для этого выражения "let". Возможно, неправильные отступы.
tr: Bu 'let' için dönüş ifadesinde hata. Muhtemelen hatalı girinti.
zh_hans: 此“let”的返回表达式出错。缩进可能不正确。
zh_hant: 這個 'let' 的傳回運算式中有錯。可能是縮排不正確。

# parsExpectedExpressionAfterLet
source: The block following this '{0}' is unfinished. Every code block is an expression and must have a result. '{1}' cannot be the final code element in a block. Consider giving this block an explicit result.
cs: Blok, který následuje po tomto {0}, není dokončený. Každý blok kódu je výraz a musí mít výsledek. {1} nemůže být konečný element kódu v bloku. Zvažte, že tomuto bloku dáte explicitní výsledek.
de: Der Block, der auf dieses {0}-Element folgt, ist unvollständig. Jeder Codeblock ist ein Ausdruck und muss ein Ergebnis besitzen. "{1}" kann nicht das letzte Codeelement in einem Block sein. Weisen Sie diesem Block ggf. ein explizites Ergebnis zu.
es: El bloque que sigue a este objeto '{0}' está sin finalizar. Cada bloque de código es una expresión y debe tener un resultado. '{1}' no puede ser el elemento de código final en un bloque. Considere la posibilidad de asignar a este bloque un resultado explícito.
fr: Le bloc qui suit ce '{0}' est inachevé. Chaque bloc de code est une expression et doit avoir un résultat. '{1}' ne peut pas être l'élément de code final d'un bloc. Donnez à ce bloc un résultat explicite.
it: Il blocco che segue questo elemento '{0}' non contiene un elemento finale. Ogni blocco di codice è un'espressione e deve includere un risultato. '{1}' non può essere l'elemento di codice finale di un blocco. Provare ad assegnare un risultato esplicito a questo blocco.
ja: この '{0}' に続くブロックが完了していません。すべてのコード ブロックは式であり、結果を持つ必要があります。'{1}' をブロック内の最後のコード要素にすることはできません。このブロックに明示的な結果を指定することを検討してください。
ko: 이 '{0}' 뒤에 오는 블록이 완료되지 않았습니다. 모든 코드 블록은 식이며 결과가 있어야 합니다. '{1}'이(가) 블록의 최종 코드 요소가 될 수 없습니다. 이 블록에 명시적 결과를 제공하세요.
pl: Blok następujący po elemencie „{0}” jest niezakończony. Każdy blok kodu jest wyrażeniem i musi mieć wynik. Element „{1}” nie może być ostatnim elementem kodu w bloku. Rozważ zastosowanie jawnego wyniku w tym bloku.
pt_br: O bloco após '{0}' está inacabado. Cada bloco de código é uma expressão e deve ter um resultado. '{1}' não pode ser o elemento de código final em um bloco. Considere dar a este bloco um resultado explícito.
ru: Блок, следующий за блоком "{0}", не закончен. Каждый блок кода является выражением и должен иметь результат. "{1}" не может быть заключительным элементом кода в блоке. Рекомендуется предоставить для этого блока явный результат.
tr: Bu '{0}' öğesini izleyen blok tamamlanmadı. Her kod bloğu bir ifadedir ve bir sonucu olmalıdır. '{1}' bir bloktaki son kod öğesi olamaz. Bu bloğa açık bir sonuç vermeyi düşünün.
zh_hans: 此“{0}”后的程序块未完成。每个代码块均为表达式，且必须具有结果。“{1}”不能为程序块中最后的代码元素。考虑为此程序块提供显式结果。
zh_hant: 此 '{0}' 後跟隨的區塊未完成。每個程式碼區塊都是運算式，且必須要有結果。'{1}' 不得為區塊中最後一個程式碼項目。請考慮為此區塊提供明確結果。

# parsIncompleteIf
source: Incomplete conditional. Expected 'if <expr> then <expr>' or 'if <expr> then <expr> else <expr>'.
cs: Neúplná podmínka. Očekávaná notace je if <výraz> then <výraz> nebo if <výraz> then <výraz> else <výraz>.
de: Unvollständige Bedingung. Erwartet wird: "if <expr> then <expr>" oder "if <expr> then <expr> else <expr>".
es: Condicional incompleta. Se esperaba "if <expr> then <expr>" o "if <expr> then <expr> else <expr>".
fr: Expression conditionnelle incomplète. Attendu 'if <expr> then <expr>' ou 'if <expr> then <expr> else <expr>'.
it: Espressione condizionale incompleta. È previsto 'if <expr> then <expr>' o 'if <expr> then <expr> else <expr>'.
ja: 不完全な条件です。'if <expr> then <expr>' や 'if <expr> then <expr> else <expr>' が必要でした。
ko: 조건이 잘못되었습니다. 'if <expr> then <expr>' 또는 'if <expr> then <expr> else <expr>'이 필요합니다.
pl: Niekompletne wyrażenie warunkowe. Oczekiwano konstrukcji „if <wyrażenie> then <wyrażenie>” lub „if <wyrażenie> then <wyrażenie> else <wyrażenie>”.
pt_br: Condicional incompleta. Esperado 'if <expr> then <expr>' ou 'if <expr> then <expr> else <expr>'.
ru: Неполное условие. Ожидается 'if <expr> then <expr>' или 'if <expr> then <expr> else <expr>'.
tr: Eksik koşullu. 'if <expr> then <expr>' veya 'if <expr> then <expr> else <expr>' bekleniyordu.
zh_hans: 条件不完整。应为 "if <expr> then <expr>" 或 "if <expr> then <expr> else <expr>"。
zh_hant: 條件不完整。應為 'if <expr> then <expr>' 或 'if <expr> then <expr> else <expr>'。

# parsAssertIsNotFirstClassValue
source: 'assert' may not be used as a first class value. Use 'assert <expr>' instead.
cs: assert nejde použít jako první hodnotu třídy. Použijte místo toho assert <výraz>.
de: "assert" kann nicht als erster Klassenwert verwendet werden. Verwenden Sie stattdessen "assert <expr>".
es: "assert" no puede utilizarse como un valor de primera clase. Utilice mejor "assert <expr>".
fr: 'assert' ne doit pas être utilisé dans une valeur de première classe. Utilisez 'assert <expr>' à la place.
it: Non è possibile usare 'assert' come valore di prima classe. Usare 'assert <expr>'.
ja: 'assert' をファースト クラス値として使用することはできません。代わりに 'assert <expr>' を使用します。
ko: 'assert'는 첫 번째 클래스 값으로 사용할 수 없습니다. 대신 'assert <expr>'을 사용하세요.
pl: Element „assert” nie może być używany jako wartość pierwszej klasy. Zamiast tego użyj elementu „assert <wyrażenie>”.
pt_br: 'assert' não pode ser usado como um valor de primeira classe. Use 'assert <expr>'.
ru: 'assert' не может использоваться как значение первого класса. Используйте 'assert <expr>'.
tr: 'assert' birinci sınıf değer olarak kullanılamaz. Bunun yerine 'assert <expr>' değerini kullanın.
zh_hans: "assert" 不能用作第一类值。请改用 "assert <expr>"。
zh_hant: 'assert' 不能用作第一個類別值。請改用 'assert <expr>'。

# parsIdentifierExpected
source: Identifier expected
cs: Očekával se identifikátor.
de: Bezeichner erwartet.
es: Se esperaba un identificador.
fr: Identificateur attendu
it: È previsto un identificatore
ja: 識別子がありません
ko: 식별자가 필요합니다.
pl: Oczekiwano identyfikatora
pt_br: Identificador esperado
ru: Требуется идентификатор.
tr: Tanımlayıcı bekleniyor
zh_hans: 应输入标识符
zh_hant: 必須是識別項

# parsInOrEqualExpected
source: 'in' or '=' expected
cs: Očekává se in nebo =.
de: 'in' oder '=' erwartet
es: Se esperaba 'in' o '='.
fr: 'in' ou '=' attendu
it: Previsto 'in' o '='
ja: 'in' または '=' が必要です
ko: 'in' 또는 '='가 필요합니다.
pl: Oczekiwano konstrukcji „in” lub „=”
pt_br: 'in' ou '=' esperado
ru: Ожидалось "in" или "="
tr: 'in' veya '=' bekleniyor
zh_hans: 应为“in”或“=”
zh_hant: 必須是 'in' 或 '='

# parsArrowUseIsLimited
source: The use of '->' in sequence and computation expressions is limited to the form 'for pat in expr -> expr'. Use the syntax 'for ... in ... do ... yield...' to generate elements in more complex sequence expressions.
cs: Použití -> ve výrazech pořadí a výpočtu je omezené na formu for vzor in výraz -> výraz. Ke generování prvků v komplexnějších výrazech pořadí použijte syntaxi for ... in ... do ... yield...
de: Die Verwendung von "->" in Sequenz- und Berechnungsausdrücken ist auf das Format "for pat in expr -> expr" beschränkt. Verwenden Sie die Syntax "for ... in ... do ... yield...", um Elemente in komplexeren Sequenzausdrücken zu generieren.
es: El uso de "->" en secuencia y las expresiones de cálculo se limitan a la forma "for pat in expr -> expr". Use la sintaxis "for ... in ... do ... yield..." para generar elementos en expresiones de secuencia más complejas.
fr: L'utilisation de '->' dans des expressions de séquence et de calcul est limitée à la forme 'for pat in expr -> expr'. Utilisez la syntaxe 'for ... in ... do ... yield...' pour générer des éléments dans des expressions de séquence plus complexes.
it: L'uso di '->' in espressioni sequenza e di calcolo è limitato al formato 'for crit in expr -> expr'. Usare la sintassi 'for ... in ... do ... yield...' per generare elementi in espressioni sequenza più complesse.
ja: シーケンス式または計算式で '->' を使用する場合、'for pat in expr -> expr' という形式にするよう制限されています。より複雑なシーケンス式でエレメントを生成するには、'for ... in ... do ... yield...' 構文を使用します。
ko: '->'를 시퀀스 및 계산 식에 사용할 때는 'for pat in expr -> expr' 형식을 사용해야 합니다. 'for ... in ... do ... yield...' 구문을 사용하면 보다 복잡한 시퀀스 식에서 요소를 생성할 수 있습니다.
pl: Użycie konstrukcji „->” w wyrażeniach obliczeń i sekwencji jest ograniczone do postaci „for wzorzec in wyrażenie -> wyrażenie”. Użyj składni „for ... in ... do ... yield...”, aby wygenerować elementy w bardziej złożonych wyrażeniach sekwencji.
pt_br: O uso de '->' em expressões de computação e sequência é limitado ao formulário 'for pat in expr -> expr'. Use a sintaxe 'for... in... do... yield...' para gerar elementos em expressões mais complexas de sequência.
ru: Конструкция '->' в последовательностях и вычисляемых выражениях может использоваться только в виде 'for pat in expr -> expr'. Используйте синтаксис 'for ... in ... do ... yield...' для создания элементов в более сложных выражениях последовательностей.
tr: Dizi ve hesaplama ifadelerinde '->' kullanımı, 'for pat in expr -> expr' biçimiyle sınırlıdır. Daha karmaşık dizi ifadelerinde öğe oluşturmak için 'for ... in ... do ... yield...' söz dizimini kullanın.
zh_hans: 只能在序列和计算表达式中按 "for pat in expr -> expr" 格式使用 "->"。要在多个复杂的序列表达式中生成元素，请使用语法 "for ... in ... do ... yield..."。
zh_hant: '->' 在序列和計算運算式中的用法只能是 'for pat in expr -> expr' 形式。請使用 'for ... in ... do ... yield...' 語法在更複雜的序列運算式中產生元素。
