Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# etUnsupportedProvidedExpression
source: Unsupported expression '{0}' from type provider. If you are the author of this type provider, consider adjusting it to provide a different provided expression.
cs: U zprostředkovatele typu se vyskytl neplatný výraz {0}. Pokud jste autorem tohoto zprostředkovatele typu, zvažte možnost upravit ho tak, aby poskytoval jiný poskytnutý výraz.
de: Nicht unterstützter Ausdruck '{0}' des Typanbieters. Wenn Sie der Autor dieses Typanbieters sind, sollten Sie ihn möglicherweise so anpassen, dass ein anderer unterstützter Ausdruck bereitgestellt wird.
es: Expresión '{0}' no admitida del proveedor de tipo. Si es el autor de este proveedor de tipo, considere ajustarlo para que devuelva una expresión proporcionada distinta.
fr: Expression '{0}' non prise en charge retournée par le fournisseur de type. Si vous êtes l'auteur de ce fournisseur de type, envisagez de l'ajuster pour présenter une expression fournie différente.
it: Espressione '{0}' non supportata dal provider di tipi. Se l'utente è l'autore di questo provider di tipi, provare a fornire un'espressione differente.
ja: 型プロバイダーから、サポートされない式 '{0}' が指定されました。この型プロバイダーの作成者である場合は、別の指定された式を指定するように調整することを検討してください。
ko: 형식 공급자의 '{0}' 식은 지원되지 않습니다. 이 형식 공급자의 작성자인 경우 제공된 다른 식을 제공하도록 조정하세요.
pl: Nieobsługiwane wyrażenie „{0}” z dostawcy typów. Jeśli ten dostawca typów jest Twojego autorstwa, rozważ dostosowanie go w celu zapewnienia innego udostępnionego wyrażenia.
pt_br: Expressão '{0}' sem suporte do provedor de tipos. Se você é o autor desse provedor de tipo, considere ajustá-lo para oferecer uma expressão diferente.
ru: Неподдерживаемое выражение "{0}" от поставщика типов. Если вы являетесь автором этого поставщика типов, попробуйте изменить его для предоставления другого выражения.
tr: Tür sağlayıcısından desteklenmeyen '{0}' ifadesi. Bu tür sağlayıcısının yazarı sizseniz, farklı bir sağlanan ifade sağlayacak şekilde ayarlamayı düşünün.
zh_hans: 类型提供程序提供的表达式“{0}”不受支持。如果您是此类型提供程序的作者，请考虑将它调整为提供不同的提供表达式。
zh_hant: 型別提供者有不支援的運算式 '{0}'。如果您是這個型別提供者的作者，請考慮進行調整以提供其他提供的運算式。

# etProvidedTypeHasUnexpectedName
source: Expected provided type named '{0}' but provided type has 'Name' with value '{1}'
cs: Očekával se poskytnutý typ s názvem {0}, ale Name u poskytnutého typu má hodnotu {1}.
de: Es wurde ein angegebener Type mit dem Namen '{0}' erwartet, der angegebene Typ verfügt jedoch über 'Name' mit dem Wert '{1}'
es: Se esperaba un tipo proporcionado con el nombre '{0}', pero el tipo proporcionado tiene el valor '{1}' para 'Name'.
fr: Un type fourni nommé '{0}' était attendu, mais 'Name' a la valeur '{1}' pour le type fourni
it: Era previsto un tipo fornito denominato '{0}', mentre il tipo fornito contiene 'Name' con valore '{1}'
ja: 指定された型の名前が '{0}' である必要がありましたが、指定された型の名前は 'Name'、値は '{1}' でした
ko: 이름이 '{0}'인 제공된 형식이 필요한데 제공된 형식의 'Name' 값은 '{1}'입니다.
pl: Oczekiwano udostępnionego typu o nazwie „{0}”, ale udostępniony typ ma właściwość Name o wartości „{1}”.
pt_br: Um tipo fornecido com nome '{0}' era esperado, mas o tipo fornecido possui 'Name' com o valor '{1}'
ru: Ожидался предоставленный тип с именем "{0}", однако у предоставленного типа значение Name равнялось "{1}"
tr: {0}' adlı sağlanan tür bekleniyordu ancak sağlanan türde '{1}' değerli 'Name' öğesi var
zh_hans: 需要名为“{0}”的提供的类型，但所提供类型的“Name”值为“{1}”
zh_hant: 提供的類型必須命名為 '{0}' 但卻具有值為 '{1}' 的 'Name'

# etEventNoAdd
source: Event '{0}' on provided type '{1}' has no value from GetAddMethod()
cs: Událost {0} u poskytnutého typu {1} nepřebírá žádnou hodnotu od GetAddMethod().
de: Ereignis '{0}' des angegebenen Typs '{1}' verfügt nicht über einen Wert von GetAddMethod()
es: El evento '{0}' del tipo '{1}' proporcionado no tiene ningún valor de GetAddMethod().
fr: L'événement '{0}' sur le type fourni '{1}' n'a pas de valeur de GetAddMethod()
it: L'evento '{0}' nel tipo fornito '{1}' non contiene un valore di GetAddMethod()
ja: 指定された型 '{1}' におけるイベント '{0}' に、GetAddMethod() の値が含まれていません
ko: 제공된 형식 '{1}'에 대한 이벤트 '{0}'에 GetAddMethod()의 값이 없습니다.
pl: Zdarzenie „{0}” w udostępnionym typie „{1}” nie ma wartości z metody GetAddMethod()
pt_br: O evento '{0}' no tipo fornecido '{1}' não tem valores de GetAddMethod()
ru: Событие "{0}" предоставленного типа "{1}" не имеет значения, полученного от метода GetAddMethod()
tr: {1}' sağlanan türündeki '{0}' olayının bir GetAddMethod() değeri yok
zh_hans: 所提供类型“{1}”上的事件“{0}”没有来自 GetAddMethod() 的值
zh_hant: 提供的類型 '{1}' 中的事件 '{0}' 沒有來自 GetAddMethod() 的值

# etEventNoRemove
source: Event '{0}' on provided type '{1}' has no value from GetRemoveMethod()
cs: Událost {0} u poskytnutého typu {1} nepřebírá žádnou hodnotu od GetRemoveMethod().
de: Ereignis '{0}' des angegebenen Typs '{1}' verfügt nicht über einen Wert von GetRemoveMethod()
es: El evento '{0}' del tipo '{1}' proporcionado no tiene ningún valor de GetRemoveMethod().
fr: L'événement '{0}' sur le type fourni '{1}' n'a pas de valeur de GetRemoveMethod()
it: L'evento '{0}' nel tipo fornito '{1}' non contiene un valore di GetRemoveMethod()
ja: 指定された型 '{1}' におけるイベント '{0}' に、GetRemoveMethod() の値が含まれていません
ko: 제공된 형식 '{1}'에 대한 이벤트 '{0}'에 GetRemoveMethod()의 값이 없습니다.
pl: Zdarzenie „{0}” w udostępnionym typie „{1}” nie ma wartości z metody GetRemoveMethod()
pt_br: O evento '{0}' no tipo fornecido '{1}' não tem valores de GetRemoveMethod()
ru: Событие "{0}" предоставленного типа "{1}" не имеет значения, полученного от метода GetRemoveMethod()
tr: {1}' sağlanan türündeki '{0}' olayının bir GetRemoveMethod() değeri yok
zh_hans: 所提供类型“{1}”上的事件“{0}”没有来自 GetRemoveMethod() 的值
zh_hant: 提供的類型 '{1}' 中的事件 '{0}' 沒有來自 GetRemoveMethod() 的值

# etProviderHasWrongDesignerAssembly
source: Assembly attribute '{0}' refers to a designer assembly '{1}' which cannot be loaded from path '{2}'. The exception reported was: {3} - {4}
cs: Atribut sestavení {0} odkazuje na navržené sestavení {1}, které se nedá načíst z cesty {2}. Ohlášená výjimka: {3} – {4}
de: Das Assemblyattribut "{0}" verweist auf eine Designerassembly "{1}", die nicht aus dem Pfad "{2}" geladen werden kann. Gemeldete Ausnahme: {3} – {4}
es: El atributo de ensamblado "{0}" hace referencia a un ensamblado de diseñador "{1}" que no se puede cargar desde la ruta de acceso "{2}". Se notificó la excepción: {3} - {4}.
fr: L'attribut d'assembly '{0}' fait référence à un assembly de concepteur '{1}' qui ne peut pas être chargé à partir du chemin '{2}'. Exception signalée : {3} - {4}
it: L'attributo di assembly '{0}' fa riferimento a un assembly '{1}' della finestra di progettazione che non può essere caricato dal percorso '{2}'. L'eccezione restituita è {3} - {4}
ja: アセンブリ属性 '{0}' は、デザイナー アセンブリ '{1}' を参照していますが、これはパス '{2}' から読み込むことができません。報告された例外: {3} - {4}
ko: 어셈블리 특성 '{0}'은(는) '{2}' 경로에서 로드할 수 없는 디자이너 어셈블리 '{1}'을(를) 참조합니다. 보고된 예외: {3} - {4}
pl: Atrybut zestawu „{0}” odwołuje się do zestawu projektanta „{1}”, którego nie można załadować ze ścieżki „{2}”. Zgłoszony wyjątek: {3} — {4}
pt_br: O atributo de assembly '{0}' se refere a um assembly de designer '{1}' que não pode ser carregado do caminho '{2}'. A exceção relatada foi: {3} – {4}
ru: Атрибут сборки "{0}" ссылается на сборку конструктора "{1}", которая не может быть загружена по пути "{2}". Получено исключение: {3} — {4}
tr: '{0}' bütünleştirilmiş kod özniteliği, '{2}' yolundan yüklenemeyen '{1}' tasarımcı bütünleştirilmiş koduna başvuruyor. Bildirilen özel durum: {3} - {4}
zh_hans: 程序集属性“{0}”引用了无法从路径“{2}”加载的设计器程序集“{1}”。报告的异常是: {3} - {4}
zh_hant: 無法從路徑 '{2}' 載入組件屬性 '{0}' 參考的設計工具組件 '{1}'。回報告的例外狀況: {3} - {4}

# etProviderDoesNotHaveValidConstructor
source: The type provider does not have a valid constructor. A constructor taking either no arguments or one argument of type 'TypeProviderConfig' was expected.
cs: Zprostředkovatel typu nemá platný konstruktor. Očekávaný konstruktor nemá přebírat buď žádné argumenty, nebo jeden argument typu TypeProviderConfig.
de: Der Typanbieter verfügt über keinen gültigen Konstruktor. Es wurde ein Konstruktor erwartet, der entweder keine Argumente oder ein Argument des Typs 'TypeProviderConfig' akzeptiert.
es: El proveedor de tipos no tiene un constructor válido. Se esperaba un constructor que no tome argumentos o bien que tome un argumento de tipo 'TypeProviderConfig'.
fr: Le fournisseur de type n'a pas de constructeur valide. Un constructeur sans argument ou prenant un argument de type 'TypeProviderConfig' était attendu.
it: Il provider di tipi non contiene un costruttore valido. Era previsto un costruttore che non accetta argomenti o che accetta un solo argomento di tipo 'TypeProviderConfig'.
ja: 型プロバイダーに有効なコンストラクターが含まれていません。引数を受け取らないコンストラクター、または 'TypeProviderConfig' 型の引数を 1 つ受け取るコンストラクターが必要です。
ko: 형식 공급자에 올바른 생성자가 없습니다. 인수를 사용하지 않거나 'TypeProviderConfig' 형식의 인수 하나를 사용하는 생성자가 필요합니다.
pl: Dostawca typów nie ma prawidłowego konstruktora. Oczekiwano konstruktora, który nie pobiera argumentów lub pobiera jeden argument typu „TypeProviderConfig”.
pt_br: O provedor de tipos não tem um construtor válido. Um construtor que não recebe argumentos ou recebe um argumento do tipo 'TypeProviderConfig' era esperado.
ru: У поставщика типов нет допустимого конструктора. Ожидался конструктор, принимающий один аргумент типа TypeProviderConfig или не принимающий ни одного аргумента этого типа.
tr: Tür sağlayıcısının geçerli bir oluşturucusu yok. Hiç bağımsız değişken almayan veya 'TypeProviderConfig' türü bağımsız değişken alan bir oluşturucu bekleniyordu.
zh_hans: 类型提供程序没有有效的构造函数。构造函数应不采用参数或仅采用一个“TypeProviderConfig”类型的参数。
zh_hant: 型別提供者沒有有效的建構函式。建構函式必須不接受任何引數，或是接受型別 'TypeProviderConfig' 的一個引數。

# etProviderError
source: The type provider '{0}' reported an error: {1}
cs: Zprostředkovatel typu {0} oznámil chybu: {1}
de: Der Typanbieter '{0}' hat einen Fehler gemeldet: {1}
es: El proveedor de tipos '{0}' informó de un error: {1}
fr: Le fournisseur de type '{0}' a signalé une erreur : {1}
it: Errore segnalato dal provider di tipi '{0}': {1}
ja: 型プロバイダー '{0}' がエラーを報告しました: {1}
ko: {0}' 형식 공급자가 오류를 보고했습니다. {1}
pl: Dostawca typów „{0}” zgłosił błąd: {1}
pt_br: O provedor de tipos '{0}' relatou um erro: {1}
ru: Поставщик типов "{0}" сообщил об ошибке: {1}
tr: Tür sağlayıcısı '{0}' bir hata bildirdi: {1}
zh_hans: 类型提供程序“{0}”报告了错误: {1}
zh_hant: 型別提供者 '{0}' 已回報錯誤: {1}

# etIncorrectParameterExpression
source: The type provider '{0}' used an invalid parameter in the ParameterExpression: {1}
cs: Zprostředkovatel typu {0} použil ve výrazu ParameterExpression neplatný parametr: {1}
de: Der Typanbieter '{0}' hat in ParameterExpression einen ungültigen Parameter verwendet: {1}
es: El proveedor de tipos '{0}' usó un parámetro no válido en ParameterExpression: {1}
fr: Le fournisseur de type '{0}' a utilisé un paramètre non valide dans ParameterExpression : {1}
it: Parametro non valido utilizzato dal provider di tipi '{0}' in ParameterExpression: {1}
ja: 型プロバイダー '{0}' の ParameterExpression 内で無効なパラメーターが使用されました: {1}
ko: {0}' 형식 공급자가 ParameterExpression에서 잘못된 매개 변수를 사용했습니다. {1}
pl: Dostawca typów „{0}” użył nieprawidłowego parametru w elemencie ParameterExpression: {1}
pt_br: O provedor de tipos '{0}' usou um parâmetro inválido na ParameterExpression: {1}
ru: Поставщик типов "{0}" использовал недопустимый параметр в выражении ParameterExpression: {1}
tr: Tür sağlayıcısı '{0}', ParameterExpression ifadesinde geçersiz parametre kullandı: {1}
zh_hans: 类型提供程序“{0}”在 ParameterExpression 中使用了无效参数: {1}
zh_hant: 型別提供者 '{0}' 在 ParameterExpression 中使用的參數無效: {1}

# etIncorrectProvidedMethod
source: The type provider '{0}' provided a method with a name '{1}' and metadata token '{2}', which is not reported among its methods of its declaring type '{3}'
cs: Zprostředkovatel typu {0} poskytnul metodu s názvem {1} a tokenem metadat {2}, která není uvedená mezi metodami jeho deklarujícího typu {3}.
de: Der Typanbieter '{0}' hat eine Methode mit dem Namen '{1}' und dem Metadatentoken '{2}' angegeben, die nicht zu den Methoden des deklarierenden Typs '{3}' gehört
es: El proveedor de tipos '{0}' proporcionó un método con un nombre '{1}' y el token de metadatos '{2}' que no se notifica entre los métodos de su tipo declarativo '{3}'
fr: Le fournisseur de type '{0}' a fourni une méthode avec un nom '{1}' et un jeton de métadonnées '{2}' qui ne figure pas parmi ses méthodes du type déclarant '{3}'
it: Il provider di tipi '{0}' ha fornito un metodo con nome '{1}' e token metadati '{2}' che non è indicato tra i metodi del tipo dichiarante '{3}'
ja: 型プロバイダー '{0}' で、'{1}' という名前のメソッドとメタデータ トークン '{2}' が指定されましたが、これは宣言型 '{3}' のメソッドの中で報告されていません
ko: {0}' 형식 공급자가 이름이 '{1}'이고 메타데이터 토큰이 '{2}'인 메서드를 제공했는데, 이는 해당 선언 형식 '{3}'의 메서드에서 보고되지 않습니다.
pl: Dostawca typów „{0}” udostępnił metodę o nazwie „{1}” i token metadanych „{2}”, które nie zostały zgłoszone wśród metod dostawcy jego typu deklarującego „{3}”
pt_br: O provedor de tipos '{0}' forneceu um método com um nome '{1}' e um token de metadados '{2}' que não é relatado entre seus métodos de seu tipo declarante '{3}'
ru: Поставщик типов "{0}" предоставил метод с именем "{1}" и токеном метаданных "{2}", который отсутствует в списке методов соответствующего объявляющего типа "{3}"
tr: Tür sağlayıcısı '{0}', kendisinin '{3}' tanımlayan türünün metotları arasında bildirilmeyen '{1}' adlı ve meta veri belirteci '{2}' olan bir metot sağladı
zh_hans: 类型提供程序“{0}”提供了具有名称“{1}”和元数据标记“{2}”的方法，该方法不会在声明类型“{3}”的方法中进行报告
zh_hant: 型別提供者 '{0}' 提供的方法具有名稱 '{1}'，以及中繼資料語彙基元 '{2}'，其中該語彙基元未在其宣告類型 '{3}' 的方法中報告

# etIncorrectProvidedConstructor
source: The type provider '{0}' provided a constructor which is not reported among the constructors of its declaring type '{1}'
cs: Zprostředkovatel typu {0} poskytnul konstruktor, který není uvedený mezi konstruktory jeho deklarujícího typu {1}.
de: Der Typanbieter '{0}' hat einen Konstruktor bereitgestellt, der nicht zu den Konstruktoren des deklarierten Typs '{1}' gehört
es: El proveedor de tipos '{0}' proporcionó un constructor que no se notifica entre los constructores de su tipo declarativo '{1}'
fr: Le fournisseur de type '{0}' a fourni un constructeur qui ne figure pas parmi les constructeurs de son type déclarant ' '{1}'
it: Il costruttore fornito dal provider di tipi '{0}' non è riportato tra i costruttori del tipo dichiarante '{1}'
ja: 型プロバイダー '{0}' で指定されたコンストラクターは、宣言型 '{1}' のコンストラクターの中で報告されていません
ko: 선언 형식('{1}')의 생성자로부터 보고되지 않은 생성자를 형식 공급자 '{0}'에서 제공했습니다.
pl: Dostawca typów „{0}” udostępnił konstruktor, który nie został zgłoszony wśród konstruktorów jego typu deklarującego „{1}”
pt_br: O provedor de tipos '{0}' forneceu um construtor que não é relatado entre os construtores de seu tipo declarante '{1}'
ru: Поставщик типов "{0}" предоставил конструктор, который не указан среди конструкторов его объявляющего типа "{1}"
tr: Tür sağlayıcısı '{0}', kendisinin '{1}' tanımlayan türünün oluşturucuları arasında bildirilmeyen bir oluşturucu sağladı
zh_hans: 类型提供程序“{0}”提供的构造函数未在声明类型为“{1}”的构造函数中进行报告
zh_hant: 型別提供者 '{0}' 所提供的建構函式未在宣告類型 '{1}' 的任何建構函式中報告

# etDirectReferenceToGeneratedTypeNotAllowed
source: A direct reference to the generated type '{0}' is not permitted. Instead, use a type definition, e.g. 'type TypeAlias = <path>'. This indicates that a type provider adds generated types to your assembly.
cs: Přímý odkaz na generovaný typ {0} není povolený. Místo něj použijte definici typu, třeba type TypeAlias = <cesta>. Ta označuje, že zprostředkovatel typu přidává k sestavení generované typy.
de: Ein direkter Verweis auf den generierten Typ "{0}" ist nicht zulässig. Verwenden Sie stattdessen die Typdefinition wie "type TypeAlias = <path>". Dadurch wird angegeben, dass ein Typanbieter Ihrer Assembly generierte Typen hinzufügt.
es: No se permite una referencia directa al tipo generado "{0}". En su lugar, utilice una definición de tipo, por ejemplo "type TypeAlias = <path>". Esto indica que un proveedor de tipo agrega tipos generados a su ensamblado.
fr: Une référence directe au type généré '{0}' n'est pas autorisée. Utilisez plutôt une définition de type, par ex. 'type TypeAlias = <chemin>'. Cela indique qu'un fournisseur de type ajoute des types générés à votre assembly.
it: Un riferimento diretto al tipo generato '{0}' non è consentito. Usare invece una definizione di tipo, ad esempio 'type TypeAlias = <path>'. Questa definizione indica che un provider di tipi aggiunge tipi generati all'assembly usato.
ja: 生成された型 '{0}' への直接参照は許可されていません。代わりに型定義 (例: 'type TypeAlias = <path>') を使用します。型プロバイダーがアセンブリに生成された型を追加することを示します。
ko: 생성된 형식 '{0}'을(를) 직접 참조할 수는 없습니다. 대신 형식 정의를 사용하세요(예: 'type TypeAlias = <path>'). 이 정의는 형식 공급자가 생성된 형식을 어셈블리에 추가함을 나타냅니다.
pl: Bezpośrednie odwołanie do wygenerowanego typu „{0}” nie jest dozwolone. Zamiast tego użyj definicji typu, np. „type TypeAlias = <ścieżka>”. Wskazuje to, że dostawca typów dodaje wygenerowane typy do używanego zestawu.
pt_br: Uma referência direta para o tipo gerado '{0}' não é permitida. Use uma definição de tipo, por exemplo, 'type TypeAlias = <path>'. Isso indica que um provedor de tipos adiciona tipos gerados para seu assembly.
ru: Прямые ссылки на созданные типы "{0}" не допускаются. Вместо них используйте определение типа, например, 'type TypeAlias = <путь>'. При этом поставщик типа добавит созданные типы в сборку.
tr: Oluşturulan '{0}' türüne doğrudan başvuruya izin verilmez. Bunun yerine bir tür tanımı (ör. 'type TypeAlias = <path>') kullanın. Bu, bir tür sağlayıcısının derlemeniz için oluşturulmuş türler eklediğini gösterir.
zh_hans: 不允许直接引用所生成的类型“{0}”。请改用类型定义，例如 "type TypeAlias = <path>"。这表示类型提供程序会将生成的类型添加到程序集。
zh_hant: 不允許直接參考所產生的類型 '{0}'。請改用類型定義 'type TypeAlias = <path>'。這表示類型提供者會將所產生的類型新增到您的組件。

# etProvidedTypeHasUnexpectedPath
source: Expected provided type with path '{0}' but provided type has path '{1}'
cs: Očekával se poskytnutý typ s cestou {0}, ale cesta poskytnutého typu je {1}.
de: Es wurde ein angegebener Type mit dem Pfad '{0}' erwartet, der angegebene Typ verfügt jedoch über den Pfad '{1}'.
es: Se esperaba un tipo proporcionado con la ruta de acceso '{0}', pero el tipo proporcionado tiene la ruta de acceso '{1}'
fr: Un type fourni utilisant le chemin '{0}' était attendu, mais le type fourni utilise le chemin '{1}'
it: Era previsto un tipo fornito con percorso '{0}', mentre il tipo fornito contiene il percorso '{1}'
ja: 指定された型のパスが '{0}' である必要がありましたが、指定された型のパスは '{1}' でした
ko: 경로가 '{0}'인 제공된 형식이 필요한데 제공된 형식의 경로는 '{1}'입니다.
pl: Oczekiwano udostępnionego typu ze ścieżką „{0}”, ale udostępniony typ ma ścieżkę „{1}”
pt_br: Um tipo fornecido com caminho '{0}' era esperado, mas o tipo fornecido possui o caminho '{1}'
ru: Ожидался предоставленный тип с путем "{0}", однако предоставленный тип имеет путь "{1}"
tr: Yolu '{0}' olan bir sağlanan tür bekleniyordu ancak sağlanan türde '{1}' yolu var
zh_hans: 需要路径为“{0}”的提供的类型，但所提供类型的路径为“{1}”
zh_hant: 提供之類型的路徑必須是 '{0}' 但卻具有路徑 '{1}'

# etUnexpectedNullFromProvidedTypeMember
source: Unexpected 'null' return value from provided type '{0}' member '{1}'
cs: Poskytnutý typ {0}, člen {1} vrátil neočekávanou návratovou hodnotu null.
de: Unerwarteter NULL-Rückgabewert vom angegebenen Typ '{0}' Member '{1}':
es: Valor devuelto 'null' inesperado del tipo '{0}' proporcionado, miembro '{1}'.
fr: Valeur 'null' inattendue retournée par le type fourni '{0}', membre '{1}'
it: Valore restituito 'null' imprevisto dal tipo fornito '{0}' membro '{1}'
ja: 指定された型 '{0}' のメンバー '{1}' から予期しない 'null' 戻り値が返されました
ko: 제공된 형식 '{0}' 멤버 '{1}'에 예기치 않은 'null' 반환 값이 있습니다.
pl: Nieoczekiwana wartość zwracana „null” udostępnionego typu „{0}”. Element członkowski: „{1}”
pt_br: Valor 'null' inesperado retornado do membro '{1}' do tipo fornecido '{0}'
ru: Непредвиденное возвращаемое значение NULL, полученное из элемента "{1}" предоставленного типа "{0}"
tr: {0}' sağlanan türü '{1}' üyesinden beklenmeyen 'null' dönüş değeri
zh_hans: 来自所提供类型“{0}”成员“{1}”的意外“null”返回值
zh_hant: 提供之類型 '{0}' 成員 '{1}' 中有未預期的 'null' 傳回值

# etUnexpectedExceptionFromProvidedMemberMember
source: Unexpected exception from member '{0}' of provided type '{1}' member '{2}': {3}
cs: U člena {0} poskytnutého typu {1}, člena {2} došlo k neočekávané výjimce: {3}
de: Unerwartete Ausnahme von Member '{0}' des angegebenen Typs '{1}' von Member '{2}': {3}
es: Excepción inesperada de miembro '{0}' del tipo '{1}' proporcionado, miembro '{2}': {3}.
fr: Exception inattendue levée par le membre '{0}' du type fourni '{1}', membre '{2}' : {3}
it: Eccezione imprevista dal membro '{0}' del tipo fornito '{1}' membro '{2}': {3}
ja: 指定された型 '{1}' のメンバー '{2}' のメンバー '{0}' で予期しない例外が発生しました: {3}
ko: 제공된 형식 '{1}' 멤버 '{2}'의 멤버 '{0}'에서 예기치 않은 예외가 발생했습니다. {3}
pl: Nieoczekiwany wyjątek elementu członkowskiego „{0}” udostępnionego typu „{1}”. Element członkowski: „{2}”: {3}
pt_br: Exceção inesperada do membro '{0}' do membro '{2}' do tipo fornecido '{1}': {3}
ru: Непредвиденное исключение, полученное из элемента "{0}" предоставленного типа "{1}", элемент "{2}": {3}
tr: {1}' sağlanan türü '{2}' üyesinin '{0}' üyesinden beklenmeyen özel durum: {3}
zh_hans: 在所提供类型“{1}”成员“{2}”的成员“{0}”中发生意外异常: {3}
zh_hant: 提供之類型 '{1}' 成員 '{2}' 的成員 '{0}' 發生未預期的例外狀況: {3}

# etNestedProvidedTypesDoNotTakeStaticArgumentsOrGenericParameters
source: Nested provided types do not take static arguments or generic parameters
cs: Vnořené poskytnuté typy nepřebírají statické argumenty ani obecné parametry.
de: Die geschachtelten angegebenen Typen akzeptieren keine statischen Argumente oder generische Parameter.
es: Los tipos anidados proporcionados no toman argumentos estáticos o parámetros genéricos.
fr: Les types fournis imbriqués ne prennent pas d'arguments statiques ni de paramètres génériques
it: I tipi forniti annidati non accettano argomenti statici né parametrici generici
ja: 指定された型が入れ子の場合、静的引数もジェネリック パラメーターも受け取りません
ko: 제공된 중첩 형식은 정적 인수 또는 제네릭 매개 변수를 사용하지 않습니다.
pl: Udostępnione typy zagnieżdżone nie pobierają argumentów statycznych lub parametrów ogólnych
pt_br: Os tipos fornecidos aninhados não recebem argumentos estáticos ou parâmetros genéricos
ru: Вложенные предоставленные типы не принимают статических аргументов или универсальных параметров
tr: İç içe sağlanan türler bağımsız değişken veya genel parametre almaz
zh_hans: 所提供的嵌套类型未采用静态实参或泛型形参
zh_hant: 提供的巢狀類型不接受靜態引數或泛型參數

# etInvalidStaticArgument
source: Invalid static argument to provided type. Expected an argument of kind '{0}'.
cs: Neplatný statický argument poskytnutého typu. Očekávaný druh argumentu je {0}.
de: Ungültiges statisches Argument für angegebenen Typ. Es wurde ein Argument der Art '{0}' erwartet.
es: Argumento estático no válido para el tipo proporcionado. Se esperaba un argumento del tipo '{0}'.
fr: L'argument statique transmis au type fourni n'est pas valide. Un argument du genre '{0}' était attendu.
it: Argomento statico non valido nel tipo fornito. È previsto un argomento di tipo '{0}'.
ja: 指定された型に対して無効な静的引数が渡されました。'{0}' という種類の引数を渡す必要があります。
ko: 제공된 형식에 대한 정적 인수가 잘못되었습니다. '{0}' 종류의 인수가 필요합니다.
pl: Nieprawidłowy argument statyczny udostępnionego typu. Oczekiwano argumentu rodzaju: „{0}”.
pt_br: Argumento estático inválido para tipo fornecido. Argumento do tipo '{0}' esperado.
ru: Недопустимый статический аргумент предоставленного типа. Ожидался аргумент вида "{0}".
tr: Sağlanan türe, geçersiz statik bağımsız değişken verildi. '{0}' türünden bir bağımsız değişken bekleniyordu.
zh_hans: 所提供类型的静态参数无效。应是类型为“{0}”的参数。
zh_hant: 提供之類型的靜態引數無效。必須是 '{0}' 類型的引數。
