Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ExceptionDefsNotCompatibleFieldOrderDiffers
source: The exception definitions are not compatible because the order of the fields is different in the signature and implementation. The module contains the exception definition\n {0} \nbut its signature specifies\n\t{1}.
cs: Definice výjimek nejsou kompatibilní, protože se signatura a implementace liší pořadím polí. Modul obsahuje definici výjimky\n {0}, \nale jeho signatura definuje\n\t{1}.
de: Die Ausnahmedefinitionen sind nicht kompatibel, weil die Reihenfolge der Felder in der Signatur und in der Implementierung unterschiedlich ist. Das Modul enthält die Ausnahmedefinition\n {0} \nDie Signatur gibt aber Folgendes an:\n\t{1}.
es: Las definiciones de excepción no son compatibles porque el orden de los campos es diferente en la signatura y en la implementación. El módulo contiene la definición de excepción\n {0} \npero su signatura especifica\n\t{1}.
fr: Les définitions de l'exception ne sont pas compatibles, car l'ordre des champs est différent entre la signature et l'implémentation. Le module contient la définition de l'exception\n {0} \nmais sa signature spécifie\n\t{1}.
it: Le definizioni di eccezione non sono compatibili perché l'ordine dei campi nella firma e nell'implementazione è diverso. Il modulo contiene la definizione di eccezione\n {0} \ntuttavia la relativa firma specifica\n\t{1}.
ja: フィールドの順序がシグネチャと実装とで異なるため、例外の定義に互換性がありません。モジュールには例外の定義\n {0} \nが含まれますが、シグネチャでは\n\t{1}\nを指定しています。
ko: 시그니처와 구현에서 필드의 순서가 서로 다르므로 예외 정의가 호환되지 않습니다. 모듈에 예외 정의\n {0}이(가) 포함되어 있지만 \n해당 시그니처는\n\t{1}을(를) 지정합니다.
pl: Definicje wyjątku są niezgodne z powodu różnej kolejności pól w sygnaturze i implementacji. Moduł zawiera definicję wyjątku\n {0}, \nale jego sygnatura określa\n\t{1}.
pt_br: As definições de exceções não são compatíveis, pois a ordem dos campos é diferente na assinatura e na implementação. O módulo contém a definição da exceção\n {0} \n, mas sua assinatura especifica\n\t{1}.
ru: Определения исключений несовместимы, поскольку отличается порядок полей в сигнатуре и реализации. Модуль содержит определение исключения\n {0} \nоднако его сигнатура задает\n\t{1}.
tr: Alanların sırası imza ve uygulamada farklı olduğu için özel durum tanımları uyumlu değil. Modül,\n {0} \nözel durum tanımını içeriyor ancak imzasında\n\t{1} belirtiliyor.
zh_hans: 异常定义不兼容，因为签名和实现中的字段顺序不同。该模块包含异常定义\n {0} \n而其签名指定\n\t{1}。
zh_hant: 例外狀況定義不相容，因為簽章與實作中的欄位順序不同。模組包含例外狀況定義\n {0} \n但它的簽章卻指定\n\t{1}。

# typrelModuleNamespaceAttributesDifferInSigAndImpl
source: The namespace or module attributes differ between signature and implementation
cs: Atributy oboru názvů nebo modulu se v signatuře a implementaci liší.
de: Die Namespace- oder Modulattribute sind in Signatur und Implementierung unterschiedlich.
es: Los atributos del espacio de nombres o módulo difieren entre la signatura y la implementación.
fr: Les attributs de l'espace de noms ou du module sont différents entre la signature et l'implémentation
it: Gli attributi dello spazio dei nomi o del modulo sono diversi nella firma e nell'implementazione
ja: 名前空間属性またはモジュール属性が、シグネチャと実装とで異なります
ko: 네임스페이스 또는 모듈 특성이 시그니처와 구현 간에 서로 다릅니다.
pl: Atrybuty przestrzeni nazw lub modułu w sygnaturze i implementacji nie są zgodne
pt_br: Os atributos de namespace ou módulo diferem entre assinatura e implementação
ru: Атрибуты пространства имен или модуля различаются в сигнатуре и реализации
tr: Ad alanı veya modül öznitelikleri imza ile uygulama arasında farklılık gösteriyor
zh_hans: 签名和实现中的命名空间或模块特性不同
zh_hant: 簽章與實作的命名空間或模組屬性不同

# typrelMethodIsOverconstrained
source: This method is over-constrained in its type parameters
cs: Tato metoda je v parametrech typu příliš omezená.
de: Diese Methode ist durch ihre Typparameter übermäßig eingeschränkt.
es: Este método está sobrerrestringido en sus parámetros de tipo.
fr: Cette méthode est contrainte de manière excessive dans ses paramètres de type
it: Questo metodo contiene troppi vincoli nei relativi parametri di tipo
ja: 型パラメーターのこのメソッドは、制約過多です
ko: 이 메서드는 해당 형식 매개 변수에서 과다하게 제약 조건이 적용되었습니다.
pl: Ta metoda ma zbyt wiele ograniczeń w parametrach typu
pt_br: Este método possui muitas restrições em seus parâmetros de tipo
ru: Данный метод чрезмерно ограничен в параметрах типа
tr: Bu metot tür parametrelerinde aşırı kısıtlanmış
zh_hans: 此方法在其类型参数中过度约束
zh_hant: 這個方法在其類型參數中被過度限制

# typrelOverloadNotFound
source: No implementations of '{0}' had the correct number of arguments and type parameters. The required signature is '{1}'.
cs: Žádná implementace {0} nemá správný počet argumentů a parametrů typu. Požadovaná signatura je {1}.
de: Keine Implementierung von "{0}" wies die richtige Anzahl von Argumenten und Typparametern auf. Die erforderliche Signatur lautet "{1}".
es: Ninguna implementación de '{0}' tenía el número correcto de argumentos y parámetros de tipo. La signatura necesaria es '{1}'.
fr: Aucune implémentation de '{0}' n'avait le nombre approprié d'arguments et de paramètres de type. La signature requise est '{1}'.
it: Nessuna implementazione di '{0}' dispone del numero di argomenti e parametri di tipo corretto. La firma necessaria è '{1}'.
ja: 正しい数の引数と型パラメーターが指定された '{0}' の実装がありません。必要なシグネチャは '{1}' です。
ko: {0}'의 구현 중 올바른 수의 인수 및 형식 매개 변수를 포함하는 구현이 없습니다. 필요한 시그니처는 '{1}'입니다.
pl: Żadna implementacja elementu „{0}” nie zawiera poprawnej liczby argumentów i parametrów typu. Wymagana sygnatura: „{1}”.
pt_br: Nenhuma implementação de '{0}' tinha o número correto de argumentos e parâmetros de tipo. A assinatura necessária é '{1}'.
ru: Ни одна реализация "{0}" не имеет нужного числа аргументов и параметров типа. Необходимая сигнатура: "{1}".
tr: Hiçbir '{0}' uygulamasında doğru sayıda bağımsız değişken ve tür parametresi yoktu. Gereken imza: '{1}'.
zh_hans: “{0}”的任何实现都不具有正确数目的参数和类型参数。所需签名为“{1}”。
zh_hant: {0}' 的任何實作都沒有正確數目的引數和型別參數。需要的簽章是 '{1}'。

# typrelOverrideWasAmbiguous
source: The override for '{0}' was ambiguous
cs: Přepsání {0} bylo nejednoznačné.
de: Die Überschreibung für "{0}" war mehrdeutig.
es: La invalidación de '{0}' era ambigua.
fr: La substitution pour '{0}' était ambigüe
it: L'override per '{0}' è ambiguo
ja: '{0}' のオーバーライドがあいまいでした
ko: '{0}'의 재정의가 모호합니다.
pl: Przesłonięcie elementu „{0}” jest niejednoznaczne
pt_br: A substituição para '{0}' foi ambígua
ru: Переопределение для "{0}" было неоднозначным
tr: '{0}' geçersiz kılma işlemi belirsizdi
zh_hans: “{0}”的重写具有多义性
zh_hant: '{0}' 的覆寫模稜兩可

# typrelMoreThenOneOverride
source: More than one override implements '{0}'
cs: Víc než jedno přepsání implementuje {0}.
de: {0} wird von mehr als einer Überschreibung implementiert.
es: Más de una invalidación implementa '{0}'.
fr: Plusieurs substitutions implémentent '{0}'
it: Più override implementano '{0}'
ja: 複数のオーバーライドが '{0}' を実装しています
ko: 둘 이상의 재정의가 '{0}'을(를) 구현합니다.
pl: Więcej niż jedno przesłonięcie zawiera implementację elementu „{0}”
pt_br: Mais de uma substituição implementa '{0}'
ru: {0} реализуется более чем одним переопределением
tr: Birden fazla geçersiz kılma '{0}' uyguluyor
zh_hans: 多个重写实现“{0}”
zh_hant: 有多個覆寫實作了 '{0}'

# typrelMethodIsSealed
source: The method '{0}' is sealed and cannot be overridden
cs: Metoda {0} je zapečetěná a nedá se přepisovat.
de: Die {0}-Methode ist versiegelt und kann nicht überschrieben werden.
es: El método '{0}' está sellado y no se puede invalidar.
fr: La méthode '{0}' est sealed et ne peut pas être substituée
it: Il metodo '{0}' è Sealed e non è possibile eseguirne l'override
ja: メソッド '{0}' がシールドであるため、オーバーライドできません
ko: '{0}' 메서드는 봉인되어 재정의할 수 없습니다.
pl: Metoda „{0}” jest zapieczętowana i nie można jej przesłonić
pt_br: O método '{0}' está selado não pode ser substituído
ru: Метод "{0}" запечатан и не может быть переопределен
tr: '{0}' metodu mühürlü olduğundan geçersiz kılınamaz
zh_hans: 方法“{0}”是密封的，不能重写
zh_hant: 方法 '{0}' 是密封的，無法覆寫

# typrelOverrideImplementsMoreThenOneSlot
source: The override '{0}' implements more than one abstract slot, e.g. '{1}' and '{2}'
cs: Přepsání {0} implementuje víc než jednu abstraktní datovou oblast, třeba {1} a {2}.
de: Die Überschreibung "{0}" implementiert mehr als einen abstrakten Umsetzungsplatz, z.B. "{1}" und "{2}".
es: La invalidación '{0}' implementa más de una ranura abstracta; por ejemplo, '{1}' y '{2}'.
fr: La substitution '{0}' implémente plusieurs emplacements abstraits, par exemple '{1}' et '{2}'
it: L'override '{0}' implementa più slot astratti, ad esempio '{1}' e '{2}'
ja: オーバーライド '{0}' は複数の抽象スロットを実装しています (たとえば、'{1}' と '{2}')
ko: 재정의 '{0}'이(가) 둘 이상의 추상 슬롯을 구현합니다(예: '{1}' 및 '{2}').
pl: Przesłonięcie „{0}” zawiera implementację więcej niż jednego miejsca abstrakcyjnego, na przykład „{1}” i „{2}”
pt_br: A substituição '{0}' implementa mais de um slot abstrato, por exemplo '{1}' e '{2}'
ru: Переопределение "{0}" реализует более одного абстрактного слота, напр. "{1}" и "{2}"
tr: {0}' geçersiz kılma işlemi birden fazla soyut yuva uyguluyor, örn. '{1}' ve '{2}'
zh_hans: 重写“{0}”实现多个抽象槽，例如“{1}”和“{2}”
zh_hant: 覆寫 '{0}' 實作了多個抽象位置，例如 '{1}' 和 '{2}'

# typrelDuplicateInterface
source: Duplicate or redundant interface
cs: Duplicitní nebo nadbytečné rozhraní
de: Doppelte oder redundante Schnittstelle.
es: Interfaz duplicada o redundante.
fr: Interface dupliquée ou redondante
it: Interfaccia duplicata o ridondante
ja: インターフェイスが重複するか、冗長です
ko: 인터페이스가 중복되었습니다.
pl: Zduplikowany lub nadmiarowy interfejs
pt_br: Interface duplicada ou redundante
ru: Повторяющийся или избыточный интерфейс
tr: Yinelenen veya gereksiz arabirim
zh_hans: 重复或冗余的接口
zh_hant: 重複或多餘的介面

# typrelNeedExplicitImplementation
source: The interface '{0}' is included in multiple explicitly implemented interface types. Add an explicit implementation of this interface.
cs: Rozhraní {0} je zahrnuté v několika explicitně implementovaných typech rozhraní. Přidejte explicitní implementaci tohoto rozhraní.
de: Die {0}-Schnittstelle ist in mehreren explizit implementierten Schnittstellentypen enthalten. Fügen Sie eine explizite Implementierung dieser Schnittstelle hinzu.
es: La interfaz '{0}' está incluida en varios tipos de interfaz implementados de forma explícita. Agregue una implementación explícita de esta interfaz.
fr: L'interface '{0}' est incluse dans plusieurs types interface implémentés explicitement. Ajoutez une implémentation explicite de cette interface.
it: L'interfaccia '{0}' è inclusa in più tipi di interfaccia implementati in modo esplicito. Aggiungere un'implementazione esplicita dell'interfaccia.
ja: 複数の明示的に実装されたインターフェイス型に、インターフェイス '{0}' が含まれています。このインターフェイスの明示的な実装を追加してください。
ko: '{0}' 인터페이스가 명시적으로 구현된 다중 인터페이스 형식에 포함되어 있습니다. 이 인터페이스의 명시적 구현을 추가하세요.
pl: Interfejs „{0}” występuje w wielu jawnie zaimplementowanych typach interfejsów. Dodaj jawną implementację tego interfejsu.
pt_br: A interface '{0}' está incluída em múltiplos tipos de interface explicitamente implementada. Adicione uma implementação explícita desta interface.
ru: Интерфейс "{0}" включен в несколько явно реализованных типов интерфейса. Добавьте явную реализацию данного интерфейса.
tr: '{0}' arabirimi, birden fazla açık olarak uygulanan arabirim türüne eklenmiş. Bu arabirimin açık uygulamasını ekleyin.
zh_hans: 接口“{0}”包含在多个显式实现的接口类型中。添加此接口的显式实现。
zh_hant: 介面 '{0}' 包含在多個明確實作的介面類型中。請加入這個介面的明確實作。

# typrelNamedArgumentHasBeenAssignedMoreThenOnce
source: The named argument '{0}' has been assigned more than one value
cs: Pojmenovaný argument {0} má přiřazenou víc než jednu hodnotu.
de: Dem benannten Argument "{0}" wurden mehrere Werte zugewiesen.
es: Se ha asignado más de un valor al argumento con nombre "{0}".
fr: Plusieurs valeurs ont été affectées à l'argument nommé '{0}'
it: All'argomento denominato '{0}' sono stati assegnati più valori
ja: 名前付き引数 '{0}' に複数の値が割り当てられました
ko: 명명된 인수 '{0}'에 둘 이상의 값이 할당되었습니다.
pl: Do nazwanego argumentu „{0}” przypisano więcej niż jedną wartość
pt_br: Foi atribuído mais de um valor a um argumento nomeado '{0}'
ru: Именованному аргументу "{0}" было присвоено несколько значений
tr: '{0}' adlandırılmış bağımsız değişkeni birden fazla değere atanmış
zh_hans: 已向命名参数“{0}”分配多个值
zh_hant: 為具名引數 '{0}' 指派了多個值

# typrelNoImplementationGiven
source: No implementation was given for '{0}'
cs: {0} nemá žádnou implementaci.
de: Für "{0}" wurde keine Implementierung angegeben.
es: No se proporcionó ninguna implementación para '{0}'.
fr: Aucune implémentation n'a été fournie pour '{0}'
it: Nessuna implementazione specificata per '{0}'
ja: '{0}' に指定された実装がありませんでした
ko: '{0}'에 대해 지정된 구현이 없습니다.
pl: Nie określono implementacji elementu „{0}”
pt_br: Nenhuma implementação foi dada por '{0}'
ru: Для "{0}" не было дано реализации
tr: '{0}' için bir uygulama verilmedi
zh_hans: 未为“{0}”给定任何实现
zh_hant: 未指定 '{0}' 的任何實作

# typrelNoImplementationGivenWithSuggestion
source: No implementation was given for '{0}'. Note that all interface members must be implemented and listed under an appropriate 'interface' declaration, e.g. 'interface ... with member ...'.
cs: {0} nemá žádnou implementaci. Všechny členy rozhraní je potřeba implementovat a uvést pod příslušnou deklarací interface, třeba takto: interface ... with member ...
de: Für "{0}" wurde keine Implementierung angegeben. Alle Schnittstellenmember müssen implementiert und unter einer entsprechenden interface-Deklaration aufgeführt werden, z.B. "interface ... with member ...".
es: No se proporcionó ninguna implementación para '{0}'. Tenga en cuenta que todos los miembros de interfaz deben implementarse y enumerarse en la correspondiente declaración 'interface'; por ejemplo, 'interface ... with member ...'.
fr: Aucune implémentation n'a été fournie pour '{0}'. Remarquez que tous les membres d'interface doivent être implémentés et listés sous une déclaration 'interface' appropriée, par exemple 'interface ... with member ...'.
it: Nessuna implementazione specificata per '{0}'. Si noti che tutti i membri dell'interfaccia devono essere implementati ed elencati in una dichiarazione 'interface' appropriata, ad esempio 'interface ... with member ...'.
ja: '{0}' に指定された実装がありませんでした。すべてのインターフェイス メンバーを実装し、適切な 'interface' 宣言で列挙してください (たとえば、'interface ... with member ...')。
ko: '{0}'에 대해 지정된 구현이 없습니다. 모든 인터페이스 멤버가 구현되어 적절한 'interface' 선언에 나열되어야 합니다(예: 'interface ... with member ...').
pl: Nie określono implementacji elementu „{0}”. Wszystkie elementy członkowskie interfejsu muszą zostać zaimplementowane i występować w odpowiedniej deklaracji „interface”, na przykład „interface ... with member ...”.
pt_br: Nenhuma implementação foi dada por '{0}'. Note que todos membros de interface devem ser implementados e listados sob uma declaração apropriada 'interface', por exemplo 'interface ... with member ...'.
ru: Для "{0}" не было дано реализации. Обратите внимание на то, что все элементы интерфейса должны быть реализованы и перечислены в соответствующем объявлении "interface", например "interface ... with member ...".
tr: '{0}' için bir uygulama verilmedi. Tüm arabirim üyelerinin uygulanması ve uygun bir 'interface' bildirimi, örn. 'interface ... with member ...' altında listelenmesi gerektiğine dikkat edin.
zh_hans: 未为“{0}”给定任何实现。请注意，必须在适当的 "interface" 声明下实现并列出所有接口成员，例如 "interface ... with member ..."。
zh_hant: 未指定 '{0}' 的任何實作。注意，所有介面成員都必須實作並列示在適當的 'interface' 宣告底下，例如 'interface ... with member ...'。

# typrelMemberDoesNotHaveCorrectNumberOfArguments
source: The member '{0}' does not have the correct number of arguments. The required signature is '{1}'.
cs: Člen {0} nemá správný počet argumentů. Požadovaná signatura je {1}.
de: Der Member "{0}" weist nicht die richtige Anzahl von Argumenten auf. Die erforderliche Signatur lautet "{1}".
es: El miembro '{0}' no tiene el número correcto de argumentos. La signatura necesaria es '{1}'.
fr: Le membre '{0}' n'a pas le nombre approprié d'arguments. La signature requise est '{1}'.
it: Il membro '{0}' non dispone del numero di argomenti corretto. La firma necessaria è '{1}'.
ja: メンバー '{0}' には引数の正しいメンバーがありません。必要なシグネチャは '{1}' です。
ko: {0}' 멤버에 올바른 수의 인수가 없습니다. 필요한 시그니처는 '{1}'입니다.
pl: Element członkowski „{0}” nie zawiera poprawnej liczby argumentów. Wymagana sygnatura: „{1}”.
pt_br: O membro '{0}' não possui o número correto de argumentos. A assinatura necessária é '{1}'.
ru: Элемент "{0}" не имеет нужного числа аргументов. Необходимая сигнатура: "{1}".
tr: Üye '{0}', doğru sayıda bağımsız değişkene sahip değil. Gereken imza: '{1}'.
zh_hans: 成员“{0}”不具有正确数目的参数。所需签名为“{1}”。
zh_hant: 成員 '{0}' 沒有正確數目的引數。需要的簽章是 '{1}'。

# typrelMemberDoesNotHaveCorrectNumberOfTypeParameters
source: The member '{0}' does not have the correct number of method type parameters. The required signature is '{1}'.
cs: Člen {0} nemá správný počet parametrů typu metody. Požadovaná signatura je {1}.
de: Der Member "{0}" weist nicht die richtige Anzahl von Methodentypparametern auf. Die erforderliche Signatur lautet "{1}".
es: El miembro '{0}' no tiene el número correcto de parámetros de tipo de método. La signatura necesaria es '{1}'.
fr: Le membre '{0}' n'a pas le nombre approprié de paramètres de type de méthode. La signature requise est '{1}'.
it: Il membro '{0}' non dispone del numero corretto di parametri di tipo del metodo. La firma necessaria è '{1}'.
ja: メンバー '{0}' には正しい数のメソッド型パラメーターがありません。必要なシグネチャは '{1}' です。
ko: {0}' 멤버에 올바른 수의 메서드 형식 매개 변수가 없습니다. 필요한 시그니처는 '{1}'입니다.
pl: Element członkowski „{0}” nie zawiera poprawnej liczby parametrów typu metody. Wymagana sygnatura: „{1}”.
pt_br: O membro '{0}' não possui o número correto de parâmetros de tipo de método. A assinatura necessária é '{1}'.
ru: Элемент "{0}" не имеет нужного числа параметров типа метода. Необходимая сигнатура: "{1}".
tr: Üye '{0}', doğru sayıda metot türü parametresine sahip değil. Gereken imza: '{1}'.
zh_hans: 成员“{0}”不具有正确数目的方法类型参数。所需签名为“{1}”。
zh_hant: 成員 '{0}' 沒有正確數目的方法型別參數。需要的簽章是 '{1}'。

# typrelMemberDoesNotHaveCorrectKindsOfGenericParameters
source: The member '{0}' does not have the correct kinds of generic parameters. The required signature is '{1}'.
cs: Člen {0} nemá správný druh obecných parametrů. Požadovaná signatura je {1}.
de: Der Member "{0}" weist nicht die richtigen Arten von generischen Parametern auf. Die erforderliche Signatur lautet "{1}".
es: El miembro '{0}' no tiene los tipos correctos de parámetros genéricos. La signatura necesaria es '{1}'.
fr: Le membre '{0}' n'a pas les genres appropriés de paramètres génériques. La signature requise est '{1}'.
it: Il membro '{0}' non dispone dei tipi di parametri generici corretti. La firma necessaria è '{1}'.
ja: メンバー '{0}' には正しい種類のジェネリック パラメーターがありません。必要なシグネチャは '{1}' です。
ko: {0}' 멤버에 올바른 종류의 제네릭 매개 변수가 없습니다. 필요한 시그니처는 '{1}'입니다.
pl: Element członkowski „{0}” nie zawiera poprawnych rodzajów parametrów ogólnych. Wymagana sygnatura: „{1}”.
pt_br: O membro '{0}' não possui os tipos corretos de parâmetros genéricos. A assinatura necessária é '{1}'.
ru: Элемент "{0}" не имеет нужных базовых параметров. Необходимая сигнатура: "{1}".
tr: Üye '{0}', doğru tür genel parametrelere sahip değil. Gereken imza: '{1}'.
zh_hans: 成员“{0}”不具有正确种类的泛型参数。所需签名为“{1}”。
zh_hant: 成員 '{0}' 沒有正確的泛型參數類型。需要的簽章是 '{1}'。

# typrelMemberCannotImplement
source: The member '{0}' cannot be used to implement '{1}'. The required signature is '{2}'.
cs: Člen {0} se k implementaci {1} použít nedá. Požadovaná signatura je {2}.
de: Der Member "{0}" kann nicht zur Implementierung von "{1}" verwendet werden. Die erforderliche Signatur lautet "{2}".
es: El miembro '{0}' no se puede usar para implementar '{1}'. La signatura necesaria es '{2}'.
fr: Impossible d'utiliser le membre '{0}' pour implémenter '{1}'. La signature requise est '{2}'.
it: Il membro '{0}' non può essere utilizzato per implementare '{1}'. La firma necessaria è '{2}'.
ja: {1}' を実装するためにメンバー '{0}' は使用できません。必要なシグネチャは '{2}' です。
ko: {0}' 멤버를 사용하여 '{1}'을(를) 구현할 수 없습니다. 필요한 시그니처는 '{2}'입니다.
pl: Nie można zaimplementować elementu „{1}” przy użyciu elementu członkowskiego „{0}”. Wymagana sygnatura: „{2}”.
pt_br: O membro '{0}' não pode ser usado para implementar '{1}'. A assinatura necessária é '{2}'.
ru: Использование элемента "{0}" для реализации "{1}" невозможно. Необходимая сигнатура: {2}.
tr: Üye '{0}', '{1}' uygulamak için kullanılamaz. Gerekli imza: '{2}'.
zh_hans: 成员“{0}”不能用于实现“{1}”。所需签名为“{2}”。
zh_hant: 成員 '{0}' 不可用來實作 '{1}'。需要的簽章是 '{2}'。

# astParseEmbeddedILError
source: Error while parsing embedded IL
cs: Chyba při analýze vloženého kódu IL
de: Fehler beim Analysieren der eingebetteten IL.
es: Error al analizar el código IL incrustado.
fr: Erreur lors de l'analyse du code IL (Intermediate Language) incorporé
it: Errore durante l'analisi di IL incorporato
ja: 埋め込まれた IL の解析中にエラーが発生しました
ko: 포함된 IL을 구문 분석하는 동안 오류가 발생했습니다.
pl: Błąd podczas analizowania osadzonego obiektu IL
pt_br: Erro ao analisar IL incorporado
ru: Ошибка при синтаксическом анализе встроенного IL
tr: Gömülü IL ayrıştırılırken hata oluştu
zh_hans: 分析嵌入的 IL 时出错
zh_hant: 剖析內嵌的 IL 時發生錯誤

# astParseEmbeddedILTypeError
source: Error while parsing embedded IL type
cs: Chyba při analýze vloženého typu IL
de: Fehler beim Analysieren des eingebetteten IL-Typs.
es: Error al analizar el tipo IL incrustado.
fr: Erreur lors de l'analyse du type IL (Intermediate Language) incorporé
it: Errore durante l'analisi del tipo IL incorporato
ja: 埋め込まれた IL 型の解析中にエラーが発生しました
ko: 포함된 IL 형식을 구문 분석하는 동안 오류가 발생했습니다.
pl: Błąd podczas analizowania typu osadzonego obiektu IL
pt_br: Erro ao analisar tipo de IL embutido
ru: Ошибка при синтаксическом анализе встроенного типа IL
tr: Gömülü IL türü ayrıştırılırken hata oluştu
zh_hans: 分析嵌入的 IL 类型时出错
zh_hant: 剖析內嵌的 IL 類型時發生錯誤

# astDeprecatedIndexerNotation
source: This indexer notation has been removed from the F# language
cs: Tato notace indexeru se už v jazyce F# nepoužívá.
de: Diese Indexernotation wurde aus der Programmiersprache F# entfernt.
es: Esta notación de indizador se ha quitado del lenguaje F#.
fr: Cette notation de l'indexeur a été supprimée du langage F#
it: Notazione indicizzatore rimossa dal linguaggio F#
ja: このインデクサー表記は F# 言語から削除されました
ko: 이 인덱서 표기법은 F# 언어에서 제거되었습니다.
pl: Ta notacja indeksatora została usunięta z języka F#
pt_br: Esta notação de indexador foi removida do idioma F#
ru: Эта нотация индексатора удалена из языка F#
tr: Bu dizin erişimcisi gösterimi F# dilinden kaldırıldı
zh_hans: 在 F# 语言中，此索引器表示法已删除
zh_hant: 這個索引子標記法已從 F# 語言移除

# astInvalidExprLeftHandOfAssignment
source: Invalid expression on left of assignment
cs: Neplatný výraz nalevo od přiřazení
de: Ungültiger Ausdruck auf der linken Seite der Zuweisung.
es: Expresión no válida en la parte izquierda de la asignación.
fr: Expression non valide à gauche de l'assignation
it: Espressione non valida a sinistra dell'assegnazione
ja: 代入式の左辺が無効です
ko: 할당 왼쪽에 잘못된 식이 있습니다.
pl: Nieprawidłowe wyrażenie po lewej stronie przypisania
pt_br: Expressão inválida à esquerda da atribuição
ru: Недопустимое выражение в левой части оператора присваивания
tr: Atamanın solunda geçersiz ifade
zh_hans: 赋值运算左侧的表达式无效
zh_hant: 指派左側的運算式無效
