Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# buildArgInvalidInt
source: '{0}' is not a valid integer argument
cs: {0} není platný celočíselný argument.
de: {0} ist kein gültiges Integer-Argument.
es: '{0}' no es un argumento de entero válido.
fr: '{0}' n'est pas un argument entier valide
it: '{0}' non è un argomento Integer valido
ja: '{0}' は有効な整数引数ではありません
ko: '{0}'은(는) 올바른 정수 인수가 아닙니다.
pl: Argument „{0}” nie jest prawidłowym argumentem liczby całkowitej
pt_br: '{0}' não é um argumento inteiro válido
ru: {0} не является действительным целочисленным аргументом
tr: '{0}' geçerli bir tamsayı bağımsız değişkeni değil
zh_hans: “{0}”不是有效的整数参数
zh_hant: '{0}' 不是有效的整數引數

# buildArgInvalidFloat
source: '{0}' is not a valid floating point argument
cs: {0} není platný argument s plovoucí desetinnou čárkou.
de: {0} ist kein gültiges Gleitkommaargument.
es: '{0}' no es un argumento de punto flotante válido.
fr: '{0}' n'est pas un argument à virgule flottante valide
it: '{0}' non è un argomento a virgola mobile valido
ja: '{0}' は有効な浮動小数点引数ではありません
ko: '{0}'은(는) 올바른 부동 소수점 인수가 아닙니다.
pl: Argument „{0}” nie jest prawidłowym argumentem liczby zmiennoprzecinkowej
pt_br: '{0}' não é um argumento de ponto flutuante válido
ru: {0} не является действительным аргументом с плавающей запятой
tr: '{0}' geçerli bir kayan nokta bağımsız değişkeni değil
zh_hans: “{0}”不是有效的浮点型参数
zh_hant: '{0}' 不是有效的浮點引數

# buildUnrecognizedOption
source: Unrecognized option: '{0}'
cs: Nerozpoznaná možnost: {0}
de: Unbekannte Option: "{0}"
es: Opción no reconocida: '{0}'.
fr: Option non reconnue : '{0}'
it: Opzione non riconosciuta: '{0}'
ja: 認識されないオプション:'{0}'
ko: 인식할 수 없는 옵션: '{0}'
pl: Nierozpoznana opcja: „{0}”
pt_br: Opção não reconhecida: '{0}'
ru: Нераспознанный параметр: '{0}'
tr: Tanınmayan seçenek: '{0}'
zh_hans: 无法识别的选项:“{0}”
zh_hant: 選項無法辨認: '{0}'

# buildInvalidModuleOrNamespaceName
source: Invalid module or namespace name
cs: Neplatný název modulu nebo oboru názvů
de: Ungültiger Modul- oder Namespacename.
es: Nombre de módulo o espacio de nombres no válido.
fr: Nom de module ou d'espace de noms non valide
it: Nome di modulo o spazio dei nomi non valido
ja: モジュール名または名前空間名が無効です
ko: 모듈 또는 네임스페이스 이름이 잘못되었습니다.
pl: Nieprawidłowa nazwa modułu lub przestrzeni nazw
pt_br: Nome de módulo ou namespace inválido
ru: Недопустимое имя модуля или пространства имен
tr: Geçersiz modül veya ad alanı adı
zh_hans: 模块或命名空间名称无效
zh_hant: 無效的模組或命名空間名稱

# pickleErrorReadingWritingMetadata
source: Error reading/writing metadata for the F# compiled DLL '{0}'. Was the DLL compiled with an earlier version of the F# compiler? (error: '{1}').
cs: Chyba čtení nebo zápisu metadat pro knihovnu DLL {0} zkompilovanou v F#. Byla knihovna DLL zkompilovaná ve starší verzi kompilátoru F#? (chyba: {1}).
de: Fehler beim Lesen/Schreiben von Metadaten für die kompilierte F#-DLL "{0}". Wurde die DLL mit einer früheren Version des F#-Compilers kompiliert? (Fehler: "{1}").
es: Error al leer o escribir metadatos para el archivo DLL '{0}' compilado con F#. ¿Se había compilado el archivo DLL con una versión anterior del compilador de F#? (Error: '{1}').
fr: Erreur lors de la lecture/l'écriture des métadonnées de la DLL compilée F# '{0}'. Est-ce que la DLL a été compilée avec une version antérieure du compilateur F# ? (erreur : '{1}').
it: Errore durante la lettura/scrittura di metadati per la DLL F# compilata '{0}'. Verificare se la DLL è stata compilata con una versione precedente del compilatore F#. Errore: '{1}'.
ja: F# でコンパイルした DLL '{0}' のメタデータの読み取り/書き込み中にエラーが発生しました。旧バージョンの F# コンパイラーでコンパイルした DLL ですか? (エラー: '{1}')
ko: F# 컴파일 DLL '{0}'에 대한 메타데이터를 읽는/쓰는 동안 오류가 발생했습니다. DLL이 이전 버전의 F# 컴파일러를 사용하여 컴파일되었습니까?(오류: '{1}')
pl: Błąd podczas odczytywania/zapisywania metadanych skompilowanej biblioteki DLL języka F# „{0}”. Czy biblioteka DLL została skompilowana przy użyciu wcześniejszej wersji kompilatora języka F#? (Błąd: „{1}”).
pt_br: Erro na leitura/gravação do metadado no DLL '{0}', que foi compilado por F#. O DLL foi compilado com uma versão inferior ao compilador F#? (erro: '{1}').
ru: Ошибка при чтении или записи метаданных для скомпилированной на языке F# библиотеки DLL "{0}". Была ли библиотека DLL скомпилирована с использованием более ранней версии компилятора F#? (ошибка: "{1}").
tr: F# ile derlenmiş DLL '{0}' meta verilerini hatalı okuma/yazma. DLL, F# derleyicisinin önceki bir sürümüyle mi derlenmişti? (hata: '{1}').
zh_hans: 读取/写入 F# 编译的 DLL“{0}”的元数据时出错。是否使用了早期版本的 F# 编译器编译 DLL? (错误: “{1}”)。
zh_hant: 讀取/寫入 F# 編譯的 DLL '{0}' 的中繼資料時發生錯誤。這個 DLL 是用舊版 F# 編譯器編譯的嗎? (錯誤: '{1}')

# tastTypeOrModuleNotConcrete
source: The type/module '{0}' is not a concrete module or type
cs: Typ nebo modul {0} není konkrétním modulem nebo typem.
de: Der Typ bzw. das Modul "{0}" ist kein konkretes Modul bzw. kein konkreter Typ.
es: El tipo o modelo '{0}' no es un modelo o un tipo concreto.
fr: Le type/module '{0}' n'est pas un module ou type concret
it: Il tipo/modulo '{0}' non è un modulo o un tipo concreto
ja: 型/モジュール '{0}' は具象モジュールまたは具象型ではありません
ko: '{0}' 형식/모듈이 구체적인 모듈 또는 형식이 아닙니다.
pl: Typ/moduł „{0}” nie jest konkretnym modułem lub typem
pt_br: O tipo/módulo '{0}' não é um módulo ou tipo concreto
ru: Тип или модуль "{0}" не является конкретным модулем или типом
tr: '{0}' türü/modülü somut bir modül veya tür değil
zh_hans: 类型/模块“{0}”不是具体的模块或类型
zh_hant: 類型/模組 '{0}' 不是具象模組或類型

# tastTypeHasAssemblyCodeRepresentation
source: The type '{0}' has an inline assembly code representation
cs: Typ {0} má reprezentaci vloženého kódu sestavení.
de: Der Typ "{0}" besitzt eine Inlineassembly-Codedarstellung.
es: El tipo '{0}' tiene una representación de código de ensamblado alineado.
fr: Le type '{0}' a une représentation du code assembleur inline
it: Il tipo '{0}' contiene una rappresentazione di codice assembly inline
ja: 型 '{0}' にはインライン アセンブラー コード表現があります
ko: '{0}' 형식에 인라인 어셈블리 코드 표현이 있습니다.
pl: Typ „{0}” ma reprezentację śródwierszowego kodu zestawu
pt_br: O tipo '{0}' possui uma representação de código de assembly embutida
ru: Тип "{0}" имеет представление встроенного кода сборки
tr: '{0}' türünün satır içi bir bütünleştirilmiş kod kodu temsili var
zh_hans: 类型“{0}”具有内联程序集代码表示形式
zh_hant: 類型 '{0}' 有內嵌組譯程式碼表示

# tastNamespaceAndModuleWithSameNameInAssembly
source: A namespace and a module named '{0}' both occur in two parts of this assembly
cs: Obor názvů a modul s názvem {0} se oba vyskytují ve dvou částech tohoto sestavení.
de: Ein Namespace und ein Modul namens "{0}" sind beide in zwei Teilen dieser Assembly vorhanden.
es: Hay un espacio de nombres y un módulo con el nombre '{0}' en dos partes de este ensamblado.
fr: Un espace de noms et un module nommés tous les deux '{0}' sont présents dans deux parties de cet assembly
it: In due parti di questo assembly sono presenti uno spazio dei nomi e un modulo entrambi denominati '{0}'
ja: '{0}' という名前空間とモジュールの両方がこのアセンブリの 2 か所で発生しています
ko: 이 어셈블리의 두 부분에서 '{0}'(이)라는 네임스페이스와 모듈이 모두 발생합니다.
pl: Przestrzeń nazw i moduł o nazwie „{0}” występują w dwóch częściach tego zestawu
pt_br: Um namespace e um módulo chamado '{0}' ocorrem em duas partes deste assembly
ru: Пространство имен и модуль с именем "{0}" одновременно встречаются в двух частях этой сборки
tr: Bir ad alanı ve '{0}' adlı modülün ikisi birden bu bütünleştirilmiş kodun iki yerinde geçiyor
zh_hans: 名称均为“{0}”的一个命名空间和一个模块同时出现在此程序集的两个部分中
zh_hant: 名稱為 '{0}' 的命名空間和模組都出現在這個組件的兩個部分中

# tastTwoModulesWithSameNameInAssembly
source: Two modules named '{0}' occur in two parts of this assembly
cs: Dva moduly s názvem {0} se vyskytují ve dvou částech tohoto sestavení.
de: Zwei Module namens "{0}" treten in zwei Teilen dieser Assembly auf.
es: Hay dos módulos con el nombre '{0}' en dos partes de este ensamblado.
fr: Deux modules nommés '{0}' sont présents dans deux parties de cet assembly
it: Due moduli con nome '{0}' sono presenti in due parti dell'assembly
ja: '{0}' という 2 つのモジュールがこのアセンブリの 2 か所で使用されています
ko: 이 어셈블리의 두 부분에서 '{0}'(이)라는 두 개의 모듈이 발생합니다.
pl: Moduły o nazwie „{0}” występują w dwóch częściach tego zestawu
pt_br: Dois módulos chamados '{0}' ocorrem em duas partes deste assembly
ru: Два модуля с именем "{0}" встречаются в двух частях этой сборки
tr: '{0}' adlı iki modül bu bütünleştirilmiş kodun iki yerinde geçiyor
zh_hans: 名为“{0}”的两个模块同时出现在此程序集的两个部分中
zh_hant: 名稱為 '{0}' 的兩個模組出現在這個組件的兩個部分中

# tastDuplicateTypeDefinitionInAssembly
source: Two type definitions named '{0}' occur in namespace '{1}' in two parts of this assembly
cs: Dvě definice typu s názvem {0} se vyskytují v oboru názvů {1} ve dvou částech tohoto sestavení.
de: Zwei Typdefinitionen namens "{0}" erscheinen im Namespace "{1}" in zwei Teilen dieser Assembly.
es: Hay dos definiciones de tipo con el nombre '{0}' en el espacio de nombres '{1}' en dos partes de este ensamblado.
fr: Deux définitions de type nommées '{0}' sont présentes dans l'espace de noms '{1}' dans deux parties de cet assembly
it: Due definizioni di tipo con nome '{0}' nello spazio dei nomi '{1}' sono presenti in due parti dell'assembly
ja: {0}' という 2 つの型の定義が、このアセンブリの 2 か所の名前空間 '{1}' で発生しています
ko: 이 어셈블리의 두 부분에서 네임스페이스 '{1}'에 '{0}'(이)라는 두 개의 형식 정의가 발생합니다.
pl: Dwie definicje typów o nazwie „{0}” występują w przestrzeni nazw „{1}” w dwóch częściach tego zestawu
pt_br: Dois tipos de definição chamados '{0}' ocorreram no namespace '{1}' em duas partes deste assembly
ru: Два определения типа с именем "{0}" встречаются в пространстве имен "{1}" в двух разных частях этой сборки
tr: {0}' adlı iki tür tanımı bu bütünleştirilmiş kodun iki yerinde '{1}' ad alanında geçiyor
zh_hans: 两个名为“{0}”的类型定义出现在命名空间“{1}”的此程序集的两个部分中
zh_hant: 兩個名稱為 '{0}' 的類型定義出現在這個組件兩個部分的命名空間 '{1}' 中

# tastConflictingModuleAndTypeDefinitionInAssembly
source: A module and a type definition named '{0}' occur in namespace '{1}' in two parts of this assembly
cs: Modul a definice typu s názvem {0} se vyskytují v oboru názvů {1} ve dvou částech tohoto sestavení.
de: Ein Modul und eine Typdefinition namens "{0}" erscheinen im Namespace "{1}" in zwei Teilen dieser Assembly.
es: Hay un módulo y una definición de tipo con el nombre '{0}' en el espacio de nombres '{1}' en dos partes de este ensamblado.
fr: Une définition de module et une définition de type nommées '{0}' sont présentes dans l'espace de noms '{1}' dans deux parties de cet assembly
it: Modulo e definizione di tipo con nome '{0}' nello spazio dei nomi '{1}' presenti in due parti dell'assembly
ja: {0}' というモジュールおよび型の定義が、このアセンブリの 2 か所の名前空間 '{1}' で発生しています
ko: 이 어셈블리의 두 부분에서 네임스페이스 '{1}'에 '{0}'(이)라는 모듈 및 형식 정의가 발생합니다.
pl: Moduł i definicja typu o nazwie „{0}” występują w przestrzeni nazw „{1}” w dwóch częściach tego zestawu
pt_br: Uma definição de módulo e tipo chamada '{0}' ocorreu no namespace '{1}' em duas partes deste assembly
ru: Определение модуля и типа с именем "{0}" встречаются в пространстве имен "{1}" в двух разных частях этой сборки
tr: {0}' adlı bir modül ve tür tanımı bu bütünleştirilmiş kodun iki yerinde '{1}' ad alanında geçiyor
zh_hans: 名称均为“{0}”的一个模块和一个类型定义出现在命名空间“{1}”的此程序集的两个部分中
zh_hant: 名稱為 '{0}' 的模組和類型定義出現在這個組件兩個部分的命名空間 '{1}' 中

# tastInvalidMemberSignature
source: Invalid member signature encountered because of an earlier error
cs: Zjistila se neplatná signatura člena kvůli dřívější chybě.
de: Ungültige Membersignatur aufgrund eines früheren Fehlers.
es: Se encontró una signatura de miembro no válida debido a un error anterior.
fr: Signature de membre non valide détectée en raison d'une erreur antérieure
it: Rilevata firma di membro non valida a causa di un errore precedente
ja: 前に発生しているエラーのために、メンバーのシグネチャが無効です
ko: 이전 오류로 인해 잘못된 멤버 시그니처가 발생했습니다.
pl: Napotkano nieprawidłową sygnaturę elementu członkowskiego z powodu wcześniejszego błędu
pt_br: Assinatura de membro inválida encontrada devido a um erro anterior
ru: Обнаружена недопустимая сигнатура элемента, связанная с предшествующей ошибкой
tr: Önceki bir hata nedeniyle geçersiz üye imzasıyla karşılaşıldı
zh_hans: 遇到无效的成员签名，因为前面出现了错误
zh_hant: 因為先前的錯誤，導致發生無效的成員簽章

# tastValueDoesNotHaveSetterType
source: This value does not have a valid property setter type
cs: Tato hodnota nemá platný typ metody set vlastnosti.
de: Für diesen Wert ist kein gültiger Eigenschaftensettertyp vorhanden.
es: Este valor no tiene un tipo de establecedor de propiedad válido.
fr: Cette valeur n'a pas de type de méthode setter de propriété valide
it: Questo valore non contiene un tipo di setter di proprietà valido
ja: この値には、有効なプロパティの set アクセス操作子の型がありません
ko: 이 값에는 올바른 속성 setter 형식이 없습니다.
pl: Ta wartość nie ma prawidłowego typu metody ustawiającej właściwość
pt_br: Este valor não possui um tipo de setter de propriedade válido
ru: Это значение имеет недопустимый тип метода присваивания значения свойства
tr: Bu değerin geçerli bir özellik ayarlayıcı türü yok
zh_hans: 此值不具有有效的属性 setter 类型
zh_hant: 這個值沒有有效的屬性 setter 類型

# tastInvalidFormForPropertyGetter
source: Invalid form for a property getter. At least one '()' argument is required when using the explicit syntax.
cs: Neplatná notace pro metodu getter vlastnosti. Při použití explicitní syntaxe se vyžaduje aspoň jeden argument ().
de: Ungültiges Format für einen Eigenschaftengetter. Mindestens ein ()-Argument ist bei Verwendung der expliziten Syntax erforderlich.
es: Formato no válido para un captador de propiedad. Se necesita al menos un argumento '()' cuando se usa la sintaxis explícita.
fr: Forme non valide pour la méthode getter d'une propriété. Au moins un argument '()' est obligatoire lors de l'utilisation de la syntaxe explicite.
it: Formato non valido per un getter di proprietà. Quando si usa la sintassi esplicita, è necessario almeno un argomento '()'.
ja: プロパティのゲッターの形式が無効です。明示的な構文を使用する場合、少なくとも 1 つの '()' 引数が必要です。
ko: 속성 getter의 형식이 잘못되었습니다. 명시적 구문을 사용할 때는 하나 이상의 '()' 인수가 필요합니다.
pl: Nieprawidłowa postać metody pobierającej właściwość. W przypadku używania jawnej składni jest wymagany co najmniej jeden argument „()”.
pt_br: Forma inválida para um getter de propriedade. Pelo menos um argumento '()' é necessário quando a sintaxe explícita é usada.
ru: Недопустимая форма метода получения свойства. При использовании явного синтаксиса требуется как минимум один аргумент "()".
tr: Özellik alıcı için geçersiz biçim. Açık sözdizimini kullanırken en az bir '()' bağımsız değişkeni gereklidir.
zh_hans: 属性 Getter 的格式无效。在使用显式语法时，至少需要一个 "()" 参数。
zh_hant: 屬性 getter 的形式無效。使用明確語法時至少要有一個 '()' 引數。

# tastInvalidFormForPropertySetter
source: Invalid form for a property setter. At least one argument is required.
cs: Neplatná notace pro metodu set vlastnosti. Vyžaduje se aspoň jeden argument.
de: Ungültiges Format für einen Eigenschaftensetter. Mindestens ein Argument ist erforderlich.
es: Formato no válido para un establecedor de propiedad. Se necesita la menos un argumento.
fr: Forme non valide pour la méthode setter d'une propriété. Au moins un argument est requis.
it: Formato non valido per un setter di proprietà. È necessario almeno un argomento.
ja: プロパティの set アクセス操作子の形式が無効です。少なくとも 1 つの引数が必要です。
ko: 속성 setter의 형식이 잘못되었습니다. 하나 이상의 인수가 필요합니다.
pl: Nieprawidłowa forma metody ustawiającej właściwości. Wymagany jest co najmniej jeden argument.
pt_br: Forma inválida para um setter de propriedade. Pelo menos um argumento é necessário.
ru: Недопустимая форма метода присваивания значения свойства. Требуется как минимум один аргумент.
tr: Özellik ayarlayıcı için geçersiz biçim. En az bir bağımsız değişken gereklidir.
zh_hans: 属性 setter 的格式无效。至少需要一个参数。
zh_hant: 屬性 setter 的形式無效。至少要有一個引數。

# tastUnexpectedByRef
source: Unexpected use of a byref-typed variable
cs: Neočekávané použití proměnné typu ByRef.
de: Unerwartete Verwendung einer Variablen vom Typ "byref".
es: Uso inesperado de una variable de tipo byref.
fr: Utilisation inattendue d'une variable typée byref
it: Utilizzo non previsto di una variabile di tipo byref
ja: byref 型変数の予期しない使用方法です:
ko: 예기치 않은 byref 형식 변수의 사용입니다.
pl: Nieoczekiwane użycie zmiennej typu byref
pt_br: Uso inesperado de uma variável do tipo byref
ru: Недопустимое использование переменной типа byref
tr: Beklenmeyen byref olarak belirtilmiş değişken kullanımı
zh_hans: 对 byref 类型化变量的意外使用
zh_hant: 未預期的 ByRef 類型變數用法

# tastInvalidMutationOfConstant
source: Invalid mutation of a constant expression. Consider copying the expression to a mutable local, e.g. 'let mutable x = ...'.
cs: Neplatná mutace konstantního výrazu. Zvažte možnost zkopírovat výraz do lokální proměnné, třeba let mutable x = ...
de: Ungültige Mutation eines konstanten Ausdrucks. Kopieren Sie den Ausdruck in eine änderbare lokale Variable, z.B. "let mutable x = ...".
es: Mutación no válida de una expresión constante. Considere copiar la expresión en un local mutable; por ejemplo, 'let mutable x = ...'.
fr: Mutation non valide d'une expression constante. Copiez l'expression dans une variable locale mutable, par exemple 'let mutable x = ...'.
it: Modifica non valida di un'espressione costante. Provare a copiare l'espressione in un locale modificabile, ad esempio 'let mutable x = ...'.
ja: 定数式の変更は無効です。変更可能なローカルに式をコピーしてください (たとえば、'let mutable x = ...')。
ko: 상수 식을 잘못 변경했습니다. 식을 변경할 수 있는 로컬로 복사하십시오(예: 'let mutable x = ...').
pl: Nieprawidłowa mutacja wyrażenia stałej. Rozważ skopiowanie wyrażenia do modyfikowalnej wartości lokalnej, na przykład „let mutable x = ...”.
pt_br: Mutação inválida de uma expressão constante. Considere copiar a expressão para um local mutável, por exemplo: 'let mutable x = ...'.
ru: Недопустимое изменение константного выражения. Рекомендуется скопировать выражение в изменяемую локальную переменную, например, "let mutable x = ...".
tr: Sabit ifadesinin geçersiz olarak değiştirilmesi. İfadeyi değiştirilebilir bir yerel değere kopyalamayı düşünün, örn. 'let mutable x = ...'.
zh_hans: 常数表达式的变化无效。请考虑将该表达式复制一个可变的本地变量，例如 "let mutable x = ..."。
zh_hant: 常數運算式無效的變動。請考慮將運算式複製到可變動的區域變數，例如 'let mutable x = ...'。

# tastValueHasBeenCopied
source: The value has been copied to ensure the original is not mutated by this operation or because the copy is implicit when returning a struct from a member and another member is then accessed
cs: Hodnota se zkopírovala pro případ, že by se v důsledku této operace původní hodnota změnila.
de: Dieser Wert wurde kopiert, damit das Original von diesem Vorgang nicht verändert wird.
es: El valor se ha copiado para garantizar que esta operación no mute el original.
fr: La valeur a été copiée pour garantir que la valeur d'origine n'est pas mutée par cette opération
it: Il valore è stato copiato per assicurare che durante l'operazione l'originale non venga modificato
ja: この操作で元の値が変更されないように、値はコピーされました
ko: 이 작업에 의해 원래 값이 변경되지 않도록 값이 복사되었습니다.
pl: Wartość została skopiowana w celu zagwarantowania, że oryginalna wartość nie zostanie zmodyfikowana przez tę operację, lub ponieważ kopia jest niejawna, gdy podczas zwracania struktury z elementu członkowskiego nastąpi otwarcie innego elementu członkowskiego.
pt_br: O valor que foi copiado para assegurar que o original não seja mudado por esta operação ou porque a cópia está implícita ao retornar o struct de um membro e outro membro é acessado
ru: Значение было скопировано, чтобы не допустить изменения исходного значения этой операцией, или так как копирование выполняется неявно при возвращении структуры из члена и последующего получения доступа к другому члену
tr: Bu işlemin özgün değeri değiştirmemesi veya bir üyeden yapı döndürülürken başka bir üyeye erişildiğinde kopyalanmış değer örtük olduğu için, değer kopyalandı
zh_hans: 已复制该值以确保此操作不会更改原始值，或由于该副本在从成员返回结构时为隐式，而随后访问了另一成员
zh_hant: 已複製值確保此作業不會變動原始值，或因為從成員傳回結構，再存取其他成員意味著已複製

# tastRecursiveValuesMayNotBeInConstructionOfTuple
source: Recursively defined values cannot appear directly as part of the construction of a tuple value within a recursive binding
cs: Rekurzivně definované hodnoty se nedají použít přímo jako součást konstrukce hodnoty řazené kolekce členů v rekurzivní vazbě.
de: Rekursiv definierte Werte können nicht direkt als Teil der Konstruktion eines Tupelwerts innerhalb einer rekursiven Bindung auftreten.
es: Los valores definidos de forma recursiva no pueden aparecer directamente como parte de la construcción de un valor de tupla en un enlace recursivo.
fr: Impossible de faire apparaître directement les valeurs définies de manière récursive dans le cadre de la construction d'une valeur basée sur un tuple dans une liaison récursive
it: I valori definiti in modo ricorsivo non possono rappresentare direttamente parte della costruzione di un valore di tupla in un binding ricorsivo
ja: 再帰的に定義された値は、再帰的な束縛内にあるタプル値の構造の一部として直接使用することはできません。
ko: 재귀적으로 정의된 값은 재귀적 바인딩 내에서 튜플 값의 구성 요소에 대한 일부로 직접 나타날 수 없습니다.
pl: Wartości zdefiniowane cyklicznie nie mogą występować bezpośrednio jako część konstrukcji wartości krotki w powiązaniu cyklicznym
pt_br: Valores definidos recursivamente não podem aparecer diretamente como parte da construção de um valor tupla em uma associação recursiva
ru: Рекурсивно определяемые значения не могут использоваться непосредственно в составе конструкции или значения кортежа внутри рекурсивной привязки
tr: Özyinelemeli tanımlanmış değerler özyinelemeli bir bağlama içinde demet değer oluşumunun parçası olarak doğrudan görünemez
zh_hans: 以递归方式定义的值在递归绑定内不能直接显示为元组值的构造的一部分
zh_hant: 遞迴定義的值不能直接顯示為遞迴繫結內元組值的一部分建構

# tastRecursiveValuesMayNotAppearInConstructionOfType
source: Recursive values cannot appear directly as a construction of the type '{0}' within a recursive binding. This feature has been removed from the F# language. Consider using a record instead.
cs: Rekurzivní hodnoty nejde použít přímo jako konstrukce typu {0} v rekurzivní vazbě. Tato funkce je už z jazyka F# odebraná. Zvažte možnost použít místo ní záznam.
de: Rekursive Werte können nicht direkt als Konstruktion vom Typ "{0}" innerhalb einer rekursiven Bindung auftreten. Diese Funktion wurde aus der Programmiersprache F# entfernt. Verwenden Sie stattdessen einen Datensatz.
es: Los valores recursivos no pueden aparecer directamente como una construcción del tipo '{0}' en un enlace recursivo. Esta característica se ha quitado del lenguaje F#. Considere el uso de un registro en su lugar.
fr: Impossible de faire apparaître les valeurs récursives directement en tant que construction du type '{0}' dans une liaison récursive. Cette fonctionnalité a été supprimée du langage F#. Utilisez un type enregistrement à la place.
it: I valori ricorsivi non possono rappresentare direttamente una costruzione del tipo '{0}' in un binding ricorsivo. Questa funzionalità è stata rimossa dal linguaggio F#. Provare a usare un record.
ja: 再帰的な値は、再帰的な束縛内の型 '{0}' の構造として直接使用することはできません。この機能は F# 言語から削除されました。代わりにレコードを使用してください。
ko: 재귀 값은 재귀적 바인딩 내에서 '{0}' 형식의 구성 요소로 직접 나타날 수 없습니다. 이 기능은 F# 언어에서 제거되었습니다. 대신 레코드를 사용하세요.
pl: Wartości cykliczne nie mogą występować bezpośrednio jako konstrukcja typu „{0}” w powiązaniu cyklicznym. Ta funkcja została usunięta z języka F#. Zamiast tego rozważ użycie rekordu.
pt_br: Valores recursivos não podem aparecer diretamente como uma construção do tipo '{0}' em uma associação recursiva. Este recurso foi removido da linguagem F#. Considere usar um registro em seu lugar.
ru: Рекурсивные значения не могут использоваться непосредственно в конструкциях вида "{0}" внутри рекурсивной привязки. Эта функция удалена из языка F#. Вместо этого рекомендуется использовать запись.
tr: Özyinelemeli değerler, özyinelemeli bir bağlama içinde '{0}' türünün doğrudan oluşturulması olarak görünemez. Bu özellik F# dilinden kaldırılmıştır. Onun yerine bir kayıt kullanmayı düşünün.
zh_hans: 递归值在递归绑定内不能直接显示为类型“{0}”的构造。在 F# 语言中，此功能已删除。请考虑改用记录。
zh_hant: 遞迴值無法直接顯示為遞迴繫結內類型 '{0}' 的建構。這項功能已從 F# 語言移除。請考慮改用記錄。
