Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# tcOnlyStructsCanHaveStructLayout
source: Only structs and classes without primary constructors may be given the 'StructLayout' attribute
cs: Atribut StructLayout se dá předávat jenom strukturám a třídám bez primárních konstruktorů.
de: Nur Strukturen und Klassen ohne primäre Konstruktoren dürfen das StructLayout-Attribut erhalten.
es: El atributo 'StructLayout' se puede dar solo a structs y clases sin constructores principales.
fr: Seuls les structs et les classes sans constructeurs principaux peuvent recevoir l'attribut 'StructLayout'
it: L'attributo 'StructLayout' può essere assegnato solo a struct e classi senza costruttori primari
ja: 'StructLayout' 属性を指定できるのは、プライマリ コンストラクターなしの構造体およびクラスのみです
ko: 기본 생성자가 없는 구조체 및 클래스에만 'StructLayout' 특성을 지정할 수 있습니다.
pl: Tylko struktury i klasy bez konstruktorów podstawowych mogą mieć atrybut „StructLayout”
pt_br: Somente structs e classes sem construtores primários podem receber o atributo 'StructLayout'.
ru: Атрибут StructLayout может присваиваться только структурам и классам без первичных конструкторов
tr: Yalnızca birincil oluşturucuları olmayan yapılara ve sınıflara 'StructLayout' özniteliği verilebilir
zh_hans: 只能为不带主构造函数的结构和类提供“StructLayout”特性
zh_hant: 只能為不含主要建構函式的結構和類別指定 'StructLayout' 屬性

# tcRepresentationOfTypeHiddenBySignature
source: The representation of this type is hidden by the signature. It must be given an attribute such as [<Sealed>], [<Class>] or [<Interface>] to indicate the characteristics of the type.
cs: Signatura reprezentaci tohoto typu skrývá. Charakteristiku typu je potřeba určit pomocí atributu, jako je třeba [<Sealed>], [<Class>] nebo [<Interface>].
de: Die Darstellung dieses Typs wird durch die Signatur versteckt. Dem Typ muss ein Attribut wie [<Sealed>], [<Class>] oder [<Interface>] hinzugefügt werden, um dessen Merkmale anzugeben.
es: La representación de este tipo está oculta por la firma. Debe recibir un atributo como [<Sealed>], [<Class>] o [<Interface>] para indicar las características del tipo.
fr: La représentation de ce type est masquée par la signature. Elle doit avoir un attribut de type [<Sealed>], [<Class>] ou [<Interface>] pour indiquer les caractéristiques du type.
it: La rappresentazione di questo tipo è nascosta dalla firma. È necessario assegnare un attributo quale [<Sealed>], [<Class>] o [<Interface>] per indicare le caratteristiche del tipo.
ja: この種の表現は、シグネチャによって非表示になります。この種の特性を示すには、[<Sealed>]、[<Class>]、または [<Interface>] などの属性を指定する必要があります。
ko: 이 형식의 표현은 시그니처에 의해 숨겨져 있습니다. 형식의 특징을 나타내기 위해 이 형식에는 [<Sealed>], [<Class>] 또는 [<Interface>]와 같은 특성을 지정해야 합니다.
pl: Reprezentacja tego typu została ukryta przez podpis. W celu wskazania charakterystyki typu musi ona zawierać atrybut, taki jak [<Sealed>], [<Class>] lub [<Interface>].
pt_br: A representação deste tipo está oculta pela assinatura. Deve ser dado um atributo como [<Sealed>], [<Class>] ou [<Interface>] para indicar as características do tipo.
ru: Представление этого типа скрыто в подписи. Необходимо добавить атрибут, например, [<Sealed>], [<Class>] или [<Interface>], чтобы указать характеристики типа.
tr: Bu türün temsili imza tarafından gizlenmiş. Türün özelliklerinin belirtilmesi için türe [<Sealed>], [<Class>] veya [<Interface>] gibi bir öznitelik verilmelidir.
zh_hans: 签名会隐藏此类型的表示形式。必须为此类型提供一个属性(例如 [<Sealed>]、[<Class>] 或 [<Interface>])以指定其特性。
zh_hant: 特徵標記隱藏了此類型的表示法。必須賦予其 [<Sealed>]、[<Class>] 或 [<Interface>] 這類的屬性，以指出類型的特性。

# tcOnlyClassesCanHaveAbstract
source: Only classes may be given the 'AbstractClass' attribute
cs: Atribut AbstractClass se dá předávat jenom třídám.
de: Nur Klassen dürfen das AbstractClass-Attribut erhalten.
es: El atributo 'AbstractClass' se puede dar sólo a clases.
fr: Seules les classes peuvent recevoir l'attribut 'AbstractClass'
it: L'attributo 'AbstractClass' può essere assegnato solo a classi
ja: 'AbstractClass' 属性を指定できるのはクラスのみです
ko: 클래스에만 'AbstractClass' 특성을 지정할 수 있습니다.
pl: Tylko klasy mogą mieć atrybut „AbstractClass”
pt_br: O atributo 'AbstractClass' só pode ser dado a classes
ru: Атрибут "AbstractClass" может присваиваться только классам
tr: 'AbstractClass' özniteliği yalnızca sınıflara verilebilir
zh_hans: 只能为类给定“AbstractClass”特性
zh_hant: 只能為類別指定 'AbstractClass' 屬性

# tcOnlyTypesRepresentingUnitsOfMeasureCanHaveMeasure
source: Only types representing units-of-measure may be given the 'Measure' attribute
cs: Atribut Measure se dá předávat jenom typům, které představují měrné jednotky.
de: Nur Typen, die Maßeinheiten darstellen, dürfen das Measure-Attribut erhalten.
es: El atributo 'Measure' se puede dar solo a tipos que representen unidades de medida.
fr: Seuls les types représentant des unités de mesure peuvent recevoir l'attribut 'Measure'
it: L'attributo 'Measure' può essere assegnato solo a tipi che rappresentano un'unità di misura
ja: 'Measure' 属性を指定できるのは、単位を表す型のみです
ko: 측정 단위를 나타내는 형식에만 'Measure' 특성을 지정할 수 있습니다.
pl: Tylko typy reprezentujące jednostkę miary mogą mieć atrybut „Measure”
pt_br: Apenas unidades de medida de representações de tipos podem receber o atributo 'Measure'
ru: Атрибут "Measure" может присваиваться только типам, представляющим единицы измерения
tr: Yalnızca ölçü birimlerini temsil eden türlere 'Measure' özniteliği verilebilir
zh_hans: 只能为表示度量单位的类型给定“Measure”特性
zh_hant: 只能為代表測量單位的類型指定 'Measure' 屬性

# tcOverridesCannotHaveVisibilityDeclarations
source: Accessibility modifiers are not permitted on overrides or interface implementations
cs: Modifikátory dostupnosti nejsou u implementací rozhraní nebo přepsání povolené.
de: Zugriffsmodifizierer sind für Überschreibungen oder Schnittstellenimplementierungen nicht zulässig.
es: No se permiten modificadores de accesibilidad en invalidaciones o implementaciones de interfaz.
fr: Les modificateurs d'accessibilité ne sont pas autorisés pour les substitutions ou les implémentations d'interfaces
it: Modificatori di accessibilità non consentiti in implementazioni di interfaccia o override
ja: オーバーライドまたはインターフェイスの実装にはアクセシビリティ修飾子を使用できません
ko: 액세스 가능성 한정자는 재정의 또는 인터페이스 구현에서 허용되지 않습니다.
pl: Modyfikatory dostępności nie są dozwolone w przypadku przesłonięć lub implementacji interfejsów
pt_br: Modificadores de acessibilidade não são permitidos em implementações de substituições ou de interfaces
ru: Модификаторы специальных возможностей не разрешаются на переопределениях или реализациях интерфейса
tr: Geçersiz kılmalarda veya arabirim uygulamalarında erişilebilirlik değiştiricilerine izin verilmez
zh_hans: 不允许对重写或接口实现使用可访问性修饰符
zh_hant: 不允許在覆寫或介面實作上使用存取範圍修飾詞

# tcTypesAreAlwaysSealedDU
source: Discriminated union types are always sealed
cs: Typy rozlišených sjednocení jsou vždycky zapečetěné.
de: Diskriminierte Union-Typen sind immer versiegelt.
es: Los tipos de unión discriminada están siempre sellados.
fr: Les types union discriminés sont toujours sealed
it: I tipi di unione discriminati sono sempre Sealed
ja: 判別された共用体型は常にシールドです
ko: 구분된 공용 구조체 형식은 항상 봉인됩니다.
pl: Typy unii rozłącznych są zawsze zapieczętowane
pt_br: Tipos de união discriminados são sempre selados
ru: Типы различаемых объединений всегда являются запечатанными
tr: Ayırt edici birleşim türleri her zaman mühürlüdür
zh_hans: 已区分的联合类型始终是密封类型
zh_hant: 差別等位類型永遠是密封的

# tcTypesAreAlwaysSealedRecord
source: Record types are always sealed
cs: Typy záznamu jsou vždycky zapečetěné.
de: Datensatztypen sind immer versiegelt.
es: Los tipos de registro están siempre sellados.
fr: Les types enregistrement sont toujours sealed
it: I tipi di record sono sempre Sealed
ja: レコード型は常にシールドです
ko: 레코드 형식은 항상 봉인됩니다.
pl: Typy rekordów są zawsze zapieczętowane
pt_br: Tipos de registros são sempre selados
ru: Типы записей всегда являются запечатанными
tr: Kayıt türleri her zaman mühürlüdür
zh_hans: 记录类型始终是密封类型
zh_hant: 記錄類型永遠是密封的

# tcTypesAreAlwaysSealedAssemblyCode
source: Assembly code types are always sealed
cs: Typy kódu sestavení jsou vždycky zapečetěné.
de: Assemblycodetypen sind immer versiegelt.
es: Los tipos de código de ensamblado están siempre sellados.
fr: Les types de codes assembleur sont toujours sealed
it: I tipi di codice assembly sono sempre Sealed
ja: アセンブリ コード型は常にシールドです
ko: 어셈블리 코드 형식은 항상 봉인됩니다.
pl: Typy kodu zestawu są zawsze zapieczętowane
pt_br: Tipos de código de assembly são sempre selados
ru: Типы кодов сборок всегда являются запечатанными
tr: Bütünleştirilmiş kod türleri her zaman mühürlüdür
zh_hans: 程序集代码类型始终是密封类型
zh_hant: 組譯程式碼類型永遠是密封的

# tcTypesAreAlwaysSealedStruct
source: Struct types are always sealed
cs: Typy struktury jsou vždycky zapečetěné.
de: Strukturtypen sind immer versiegelt.
es: Los tipos de struct están siempre sellados.
fr: Les types struct sont toujours sealed
it: I tipi di struct sono sempre Sealed
ja: 構造体型は常にシールドです
ko: 구조체 형식은 항상 봉인됩니다.
pl: Typy struktur są zawsze zapieczętowane
pt_br: Tipos struct são sempre selados
ru: Типы структур всегда являются запечатанными
tr: Yapı türleri her zaman mühürlüdür
zh_hans: 结构类型始终是密封类型
zh_hant: 結構類型永遠是密封的

# tcTypesAreAlwaysSealedDelegate
source: Delegate types are always sealed
cs: Typy delegátů jsou vždycky zapečetěné.
de: Delegattypen sind immer versiegelt.
es: Los tipos de delegado están siempre sellados.
fr: Les types délégués sont toujours sealed
it: I tipi delegati sono sempre Sealed
ja: デリゲート型は常にシールドです
ko: 대리자 형식은 항상 봉인됩니다.
pl: Typy delegatów są zawsze zapieczętowane.
pt_br: Tipos delegados são sempre selados
ru: Делегатные типы всегда являются запечатанными
tr: Temsilci türleri her zaman mühürlüdür
zh_hans: 委托类型始终是密封类型
zh_hant: 委派類型永遠是密封的

# tcTypesAreAlwaysSealedEnum
source: Enum types are always sealed
cs: Typy výčtu jsou vždycky zapečetěné.
de: Enumerationstypen sind immer versiegelt.
es: Los tipos de enumeración están siempre sellados.
fr: Les types enum sont toujours sealed
it: I tipi enumerazione sono sempre sealed
ja: 列挙型は常にシールドです
ko: 열거형 형식은 항상 봉인됩니다.
pl: Typy wyliczeniowe są zawsze zapieczętowane
pt_br: Tipos enum são sempre selados
ru: Перечисляемые типы всегда являются запечатанными
tr: Sabit listesi türleri her zaman mühürlüdür
zh_hans: 枚举类型始终是密封类型
zh_hant: 列舉類型永遠是密封的

# tcInterfaceTypesAndDelegatesCannotContainFields
source: Interface types and delegate types cannot contain fields
cs: Typy rozhraní a typy delegátů nemůžou obsahovat pole.
de: Schnittstellentypen und Delegattypen dürfen keine Felder enthalten.
es: Los tipos de interfaz y los tipos de delegado no pueden contener campos.
fr: Les types interface et les types délégués ne peuvent pas contenir de champs
it: I tipi di interfaccia e i tipi delegati non possono contenere campi
ja: インターフェイス型またはデリゲート型にフィールドを含めることはできません
ko: 인터페이스 형식 및 대리자 형식에는 필드를 포함할 수 없습니다.
pl: Typy interfejsów i delegatów nie mogą zawierać pól
pt_br: Tipos de interface e tipos delegado não podem conter campos
ru: Типы интерфейсов и типы делегатов не могут содержать поля
tr: Arabirim türleri ve temsilci türleri alan içeremez
zh_hans: 接口类型和委托类型不能包含字段
zh_hant: 介面類型和委派類型不能包含欄位

# tcAbbreviatedTypesCannotBeSealed
source: Abbreviated types cannot be given the 'Sealed' attribute
cs: Zkráceným typům se nedá předávat atribut Sealed.
de: Abgekürzte Typen können nicht mit dem Sealed-Attribut versehen werden.
es: A los tipos abreviados no se les puede dar el atributo 'Sealed'.
fr: Impossible de donner aux types abrégés l'attribut 'Sealed'
it: Non è possibile assegnare l'attributo 'Sealed' a tipi abbreviati
ja: 省略された型に 'Sealed' 属性を指定することはできません
ko: 간략화된 형식에는 'Sealed' 특성을 지정할 수 없습니다.
pl: Skrócone typy nie mogą mieć atrybutu „Sealed”
pt_br: O atributo 'Sealed' não pode ser dado aos tipos abreviados.
ru: Не допускается присваивание атрибута "Sealed" сокращенным типам
tr: Kısaltılmış türlere 'Sealed' özniteliği verilemez
zh_hans: 不能为缩写的类型给定“Sealed”特性
zh_hant: 不能為縮寫的類型指定 'Sealed' 屬性

# tcCannotInheritFromSealedType
source: Cannot inherit a sealed type
cs: Zapečetěný typ nejde zdědit.
de: Von einem versiegelten Typ kann nicht geerbt werden.
es: No se puede heredar un tipo sellado.
fr: Impossible d'hériter d'un type sealed
it: Non è possibile ereditare un tipo Sealed
ja: シールド型を継承できません
ko: 봉인된 형식을 상속할 수 없습니다.
pl: Nie można odziedziczyć zapieczętowanego typu
pt_br: Não é possível herdar um tipo selado
ru: Не удается реализовать наследование от запечатанного типа
tr: Mühürlü tür devralınamıyor
zh_hans: 无法继承密封类型
zh_hant: 無法繼承密封類型

# tcCannotInheritFromInterfaceType
source: Cannot inherit from interface type. Use interface ... with instead.
cs: Nejde dědit z typu rozhraní. Použijte místo toho výraz interface ... with.
de: Vom Schnittstellentyp kann nicht geerbt werden. Verwenden Sie stattdessen "interface ... with".
es: No se puede heredar de un tipo de interfaz. Use 'interface ... with' en su lugar.
fr: Impossible d'hériter du type interface. Utilisez interface ... with à la place.
it: Non è possibile ereditare da un tipo di interfaccia. Usare invece interface ... with.
ja: インターフェイスの型から継承できません。代わりに interface ... with を使用してください。
ko: 인터페이스 형식에서 상속할 수 없습니다. 대신 interface ... with를 사용하세요.
pl: Nie można dziedziczyć po typie interfejsu. Zamiast tego użyj konstrukcji interface ... with.
pt_br: Não é possível herdar de um tipo de interface. Use interface ... with em seu lugar.
ru: Не удается реализовать наследование от типа интерфейса. Вместо этого используйте выражение "interface ... with".
tr: Arabirim türünden devralınamıyor. Onun yerine interface ... with kullanın.
zh_hans: 无法从接口类型继承。请改用 interface ... with。
zh_hant: 無法繼承自介面類型。請改用 interface ... with。

# tcStructTypesCannotContainAbstractMembers
source: Struct types cannot contain abstract members
cs: Typy struktury nemůžou obsahovat abstraktní členy.
de: Strukturtypen dürfen keine abstrakten Member enthalten.
es: Los tipos de struct no pueden contener miembros abstractos.
fr: Les types struct ne peuvent pas contenir de membres abstraits
it: I tipi di struct non possono contenere membri astratti
ja: 構造体型に抽象メンバーを含むことはできません
ko: 구조체 형식에는 추상 멤버를 포함할 수 없습니다.
pl: Typy struktur nie mogą zawierać abstrakcyjnych elementów członkowskich
pt_br: Tipos de struct não podem conter membros abstratos
ru: Типы структуры не могут содержать абстрактных элементов
tr: Struct türleri soyut üyeler içeremez
zh_hans: 结构类型不能包含抽象成员
zh_hant: 結構類型不能包含抽象成員

# tcInterfaceTypesCannotBeSealed
source: Interface types cannot be sealed
cs: Typy rozhraní nemůžou být zapečetěné.
de: Schnittstellentypen dürfen nicht versiegelt sein.
es: Los tipos de interfaz no pueden estar sellados.
fr: Les types interface ne peuvent pas être sealed
it: I tipi di interfaccia non possono essere Sealed
ja: インターフェイス型をシールドにすることはできません
ko: 인터페이스 형식은 봉인할 수 없습니다.
pl: Typy interfejsów nie mogą być zapieczętowane
pt_br: Tipos de interface não podem ser selados
ru: Типы интерфейсов не могут быть запечатаны
tr: Arabirim türleri mühürlü olamaz
zh_hans: 接口类型不能为密封类型
zh_hant: 介面類型不可以是密封的

# tcInvalidDelegateSpecification
source: Delegate specifications must be of the form 'typ -> typ'
cs: Specifikace delegátů musí mít notaci typ -> typ.
de: Delegierte Spezifikationen müssen das Format "typ -> typ" aufweisen.
es: Las especificaciones del delegado deben tener el formato "typ -> typ"
fr: Les spécifications de délégué doivent être de la forme 'typ -> typ'
it: Il formato delle specifiche di delegato deve essere 'tip -> tip'
ja: デリゲート仕様の形式は、'typ -> typ' でなければなりません
ko: 대리자 지정의 형식은 'typ -> typ'여야 합니다.
pl: Specyfikacje delegatów muszą mieć postać „typ -> typ”
pt_br: As especificações de delegado devem ser da forma 'typ -> typ'
ru: Спецификации делегатов должны иметь вид 'typ -> typ'
tr: Temsilci belirtimleri 'typ -> typ' biçiminde olmalıdır
zh_hans: 委托规范必须采用 "typ -> typ" 形式
zh_hant: 委派規格的形式必須為 'typ -> typ'

# tcDelegatesCannotBeCurried
source: Delegate specifications must not be curried types. Use 'typ * ... * typ -> typ' for multi-argument delegates, and 'typ -> (typ -> typ)' for delegates returning function values.
cs: Specifikace delegátů nesmí být curryfikované typy. Pro delegáty, kteří mají více argumentů, použijte typ * ... * typ -> typ a pro delegáty, kteří vrací hodnoty funkcí, použijte typ -> (typ -> typ).
de: Delegatspezifikationen dürfen keine Currytypen sein. Verwenden Sie " typ * ... * typ -> typ" für Delegaten mit mehreren Argumenten und " typ -> (typ -> typ)" für Delegaten, die Funktionswerte zurückgeben.
es: Las especificaciones del delegado no deben ser tipos currificados. Utilice "typ * ... * typ -> typ" para delegados de argumentos múltiples, y "typ -> (typ -> typ)" para delegados que devuelven valores de función.
fr: Les spécifications de délégué ne doivent pas être des types curryfiés. Utilisez 'typ * ... * typ -> typ' pour les délégués multiarguments et 'typ -> (typ -> typ)' pour les délégués qui retournent des valeurs de fonction.
it: Le specifiche di delegato non devono essere tipi sottoposti a currying. Usare 'typ * ... * typ -> typ' per delegati con più argomenti e 'typ -> (typ -> typ)' per delegati che restituiscono valori di funzione.
ja: デリゲートにはカリー化された型を指定しないでください。複数引数のデリゲートには 'typ * ... * typ -> typ' を使用し、関数値を返すデリゲートには 'typ -> (typ -> typ)' を使用します。
ko: 대리자 지정은 커리된 형식이어서는 안 됩니다. 다중 인수 대리자의 경우 'typ * ... * typ -> typ', 함수 값을 반환하는 대리자의 경우 'typ -> (typ -> typ)'를 사용하세요.
pl: Specyfikacje delegatów nie mogą być typu curried. Użyj konstrukcji „typ * ... * typ -> typ” w przypadku delegatów z wieloma argumentami i konstrukcji „typ -> (typ -> typ)” w przypadku delegatów zwracających wartości funkcji.
pt_br: Especificações de delegado não devem ser tipos de representante via currying. Use 'typ * ... * typ -> typ' para delegados multi-argumento e 'typ -> (typ -> typ)' para delegados que retornam valores de função.
ru: Спецификации делегата не могут иметь каррированные типы. Используйте 'typ * ... * typ -> typ' для делегатов с несколькими аргументами и 'typ -> (typ -> typ)' для делегатов, возвращающих значения функций.
tr: Temsilci belirtimleri Curry biçimli türler olmamalıdır. Birden çok bağımsız değişken temsilcisi için 'typ * ... * typ -> typ', işlev değerleri döndüren temsilciler için 'typ -> (typ -> typ)' kullanın.
zh_hans: 委托规范不得为扩充类型。请为多参数委托使用 "typ * ... * typ -> typ"，并为返回函数值的委托使用 "typ -> (typ -> typ)"。
zh_hant: 委派規格不得為局部調用的類型。若為多引數委派，請使用 'typ * ... * typ -> typ'; 若為傳回函式值的委派，則使用 'typ -> (typ -> typ)'。

# tcInvalidTypeForLiteralEnumeration
source: Literal enumerations must have type int, uint, int16, uint16, int64, uint64, byte, sbyte or char
cs: Literálový výčet musí být typu int, uint, int16, uint16, int64, uint64, byte, sbyte nebo char.
de: Literalenumerationen müssen den Typ "int", "uint", "int16", "uint16", "int64", "uint64", "byte", "sbyte" oder "char" aufweisen.
es: Las enumeraciones de literal deben tener el tipo int, uint, int16, uint16, int64, uint64, byte, sbyte o char.
fr: Les littéraux énumérés doivent être de type int, uint, int16, uint16, int64, uint64, byte, sbyte ou char
it: Le enumerazioni di valori letterali devono avere tipo int, uint, int16, uint16, int64, uint64, byte, sbyte o char
ja: リテラル列挙値の型は、int、uint、int16、uint16、int64、uint64、byte、sbyte、または char にする必要があります
ko: 리터럴 열거형의 형식은 int, uint, int16, uint16, int64, uint64, byte, sbyte 또는 char이어야 합니다.
pl: Wyliczenia literałów muszą być typu int, uint, int16, uint16, int64, uint64, byte, sbyte lub char
pt_br: Enumerações literais devem ter tipo int, uint, int16, uint16, int64, uint64, byte, sbyte ou char
ru: Перечисления литералов должны иметь тип int, uint, int16, uint16, int64, uint64, byte, sbyte или char
tr: Sabit değer listelerinde int, uint, int16, uint16, int64, uint64, byte, sbyte veya char türü olmalıdır
zh_hans: 文本枚举必须具有类型 int、uint、int16、uint16、int64、uint64、byte、sbyte 或 char
zh_hant: 常值列舉值必須為類型 int、uint、int16、uint16、int64、uint64、byte、sbyte 或 char

# tcTypeDefinitionIsCyclic
source: This type definition involves an immediate cyclic reference through an abbreviation
cs: Tato definice typu zahrnuje okamžitý cyklický odkaz zprostředkovaný zkratkou.
de: Diese Typdefinition umfasst einen sofortigen zyklischen Verweis über eine Abkürzung.
es: Esta definición de tipo implica una referencia cíclica inmediata a través de una abreviación.
fr: Cette définition de type implique une référence cyclique immédiate via une abréviation
it: Questa definizione di tipo prevede un riferimento ciclico immediato tramite un'abbreviazione
ja: この型定義では、省略形による直接的な循環参照が発生します
ko: 이 형식 정의에는 약어를 통해 직접 순환 참조가 사용됩니다.
pl: Ta definicja typu zawiera bezpośrednie odwołanie cykliczne za pośrednictwem skrótu
pt_br: Esta definição de tipo envolve uma referência cíclica imediata através de uma abreviação
ru: Определение данного типа включает прямую циклическую ссылку через сокращение
tr: Bu tür tanımı, kısaltma aracılığıyla anlık döngüsel başvuru içeriyor
zh_hans: 此类型定义涉及一个经由缩写词的直接循环引用
zh_hant: 這個類型定義涉及透過縮寫的立即循環參考

# tcTypeDefinitionIsCyclicThroughInheritance
source: This type definition involves an immediate cyclic reference through a struct field or inheritance relation
cs: Tato definice typu zahrnuje okamžitý cyklický odkaz zprostředkovaný polem struktury nebo vztahem dědičnosti.
de: Diese Typdefinition umfasst einen sofortigen zyklischen Verweis über ein Strukturfeld oder eine Vererbungsbeziehung.
es: Esta definición de tipo implica una referencia cíclica inmediata a través de un campo de struct o una relación de herencia.
fr: Cette définition de type implique une référence cyclique immédiate via un champ struct ou une relation d'héritage
it: Questa definizione di tipo prevede un riferimento ciclico immediato tramite un campo struct o una relazione di ereditarietà
ja: この型定義では、構造体フィールドまたは継承の関係による直接的な循環参照が発生します
ko: 이 형식 정의에는 구조체 필드 또는 상속 관계를 통해 직접 순환 참조가 사용됩니다.
pl: Ta definicja typu zawiera bezpośrednie odwołanie cykliczne za pośrednictwem pola struktury lub relacji dziedziczenia
pt_br: Esta definição de tipo envolve uma referência cíclica imediata através de um campo struct ou relação de herança
ru: Определение данного типа включает циклическую ссылку верхнего уровня через поле структуры или отношение наследования
tr: Bu tür tanımı, yapı alanı veya devralma ilişkisi aracılığıyla anlık döngüsel başvuru içeriyor
zh_hans: 此类型定义涉及一个经由结构字段或继承关系的直接循环引用
zh_hant: 這個類型定義涉及透過結構欄位或繼承關係的立即循環參考
