Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DefaultParameterValueNotAppropriateForArgument
source: The default value does not have the same type as the argument. The DefaultParameterValue attribute and any Optional attribute will be ignored. Note: 'null' needs to be annotated with the correct type, e.g. 'DefaultParameterValue(null:obj)'.
cs: Výchozí hodnota má jiný typ než argument. Atribut DefaultParameterValue a případné volitelné atributy se budou ignorovat. Poznámka: null je potřeba anotovat správným typem, např. DefaultParameterValue(null:obj).
de: Der Standardwert hat nicht den gleichen Typ wie das Argument. Das DefaultParameterValue-Attribut sowie ggf. vorhandene optionale Attribute werden ignoriert. Hinweis: "null" muss mit dem richtigen Typ gekennzeichnet sein. Beispiel: DefaultParameterValue(null:obj).
es: El valor predeterminado no tiene el mismo tipo que el argumento. El atributo DefaultParameterValue y los atributos Optional se omitirán. Nota: Debe anotarse el tipo correcto en "null". Por ejemplo, "DefaultParameterValue(null:obj)".
fr: La valeur par défaut n'a pas le même type que l'argument. L'attribut DefaultParameterValue et tous les attributs facultatifs seront ignorés. Remarque : 'null' doit être annoté avec le type approprié, par ex., 'DefaultParameterValue(null:obj)'.
it: Il tipo del valore predefinito non è uguale a quello dell'argomento. L'attributo DefaultParameterValue e l'eventuale attributo Optional verranno ignorati. Nota: 'null' deve essere annotato con il tipo corretto, ad esempio 'DefaultParameterValue(null:obj)'.
ja: 既定値が引数と同じ型ではありません。DefaultParameterValue 属性とすべての Optional 属性は無視されます。注: 'null' には適切な型の注釈を付ける必要があります。例: 'DefaultParameterValue(null:obj)'。
ko: 기본값에 인수와 같은 형식이 없습니다. DefaultParameterValue 특성 및 모든 Optional 특성은 무시됩니다. 참고: 'null'은 올바른 형식으로 주석이 추가되어야 합니다(예: 'DefaultParameterValue(null:obj)').
pl: Wartość domyślna nie ma takiego samego typu jak argument. Atrybut DefaultParameterValue i wszelkie atrybuty Optional zostaną zignorowane. Uwaga: dla wartości „null” należy użyć adnotacji z poprawnym typem, np. „DefaultParameterValue(null:obj)”.
pt_br: O valor padrão não tem o mesmo tipo que o argumento. O atributo DefaultParameterValue e qualquer atributo Optional serão ignorados. Observação: 'null' precisa ser anotado com o tipo correto, por exemplo, 'DefaultParameterValue(null:obj)'.
ru: Значение по умолчанию и аргумент имеют разные типы. Атрибут DefaultParameterValue и любые атрибуты Optional будут игнорироваться. Примечание: null необходимо аннотировать правильным типом, например DefaultParameterValue(null:obj).
tr: Varsayılan değer, bağımsız değişkenle aynı türde değil. DefaultParameterValue özniteliği ve tüm İsteğe Bağlı öznitelikler yoksayılacak. Not: 'null'un doğru tür ile eklenmesi gerekir, örneğin 'DefaultParameterValue(null:obj)'.
zh_hans: 默认值与参数的类型不同。将忽略 DefaultParameterValue 属性以及任何可选属性。注意: "null" 需要用正确的类型进行批注，例如 "DefaultParameterValue(null:obj)"。
zh_hant: 預設值並沒有與引數相同的類型。將略過 DefaultParameterValue 屬性及任何 Optional 屬性。注意: 'null' 需要加上正確的加註類型，例如 'DefaultParameterValue(null:obj)'。

# tcGlobalsSystemTypeNotFound
source: The system type '{0}' was required but no referenced system DLL contained this type
cs: Požadoval se systémový typ {0}, ale žádná odkazovaná systémová knihovna DLL tento typ neobsahovala.
de: Der Systemtyp "{0}" war erforderlich, aber in keiner referenzierten System-DLL vorhanden.
es: Se requería el tipo de sistema '{0}', pero ningún archivo DLL del sistema al que se hacía referencia contenía este tipo.
fr: Le type système '{0}' est obligatoire, mais aucune DLL système référencée ne contient ce type
it: È richiesto il tipo di sistema '{0}', ma nessuna DLL di sistema di riferimento contiene questo tipo
ja: システム型 '{0}' が必要でしたが、この型を含む参照されたシステム DLL はありません
ko: 시스템 형식 '{0}'이(가) 필요했지만, 참조된 시스템 DLL에 이 형식이 포함되어 있지 않습니다.
pl: Typ systemowy „{0}” był wymagany, ale żadna z przywoływanych systemowych bibliotek DLL nie zawierała tego typu
pt_br: O tipo de sistema '{0}' era necessário, mas nenhum DLL de sistema referenciado o continha
ru: Требуется системный тип "{0}", а в этом типе нет упоминаемой системой библиотеки DLL.
tr: '{0}' sistem türü gerekiyordu, ancak başvurulan hiçbir sistem DLL'si bu türü içermiyordu
zh_hans: 需要系统类型“{0}”，但没有引用系统 DLL 包含此类型
zh_hant: 需要系統類型 '{0}'，但參考的系統 DLL 均未包含此類型

# typrelMemberHasMultiplePossibleDispatchSlots
source: The member '{0}' matches multiple overloads of the same method.\nPlease restrict it to one of the following:{1}.
cs: Člen {0} odpovídá více přetížením stejné metody.\nOmezte ho prosím na jedno z následujících: {1}.
de: Der Member "{0}" entspricht mehreren Überladungen der gleichen Methode.\nBeschränken Sie ihn auf eine der folgenden Optionen: {1}.
es: El miembro "{0}" coincide con varias sobrecargas del mismo método.\nRestrínjalo a una de las siguientes: {1}.
fr: Le membre '{0}' correspond à plusieurs surcharges de la même méthode.\nLimitez-le à l'une des options suivantes : {1}.
it: Il membro '{0}' corrisponde a più overload dello stesso metodo.\nLimitarlo a uno dei seguenti:{1}.
ja: メンバー '{0}' は同じメソッドの複数のオーバーロードと一致しています。\n次のいずれかに制限してください: {1}。
ko: {0}' 멤버는 동일한 메서드의 여러 오버로드와 일치합니다.\n다음 중 하나로 제한하세요. {1}.
pl: Element członkowski „{0}” pasuje do wielu przeciążeń tej samej metody.\nOgranicz go do jednej z następujących opcji: {1}.
pt_br: O membro '{0}' corresponde a várias sobrecargas do mesmo método.\nLimite-o a uma das seguintes:{1}.
ru: Элемент "{0}" соответствует нескольким перегрузкам одного метода.\nНеобходимо ограничить его одним из следующих: {1}.
tr: {0}' adlı üye, aynı metodun birden fazla aşırı yüklemesiyle eşleşiyor.\nLütfen şunlardan biriyle kısıtlayın: {1}.
zh_hans: 成员“{0}”与同一方法的多个重载匹配。\n请将其限制为下面其中一项: {1}。
zh_hant: 成員 '{0}' 符合相同方法的多個多載。\n請將它限制為下列其中一項: {1}。

# methodIsNotStatic
source: Method or object constructor '{0}' is not static
cs: Metoda nebo konstruktor objektu {0} nejsou statické.
de: Methode oder Objektkonstruktor "{0}" ist nicht statisch.
es: El constructor de objeto o método "{0}" no es estático.
fr: La méthode ou le constructeur d'objet '{0}' n'est pas statique
it: Il costruttore di oggetto o metodo '{0}' non è statico
ja: メソッドまたはオブジェクト コンストラクター '{0}' が静的ではありません
ko: 메서드 또는 개체 생성자 '{0}'이(가) 정적이 아닙니다.
pl: Metoda nie jest statyczna lub konstruktor obiektu „{0}” nie jest statyczny
pt_br: O método ou o construtor de objeto '{0}' não é estático
ru: Метод или конструктор объекта "{0}" не является статическим
tr: '{0}' metodu veya nesne oluşturucusu, statik değil
zh_hans: 方法或对象构造函数“{0}”不是静态的
zh_hant: 方法或物件建構函式 '{0}' 不是靜態的

# parsUnexpectedSymbolEqualsInsteadOfIn
source: Unexpected symbol '=' in expression. Did you intend to use 'for x in y .. z do' instead?
cs: Neočekávaný symbol = ve výrazu. Neměli jste v úmyslu použít místo toho for x in y ... z do?
de: Unerwartetes Symbol "=" im Ausdruck. Wollten Sie stattdessen "for x in y .. z do" verwenden?
es: Símbolo "= " inesperado en la expresión. ¿Quería usar "for x in y .. z do" en su lugar?
fr: Symbole '=' inattendu dans l'expression. Souhaitiez-vous utiliser 'for x in y .. z do' à la place ?
it: Simbolo '=' imprevisto nell'espressione. Si intendeva usare 'for x in y .. z do'?
ja: 式の予期しない記号 '='。代わりに 'for x in y .. z do' を使用するつもりでしたか?
ko: 식에 예기치 않은 '=' 기호가 있습니다. 대신 'for x in y .. z do'를 사용하려고 했나요?
pl: Nieoczekiwany symbol „=” w wyrażeniu. Czy w zamian planowano użycie instrukcji „for x in y .. z do”?
pt_br: Símbolo inesperado '=' na expressão. Você pretendia usar 'for x in y .. z do' em vez disso?
ru: Непредвиденный символ = в выражении. Возможно, предполагалось использовать for x in y .. z do?
tr: İfadede beklenmeyen '=' sembolü. Bunun yerine 'for x in y .. z do' kullanmak mı istemiştiniz?
zh_hans: 表达式中出现意外符号 "="。是否想要改用 "for x in y .. z do"?
zh_hant: 運算式中有非預期的符號 '='。您其實要使用 'for x in y .. z do' 嗎?

# keywordDescriptionAbstract
source: Indicates a method that either has no implementation in the type in which it is declared or that is virtual and has a default implementation.
cs: Označuje metodu, která buď nemá implementaci v typu, ve kterém je deklarovaná, nebo která je virtuální a má výchozí implementaci.
de: Gibt eine Methode an, die entweder im Typ, in dem sie deklariert wird, über keine Implementierung verfügt oder die virtuell ist und über eine Standardimplementierung verfügt.
es: Indica un método que no tiene ninguna implementación en el tipo en el que se declara o un método que es virtual y tiene una implementación predeterminada.
fr: Indique une méthode qui n'a aucune implémentation dans le type dans lequel elle est déclarée, ou qui est virtuelle avec une implémentation par défaut.
it: Indica un metodo per il quale non esiste alcuna implementazione nel tipo in cui viene dichiarato oppure che è virtuale e per il quale esiste un'implementazione predefinita.
ja: 宣言された型に実装がないメソッド、または既定の実装がある仮想のメソッドを示します。
ko: 선언된 형식에 구현이 없는 메서드 또는 기본 구현이 있는 가상 메서드를 나타냅니다.
pl: Wskazuje metodę, która nie ma implementacji w typie, w którym została zadeklarowana, lub jest wirtualna i ma implementację domyślną.
pt_br: Indica um método que não tem implementação no tipo no qual ele é declarado ou que é virtual e tem uma implementação padrão.
ru: Обозначает метод, который не имеет реализации в типе, в котором он объявлен, или является виртуальным и имеет реализацию по умолчанию.
tr: İçinde bildirildiği türde hiç uygulaması olmayan veya sanal olup varsayılan uygulaması olan bir metodu belirtir.
zh_hans: 表示一种方法，该方法在进行声明的类型中没有任何实现，或该方法为虚拟方法且包含默认实现。
zh_hant: 指出方法，此方法可能在其宣告的類型中沒有實作，或者是虛擬方法而具有預設實作。

# keyworkDescriptionAnd
source: Used in mutually recursive bindings, in property declarations, and with multiple constraints on generic parameters.
cs: Používá se ve vzájemně rekurzivních vazbách, v deklaracích vlastností a s několika omezeními u generických parametrů.
de: Wird in gegenseitig rekursiven Bindungen, in Eigenschaftendeklarationen und bei mehreren Beschränkungen in Bezug auf generische Parameter verwendet.
es: Se usa en enlaces mutuamente recursivos, en declaraciones de propiedad y con varias restricciones en parámetros genéricos.
fr: Utilisé dans les liaisons mutuellement récursives, dans les déclarations de propriété et avec plusieurs contraintes sur des paramètres génériques.
it: Usata in binding ricorsivi reciproci, dichiarazioni di proprietà e con più vincoli su parametri generici.
ja: 相互に再帰的なバインディング、プロパティの宣言、およびジェネリック パラメーターの複数の制約に使用します。
ko: 상호 재귀적 바인딩과 속성 선언에 사용되며 제네릭 매개 변수의 여러 제약 조건과 함께 사용됩니다.
pl: Używane w powiązaniach wzajemnie cyklicznych, deklaracjach właściwości oraz z wieloma ograniczeniami parametrów ogólnych.
pt_br: Usado em associações mutualmente recursivas, em declarações de propriedade e em múltiplas restrições em parâmetros genéricos.
ru: Используется во взаимно рекурсивных привязках, объявлениях свойств и с несколькими ограничениями для универсальных параметров.
tr: Karşılıklı yinelemeli bağlamalarda, özellik bildirimlerinde ve genel parametreler üzerinde birden çok kısıtlamayla kullanılır.
zh_hans: 用于互相递归绑定、属性声明，并用于对泛型参数的多个约束。
zh_hant: 用於互相遞迴的繫結、屬性宣告，以及搭配泛型參數的多個條件約束。

# keywordDescriptionAs
source: Used to give the current class object an object name. Also used to give a name to a whole pattern within a pattern match.
cs: Slouží k pojmenování objektu aktuální třídy. Používá se také k pojmenování celého vzoru v rámci porovnávání vzorů.
de: Wird verwendet, um für das aktuelle Klassenobjekt einen Objektnamen zu vergeben. Wird auch verwendet, um für ein gesamtes Muster innerhalb eines Musterabgleichs einen Namen zu vergeben.
es: Se usa para asignar un nombre de objeto al objeto de clase actual. También se usa para asignar un nombre a un patrón completo en una coincidencia de patrones.
fr: Permet de donner un nom d'objet à l'objet de classe actuel. Permet également de nommer un modèle complet dans un critère spécial.
it: Usata per assegnare un nome di oggetto all'oggetto classe corrente. Usata inoltre per assegnare un nome a un intero criterio nell'ambito dei criteri di ricerca.
ja: 現在のクラス オブジェクトにオブジェクト名を指定するために使用します。パターン マッチ内のパターン全体に名前を指定するためにも使用します。
ko: 현재 클래스 개체 및 개체 이름을 제공하는 데 사용됩니다. 패턴 일치 내의 전체 패턴에 이름을 제공하는 데에도 사용됩니다.
pl: Używane do nadawania nazwy bieżącemu obiektowi klasy oraz do nadawania nazwy całemu wzorcowi w obrębie dopasowania wzorca.
pt_br: Usado para dar ao objeto de classe atual um nome de objeto. Também usado para dar um nome para um padrão completo em uma correspondência de padrão.
ru: Используется для присвоения текущему объекту класса имени объекта. Также используется для присвоения имени всему шаблону в пределах сопоставления шаблонов.
tr: Geçerli sınıf nesnesine bir nesne adı vermek için kullanılır. Desen eşleştirmesi içindeki bir tam desene ad vermek için de kullanılır.
zh_hans: 用于向当前类对象提供对象名称。另外，也用于向模式匹配中的整个模式提供名称。
zh_hant: 用以提供物件名稱給目前的類別物件。也用以提供名稱給模式比對內的整個模式。

# keywordDescriptionAssert
source: Used to verify code during debugging.
cs: Slouží k ověření kódu během ladění.
de: Wird verwendet, um den Code während des Debuggens zu überprüfen.
es: Se usa para comprobar el código durante la depuración.
fr: Permet de vérifier le code durant le débogage.
it: Usata per verificare il codice durante il debug.
ja: デバッグ中のコードの検証に使用します。
ko: 디버그 중 코드를 확인하는 데 사용됩니다.
pl: Używane do weryfikowania kodu podczas debugowania.
pt_br: Usado para verificar o código durante a depuração.
ru: Используется для проверки кода во время отладки.
tr: Hata ayıklama sırasında kodu doğrulamak için kullanılır.
zh_hans: 用于在调试期间验证代码。
zh_hant: 用以在偵錯期間驗證程式碼。

# keywordDescriptionBase
source: Used as the name of the base class object.
cs: Používá se jako název objektu základní třídy.
de: Wird als Name des Basisklassenobjekts verwendet.
es: Se usa como nombre del objeto de clase base.
fr: Utilisé comme nom de l'objet de classe de base.
it: Usata come nome dell'oggetto classe di base.
ja: 基底クラス オブジェクトの名前として使用します。
ko: 기본 클래스 개체의 이름으로 사용됩니다.
pl: Używane jako nazwa obiektu klasy podstawowej.
pt_br: Usado como o nome do objeto de classe base.
ru: Используется в качестве имени объекта базового класса.
tr: Temel sınıf nesnesinin adı olarak kullanılır.
zh_hans: 用作基类对象的名称。
zh_hant: 用作基底類別物件的名稱。

# keywordDescriptionBegin
source: In verbose syntax, indicates the start of a code block.
cs: V podrobné syntaxi označuje začátek bloku kódu.
de: Gibt in ausführlicher Syntax den Start eines Codeblocks an.
es: En la sintaxis detallada, indica el inicio de un bloque de código.
fr: En syntaxe détaillée, indique le début d'un bloc de code.
it: Nella sintassi dettagliata indica l'inizio di un blocco di codice.
ja: 冗語構文で、コード ブロックの先頭を示します。
ko: 자세한 구문에서 코드 블록의 시작을 나타냅니다.
pl: W składni pełnej wskazuje początek bloku kodu.
pt_br: Na sintaxe detalhada, indica o começo de um bloco de código.
ru: В подробном синтаксисе обозначает начало блока кода.
tr: Ayrıntılı söz diziminde kod bloğunun başlangıcını gösterir.
zh_hans: 在详细语法中，指示程序块的开头。
zh_hant: 在詳細資訊語法中指定程式碼區塊的開頭。

# keywordDescriptionClass
source: In verbose syntax, indicates the start of a class definition.
cs: V podrobné syntaxi označuje začátek definice třídy.
de: Gibt in ausführlicher Syntax den Beginn einer Klassendefinition an.
es: En la sintaxis detallada, indica el inicio de una definición de clase.
fr: En syntaxe détaillée, indique le début d'une définition de classe.
it: Nella sintassi dettagliata indica l'inizio di una definizione di classe.
ja: 冗語構文で、クラス定義の始まりを示します。
ko: 자세한 구문에서 클래스 정의의 시작을 나타냅니다.
pl: W składni pełnej wskazuje początek definicji klasy.
pt_br: Na sintaxe detalhada, indica o começo de uma definição de classe.
ru: В подробном синтаксисе обозначает начало определения класса.
tr: Ayrıntılı söz diziminde, sınıf tanımının başlangıcını belirtir.
zh_hans: 在详细语法中，表示类定义的开头。
zh_hant: 在詳細資訊語法中，指出類別定義的開頭。

# keywordDescriptionDefault
source: Indicates an implementation of an abstract method; used together with an abstract method declaration to create a virtual method.
cs: Označuje implementaci abstraktní metody; společně s deklarací abstraktní metody se používá k vytvoření virtuální metody.
de: Gibt eine Implementierung einer abstrakten Methode an; wird gemeinsam mit einer abstrakten Methodendeklaration zum Erstellen einer virtuellen Methode verwendet.
es: Indica una implementación de un método abstracto. Se usa junto con una declaración de método abstracto para crear un método virtual.
fr: Indique l'implémentation d'une méthode abstraite et s'utilise avec une déclaration de méthode abstraite pour créer une méthode virtuelle.
it: Indica un'implementazione di un metodo astratto. Usata insieme a una dichiarazione di metodo astratto per creare un metodo virtuale.
ja: 抽象メソッドの実装を示します。抽象メソッドの宣言と同時に使用して仮想メソッドを作成します。
ko: 추상 메서드의 구현을 나타냅니다. 추상 메서드 선언과 함께 사용하여 가상 메서드를 만듭니다.
pl: Wskazuje implementację metody abstrakcyjnej; używane razem z deklaracją metody abstrakcyjnej do tworzenia metody wirtualnej.
pt_br: Indica uma implementação de um método abstrato; usado em conjunto com uma declaração de método abstrato para criar um método virtual.
ru: Обозначает реализацию абстрактного метода; используется вместе с объявлением абстрактного метода для создания виртуального метода.
tr: Soyut bir metodun uygulamasını belirtir; sanal metot oluşturmak üzere soyut metot bildirimi ile birlikte kullanılır.
zh_hans: 表示抽象方法的实现；与抽象方法声明配合使用可创建虚拟方法。
zh_hant: 指出抽象方法的實作; 與抽象方法宣告一併使用，以建立虛擬方法。

# keywordDescriptionDelegate
source: Used to declare a delegate.
cs: Slouží k deklaraci delegáta.
de: Wird verwendet, um einen Delegaten zu deklarieren.
es: Se usa para declarar un delegado.
fr: Permet de déclarer un délégué.
it: Usata per dichiarare un delegato.
ja: デリゲートの宣言に使用します。
ko: 대리자를 선언하는 데 사용됩니다.
pl: Używane do deklarowania delegata.
pt_br: Usada para declarar um delegado.
ru: Используется для объявления делегата.
tr: Bir temsilci bildirmek için kullanılır.
zh_hans: 用于声明委托。
zh_hant: 用以宣告委派。

# keywordDescriptionDo
source: Used in looping constructs or to execute imperative code.
cs: Používá se v konstruktorech cyklů nebo k provádění imperativního kódu.
de: Wird in Schleifenkonstrukten oder zum Ausführen von imperativem Code verwendet.
es: Se usa en construcciones de bucle o para ejecutar código imperativo.
fr: Utilisé dans les constructions de boucles ou pour exécuter du code impératif.
it: Usata in costrutti di ciclo oppure per eseguire codice imperativo.
ja: ループ コンストラクト、または命令型コードの実行に使用します。
ko: 루프 구문에 사용되거나 명령형 코드를 실행하기 위해 사용됩니다.
pl: Używane w konstrukcjach zapętlenia lub do wykonywania kodu imperatywnego.
pt_br: Usado em construções de looping ou para executar código imperativo.
ru: Используется в циклических конструкциях или для выполнения императивного кода.
tr: Döngü yapılarında veya kesinlik temelli kod yürütmek için kullanılır.
zh_hans: 用于循环构造或执行强制性代码。
zh_hant: 用於重複的建構或用以執行命令式程式碼。

# keywordDescriptionDone
source: In verbose syntax, indicates the end of a block of code in a looping expression.
cs: V podrobné syntaxi označuje konec bloku kódu ve výrazu cyklu.
de: Gibt in ausführlicher Syntax das Ende eines Codeblocks in einem Schleifenausdruck an.
es: En la sintaxis detallada, indica el final de un bloque de código en una expresión de bucle.
fr: En syntaxe détaillée, indique la fin d'un bloc de code dans une expression de boucle.
it: Nella sintassi dettagliata indica la fine di un blocco di codice in un'espressione di ciclo.
ja: 冗語構文で、ループ式のコード ブロックの末尾を示します。
ko: 자세한 구문에서 루프 식의 코드 블록 끝을 나타냅니다.
pl: W składni pełnej wskazuje koniec bloku kodu w wyrażeniu zapętlenia.
pt_br: Na sintaxe detalhada, indica o fim de um bloco de código em uma expressão de looping.
ru: В подробном синтаксисе обозначает окончание блока кода в циклическом выражении.
tr: Ayrıntılı söz diziminde, döngü ifadesindeki bir kod bloğunun sonunu gösterir.
zh_hans: 在详细语法中，表示循环表达式中程序块的结尾。
zh_hant: 在詳細資訊語法中，指出重複運算式中程式碼區塊的結尾。

# keywordDescriptionDowncast
source: Used to convert to a type that is lower in the inheritance chain.
cs: Slouží k převodu na typ, který je na nižší pozici v řetězu dědičnosti.
de: Wird zum Konvertieren in einen Typ verwendet, der in Vererbungskette höher ist.
es: Se usa para realizar la conversión a un tipo situado en un nivel inferior de la cadena de herencia.
fr: Permet de convertir en un type inférieur dans la chaîne d'héritage.
it: Usata per eseguire la conversione in un tipo che occupa una posizione più bassa nella catena di ereditarietà.
ja: 継承チェーン内の下位の型に変換するために使用します。
ko: 상속 체인에서 더 낮은 형식으로 변환하는 데 사용됩니다.
pl: Używane do konwertowania na typ znajdujący się niżej w łańcuchu dziedziczenia.
pt_br: Usada para converter para um tipo que é inferior na cadeia de herança.
ru: Используется для преобразования в тип, который находится ниже в цепочке наследования.
tr: Devralma zincirinde daha aşağıda bulunan bir türe dönüştürmek için kullanılır.
zh_hans: 用于转换为较低继承链中的类型。
zh_hant: 用以將類型轉換為繼承鏈結中較低的類型。

# keywordDescriptionDownto
source: In a for expression, used when counting in reverse.
cs: Slouží k počítání pozpátku ve výrazu for.
de: Wird in einem for-Ausdruck beim Rückwährtszählen verwendet.
es: En una expresión for, se usa al contar en orden inverso.
fr: Dans une expression for, permet de compter en sens inverse.
it: Usata in un'espressione for per il conteggio in ordine inverso.
ja: for 式で、逆方向にカウントするときに使用します。
ko: for 식에서 역으로 계산할 때 사용됩니다.
pl: W wyrażeniu for używane podczas liczenia w kolejności odwrotnej.
pt_br: Em uma expressão, usado ao contar regressivamente.
ru: В выражении for используется для счета в обратном порядке.
tr: Bir for ifadesinde, tersten sayım sırasında kullanılır.
zh_hans: 在 for 表达式中，在反向计数时使用。
zh_hant: 在 for 運算式中，在倒數時使用。

# keywordDescriptionElif
source: Used in conditional branching. A short form of else if.
cs: Používá se v podmíněném větvení. Krátká forma výrazu else if.
de: Wird in Verzweigungskonstrukten verwendet. Eine Kurzform von "else if".
es: Se usa en la creación de ramas condicional. Es una forma abreviada de else if.
fr: Utilisé dans la création de branche conditionnelle. Forme abrégée d'else if.
it: Usata nella diramazione condizionale. Forma abbreviata di else if.
ja: 条件分岐で使用します。else if の短い形式です。
ko: 조건부 분기에 사용됩니다. else if의 약식입니다.
pl: Używane w rozgałęzianiu warunkowym. Krótka postać instrukcji else if.
pt_br: Usado em ramificação condicional. Uma forma abreviada de else if.
ru: Используется в условном ветвлении. Краткая форма else if.
tr: Koşullu dallanmada kullanılır. else if'in kısa bir biçimidir.
zh_hans: 用于条件性分支。Else if 的缩写形式。
zh_hant: 用於條件式分支。else if 的簡短形式。

# keywordDescriptionElse
source: Used in conditional branching.
cs: Používá se v podmíněném větvení.
de: Wird in Verzweigungskonstrukten verwendet.
es: Se usa en la creación de ramas condicional.
fr: Utilisé dans la création de branche conditionnelle.
it: Usata nella diramazione condizionale.
ja: 条件分岐で使用します。
ko: 조건부 분기에 사용됩니다.
pl: Używane w rozgałęzianiu warunkowym.
pt_br: Usado em ramificação condicional.
ru: Используется в условном ветвлении.
tr: Koşullu dallanmada kullanılır.
zh_hans: 用于条件性分支。
zh_hant: 用於條件式分支。
