Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# tcInvalidMemberName
source: The name '({0})' should not be used as a member name. If defining a static member for use from other CLI languages then use the name '{1}' instead.
cs: ({0}) není vhodný název pro člena. Pokud definujete statického člena, který se má použít z jiných jazyků CLI, použijte místo toho název {1}.
de: Der Name "({0})" sollte nicht als Membername verwendet werden. Verwenden Sie zum Definieren eines statischen Members für die Verwendung durch andere CLI-Sprachen stattdessen den Namen "{1}".
es: El nombre '({0})' no debe usarse como un nombre de miembro. Si define un miembro estático para usarlo desde otros lenguajes CLI, use el nombre '{1}' en su lugar.
fr: Le nom '({0})' ne doit pas être utilisé en tant que nom de membre. Si vous définissez un membre statique à utiliser à partir d'autres langages CLI, utilisez le nom '{1}' à la place.
it: Il nome '({0})' non può essere usato come nome di membro. Se si definisce un membro statico per l'uso da parte di altri linguaggi CLI, usare il nome '{1}'.
ja: 名前 '({0})' はメンバー名として使用しないでください。他の CLI 言語から使用するために静的メンバーを定義する場合、代わりに '{1}' という名前を使用してください。
ko: 이름 '({0})'은(는) 멤버 이름으로 사용하면 안 됩니다. 다른 CLI 언어를 통해 사용할 정적 멤버를 정의하는 경우에는 이름 '{1}'을(를) 대신 사용하세요.
pl: Nazwa „({0})” nie powinna być używana jako nazwa elementu członkowskiego. W przypadku definiowania statycznego elementu członkowskiego do użycia z innych języków CLI użyj nazwy „{1}”.
pt_br: O nome '({0})' não deve ser usado como um nome de membro. Se for definir um membro estático para uso em outras linguagens CLI, use o nome '{1}'.
ru: Имя "({0})" не может использоваться в качестве имени элемента. При определении статического элемента для использования из других языков CLI, используйте имя "{1}".
tr: ({0})' adı üye adı olarak kullanılmamalıdır. Diğer CLI dillerinden kullanılacak statik bir üye tanımlıyorsanız onun yerine '{1}' adını kullanın.
zh_hans: 名称“({0})”不应用作成员名称。如果从其他 CLI 语言中定义了要使用的静态成员，请改用名称“{1}”。
zh_hant: 名稱 '({0})' 不應該做為成員名稱使用。如果要定義靜態成員以用於其他 CLI 語言，請改用名稱 '{1}'。

# tcInvalidMemberNameFixedTypes
source: The name '({0})' should not be used as a member name because it is given a standard definition in the F# library over fixed types
cs: ({0}) není vhodný název pro člena, protože se mu v knihovně F# prostřednictvím pevných typů předává standardní definice.
de: Der Name "({0})" sollte nicht als Membername verwendet werden, weil in der F#-Bibliothek eine Standarddefinition für feste Typen dafür vergeben wird.
es: El nombre '({0})' no debe usarse como un nombre de miembro porque se le da una definición estándar en la biblioteca de F# sobre tipos fijos.
fr: Le nom '({0})' ne doit pas être utilisé en tant que nom de membre, car il reçoit une définition standard dans la bibliothèque F# sur les types fixes
it: Il nome '({0})' non può essere usato come nome di membro perché è associato a una definizione standard nella libreria F# sui tipi fissi
ja: 名前 '({0})' はメンバー名として使用しないでください。固定の型に関して、F# ライブラリではこの名前は標準的な定義が指定されています。
ko: 이름 '({0})'에는 고정 형식에 대한 F# 라이브러리의 표준 정의가 지정되어 있으므로 해당 이름을 멤버 이름으로 사용하면 안 됩니다.
pl: Nazwa „({0})” nie powinna być używana jako nazwa elementu członkowskiego, ponieważ ma standardową definicję w bibliotece języka F# dla typów stałych
pt_br: O nome '({0})' não deve ser usado como um nome de membro porque ele é dado a uma definição padrão na biblioteca F# sobre tipos fixos
ru: Имя "({0})" не должно использоваться в качестве имени элемента, так как оно получает стандартное определение в библиотеке F# поверх исправленных типов
tr: '({0})' adına F# kitaplığında sabit türler üzerinden standart bir tanım verildiği için üye adı olarak kullanılmamalıdır
zh_hans: 名称“({0})”不应用作成员名称，因为在 F# 库中为此名称给定了针对固定类型的标准定义
zh_hant: 名稱 '({0})' 不應該做為成員名稱使用，因為已經在 F# 程式庫中透過固定類型為它指定標準定義

# tcInvalidOperatorDefinitionRelational
source: The '{0}' operator should not normally be redefined. To define overloaded comparison semantics for a particular type, implement the 'System.IComparable' interface in the definition of that type.
cs: Operátor {0} se nedoporučuje předefinovávat. Pokud chcete definovat přetíženou sémantiku porovnání pro určitý typ, implementujte rozhraní System.IComparable v definici tohoto typu.
de: Der {0}-Operator sollte normalerweise nicht umdefiniert werden. Implementieren Sie zum Definieren der überladenen Vergleichssemantik für einen bestimmten Typ die System.IComparable-Schnittstelle in der Definition dieses Typs.
es: Normalmente, el operador '{0}' no se debe redefinir. Para definir semántica de comparación sobrecargada para un tipo concreto, implemente la interfaz 'System.IComparable' en la definición de ese tipo.
fr: Normalement, l'opérateur '{0}' ne doit pas être redéfini. Pour définir une sémantique de comparaison surchargée pour un type particulier, implémentez l'interface 'System.IComparable' dans la définition de ce type.
it: In genere, l'operatore '{0}' non deve essere ridefinito. Per definire semantica di confronto con overload per un determinato tipo, implementare l'interfaccia 'System.IComparable' nella definizione del tipo stesso.
ja: 通常、'{0}' 演算子は再定義できません。特定の型について、オーバーロードされた比較セマンティクスを定義するには、その型の定義で 'System.IComparable' インターフェイスを実装してください。
ko: '{0}' 연산자는 일반적으로 다시 정의하면 안 됩니다. 특정 형식에 대한 오버로드된 비교 의미 체계를 정의하려면 해당 형식의 정의에서 'System.IComparable' 인터페이스를 구현하세요.
pl: Zwykle nie należy ponownie definiować operatora „{0}”. Aby zdefiniować semantykę porównania z przeciążeniem dla określonego typu, zaimplementuj interfejs „System.IComparable” w definicji tego typu.
pt_br: O operador '{0}' não deve ser referenciado normalmente. Para definir semânticas de comparação sobrecarregadas para um tipo particular, implemente a interface 'System.IComparable' na definição deste tipo.
ru: Оператор "{0}" обычно не должен быть переопределен. Чтобы определить для типа семантику сравнения, реализуйте интерфейс "System.IComparable" в определении этого типа.
tr: '{0}' işleci normalde yeniden tanımlanmamalıdır. Belirli bir türün aşırı yüklenmiş karşılaştırma semantiğini tanımlamak için o türün tanımında 'System.IComparable' arabirimini uygulayın.
zh_hans: 通常不应重新定义“{0}”运算符。若要为类型定义重载的比较语义，请在该类型的定义中实现“System.IComparable”接口。
zh_hant: 通常不應該重新定義 '{0}' 運算子。若要定義特定類型的多載比較語意，請在該類型的定義中實作 'System.IComparable' 介面。

# tcInvalidOperatorDefinitionEquality
source: The '{0}' operator should not normally be redefined. To define equality semantics for a type, override the 'Object.Equals' member in the definition of that type.
cs: Operátor {0} se nedoporučuje předefinovávat. Pokud chcete definovat sémantiku rovnosti pro typ, přepište člena Object.Equals v definici tohoto typu.
de: Der {0}-Operator sollte normalerweise nicht umdefiniert werden. Überschreiben Sie zum Definieren der Gleichheitssemantik für einen Typ den Object.Equals-Member in der Definition dieses Typs.
es: Normalmente, el operador '{0}' no se debe redefinir. Para definir semántica de igualdad para un tipo, invalide el miembro 'Object.Equals' en la definición de ese tipo.
fr: Normalement, l'opérateur '{0}' ne doit pas être redéfini. Pour définir une sémantique d'égalité pour un type, substituez le membre 'Object.Equals' dans la définition de ce type.
it: In genere, l'operatore '{0}' non deve essere ridefinito. Per definire semantica di uguaglianza per un tipo, eseguire l'override del membro 'Object.Equals' nella definizione del tipo stesso.
ja: 通常、'{0}' 演算子は再定義できません。型の等値セマンティクスを定義するには、その型の定義で 'Object.Equals' メンバーをオーバーライドしてください。
ko: '{0}' 연산자는 일반적으로 다시 정의하면 안 됩니다. 형식에 대한 같음 의미 체계를 정의하려면 해당 형식의 정의에서 'Object.Equals' 멤버를 재정의하세요.
pl: Zwykle nie należy ponownie definiować operatora „{0}”. Aby zdefiniować semantykę równości dla typu, przesłoń element członkowski „Object.Equals” w definicji tego typu.
pt_br: O operador '{0}' não deve ser referenciado normalmente. Para definir semânticas de igualdade para um tipo, substitua o membro 'Object.Equals' na definição deste tipo.
ru: Оператор "{0}" обычно не должен быть переопределен. Чтобы определить для типа семантику равенства, переопределите элемент "Object.Equals" в определении этого типа.
tr: '{0}' işleci normalde yeniden tanımlanmamalıdır. Bir türün eşitlik semantiğini tanımlamak için o türün tanımında 'Object.Equals' üyesini geçersiz kılın.
zh_hans: 通常不应重新定义“{0}”运算符。若要为类型定义相等语义，请在该类型的定义中重写“Object.Equals”成员。
zh_hant: 通常不應該重新定義 '{0}' 運算子。若要定義類型的相等語意，請在該類型的定義中覆寫 'Object.Equals' 成員。

# tcInvalidOperatorDefinition
source: The '{0}' operator should not normally be redefined. Consider using a different operator name
cs: Operátor {0} se nedoporučuje předefinovávat. Zvažte použití jiného názvu operátoru.
de: Der {0}-Operator sollte normalerweise nicht umdefiniert werden. Verwenden Sie einen anderen Operatornamen.
es: Normalmente, el operador '{0}' no se debe redefinir. Considere el uso de un nombre de operador diferente.
fr: Normalement, l'opérateur '{0}' ne doit pas être redéfini. Utilisez un autre nom d'opérateur
it: In genere, l'operatore '{0}' non deve essere ridefinito. Provare a utilizzare un altro nome di operatore
ja: 通常、'{0}' 演算子は再定義できません。別の演算子名を使用してください。
ko: '{0}' 연산자는 일반적으로 다시 정의하면 안 됩니다. 다른 연산자 이름을 사용하세요.
pl: Zwykle nie należy ponownie definiować operatora „{0}”. Rozważ użycie innej nazwy operatora
pt_br: O operador '{0}' não deve ser referenciado normalmente. Considere usar um nome de operador diferente
ru: Оператор "{0}" обычно не должен быть переопределен. Рекомендуется использовать другое имя оператора
tr: '{0}' işleci normalde yeniden tanımlanmamalıdır. Farklı bir işleç adı kullanmayı düşünün
zh_hans: 通常不应重新定义“{0}”运算符。请考虑使用其他运算符名称
zh_hant: 通常不應該重新定義 '{0}' 運算子。請考慮使用其他運算子名稱

# tcInvalidIndexOperatorDefinition
source: The '{0}' operator cannot be redefined. Consider using a different operator name
cs: Operátor {0} se nedá předefinovat. Zvažte možnost použití jiného názvu operátoru.
de: Der {0}-Operator kann nicht umdefiniert werden. Verwenden Sie einen anderen Operatornamen.
es: El operador '{0}' no se puede redefinir. Considere el uso de un nombre de operador diferente.
fr: Impossible de redéfinir l'opérateur '{0}'. Utilisez un autre nom d'opérateur
it: Non è possibile ridefinire l'operatore '{0}'. Provare a usare un altro nome di operatore
ja: '{0}' 演算子は再定義できません。別の演算子名を使用してください。
ko: '{0}' 연산자를 다시 정의할 수 없습니다. 다른 연산자 이름을 사용하세요.
pl: Nie można ponownie zdefiniować operatora „{0}”. Rozważ użycie innej nazwy operatora
pt_br: O operador '{0}' não pode ser redefinido. Considere usar um nome de operador diferente
ru: Оператор "{0}" не может быть переопределен. Рекомендуется использовать другое имя оператора
tr: '{0}' işleci yeniden tanımlanamaz. Farklı bir işleç adı kullanmayı düşünün
zh_hans: 无法重定义“{0}”运算符。请考虑使用其他运算符名称
zh_hant: 不能重新定義 '{0}' 運算子。請考慮使用其他運算子名稱

# tcExpectModuleOrNamespaceParent
source: Expected module or namespace parent {0}
cs: Očekával se nadřazený prvek modulu nebo oboru názvů {0}.
de: Ein übergeordnetes Modul oder ein übergeordneter Namespace "{0}" wurde erwartet.
es: Se esperaba un primario de espacio de nombres o módulo {0}.
fr: Parent de module ou d'espace de noms attendu {0}
it: Previsto elemento padre di modulo o spazio dei nomi {0}
ja: モジュールまたは名前空間の親 {0} を指定してください
ko: 모듈 또는 네임스페이스 부모 {0}이(가) 필요합니다.
pl: Oczekiwano elementu nadrzędnego modułu lub przestrzeni nazw {0}
pt_br: Pai de módulo ou namespace {0} esperado
ru: Требуется модуль или родительский элемент пространства имен {0}
tr: Modül veya ad alanı üst öğesi {0} bekleniyordu
zh_hans: 应为模块或命名空间父级 {0}
zh_hant: 必須是模組或命名空間父代 {0}

# tcImplementsIComparableExplicitly
source: The struct, record or union type '{0}' implements the interface 'System.IComparable' explicitly. You must apply the 'CustomComparison' attribute to the type.
cs: Typ struktura, záznam nebo sjednocení {0} implementuje explicitně rozhraní System.IComparable. Pro tento typ musíte použít atribut CustomComparison.
de: Der Struktur-, Datensatz- oder Union-Typ "{0}" implementiert die System.IComparable-Schnittstelle explizit. Sie müssen das CustomComparison-Attribut auf den Typ anwenden.
es: El tipo de struct, registro o unión '{0}' implementa la interfaz 'System.IComparable' de forma explícita. Debe aplicar el atributo 'CustomComparison' al tipo.
fr: Le type struct, enregistrement ou union '{0}' implémente explicitement l'interface 'System.IComparable'. Vous devez appliquer l'attribut 'CustomComparison' au type.
it: Il tipo di struct, record o unione '{0}' implementa l'interfaccia 'System.IComparable' in modo esplicito. È necessario applicare l'attributo 'CustomComparison' al tipo.
ja: 構造体型、レコード型、または共用体型の '{0}' はインターフェイス 'System.IComparable' を明示的に実装しています。この型には 'CustomComparison' 属性を適用する必要があります。
ko: 구조체, 레코드 또는 공용 구조체 형식 '{0}'은(는) 'System.IComparable' 인터페이스를 명시적으로 구현합니다. 형식에 'CustomComparison' 특성을 적용해야 합니다.
pl: Typ struktury, rekordu lub unii „{0}” zawiera jawną implementację interfejsu „System.IComparable”. Musisz zastosować atrybut „CustomComparison” do typu.
pt_br: O tipo struct, registro ou união '{0}' implementa explicitamente a interface 'System.IComparable'. Você deve aplicar o atributo 'CustomComparison' ao tipo.
ru: Тип структуры, записи или объединения "{0}" явно реализует интерфейс "System.IComparable". Необходимо применить к типу атрибут "CustomComparison".
tr: Yapı, kayıt veya birleşim türü '{0}', 'System.IComparable' arabirimini açık olarak uyguluyor. Türe 'CustomComparison' özniteliğini uygulamanız gerekir.
zh_hans: 结构、记录或联合类型“{0}”显式实现接口“System.IComparable”。您必须将“CustomComparison”特性应用于相应的类型。
zh_hant: 結構、記錄或等位型別 '{0}' 明確實作了介面 'System.IComparable'。您必須將 'CustomComparison' 屬性套用到該型別。

# tcImplementsGenericIComparableExplicitly
source: The struct, record or union type '{0}' implements the interface 'System.IComparable<_>' explicitly. You must apply the 'CustomComparison' attribute to the type, and should also provide a consistent implementation of the non-generic interface System.IComparable.
cs: Typ struktury, záznamu nebo sjednocení {0} explicitně implementuje rozhraní System.IComparable<_>. Pro typ je třeba použít atribut CustomComparison a měli byste také poskytnout konzistentní implementaci neobecného rozhraní System.IComparable.
de: Der Struktur-, Datensatz- oder Union-Typ "{0}" implementiert die "System.IComparable<_>"-Schnittstelle explizit. Sie müssen das CustomComparison-Attribut auf den Typ anwenden und sollten außerdem eine einheitliche Implementierung der nicht generischen System.IComparable-Schnittstelle bereitstellen.
es: El tipo de estructura, registro o unión "{0}" implementa la interfaz "System.IComparable<_>" explícitamente. Debe aplicar el atributo "CustomComparison" al tipo y también debe proporcionar una implementación coherente de la interfaz no genérica System.IComparable.
fr: Le type de struct, d'enregistrement ou d'union '{0}' implémente l'interface 'System.IComparable<_>' explicitement. Vous devez appliquer l'attribut 'CustomComparison' au type et fournir une implémentation cohérente de l'interface non générique System.IComparable.
it: Il tipo di struct, record o unione '{0}' implementa l'interfaccia 'System.IComparable<_>' in modo esplicito. È necessario applicare l'attributo 'CustomComparison' al tipo, nonché fornire un'implementazione coerente dell'interfaccia non generica System.IComparable.
ja: 構造体型、レコード型、または共用体型の '{0}' はインターフェース 'System.IComparable<_>' を明示的に実装しています。この型には 'CustomComparison' 属性を適用し、さらに整合性のある非ジェネリック インターフェース System.IComparable の実装を用意する必要があります。
ko: 구조체, 레코드 또는 공용 구조체 형식 '{0}'은(는) 'System.IComparable<_>' 인터페이스를 명시적으로 구현합니다. 형식에 'CustomComparison' 특성을 적용하고 제네릭이 아닌 인터페이스 System.IComparable에 대한 일관된 구현도 제공해야 합니다.
pl: Typ struktury, rekordu lub unii „{0}” zawiera jawną implementację interfejsu „System.IComparable<_>”. Musisz zastosować atrybut „CustomComparison” do typu i określić spójną implementację nieogólnego interfejsu System.IComparable.
pt_br: O struct, registro ou tipo de união '{0}' implementa a interface 'System.IComparable<_>' explicitamente. Você deve aplicar o atributo 'CustomComparison' ao tipo e fornecer uma implementação consistente da interface não genérica System.IComparable.
ru: Тип структуры, записи или объединения '{0}' явно реализует интерфейс 'System.IComparable<_>'. Необходимо применить атрибут 'CustomComparison' к типу и подготовить постоянную реализацию необщего интерфейса System.IComparable.
tr: Yapı, kayıt veya birleşim türü '{0}', 'System.IComparable<_>' arabirimini açıkça uyguluyor. Türe 'CustomComparison' özniteliğini uygulamalı ve aynı zamanda genel olmayan System.IComparable arabiriminin tutarlı bir uygulamasını sağlamalısınız.
zh_hans: 结构、记录或联合类型“{0}”显式实现接口 "System.IComparable<_>"。必须将 "CustomComparison" 属性应用于该类型，还应提供非泛型接口 System.IComparable 的一致实现。
zh_hant: 結構、記錄或等位型別 '{0}' 會明確實作介面 'System.IComparable<_>'。您必須將 'CustomComparison' 屬性套用到類型，也應提供一致的非泛型介面 System.IComparable 實作。

# tcImplementsIStructuralComparableExplicitly
source: The struct, record or union type '{0}' implements the interface 'System.IStructuralComparable' explicitly. Apply the 'CustomComparison' attribute to the type.
cs: Typ struktura, záznam nebo sjednocení {0} implementuje explicitně rozhraní System.IStructuralComparable. Použijte pro tento typ atribut CustomComparison.
de: Der Struktur-, Datensatz- oder Union-Typ "{0}" implementiert die System.IStructuralComparable-Schnittstelle explizit. Wenden Sie das CustomComparison-Attribut auf den Typ an.
es: El tipo de struct, registro o unión '{0}' implementa la interfaz 'System.IStructuralComparable' de forma explícita. Aplique el atributo 'CustomComparison' al tipo.
fr: Le type struct, enregistrement ou union '{0}' implémente explicitement l'interface 'System.IStructuralComparable'. Appliquez l'attribut 'CustomComparison' au type.
it: Il tipo di struct, record o unione '{0}' implementa l'interfaccia 'System.IStructuralComparable' in modo esplicito. Applicare l'attributo 'CustomComparison' al tipo.
ja: 構造体型、レコード型、または共用体型の '{0}' はインターフェイス 'System.IStructuralComparable' を明示的に実装しています。この型には 'CustomComparison' 属性を適用してください。
ko: 구조체, 레코드 또는 공용 구조체 형식 '{0}'은(는) 'System.IStructuralComparable' 인터페이스를 명시적으로 구현합니다. 형식에 'CustomComparison' 특성을 적용하세요.
pl: Typ struktury, rekordu lub unii „{0}” zawiera jawną implementację interfejsu „System.IStructuralComparable”. Zastosuj atrybut „CustomComparison” do typu.
pt_br: O tipo de struct, registro ou união '{0}' implementa explicitamente a interface 'System.IStructuralComparable'. Aplique o atributo 'CustomComparison' ao tipo.
ru: Тип структуры, записи или объединения "{0}" явно реализует интерфейс "System.IStructuralComparable". Необходимо применить к типу атрибут "CustomComparison".
tr: Yapı, kayıt veya birleşim türü '{0}', 'System.IStructuralComparable' arabirimini açık olarak uyguluyor. Türe 'CustomComparison' özniteliğini uygulayın.
zh_hans: 结构、记录或联合类型“{0}”显式实现接口“System.IStructuralComparable”。将“CustomComparison”特性应用于相应的类型。
zh_hant: 結構、記錄或等位型別 '{0}' 明確實作了介面 'System.IStructuralComparable'。請將 'CustomComparison' 屬性套用到該型別。

# tcRecordFieldInconsistentTypes
source: This record contains fields from inconsistent types
cs: Tento záznam obsahuje pole z nekonzistentních typů.
de: Dieser Datensatz enthält Felder aus inkonsistenten Typen.
es: Este registro contiene campos de tipos incoherentes.
fr: Cet enregistrement contient des champs de types incohérents
it: Questo record contiene campi di tipi incoerenti
ja: このレコードには、相反する型からのフィールドが含まれます
ko: 이 레코드에는 일관성이 없는 형식의 필드가 포함되어 있습니다.
pl: Ten rekord zawiera pola niespójnych typów
pt_br: Este registro contém campos de tipos inconsistentes
ru: Данная запись содержит поля из несогласованных типов
tr: Bu kayıt tutarsız türlere ait alanlar içeriyor
zh_hans: 此记录包含来自不一致的类型的字段
zh_hant: 這個記錄包含來自不一致類型的欄位

# tcDllImportStubsCannotBeInlined
source: DLLImport stubs cannot be inlined
cs: Provizorní kódy DLLImport nemůžou být vložené.
de: DLLImport-Stubs können nicht inline gesetzt werden.
es: Los códigos auxiliares DLLImport no se pueden establecer como inline.
fr: Impossible d'utiliser des stubs DLLImport inline
it: Non è possibile impostare come inline gli stub DLLImport
ja: DLLImport スタブはインライン展開できません
ko: DLLImport 스텁은 인라인할 수 없습니다.
pl: Klasy zastępcze DLLImport nie mogą być śródwierszowe
pt_br: Stubs DLLImport não podem ser embutidos
ru: Заглушки DLLImport не могут быть подставлены
tr: DLLImport saplamaları satır içine alınamaz
zh_hans: 无法内联 DLLImport 存根
zh_hant: 無法內嵌 DLLImport Stub

# tcStructsCanOnlyBindThisAtMemberDeclaration
source: Structs may only bind a 'this' parameter at member declarations
cs: Struktury můžou u deklarací členů vázat jenom parametr this.
de: Strukturen dürfen einen this-Parameter nur in Memberdeklarationen binden.
es: Los structs solo pueden enlazar un parámetro 'this' en declaraciones de miembro.
fr: Les structs ne peuvent lier un paramètre 'this' que dans les déclarations de membre
it: Gli struct possono eseguire il binding solo di un parametro 'this' in dichiarazioni di membro
ja: 構造体は、メンバーの宣言の 'this' パラメーターのみをバインドできます
ko: 구조체는 멤버 선언에서만 'this' 매개 변수를 바인딩할 수 있습니다.
pl: Struktury mogą tylko tworzyć powiązanie parametru „this” w deklaracjach elementów członkowskich
pt_br: Os structs só podem vincular um parâmetro 'this' em declarações de membros
ru: Структуры могут выполнять привязку параметра "this" только в объявлениях элементов
tr: Yapılar üye bildirimlerinde yalnızca 'this' parametresini bağlayabilirler
zh_hans: 结构只能在成员声明中绑定“this”参数
zh_hant: 結構只能在成員宣告中繫結 'this' 參數

# tcUnexpectedExprAtRecInfPoint
source: Unexpected expression at recursive inference point
cs: Neočekávaný výraz v místě rekurzivního odvození
de: Unerwarteter Ausdruck bei rekursivem Rückschlusspunkt.
es: Expresión inesperada en punto de inferencia recursiva.
fr: Expression inattendue au point d'inférence récursif
it: Espressione non prevista in punto di inferenza ricorsiva
ja: 再帰的推論ポイントに予期しない式があります:
ko: 재귀적 유추 지점에 예기치 않은 식이 있습니다.
pl: Nieoczekiwane wyrażenie w punkcie wnioskowania cyklicznego
pt_br: Expressão inesperada no ponto de inferência recursiva
ru: Недопустимое выражение в точке рекурсивного выведения
tr: Özyinelemeli çıkarım noktasında beklenmeyen ifade
zh_hans: 递归推理点中的意外的表达式
zh_hant: 於遞迴推斷點有未預期的運算式
