Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# fscKeyFileWarning
source: Option '--keyfile' overrides attribute 'System.Reflection.AssemblyKeyFileAttribute' given in a source file or added module
cs: Možnost --keyfile přepisuje atribut System.Reflection.AssemblyKeyFileAttribute předaný ve zdrojovém souboru nebo přidaném modulu.
de: Die Option '--keyfile' überschreibt das Attribut 'System.Reflection.AssemblyKeyFileAttribute', das in einer Quelldatei oder einem hinzugefügten Modul angegeben wurde.
es: La opción '--keyfile' invalida el atributo 'System.Reflection.AssemblyKeyFileAttribute' proporcionado en un archivo de código fuente o un módulo agregado.
fr: L'option '--keyfile' remplace l'attribut 'System.Reflection.AssemblyKeyFileAttribute' fourni dans un fichier source ou un module ajouté
it: L'opzione '--keyfile' esegue l'override dell'attributo 'System.Reflection.AssemblyKeyFileAttribute' specificato in un file di codice sorgente o in un modulo aggiunto
ja: ソース ファイルまたは追加されたモジュールに指定された 'System.Reflection.AssemblyKeyFileAttribute' 属性は、'--keyfile' オプションでオーバーライドされます
ko: '--keyfile' 옵션은 소스 파일 또는 추가 모듈에 지정된 'System.Reflection.AssemblyKeyFileAttribute' 특성을 재정의합니다.
pl: Opcja „--keyfile” przesłania atrybut „System.Reflection.AssemblyKeyFileAttribute” podany w pliku źródłowym lub dodanym module
pt_br: A opção '--keyfile' substitui o atributo 'System.Reflection.AssemblyKeyFileAttribute' fornecido em um módulo adicionado ou arquivo de origem
ru: Параметр --keyfile переопределяет атрибут System.Reflection.AssemblyKeyFileAttribute, заданный в файле с исходным кодом или в добавленном модуле
tr: '--keyfile' seçeneği kaynak dosyasında veya ekli modülde verilen 'System.Reflection.AssemblyKeyFileAttribute' özniteliğini geçersiz kılar
zh_hans: 选项“--keyfile”将重写源文件或添加的模块中给定的“System.Reflection.AssemblyKeyFileAttribute”特性
zh_hant: 選項 '--keyfile' 會覆寫原始程式檔或加入的模組中指定的屬性 'System.Reflection.AssemblyKeyFileAttribute'

# fscKeyNameWarning
source: Option '--keycontainer' overrides attribute 'System.Reflection.AssemblyNameAttribute' given in a source file or added module
cs: Možnost --keycontainer přepisuje atribut System.Reflection.AssemblyNameAttribute předaný ve zdrojovém souboru nebo přidaném modulu.
de: Die Option '--keycontainer' überschreibt das Attribut 'System.Reflection.AssemblyNameAttribute', das in einer Quelldatei oder einem hinzugefügten Modul angegeben wurde.
es: La opción '--keycontainer' invalida el atributo 'System.Reflection.AssemblyNameAttribute' proporcionado en un archivo de código fuente o un módulo agregado.
fr: L'option '--keycontainer' remplace l'attribut 'System.Reflection.AssemblyNameAttribute' fourni dans un fichier source ou un module ajouté
it: L'opzione '--keycontainer' esegue l'override dell'attributo 'System.Reflection.AssemblyNameAttribute' specificato in un file di codice sorgente o in un modulo aggiunto
ja: ソース ファイルまたは追加されたモジュールに指定された 'System.Reflection.AssemblyNameAttribute' 属性は、'--keycontainer' オプションでオーバーライドされます
ko: '--keycontainer' 옵션은 소스 파일이나 추가 모듈에 지정된 'System.Reflection.AssemblyNameAttribute' 특성을 재정의합니다.
pl: Opcja „--keycontainer” przesłania atrybut „System.Reflection.AssemblyNameAttribute” podany w pliku źródłowym lub dodanym module
pt_br: A opção '--keycontainer' substitui o atributo 'System.Reflection.AssemblyNameAttribute' fornecido em um módulo adicionado ou arquivo de origem
ru: Параметр --keycontainer переопределяет атрибут System.Reflection.AssemblyNameAttribute, заданный в файле с исходным кодом или добавленном модуле
tr: '--keycontainer' seçeneği kaynak dosyasında veya ekli modülde verilen 'System.Reflection.AssemblyNameAttribute' özniteliğini geçersiz kılar
zh_hans: 选项“--keycontainer”将重写源文件或添加的模块中给定的“System.Reflection.AssemblyNameAttribute”特性
zh_hant: 選項 '--keycontainer' 會覆寫原始程式檔或加入的模組中指定的屬性 'System.Reflection.AssemblyNameAttribute'

# fscReferenceOnCommandLine
source: The assembly '{0}' is listed on the command line. Assemblies should be referenced using a command line flag such as '-r'.
cs: Sestavení {0} je uvedené na příkazovém řádku. Sestavení by se měla odkazovat pomocí příznaků příkazového řádku, jako je třeba -r.
de: Die Assembly '{0}' ist an der Befehlszeile aufgeführt. Auf Assemblys muss mithilfe eines Befehlszeilenflags wie '-r' verwiesen werden.
es: El ensamblado '{0}' aparece en la línea de comandos. Para hacer referencia a ensamblados, debe usarse una marca de la línea de comandos como '-r'.
fr: L'assembly '{0}' est répertorié sur la ligne de commande. Les assemblys doivent être référencés à l'aide d'un indicateur de ligne de commande, tel que '-r'.
it: L'assembly '{0}' è elencato nella riga di comando. È necessario fare riferimento agli assembly utilizzando un flag della riga di comando quale '-r'.
ja: アセンブリ '{0}' はコマンド ラインに一覧表示されます。アセンブリは '-r' などのコマンド ライン フラグを使用して参照する必要があります。
ko: '{0}' 어셈블리가 명령줄에 나열되어 있습니다. '-r'과 같은 명령줄 플래그를 사용하여 어셈블리를 참조해야 합니다.
pl: Zestaw „{0}” wyszczególniono w wierszu polecenia. Odwołania do zestawów powinny być tworzone przy użyciu flagi wiersza polecenia, takiej jak „-r”.
pt_br: O assembly '{0}' está listado na linha de comando. Assemblies devem ser referenciados usando um sinalizador de linha de comando como '-r'.
ru: Сборка "{0}" указана в командной строке. Ссылки на сборки следует задавать с помощью флага командной строки, например флага "-r".
tr: '{0}' bütünleştirilmiş kodu komut satırında listeleniyor. Bütünleştirilmiş kodlara '-r' gibi bir komut satırı bayrağı kullanılarak başvurulmalıdır.
zh_hans: 程序集“{0}”已在命令行中列出。应使用命令行标志(如“-r”)引用程序集。
zh_hant: 組件 '{0}' 列在命令列中。請使用命令列旗標 (例如 '-r') 來參考組件。

# fscRemotingError
source: The resident compilation service was not used because a problem occured in communicating with the server.
cs: Rezidentní kompilační služba se nepoužila, protože došlo k potížím při komunikaci se serverem.
de: Der residente Kompilierungsdienst wurde nicht verwendet, da bei der Kommunikation mit dem Server ein Problem aufgetreten ist.
es: El servicio de compilación residente no se usó porque se produjo un problema en la comunicación con el servidor.
fr: Le service de compilation résident n'a pas été utilisé en raison d'un problème lors de la communication avec le serveur.
it: Il servizio di compilazione residente non è stato usato perché si è verificato un problema nella comunicazione con il server.
ja: サーバーとの通信で問題が発生したため、常駐コンパイル サービスが使用されませんでした。
ko: 서버와 통신하는 동안 문제가 발생하여 상주 컴파일 서비스를 사용하지 않았습니다.
pl: Rezydentna usługa kompilacji nie została użyta, ponieważ wystąpił problem z komunikowaniem się z serwerem.
pt_br: O serviço de compilação residente não foi usado porque houve um problema de comunicação com o servidor.
ru: Служба резидентной компиляции не использовалась, поскольку возникла проблема при взаимодействии с сервером.
tr: Sunucuyla iletişimde bir sorun oluştuğu için yerleşik derleme hizmeti kullanılmadı.
zh_hans: 未使用驻留编译服务，因为与服务器通信时发生问题。
zh_hant: 未使用常駐編譯服務，因為伺服器發生通訊問題。

# pathIsInvalid
source: Problem with filename '{0}': Illegal characters in path.
cs: Potíže s názvem souboru {0}: neplatné znaky v cestě
de: Problem mit Dateinamen '{0}': Ungültige Zeichen im Pfad.
es: Problema con el nombre de archivo '{0}': caracteres no válidos en la ruta de acceso.
fr: Problème avec le nom de fichier '{0}' : caractères non valides dans le chemin.
it: Problema con il nome file '{0}': caratteri non validi nel percorso.
ja: ファイル名 '{0}' に問題があります: パスに無効な文字が含まれています。
ko: 파일 이름 '{0}'에 문제가 있습니다. 경로에 잘못된 문자가 있습니다.
pl: Problem z nazwą pliku „{0}”: niedozwolone znaki w ścieżce.
pt_br: Problema com nome de arquivo '{0}': caracteres inválidos no caminho.
ru: Проблема с именем файла "{0}": недопустимые символы в пути.
tr: '{0}' dosya adında sorun: Yolda geçersiz karakterler var.
zh_hans: 文件名“{0}”出现问题: 路径中存在非法字符。
zh_hant: 檔名 '{0}' 有問題: 路徑中有不合法的字元。

# fscResxSourceFileDeprecated
source: Passing a .resx file ({0}) as a source file to the compiler is deprecated. Use resgen.exe to transform the .resx file into a .resources file to pass as a --resource option. If you are using MSBuild, this can be done via an <EmbeddedResource> item in the .fsproj project file.
cs: Předávat kompilátoru soubor .resx ({0}) jako zdrojový soubor je zastaralý postup. Pomocí programu resgen.exe převeďte soubor .resx na soubor .resources, aby se předával jako parametr --resource. Pokud používáte MSBuild, dá se to udělat prostřednictvím položky <EmbeddedResource> v souboru projektu .fsproj.
de: Das Übergeben einer RESX-Datei ({0}) als Quelldatei an den Compiler ist veraltet. Verwenden Sie "resgen.exe", um die RESX-Datei in eine RESOURCES-Datei zu konvertieren, die mit der Option "--resource" übergeben werden. Wenn Sie MSBuild verwenden, kann dies über ein <EmbeddedResource>-Element in der FSPROJECT-Projektdatei durchgeführt werden.
es: Pasar un archivo .resx ({0}) como archivo de origen al compilador está en desuso. Use resgen.exe para transformar el archivo .resx en un archivo .resources para pasarlo como una opción --resource. Si está utilizando MSBuild, esto se puede hacer a través de un elemento <EmbeddedResource> en el archivo de proyecto .fsproj.
fr: Le passage d'un fichier .resx ({0}) comme fichier source au compilateur est déprécié. Utilisez resgen.exe pour transformer le fichier .resx en fichier .resources à passer comme option --resource. Si vous utilisez MSBuild, vous pouvez le faire avec un élément <EmbeddedResource> dans le fichier projet .fsproj.
it: Il passaggio di un file con estensione resx ({0}) come file di origine al compilatore è deprecato. Usare resgen.exe per trasformare il file con estensione resx in un file con estensione resources da passare come opzione --resource. Se si usa MSBuild, tale operazione può esser eseguita mediante un elemento <EmbeddedResource> nel file di progetto con estensione fsproj.
ja: .resx ファイル ({0}) をコンパイラにソース ファイルとして渡す操作は非推奨です。resgen.exe を使用して .resx ファイルから .resources ファイル (--resource オプションで渡すファイル) に変換します。MSBuild を使用している場合には、.fsproj プロジェクト ファイルの <EmbeddedResource> 項目を使用して変換を実行できます。
ko: 더 이상 .resx 파일({0})이 컴파일러에 소스 파일로 전달되지 않습니다. resgen.exe를 사용하여 .resx 파일을 .resources 파일로 변환해 --resource 옵션으로 전달하세요. MSBuild를 사용하는 경우 .fsproj 프로젝트 파일의 <EmbeddedResource> 항목을 통해 이 작업을 수행할 수 있습니다.
pl: Przekazywanie pliku resx ({0}) jako pliku źródłowego do kompilatora jest przestarzałe. Użyj programu resgen.exe, aby przekształcić plik resx w plik resources w celu przekazania go w opcji --resource. Jeśli używasz narzędzia MSBuild, można to zrobić za pośrednictwem elementu <EmbeddedResource> w pliku projektu fsproj.
pt_br: Passar um arquivo. resx ({0}) como um arquivo de origem para o compilador é preterido. Use resgen.exe para transformar o arquivo .resx em um arquivo .resources para passar como uma opção --resource.Se você estiver usando MSBuild, isso poderá ser feito por meio de um item <EmbeddedResource> no arquivo de projeto. fsproj.
ru: Передача файла .resx ({0}) в качестве исходного файла компилятору больше не поддерживается. Используйте resgen.exe, чтобы преобразовать файл .resx в файл .resources, который необходимо передать с помощью параметра --resource. Если вы используете MSBuild, это можно сделать, указав элемент <EmbeddedResource> в файл проекта .fsproj.
tr: Bir resx dosyasını ({0}) derleyiciye kaynak dosyası olarak geçirme işlemi kullanımdan kaldırılmıştır. .resx dosyasını bir --resource seçeneği olarak geçirmek için resgen.exe aracını kullanarak dosyayı bir .resources dosyasına dönüştürün. MSBuild kullanıyorsanız bu işlem .fsproj proje dosyasındaki bir <EmbeddedResource> öğesi aracılığıyla gerçekleştirilebilir.
zh_hans: 不推荐将 .resx 文件({0})作为源文件传递给编译器。请使用 resgen.exe 将 .resx 文件转换为 .resources 文件以作为 --resource 选项进行传递。如果使用的是 MSBuild，则可通过 .fsproj 项目文件中的 <EmbeddedResource> 项完成此操作。
zh_hant: 以來源檔案形式將 .resx 檔案 ({0}) 傳遞到編譯器的行為已淘汰。請使用 resgen.exe 將 .resx 檔案轉換成 .resources 檔案，以 --resource 選項的形式傳遞。若您使用 MSBuild，可以透過 .fsproj 專案檔中的 <EmbeddedResource> 項目完成這個動作。

# fscStaticLinkingNoProfileMismatches
source: Static linking may not be used on an assembly referencing mscorlib (e.g. a .NET Framework assembly) when generating an assembly that references System.Runtime (e.g. a .NET Core or Portable assembly).
cs: Když se generuje sestavení, které se odkazuje na System.Runtime (třeba sestavení .NET Core nebo přenosné sestavení), nejde pro sestavení, které se odkazuje na knihovnu mscorlib (třeba sestavení rozhraní .NET Framework), použít statické propojování.
de: Statische Verknüpfungen dürfen beim Generieren einer Assembly mit Verweis auf System.Runtime (z.B. eine .NET Core- oder eine portierbare Assembly) nicht für eine Assembly verwendet werden, die auf mscorlib verweist (z.B. eine .NET Framework-Assembly).
es: No se puede usar la vinculación estática en un ensamblado que haga referencia a mscorlib (por ejemplo, un ensamblado de .NET Framework) al generar un ensamblado que haga referencia a System.Runtime (por ejemplo, un ensamblado portable o de .NET Core).
fr: Les liens statiques ne doivent pas être utilisés sur un assembly qui référence mscorlib (par ex., un assembly .NET Framework) pendant la génération d'un assembly qui référence System.Runtime (par ex., un assembly .NET Core ou portable).
it: Non è possibile usare il collegamento statico in un assembly che fa riferimento a mscorlib (ad esempio un assembly .NET Framework) durante la generazione di un assembly che fa riferimento a System.Runtime (ad esempio un assembly .NET Core o Portable).
ja: 静的リンクは、System.Runtime (.NET Core または移植可能なアセンブリなど) を参照するアセンブリを生成する場合、mscorlib (.NET Framework アセンブリなど) を参照するアセンブリには使用できません。
ko: System.Runtime을 참조하는 어셈블리(예: .NET Core 또는 이식 가능한 어셈블리)를 생성할 때 mscorlib를 참조하는 어셈블리(예: .NET Framework 어셈블리)에서 정적 링크를 사용할 수 없습니다.
pl: Nie można użyć łączenia statycznego w przypadku zestawu przywołującego bibliotekę mscorlib (np. zestaw programu .NET Framework) podczas generowania zestawu przywołującego element System.Runtime (np. zestaw programu .NET Core lub przenośny).
pt_br: A vinculação estática não pode ser usada em um assembly com referência a mscorlib (por exemplo, um assembly do .NET Framework) ao gerar um assembly com referência a System.Runtime (por exemplo, um assembly .NET Core ou Portátil).
ru: Статическая компоновка не позволяет использовать сборку, которая ссылается на mscorlib (например, сборку .NET Framework), при создании сборки, которая ссылается на System.Runtime (например, сборки .NET Core или переносимой сборки).
tr: System.Runtime'a başvuran bir bütünleştirilmiş kod oluşturulurken (örneğin, .NET Core veya Taşınabilir bütünleştirilmiş kod), mscorlib'e başvuran bir bütünleştirilmiş kodda (örneğin, .NET Framework bütünleştirilmiş kodu) statik bağlama kullanılamaz.
zh_hans: 当生成引用 System.Runtime 的程序集(如 .NET Core 或 Portable 程序集)时，静态链接不能用在引用 mscorlib 的程序集(如 .NET Framework 程序集)上。
zh_hant: 產生參考 System.Runtime 的組件 (例如 .NET Core 或可攜式組件) 時，參考 mscorlib 的組件 (例如 .NET Framework 組件) 無法使用靜態連結。

# fscAssemblyWildcardAndDeterminism
source: An {0} specified version '{1}', but this value is a wildcard, and you have requested a deterministic build, these are in conflict.
cs: Zadaná verze {0} je {1}, ale tato hodnota představuje zástupný znak a vy jste požádali o deterministické sestavení, což je v konfliktu.
de: {0} hat Version "{1}" angegeben, dieser Wert ist jedoch ein Platzhalter, und Sie haben einen deterministischen Build angefordert. Zwischen diesen besteht ein Konflikt.
es: Un objeto {0} especificó la versión "{1}", pero este valor es un carácter comodín y ha solicitado una compilación determinista. Estas opciones están en conflicto.
fr: {0} a spécifié la version '{1}', mais cette valeur est un caractère générique, et comme vous avez demandé une build déterministe, il existe un conflit.
it: In un attributo {0} è stata specificata la versione '{1}', ma questo valore è un carattere jolly ed è stata richiesta una compilazione deterministica. Tali opzioni sono in conflitto.
ja: {0} によりバージョン '{1}' が指定されましたが、この値はワイルドカードです。決定論的なビルドを要求しているため、これらの指定は矛盾しています。
ko: {0}이(가) '{1}' 버전을 지정했지만, 이 값은 와일드카드인데 사용자가 결정적 빌드를 요청하여 문제가 발생했습니다.
pl: Element {0} określił wersję „{1}”, ale wartość jest symbolem wieloznacznym. Żądano kompilacji deterministycznej. Te wartości powodują konflikt.
pt_br: Uma versão especificada {0} '{1}', mas esse valor é um curinga, e você solicitou uma compilação determinística. Eles estão em conflito.
ru: Пользователь {0} указал версию "{1}", но это значение является подстановочным знаком, а вы запросили детерминированную сборку: возник конфликт.
tr: Bir {0} tarafından '{1}' sürümü belirtildi. Ancak siz belirleyici bir derleme istediniz, bu ise bir joker karakter ve bunlar çakışıyor.
zh_hans: {0} 指定了版本“{1}”，但该值为通配符，并且你已请求确定的版本，因此存在冲突。
zh_hant: {0} 已指定版本 '{1}'，但這個值為萬用字元，且您已要求確定性組建，所以發生衝突。

# fscDeterministicDebugRequiresPortablePdb
source: Deterministic builds only support portable PDBs (--debug:portable or --debug:embedded)
cs: Deterministické buildy podporují jenom přenositelné soubory PDB (--debug:portable nebo --debug:embedded)
de: Deterministische Builds unterstützen nur portierbare PDBs ("--debug:portable" oder "--debug:embedded").
es: Las compilaciones deterministas solo admiten PDB portátiles (--Debug: portable o--Debug: embedded)
fr: Les builds déterministes prennent seulement en charge les PDB portables (--debug:portable ou --debug:embedded)
it: Le compilazioni deterministiche supportano solo file PDB portabili (--debug:portable o --debug:embedded)
ja: 決定論的ビルドは、ポータブル PDB のみをサポートします (--debug:portable または --debug:embedded)
ko: 결정적 빌드는 이식 가능한 PDB만 지원합니다(--debug:portable 또는 --debug:embedded).
pl: Deterministyczne kompilacje obsługują tylko przenośne pliki PDB (--debug:portable lub --debug:embedded)
pt_br: Os builds determinísticos oferecem suporte apenas para PDBs portáteis (--debug:portable ou --debug:embedded)
ru: Детерминированные сборки поддерживают только переносимые PDB-файлы (--debug:portable или --debug:embedded)
tr: Belirlenimci derlemeler yalnızca taşınabilir PDB'leri (--debug:portable veya --debug:embedded) destekler
zh_hans: 决定性生成仅支持可移植的 PDB (--debug:portable 或 --debug:embedded)
zh_hant: 確定性組建僅支援可攜式 PDB (--debug:portable 或 --debug:embedded)

# etIllegalCharactersInNamespaceName
source: Character '{0}' is not allowed in provided namespace name '{1}'
cs: Znak {0} není v názvu poskytnutého oboru názvů {1} povolený.
de: Das Zeichen '{0}' ist im angegebenen Namespacenamen '{1}' nicht zulässig.
es: No se permite el carácter '{0}' en el nombre de espacio de nombres '{1}' proporcionado.
fr: Le caractère '{0}' n'est pas autorisé dans le nom d'espace de noms fourni '{1}'
it: Il carattere '{0}' non è consentito nel nome dello spazio dei nomi fornito '{1}'
ja: 指定された名前空間名 '{1}' には、文字 '{0}' を使用することはできません
ko: 제공된 네임스페이스 이름 '{1}'에는 '{0}' 문자를 사용할 수 없습니다.
pl: Znak „{0}” jest niedozwolony w podanej nazwie przestrzeni nazw „{1}”
pt_br: O caractere '{0}' não é permitido no nome de namespace fornecido '{1}'.
ru: Не допускается использовать символ "{0}" в указанном имени пространства имен "{1}"
tr: {1}' sağlanan ad alanı adında '{0}' karakterine izin verilmez
zh_hans: 所提供的命名空间名称“{1}”中不允许出现字符“{0}”
zh_hant: 提供的命名空間名稱 '{1}' 中不允許使用字元 '{0}'

# etNullOrEmptyMemberName
source: The provided type '{0}' returned a member with a null or empty member name
cs: Poskytnutý typ {0} vrátil člena, jehož název je prázdný nebo null.
de: Der angegebene Typ '{0}' hat einen Member mit einem NULL- oder leeren Membernamen zurückgegeben.
es: El tipo '{0}' proporcionado devolvió un miembro con un nombre de miembro NULL o vacío.
fr: Le type fourni '{0}' a retourné un membre avec un nom de membre Null ou vide
it: Membro con nome Null o vuoto restituito dal tipo fornito '{0}'
ja: 指定された型 '{0}' が返したメンバーのメンバー名が null または空です
ko: 제공된 '{0}' 형식에서 멤버 이름이 비어 있거나 null인 멤버를 반환했습니다.
pl: Udostępniony typ „{0}” zwrócił element członkowski z wartością null lub pustą nazwą elementu członkowskiego
pt_br: O tipo fornecido '{0}' retornou um membro com nome de membro nulo ou vazio
ru: Предоставленный тип "{0}" вернул элемент с именем NULL или пустым именем
tr: '{0}' sağlanan türü null veya boş üye adı olan bir üye döndürdü
zh_hans: 所提供的类型“{0}”返回了具有 null 或空成员名称的成员
zh_hant: 提供的類型 '{0}' 傳回具有 null 或空白成員名稱的成員

# etNullMember
source: The provided type '{0}' returned a null member
cs: Poskytnutý typ {0} vrátil člena s hodnotou null.
de: Der Typanbieter '{0}' hat einen NULL-Member zurückgegeben.
es: El tipo '{0}' proporcionado devolvió un miembro NULL.
fr: Le type fourni '{0}' a retourné un membre Null
it: Membro Null restituito dal tipo fornito '{0}'
ja: 指定された型 '{0}' が null のメンバーを返しました
ko: 제공된 '{0}' 형식에서 null 멤버를 반환했습니다.
pl: Udostępniony typ „{0}” zwrócił element członkowski o wartości null
pt_br: O tipo fornecido '{0}' retornou um membro nulo
ru: Предоставленный тип "{0}" вернул элемент с NULL
tr: '{0}' sağlanan türü bir null üye döndürdü
zh_hans: 所提供的类型“{0}”返回了 null 成员
zh_hant: 提供的類型 '{0}' 傳回 null 成員

# etNullMemberDeclaringType
source: The provided type '{0}' member info '{1}' has null declaring type
cs: U informací o členu {1} poskytnutého typu {0} má deklarující typ hodnotu null.
de: Die Memberinformationen '{1}' des angegebenen Typs '{0}' verfügen über einen NULL-Deklarierungstyp.
es: La información de miembro '{1}' del tipo '{0}' proporcionado tiene un tipo declarativo NULL.
fr: Les infos de membre '{1}' du type fourni '{0}' ont un type déclarant Null
it: Le informazioni sul membro '{1}' del tipo fornito '{0}' contengono un tipo dichiarante Null
ja: 指定された型 '{0}' のメンバー情報 '{1}' に null を宣言する型が含まれています
ko: 제공된 '{0}' 형식의 멤버 정보('{1}')에 null 선언 형식이 있습니다.
pl: Informacje elementu członkowskiego „{1}” udostępnionego typu „{0}” mają typ deklarujący o wartości null
pt_br: As informações do membro {1} do tipo fornecido '{0}' possui um tipo de declaração nulo
ru: Сведения об элементе "{1}" предоставленного типа "{0}" содержат объявляющий тип NULL
tr: {0}' sağlanan türünün '{1}' üye bilgisinde null tanımlama türü var
zh_hans: 所提供的类型“{0}”成员信息“{1}”具有 null 声明类型
zh_hant: 提供的類型 '{0}' 成員資訊 '{1}' 具有 null 宣告類型

# etNullMemberDeclaringTypeDifferentFromProvidedType
source: The provided type '{0}' has member '{1}' which has declaring type '{2}'. Expected declaring type to be the same as provided type.
cs: Poskytnutý typ {0} má člena {1} s deklarujícím typem {2}. Očekává se, že deklarující typ bude stejný jako poskytnutý typ.
de: Der angegebene Typ '{0}' verfügt über einen Member '{1}' mit dem deklarierenden Typ '{2}'. Es wurde als deklarierender Typ derselbe wie der angegebene Typ erwartet.
es: El tipo '{0}' proporcionado tiene el miembro '{1}' con el tipo declarativo '{2}'. Se esperaba que el tipo declarativo coincidiera con el tipo proporcionado.
fr: Le type fourni '{0}' a un membre '{1}' de type déclarant '{2}'. Le type déclarant attendu est le même que le type fourni.
it: Il tipo fornito '{0}' contiene il membro '{1}' con il tipo dichiarante '{2}'. Il tipo dichiarante previsto deve essere dello stesso tipo di quello fornito.
ja: 指定された型 '{0}' のメンバー '{1}' に、宣言する型 '{2}' が含まれています。宣言する型は、指定された型と同じである必要があります。
ko: 제공된 '{0}' 형식에 포함된 멤버 '{1}'의 선언 형식이 '{2}'입니다. 제공된 형식과 같은 선언 형식이 필요합니다.
pl: Udostępniony typ „{0}” ma element członkowski „{1}” z typem deklarującym „{2}”. Oczekiwano, że typ deklarujący będzie taki sam jak udostępniony typ.
pt_br: O tipo fornecido '{0}' possui um membro '{1}' com tipo declarativo '{2}'. O tipo declarativo esperado deve ser o mesmo que o tipo fornecido.
ru: Предоставленный тип "{0}" имеет элемент "{1}" с объявляющим типом "{2}". Ожидается, что объявляющий тип будет совпадать с предоставленным типом.
tr: {0}' sağlanan türünde '{2}' tanımlama türüne sahip '{1}' üyesi var. Tanımlama türünün sağlanan türle aynı olması bekleniyordu.
zh_hans: 所提供的类型“{0}”的成员“{1}”具有声明类型“{2}”。声明类型应与所提供的类型相同。
zh_hant: 提供之類型 '{0}' 的成員 '{1}' 具有宣告類型 '{2}'。宣告類型必須與提供的類型相同。
