Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# tcEmptyRecordInvalid
source: '{{ }}' is not a valid expression. Records must include at least one field. Empty sequences are specified by using Seq.empty or an empty list '[]'.
cs: {{ }} není platný výraz. Záznamy musí obsahovat alespoň jedno pole. Prázdné posloupnosti se specifikují pomocí Seq.empty nebo prázdného seznamu [].
de: {{ }} ist kein gültiger Ausdruck. Datensätze müssen mindestens ein Feld umfassen. Leere Sequenzen werden mit "Seq.empty" oder einer leeren Liste "[]" angegeben.
es: "{{ }}" no es una expresión válida. Los registros deben incluir al menos un campo. Las secuencias vacías se especifican con Seq.empty o una lista vacía "[]".
fr: '{{ }}' n'est pas une expression valide. Les enregistrements doivent inclure au moins un champ. Les séquences vides sont spécifiées via Seq.empty ou une liste vide '[]'.
it: '{{ }}' non è un'espressione valida. I record devono includere almeno un campo. Le sequenze vuote vengono specificate mediante Seq.empty o un elenco vuoto '[]'.
ja: '{{ }}' は有効な式ではありません。レコードには 1 つ以上のフィールドを含める必要があります。空のシーケンスを指定するには、Seq.empty または空のリスト '[]' をご使用ください。
ko: '{{ }}'는 유효한 식이 아닙니다. 레코드에는 하나 이상의 필드를 포함해야 합니다. 빈 시퀀스는 Seq.empty 또는 빈 목록 '[]'를 사용하여 지정합니다.
pl: „{{ }}” nie jest prawidłowym wyrażeniem. Rekordy muszą zawierać co najmniej jedno pole. Puste sekwencje są określane przy użyciu elementu Seq.empty lub pustej listy „[]”.
pt_br: '{{ }}' não é uma expressão válida. Registros devem incluir pelo menos um campo. Sequências vazias são especificadas pelo uso de Seq.empty ou uma lista vazia '[]'.
ru: Выражение "{{ }}" недопустимо. Записи должны включать по меньшей мере одно поле. Пустые последовательности задаются с использованием Seq.empty или пустого списка "[]".
tr: '{{ }}' geçerli bir ifade değil. Kayıtlar en az bir alan içermelidir. Boş diziler Seq.empty veya boş liste '[]' kullanılarak belirtilir.
zh_hans: “{{ }}”不是有效的表达式。记录必须至少包含一个字段。使用 Seq.empty 或空列表“[]”指定空序列。
zh_hant: '{{ }}' 不是有效的運算式。記錄至少必須包含一個欄位。使用 Seq.empty 或空白清單 '[]' 指定了空白順序。

# tcTypeIsNotARecordTypeNeedConstructor
source: This type is not a record type. Values of class and struct types must be created using calls to object constructors.
cs: Tento typ není typem záznamu. Hodnoty typů třída a struktura se musí vytvořit pomocí volání konstruktorů objektu.
de: Dieser Typ ist kein Datensatztyp. Werte von Klassen- und Strukturtypen müssen mithilfe von Aufrufen an Objektkonstruktoren erstellt werden.
es: Este tipo no es un tipo de registro. Los valores de clase y los tipos de struct deben crearse usando llamadas a constructores de objeto.
fr: Ce type n'est pas un type enregistrement. Les valeurs des types classe et struct doivent être créées à l'aide d'appels à des constructeurs d'objets.
it: Questo tipo non è un tipo di record. I valori di tipi di struct e classi devono essere creati mediante chiamate a costruttori di oggetto.
ja: この型はレコード型ではありません。クラス型および構造体型の値は、オブジェクト コンストラクターの呼び出しを使用して作成してください。
ko: 이 형식은 레코드 형식이 아닙니다. 클래스 및 구조체 형식의 값은 개체 생성자에 대한 호출을 사용하여 만들어야 합니다.
pl: Ten typ nie jest typem rekordu. Wartości typów klas i struktur muszą zostać utworzone przy użyciu wywołań konstruktorów obiektów.
pt_br: Este tipo não é um tipo de registro. Valores de tipos de classe e struct devem ser criados com o uso de construtores de objeto.
ru: Этот тип не является типом записи. Значения типов класса и структуры должны создаваться, используя вызовы конструкторов объекта.
tr: Bu tür bir kayıt türü değil. Nesne oluşturucularına yapılan çağrılar kullanılarak sınıf ve yapı türlerinin değerlerinin oluşturulması gerekiyor.
zh_hans: 此类型不是记录类型。必须使用对对象构造函数的调用来创建类和结构类型的值。
zh_hant: 這種類型不是記錄類型。類別和結構類型的值必須呼叫物件建構函式來建立。

# tcTypeIsNotARecordType
source: This type is not a record type
cs: Tento typ není typem záznamu.
de: Dieser Typ ist kein Datensatztyp.
es: Este tipo no es un tipo de registro.
fr: Ce type n'est pas un type enregistrement
it: Questo tipo non è un tipo di record
ja: この型はレコード型ではありません
ko: 이 형식은 레코드 형식이 아닙니다.
pl: Ten typ nie jest typem rekordu
pt_br: Este não é um tipo de registro
ru: Этот тип не является типом записи
tr: Bu tür bir kayıt türü değil
zh_hans: 此类型不是记录类型
zh_hant: 這種類型不是記錄類型

# tcConstructIsAmbiguousInComputationExpression
source: This construct is ambiguous as part of a computation expression. Nested expressions may be written using 'let _ = (...)' and nested computations using 'let! res = builder {{ ... }}'.
cs: Tento konstruktor je jako součást výrazu výpočtu nejednoznačný. Vnořené výrazy jde zapsat pomocí notace let _ = (...) a vnořené výpočty pomocí notace let! res = builder {{ ... }}.
de: Dieses Konstrukt ist als Teil eines Berechnungsausdrucks nicht eindeutig. Geschachtelte Ausdrücke können mit "let _ = (...)", geschachtelte Berechnungen mit "let! res = builder {{ ... }}" ausgedrückt werden.
es: Esta construcción es ambigua como parte de una expresión de cómputo. Las expresiones anidadas se pueden escribir usando 'let _ = (...)' y los cómputos anidados usando 'let! res = builder {{ ... }}'.
fr: Cette construction est ambiguë dans le cadre d'une expression de calcul. Les expressions imbriquées peuvent être écrites avec 'let _ = (...)' et les calculs imbriqués avec 'let! res = builder {{ ... }}'.
it: Questo costrutto è ambiguo all'interno di un'espressione di calcolo. È possibile scrivere le espressioni annidate con 'let _ = (...)' e i calcoli annidati con 'let! res = builder {{ ... }}'.
ja: このコンストラクトはコンピュテーション式の一部としてあいまいです。入れ子の式を記述するには 'let _ = (...)' を使用し、入れ子の計算には 'let! res = builder {{ ... }}' を使用します。
ko: 이 구문은 계산 식의 일부로서 모호합니다. 중첩 식은 'let _ = (...)', 중첩 계산은 'let! res = builder {{ ... }}'를 사용하여 작성할 수 있습니다.
pl: Ta konstrukcja jest niejednoznaczna jako część wyrażenia obliczenia. Zagnieżdżone wyrażenia mogą zawierać ciąg „let _ = (...)”, a zagnieżdżone obliczenia mogą zawierać ciąg „let! wynik = konstruktor {{ ... }}”.
pt_br: Esse constructo é ambíguo como parte de uma expressão de computação. Expressões aninhadas podem ser gravadas com o uso de 'let _ = (...)' e computações aninhadas através de 'let! res = builder {{ ... }}'.
ru: Этот конструктор является неоднозначным как часть вычислительного выражения. Вложенные выражения могут записываться с использованием "let _ = (...)", а вложенные вычисления - с использованием "let! res = builder {{ ... }}".
tr: Bu yapı, bir hesaplama ifadesinin parçası olarak belirsiz. İç içe ifadeler 'let _ = (...)' kullanılarak ve iç içe hesaplamalar 'let! res = builder {{ ... }}' kullanılarak yazılabilir.
zh_hans: 此构造作为计算表达式的一部分具有多义性。可以使用“let _ = (...)”来编写嵌套的表达式，并可以使用“let! res = builder {{ ... }}”来编写嵌套的计算。
zh_hant: 這個建構是計算運算式中模稜兩可的一部分。巢狀運算式可以使用 'let _ = (...)' 撰寫，巢狀計算則使用 'let! res = builder {{ ... }}'。

# tcConstructIsAmbiguousInSequenceExpression
source: This construct is ambiguous as part of a sequence expression. Nested expressions may be written using 'let _ = (...)' and nested sequences using 'yield! seq {{... }}'.
cs: Tento konstruktor je jako součást výrazu pořadí nejednoznačný. Vnořené výrazy jde zapsat pomocí notace let _ = (...) a vnořená pořadí pomocí notace yield! seq {{... }}.
de: Dieses Konstrukt ist als Teil eines Sequenzausdrucks nicht eindeutig. Geschachtelte Ausdrücke können mit "let _ = (...)", geschachtelte Sequenzen mit "yield! seq {{... }}" ausgedrückt werden.
es: Esta construcción es ambigua como parte de una expresión de secuencia. Las expresiones anidadas se pueden escribir usando 'let _ = (...)' y las secuencias anidadas usando 'yield! seq {{... }}'.
fr: Cette construction est ambiguë dans le cadre d'une expression de séquence. Les expressions imbriquées peuvent être écrites avec 'let _ = (...)' et les séquences imbriquées avec 'yield! seq {{... }}'.
it: Questo costrutto è ambiguo all'interno di un'espressione sequenza. È possibile scrivere le espressioni annidate con 'let _ = (...)' e le sequenze annidate con 'yield! seq {{... }}'.
ja: このコンストラクトはシーケンス式の一部としてあいまいです。入れ子の式を記述するには 'let _ = (...)' を使用し、入れ子のシーケンスには 'yield! seq {{... }}' を使用します。
ko: 이 구문은 시퀀스 식의 일부로서 모호합니다. 중첩 식은 'let _ = (...)', 중첩 시퀀스는 'yield! seq {{... }}'를 사용하여 작성할 수 있습니다.
pl: Ta konstrukcja jest niejednoznaczna jako część wyrażenia sekwencji. Zagnieżdżone wyrażenia mogą zawierać ciąg „let _ = (...)”, a zagnieżdżone sekwencje mogą zawierać ciąg „yield! seq {{... }}”.
pt_br: Esse constructo é ambíguo como parte de uma expressão de sequência. Expressões aninhadas podem ser gravadas usando 'let _ = (...)' e sequências aninhadas através de 'yield! seq {{... }}'.
ru: Этот конструктор является неоднозначным как часть выражения последовательности. Вложенные выражения могут записываться с использованием "let _ = (...)", а вложенные последовательности - с использованием "yield! seq {{... }}".
tr: Bu yapı, bir dizi ifadesinin parçası olarak belirsiz. İç içe ifadeler 'let _ = (...)' kullanılarak ve iç içe diziler 'yield! seq {{... }}' kullanılarak yazılabilir.
zh_hans: 此构造作为序列表达式的一部分具有多义性。可以使用“let _ = (...)”来编写嵌套的表达式，并可以使用“yield! seq {{... }}”来编写嵌套的序列。
zh_hant: 這個建構是循序項運算式中模稜兩可的一部分。巢狀運算式可以使用 'let _ = (...)' 撰寫，巢狀順序則使用 'yield! seq {{... }}'。

# tcDoBangIllegalInSequenceExpression
source: 'do!' cannot be used within sequence expressions
cs: Klíčové slovo do! se ve výrazech pořadí nedá použít.
de: do! kann nicht in Sequenzausdrücken verwendet werden.
es: 'do!' no se puede usar en expresiones de secuencia.
fr: Impossible d'utiliser 'do!' dans des expressions de séquence
it: 'do!' non può essere utilizzato in espressioni sequenza
ja: シーケンス式内には 'do!' を使用できません
ko: 'do!'는 시퀀스 식 내에 사용할 수 없습니다.
pl: Wyrażenie „do!” nie może być używane w wyrażeniach sekwencji
pt_br: 'do!' não pode ser resolvido em expressões de sequência
ru: do! нельзя использовать в выражениях последовательности
tr: 'do!' dizi ifadeleri içinde kullanılamaz
zh_hans: 不能在序列表达式中使用“do!
zh_hant: 無法在循序項運算式內使用 'do!'

# tcUseForInSequenceExpression
source: The use of 'let! x = coll' in sequence expressions is not permitted. Use 'for x in coll' instead.
cs: Použití notace let! x = coll ve výrazech pořadí není povolené. Použijte místo ní notaci for x in coll.
de: Die Verwendung von "let! x = coll" in Sequenzausdrücken ist nicht zulässig. Verwenden Sie stattdessen "for x in coll".
es: No se permite el uso de 'let! x = coll' en expresiones de secuencia. Use 'for x in coll' en su lugar.
fr: L'utilisation de 'let! x = coll' dans les expressions de séquence n'est pas autorisée. Utilisez 'for x in coll' à la place.
it: L'utilizzo di 'let! x = coll' in espressioni sequenza non è consentito. Utilizzare invece 'for x in coll'.
ja: シーケンス式では 'let! x = coll' を使用できません。代わりに 'for x in coll' を使用してください。
ko: 'let! x = coll'은 시퀀스 식에 사용할 수 없습니다. 대신 'for x in coll'을 사용하세요.
pl: Używanie ciągu „let! x = coll” w wyrażeniach sekwencji jest niedozwolone. Zamiast tego użyj ciągu „for x in coll”.
pt_br: O uso de 'let! x = coll' em expressões de sequência não é permitido. Em vez disso, use 'for x in coll'.
ru: Использование "let! x = coll" в выражениях последовательности не разрешается. Вместо этого используется "for x in coll".
tr: Dizi ifadelerinde 'let! x = coll' kullanımına izin verilmez. Onun yerine 'for x in coll' kullanın.
zh_hans: 不允许在序列表达式中使用“let! x = coll”。请改用“for x in coll”。
zh_hant: 不允許在循序項運算式中使用 'let! x = coll'。請改用 'for x in coll'。

# tcTryIllegalInSequenceExpression
source: 'try'/'with' cannot be used within sequence expressions
cs: Výrazy try/with se u výrazů pořadí použít nedají.
de: 'try'/'with' kann nicht in Sequenzausdrücken verwendet werden.
es: No se puede usar 'try'/'with' en expresiones de secuencia.
fr: Impossible d'utiliser 'try'/'with' dans des expressions de séquence
it: Non è possibile usare 'try'/'with' in espressioni sequenza
ja: シーケンス式内には 'try'/'with' を使用できません
ko: 'try'/'with'는 시퀀스 식 내에 사용할 수 없습니다.
pl: Wyrażenia „try”/„with” nie mogą być używane w wyrażeniach sekwencji
pt_br: 'try'/'with' não podem ser usados em expressões de sequência
ru: ''try''/''with'' не могут использоваться внутри (within) выражений последовательностей
tr: Dizi ifadeleri içinde 'try'/'with' kullanılamaz
zh_hans: 不能在序列表达式中使用“try”/“with”
zh_hant: 'try'/'with' 不能搭配循序項運算式一起使用

# tcUseYieldBangForMultipleResults
source: In sequence expressions, multiple results are generated using 'yield!'
cs: Ve výrazech pořadí se víc výsledků generuje pomocí yield!.
de: In Sequenzausdrücken werden mehrere Ergebnisse mithilfe von "yield!" erzeugt.
es: En expresiones de secuencia, se generan varios resultados con 'yield!'.
fr: Dans les expressions de séquence, les résultats multiples sont générés à l'aide de 'yield!'
it: Nelle espressioni sequenza più risultati sono generati mediante 'yield!'
ja: シーケンス式で、複数の結果は 'yield!' を使用して生成されます
ko: 시퀀스 식에서는 'yield!'를 사용하여 다중 결과가 생성됩니다.
pl: W wyrażeniach sekwencji wiele wyników jest generowanych przy użyciu elementu „yield!”
pt_br: Em expressões de sequência, os resultados múltiplos são gerados com o uso de 'yield!'
ru: В выражениях последовательности множественные результаты создаются с помощью "yield!"
tr: Dizi ifadelerinde, 'yield!' kullanılarak birden çok sonuç oluşturulur
zh_hans: 在序列表达式中，使用“yield!”生成多个结果
zh_hant: 在循序項運算式中，多個結果是使用 'yield!' 產生的

# tcInvalidAssignment
source: Invalid assignment
cs: Neplatné přiřazení
de: Ungültige Zuweisung.
es: Asignación no válida.
fr: Assignation non valide
it: Assegnazione non valida
ja: 割り当てが無効です
ko: 할당이 잘못되었습니다.
pl: Nieprawidłowe przypisanie
pt_br: Atribuição inválida
ru: Недопустимое присваивание
tr: Geçersiz atama
zh_hans: 赋值无效
zh_hant: 無效的指派

# tcInvalidUseOfTypeName
source: Invalid use of a type name
cs: Neplatné použití názvu typu
de: Unzulässige Verwendung eines Typnamens.
es: Uso no válido de un nombre de tipo.
fr: Utilisation non valide d'un nom de type
it: Uso non valido di un nome di tipo
ja: 型名の使用方法に誤りがあります
ko: 형식 이름을 잘못 사용했습니다.
pl: Nieprawidłowe użycie nazwy typu
pt_br: Uso inválido de um nome de tipo
ru: Недопустимое использование имени типа
tr: Geçersiz tür adı kullanımı
zh_hans: 类型名称的使用无效
zh_hant: 無效的類型名稱使用方式

# tcTypeHasNoAccessibleConstructor
source: This type has no accessible object constructors
cs: Pro tento typ nejsou dostupné žádné konstruktory objektu.
de: Dieser Typ verfügt über keine zugreifbaren Objektkonstruktoren.
es: Este tipo no tiene constructores de objeto accesibles.
fr: Ce type n'a aucun constructeur d'objet accessible
it: Questo tipo non dispone di costruttori di oggetto accessibili
ja: この型にアクセスできるオブジェクト コンストラクターはありません
ko: 이 형식에는 액세스 가능한 개체 생성자가 없습니다.
pl: Ten typ nie ma dostępnych konstruktorów obiektów
pt_br: Este tipo não possui construtores de objeto acessíveis
ru: Этот тип не имеет доступных конструкторов объекта
tr: Bu türün erişilebilir bir nesne oluşturucusu yok
zh_hans: 此类型不具有可访问的对象构造函数
zh_hant: 這種類型沒有可存取的物件建構函式

# tcInvalidUseOfInterfaceType
source: Invalid use of an interface type
cs: Neplatné použití typu rozhraní
de: Unzulässige Verwendung eines Schnittstellentyps.
es: Uso no válido de un tipo de interfaz.
fr: Utilisation non valide d'un type interface
it: Uso non valido di un tipo di interfaccia
ja: インターフェイス型の使用方法に誤りがあります
ko: 인터페이스 형식을 잘못 사용했습니다.
pl: Nieprawidłowe użycie typu interfejsu
pt_br: Uso inválido de um tipo de interface
ru: Недопустимое использование интерфейсного типа
tr: Geçersiz arabirim türü kullanımı
zh_hans: 接口类型的使用无效
zh_hant: 無效的介面類型使用方式

# tcInvalidUseOfDelegate
source: Invalid use of a delegate constructor. Use the syntax 'new Type(args)' or just 'Type(args)'.
cs: Neplatné použití konstruktoru delegáta. Použijte syntaxi new Type(args) nebo jenom Type(args).
de: Unzulässige Verwendung eines Delegatkonstruktors. Verwenden Sie die Syntax "new Type(args)" oder einfach nur "Type(args)".
es: Uso no válido de un constructor de delegado. Use la sintaxis 'new Type(args)' o simplemente 'Type(args)'.
fr: Utilisation non valide d'un constructeur délégué. Utilisez la syntaxe 'new Type(args)' ou simplement 'Type(args)'.
it: Utilizzo non valido di un costruttore di delegato. Utilizzare la sintassi 'new Type(args)' o semplicemente 'Type(args)'.
ja: デリゲート コンストラクターの使用方法に誤りがあります。'new Type(args)' か、単に 'Type(args)' という構文を使用してください
ko: 대리 생성자를 잘못 사용했습니다. 'new Type(args)' 구문을 사용하거나 'Type(args)'만 사용하세요.
pl: Nieprawidłowe użycie konstruktora delegatów. Użyj składni „new Typ(argumenty)” lub „Typ(argumenty)”.
pt_br: Uso inválido de um construtor delegado. Use a sintaxe 'new Type(args)' ou somente 'Type(args)'.
ru: Недопустимое использование конструктора делегата. Допустимый синтаксис: "new Type(args)" или "Type(args)".
tr: Geçersiz temsilci oluşturucu kullanımı. 'new Type(args)' sözdizimini kullanın veya yalnızca 'Type(args)' kullanın.
zh_hans: 委托构造函数的使用无效。请使用语法“new Type(args)”或直接使用“Type(args)”。
zh_hant: 無效的委派建構函式使用方式。請使用 'new Type(args)' 語法或只用 'Type(args)'。

# tcPropertyIsNotStatic
source: Property '{0}' is not static
cs: Vlastnost {0} není statická.
de: Die {0}-Eigenschaft ist nicht statisch.
es: La propiedad '{0}' no es estática.
fr: La propriété '{0}' n'est pas statique
it: La proprietà '{0}' non è statica
ja: プロパティ '{0}' は静的ではありません
ko: '{0}'은(는) 정적 속성이 아닙니다.
pl: Właściwość „{0}” nie jest statyczna
pt_br: A propriedade '{0}' não é estática
ru: Свойство "{0}" не является статическим
tr: '{0}' özelliği statik değil
zh_hans: 属性“{0}”不是静态的
zh_hant: 屬性 '{0}' 不是靜態的

# tcPropertyIsNotReadable
source: Property '{0}' is not readable
cs: Vlastnost {0} se nedá přečíst.
de: Die {0}-Eigenschaft ist nicht lesbar.
es: La propiedad '{0}' no se puede leer.
fr: La propriété '{0}' n'est pas lisible
it: La proprietà '{0}' non è leggibile
ja: プロパティ '{0}' は読み取り可能ではありません
ko: '{0}' 속성은 읽을 수 없습니다.
pl: Nie można odczytać właściwości „{0}”
pt_br: A propriedade '{0}' não é legível
ru: Свойство "{0}" недоступно для чтения
tr: '{0}' özelliği okunamıyor
zh_hans: 属性“{0}”不可读
zh_hant: 無法讀取屬性 '{0}'

# tcLookupMayNotBeUsedHere
source: This lookup cannot be used here
cs: Toto vyhledávání se tady nedá použít.
de: Dieses Lookup kann an dieser Stelle nicht verwendet werden.
es: Aquí no se puede usar esta búsqueda.
fr: Impossible d'utiliser cette recherche ici
it: Non è possibile usare questa ricerca in questa posizione
ja: ここでこの参照は使用できません
ko: 이 조회는 여기에 사용할 수 없습니다.
pl: Nie można tutaj użyć tego odnośnika
pt_br: Esta pesquisa não pode ser usada aqui
ru: Данный поиск не может быть использован здесь.
tr: Bu arama burada kullanılamaz
zh_hans: 不能在此处使用此查找
zh_hant: 此處不能使用這個查詢

# tcPropertyIsStatic
source: Property '{0}' is static
cs: Vlastnost {0} je statická.
de: Die {0}-Eigenschaft ist statisch.
es: La propiedad '{0}' es estática.
fr: La propriété '{0}' est statique
it: La proprietà '{0}' è statica
ja: プロパティ '{0}' は静的です
ko: '{0}'은(는) 정적 속성입니다.
pl: Właściwość „{0}” jest statyczna
pt_br: A propriedade '{0}' é estática
ru: Свойство "{0}" является статическим
tr: '{0}' özelliği statik
zh_hans: 属性“{0}”是静态的
zh_hant: 屬性 '{0}' 是靜態的

# tcPropertyCannotBeSet1
source: Property '{0}' cannot be set
cs: Vlastnost {0} se nedá nastavit.
de: Die {0}-Eigenschaft kann nicht festgelegt werden.
es: La propiedad '{0}' no se puede establecer.
fr: Impossible de définir la propriété '{0}'
it: Non è possibile impostare la proprietà '{0}'
ja: プロパティ '{0}' は設定できません
ko: '{0}' 속성은 설정할 수 없습니다.
pl: Nie można ustawić właściwości „{0}”
pt_br: A propriedade '{0}' não pode ser definida
ru: Нельзя задать свойство "{0}".
tr: '{0}' özelliği ayarlanamaz
zh_hans: 无法设置属性“{0}”
zh_hant: 無法設定屬性 '{0}'

# tcConstructorsCannotBeFirstClassValues
source: Constructors must be applied to arguments and cannot be used as first-class values. If necessary use an anonymous function '(fun arg1 ... argN -> new Type(arg1,...,argN))'.
cs: Konstruktory se musí použít pro argumenty a nejde je použít jako hodnoty první třídy. V případě potřeby použijte anonymní funkci (fun arg1 ... argN -> new Type(arg1,...,argN)).
de: Konstruktoren müssen auf Argumente angewendet werden und dürfen nicht als Werte der ersten Klasse verwendet werden. Verwenden Sie bei Bedarf eine anonyme Funktion "(fun arg1 ... argN -> new Type(arg1,...,argN))".
es: Los constructores deben aplicarse a argumentos y no pueden usarse como valores de primera clase. Si es necesario, use una función anónima "(fun arg1 ... argN -> new Type(arg1,...,argN))".
fr: Les constructeurs doivent être appliqués aux arguments et ne peuvent pas être utilisés comme des valeurs de première classe. Si nécessaire, utilisez une fonction anonyme '(fun arg1 ... argN -> new Type(arg1,...,argN))'.
it: I costruttori devono essere applicati ad argomenti e non possono essere usati come valori di prima classe. Se necessario, usare una funzione anonima '(fun arg1 ... argN -> new Type(arg1,...,argN))'.
ja: コンストラクターは引数に適用する必要があり、ファースト クラス値として使用することはできません。必要な場合には、匿名関数 '(fun arg1 ... argN -> new Type(arg1,...,argN))' を使用します。
ko: 생성자는 인수에 적용해야 하며 첫 번째 클래스 값으로 사용할 수 없습니다. 필요한 경우 익명 함수 '(fun arg1 ... argN -> new Type(arg1,...,argN))'을 사용하세요.
pl: Konstruktory muszą być stosowane do argumentów i nie mogą być używane jako wartości pierwszej klasy. Jeśli to konieczne, użyj funkcji anonimowej „(fun argument1 ... argumentN -> new Type(argument1,...,argumentN))”.
pt_br: Construtores devem ser aplicados a argumentos e não podem ser usados como valores de primeira classe. Se necessário, use uma função anônima '(fun arg1 ... argN -> new Type(arg1,...,argN))'.
ru: Конструкторы должны применяться к аргументам и не могут использоваться как значения первого класса. При необходимости используйте анонимную функцию '(fun arg1 ... argN -> new Type(arg1,...,argN))'.
tr: Oluşturucular bağımsız değişkenlere uygulanmalıdır ve birinci sınıf değerler olarak kullanılamaz. Gerekirse anonim bir işlev '(fun arg1 ... argN -> new Type(arg1,...,argN))' kullanın.
zh_hans: 构造函数必须应用于参数，且不能用作第一类值。如有必要，请使用匿名函数 "(fun arg1 ... argN -> new Type(arg1,...,argN))"。
zh_hant: 建構函式必須套用到引數，且無法用作第一個類別值。如有必要，請使用匿名函式 '(fun arg1 ... argN -> new Type(arg1,...,argN))'。

# tcSyntaxFormUsedOnlyWithRecordLabelsPropertiesAndFields
source: The syntax 'expr.id' may only be used with record labels, properties and fields
cs: Syntaxe expr.id se dá použít jenom u vlastností, polí a popisků záznamů.
de: Die Syntax "expr.id" darf nur für Datensatzbezeichnungen, Eigenschaften und Felder verwendet werden.
es: La sintaxis 'expr.id' se puede usar solo con propiedades, campos y etiquetas de registro.
fr: La syntaxe 'expr.id' ne peut être utilisée qu'avec des étiquettes d'enregistrement, des propriétés et des champs
it: La sintassi 'expr.id' è utilizzabile solo con campi, proprietà ed etichette di record
ja: 構文 'expr.id' を使用できるのは、レコードのラベル、プロパティ、およびフィールドのみです
ko: 'expr.id' 구문은 레코드 레이블, 속성 및 필드에만 사용할 수 있습니다.
pl: Składnia „wyrażenie.identyfikator” może być używana tylko z etykietami rekordów, właściwościami i polami
pt_br: A sintaxe 'expr.id' só pode ser usada em rótulos de registros, propriedades e campos
ru: Синтаксис "expr.id" может использоваться только с метками записей, свойствами и полями
tr: 'expr.id' sözdizimi yalnızca kayıt etiketleri, özellikler ve alanlarla kullanılabilir
zh_hans: 语法“expr.id”只能用于记录标签、属性和字段
zh_hant: 語法 'expr.id' 只能搭配記錄標籤、屬性和欄位一起使用

# tcEventIsStatic
source: Event '{0}' is static
cs: Událost {0} je statická.
de: Das {0}-Ereignis ist statisch.
es: El evento '{0}' es estático.
fr: L'événement '{0}' est statique
it: L'evento '{0}' è statico
ja: イベント '{0}' は静的です
ko: '{0}'은(는) 정적 이벤트입니다.
pl: Zdarzenie „{0}” jest statyczne
pt_br: O evento '{0}' é estático
ru: Событие "{0}" является статическим
tr: '{0}' olayı statik
zh_hans: 事件“{0}”是静态的
zh_hant: 事件 '{0}' 是靜態的

# tcEventIsNotStatic
source: Event '{0}' is not static
cs: Událost {0} není statická.
de: Das {0}-Ereignis ist nicht statisch.
es: El evento '{0}' no es estático.
fr: L'événement '{0}' n'est pas statique
it: L'evento '{0}' non è statico
ja: イベント '{0}' は静的ではありません
ko: '{0}'은(는) 정적 이벤트가 아닙니다.
pl: Zdarzenie „{0}” nie jest statyczne
pt_br: O evento '{0}' não é estático
ru: Событие "{0}" не является статическим
tr: '{0}' olayı statik değil
zh_hans: 事件“{0}”不是静态的
zh_hant: 事件 '{0}' 不是靜態的
