Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# chkFeatureNotLanguageSupported
source: Feature '{0}' is not available in F# {1}. Please use language version {2} or greater.
cs: Funkce {0} není v jazyce F# {1} dostupná. Použijte prosím jazyk verze {2} nebo vyšší.
de: Das Feature "{0}" ist in F# {1} nicht verfügbar. Verwenden Sie Sprachversion {2} oder höher.
es: La característica "{0}" no está disponible en F# {1}. Use la versión {2} del lenguaje o una posterior.
fr: La fonctionnalité '{0}' n'est pas disponible en F# {1}. Utilisez la version de langage {2} ou une version ultérieure.
it: La funzionalità '{0}' non è disponibile in F# {1}. Usare la versione {2} o versioni successive del linguaggio.
ja: 機能 '{0}' は F# {1} では使用できません。{2} 以上の言語バージョンをお使いください。
ko: '{0}' 기능은 F# {1}에서 사용할 수 없습니다. {2} 이상의 언어 버전을 사용하세요.
pl: Funkcja „{0}” nie jest dostępna w języku F# {1}. Użyj języka w wersji {2} lub nowszej.
pt_br: O recurso '{0}' não está disponível no F# {1}. Use a versão da linguagem {2} ou superior.
ru: Компонент "{0}" недоступен в F# {1}. Используйте версию языка {2} или выше.
tr: '{0}' özelliği F# {1} sürümünde kullanılamıyor. Lütfen {2} veya daha yüksek bir dil sürümünü kullanın.
zh_hans: 功能“{0}”在 F# {1} 中不可用。请使用 {2} 或更高的语言版本。
zh_hant: F# {1} 中無法使用 '{0}' 功能。請使用語言版本 {2} 或更新的版本。

# chkFeatureNotRuntimeSupported
source: Feature '{0}' is not supported by target runtime.
cs: Cílový modul runtime nepodporuje funkci {0}.
de: Das Feature "{0}" wird von der Zielruntime nicht unterstützt.
es: El entorno de ejecución de destino no admite la característica "{0}".
fr: La fonctionnalité '{0}' n'est pas prise en charge par le runtime cible.
it: La funzionalità '{0}' non è supportata dal runtime di destinazione.
ja: 機能 '{0}' は、ターゲット ランタイムではサポートされていません。
ko: '{0}' 기능은 대상 런타임에서 지원되지 않습니다.
pl: Funkcja „{0}” nie jest obsługiwana przez docelowe środowisko uruchomieniowe.
pt_br: O recurso '{0}' não é compatível com o runtime de destino.
ru: Компонент "{0}" не поддерживается целевой средой выполнения.
tr: '{0}' özelliği hedef çalışma zamanı tarafından desteklenmiyor.
zh_hans: 目标运行时不支持功能“{0}”。
zh_hant: 目標執行階段不支援功能 '{0}'。

# chkFeatureNotSupportedInLibrary
source: Feature '{0}' requires the F# library for language version {1} or greater.
cs: Funkce {0} vyžaduje knihovnu F# pro verzi jazyka {1} nebo novější.
de: Für das Feature "{0}" ist die F#-Bibliothek für die Sprachversion {1} oder höher erforderlich.
es: La característica "{0}" requiere la biblioteca de F# para la versión de lenguaje {1} o superior.
fr: La fonctionnalité '{0}' nécessite la bibliothèque F# pour le langage version {1} ou ultérieure.
it: Con la funzionalità '{0}' è richiesta la libreria F# per la versione {1} o successiva del linguaggio.
ja: 機能 '{0}' を使用するには、言語バージョン {1} 以上の F# ライブラリが必要です。
ko: 언어 버전 {1} 이상에서 '{0}' 기능을 사용하려면 F# 라이브러리가 필요합니다.
pl: Funkcja „{0}” wymaga biblioteki języka F# dla wersji językowej {1} lub nowszej.
pt_br: O recurso '{0}' exige a biblioteca F# para a versão da linguagem {1} ou posterior.
ru: Компоненту "{0}" требуется библиотека F# для языка версии {1} или более поздней.
tr: '{0}' özelliği için F# kitaplığının {1} veya üstü dil sürümü gerekir.
zh_hans: 功能“{0}”需要 {1} 或更高语言版本的 F# 库。
zh_hant: 功能 '{0}' 需要語言版本 {1} 或更高的 F# 程式庫。

# csAvailableOverloads
source: Available overloads:\n{0}
cs: Dostupná přetížení:\n{0}
de: Verfügbare Überladungen:\n{0}
es: Sobrecargas disponibles:\n{0}
fr: Surcharges disponibles :\n{0}
it: Overload disponibili:\n{0}
ja: 使用可能なオーバーロード:\n{0}
ko: 사용 가능한 오버로드:\n{0}
pl: Dostępne przeciążenia:\n{0}
pt_br: Sobrecargas disponíveis:\n{0}
ru: Доступные перегрузки:\n{0}
tr: Kullanılabilir aşırı yüklemeler:\n{0}
zh_hans: 可用重载:\n{0}
zh_hant: 可用的多載:\n{0}

# csGenericConstructRequiresStructOrReferenceConstraint
source: A generic construct requires that a generic type parameter be known as a struct or reference type. Consider adding a type annotation.
cs: Obecná konstrukce vyžaduje, aby byl parametr obecného typu známý jako typ struct nebo reference. Zvažte možnost přidat anotaci typu.
de: Für ein generisches Konstrukt muss ein generischer Typparameter als Struktur- oder Verweistyp bekannt sein. Erwägen Sie das Hinzufügen einer Typanmerkung.
es: Una construcción genérica requiere que un parámetro de tipo genérico se conozca como tipo de referencia o estructura. Puede agregar una anotación de tipo.
fr: L'utilisation d'une construction générique est possible uniquement si un paramètre de type générique est connu en tant que type struct ou type référence. Ajoutez une annotation de type.
it: Un costrutto generico richiede che un parametro di tipo generico sia noto come tipo riferimento o struct. Provare ad aggiungere un'annotazione di tipo.
ja: ジェネリック コンストラクトでは、ジェネリック型パラメーターが構造体または参照型として認識されている必要があります。型の注釈の追加を検討してください。
ko: 제네릭 구문을 사용하려면 구조체 또는 참조 형식의 제네릭 형식 매개 변수가 필요합니다. 형식 주석을 추가하세요.
pl: Konstrukcja ogólna wymaga, aby parametr typu ogólnego był znany jako struktura lub typ referencyjny. Rozważ dodanie adnotacji typu.
pt_br: Um constructo genérico exige que um parâmetro de tipo genérico seja conhecido como um tipo de referência ou struct. Considere adicionar uma anotação de tipo.
ru: В универсальной конструкции требуется использовать параметр универсального типа, известный как структура или ссылочный тип. Рекомендуется добавить заметку с типом.
tr: Genel yapı, genel bir tür parametresinin yapı veya başvuru türü olarak bilinmesini gerektirir. Tür ek açıklaması eklemeyi düşünün.
zh_hans: 泛型构造要求泛型类型参数被视为结构或引用类型。请考虑添加类型注释。
zh_hant: 泛型建構要求泛型型別參數必須指定為結構或參考型別。請考慮新增型別註解。

# csNoOverloadsFoundArgumentsPrefixPlural
source: Known types of arguments: {0}
cs: Známé typy argumentů: {0}
de: Bekannte Argumenttypen: {0}
es: Tipos de argumentos conocidos: {0}
fr: Types d'argument connus : {0}
it: Tipi di argomenti noti: {0}
ja: 既知の型の引数: {0}
ko: 알려진 인수 형식: {0}
pl: Znane typy argumentów: {0}
pt_br: Tipos de argumentos conhecidos: {0}
ru: Известные типы аргументов: {0}
tr: Bilinen bağımsız değişken türleri: {0}
zh_hans: 已知参数类型: {0}
zh_hant: 已知的引數類型: {0}

# csNoOverloadsFoundArgumentsPrefixSingular
source: Known type of argument: {0}
cs: Známý typ argumentu: {0}
de: Bekannter Argumenttyp: {0}
es: Tipo de argumento conocido: {0}
fr: Type d'argument connu : {0}
it: Tipo di argomento noto: {0}
ja: 既知の型の引数: {0}
ko: 알려진 인수 형식: {0}
pl: Znany typ argumentu: {0}
pt_br: Tipo de argumento conhecido: {0}
ru: Известный тип аргумента: {0}
tr: Bilinen bağımsız değişken türü: {0}
zh_hans: 已知参数类型: {0}
zh_hant: 已知的引數類型: {0}

# csNoOverloadsFoundReturnType
source: Known return type: {0}
cs: Známý návratový typ: {0}
de: Bekannter Rückgabetyp: {0}
es: Tipo de valor devuelto conocido: {0}
fr: Type de retour connu : {0}
it: Tipo restituito noto: {0}
ja: 既知の戻り値の型: {0}
ko: 알려진 반환 형식: {0}
pl: Znany zwracany typ: {0}
pt_br: Tipo de retorno conhecido: {0}
ru: Известный тип возвращаемого значения: {0}
tr: Bilinen dönüş türü: {0}
zh_hans: 已知返回类型: {0}
zh_hant: 已知的傳回型別: {0}

# csNoOverloadsFoundTypeParametersPrefixPlural
source: Known type parameters: {0}
cs: Známé parametry typů: {0}
de: Bekannte Typparameter: {0}
es: Parámetros de tipo conocidos: {0}
fr: Paramètres de type connus : {0}
it: Parametri di tipo noti: {0}
ja: 既知の型パラメーター: {0}
ko: 알려진 형식 매개 변수: {0}
pl: Parametry znanego typu: {0}
pt_br: Parâmetros de tipo conhecidos: {0}
ru: Известные параметры типа: {0}
tr: Bilinen tür parametreleri: {0}
zh_hans: 已知类型参数: {0}
zh_hant: 已知的類型參數: {0}

# csNoOverloadsFoundTypeParametersPrefixSingular
source: Known type parameter: {0}
cs: Známý typ parametru: {0}
de: Bekannter Typparameter: {0}
es: Parámetro de tipo conocido: {0}
fr: Paramètre de type connu : {0}
it: Parametro di tipo noto: {0}
ja: 既知の型パラメーター: {0}
ko: 알려진 형식 매개 변수: {0}
pl: Parametr znanego typu: {0}
pt_br: Parâmetro de tipo conhecido: {0}
ru: Известный параметр типа: {0}
tr: Bilinen tür parametresi: {0}
zh_hans: 已知类型参数: {0}
zh_hant: 已知的型別參數: {0}

# csOverloadCandidateIndexedArgumentTypeMismatch
source: Argument at index {0} doesn't match
cs: Argument na indexu {0} neodpovídá
de: Das Argument bei Index {0} stimmt nicht überein.
es: El argumento del índice {0} no coincide.
fr: L'argument à l'index {0} ne correspond pas
it: L'argomento alla posizione di indice {0} non corrisponde
ja: インデックス {0} の引数が一致しません
ko: 인덱스 {0}의 인수가 일치하지 않습니다.
pl: Argument pod indeksem {0} nie jest zgodny
pt_br: O argumento no índice {0} não corresponde
ru: Аргумент в индексе {0} не соответствует
tr: {0} dizinindeki bağımsız değişken eşleşmiyor
zh_hans: 索引 {0} 处的参数不匹配
zh_hant: 位於索引 {0} 的引數不相符

# csOverloadCandidateNamedArgumentTypeMismatch
source: Argument '{0}' doesn't match
cs: Argument {0} neodpovídá
de: Das Argument "{0}" stimmt nicht überein.
es: El argumento "{0}" no coincide.
fr: L'argument '{0}' ne correspond pas
it: L'argomento '{0}' non corrisponde
ja: 引数 '{0}' が一致しません
ko: '{0}' 인수가 일치하지 않습니다.
pl: Argument „{0}” nie jest zgodny
pt_br: O argumento '{0}' não corresponde
ru: Аргумент "{0}" не соответствует
tr: '{0}' bağımsız değişkeni eşleşmiyor
zh_hans: 参数 "{0}" 不匹配
zh_hant: 引數 '{0}' 不相符

# etProviderHasDesignerAssemblyDependency
source: The type provider designer assembly '{0}' could not be loaded from folder '{1}' because a dependency was missing or could not loaded. All dependencies of the type provider designer assembly must be located in the same folder as that assembly. The exception reported was: {2} - {3}
cs: Navržené sestavení poskytovatele typu {0} nešlo načíst ze složky {1}, protože chyběla závislost nebo ji nešlo načíst. Všechny závislosti tohoto sestavení se musí nacházet ve stejné složce jako toto sestavení. Ohlášená výjimka: {2} – {3}
de: Die Typanbieter-Designerassembly "{0}" konnte aus dem Ordner "{1}" nicht geladen werden, weil eine Abhängigkeit fehlte oder nicht geladen werden konnte. Alle Abhängigkeiten der Typanbieter-Designerassembly müssen sich in demselben Ordner wie die Assembly befinden. Gemeldete Ausnahme: {2} – {3}
es: No se pudo cargar el ensamblado del diseñador de proveedores de tipos "{0}" desde la carpeta "{1}" porque falta una dependencia o no se pudo cargar. Todas las dependencias del ensamblado del diseñador de proveedores de tipos deben encontrarse en la misma carpeta que el ensamblado. Se notificó la excepción: {2} - {3}.
fr: Impossible de charger l'assembly de concepteur de fournisseur de type '{0}' à partir du dossier '{1}', car une dépendance est manquante ou n'a pas pu être chargée. Toutes les dépendances de l'assembly de concepteur de fournisseur de type doivent se trouver dans le même dossier que cet assembly. Exception signalée : {2} - {3}
it: Non è stato possibile caricare l'assembly '{0}' della finestra di progettazione del provider di tipi dalla cartella '{1}' perché una dipendenza non è presente o non è stato possibile caricarla. Tutte le dipendenze dell'assembly della finestra di progettazione del provider di tipi devono trovarsi nella stessa cartella dell'assembly. L'eccezione restituita è {2} - {3}
ja: 依存関係がないか、または読み込めなかったため、型プロバイダーのデザイナー アセンブリ '{0}' をフォルダー '{1}' から読み込めませんでした。型プロバイダーのデザイナー アセンブリのすべての依存関係は、そのアセンブリと同じフォルダーに配置されている必要があります。次の例外が報告されました: {2} - {3}
ko: 종속성이 없거나 로드되지 않았으므로 '{0}' 형식 공급자 디자이너 어셈블리를 '{1}' 폴더에서 로드할 수 없습니다. 형식 공급자 디자이너 어셈블리의 모든 종속성은 해당 어셈블리와 동일한 폴더에 있어야 합니다. 보고된 예외: {2} - {3}
pl: Nie można załadować zestawu projektanta dostawców typów „{0}” z folderu „{1}”, ponieważ brakuje zależności lub nie można jej załadować. Wszystkie zależności zestawu projektanta dostawców typów muszą znajdować się w tym samym folderze co ten zestaw. Zgłoszony wyjątek: {2} — {3}
pt_br: Não foi possível carregar o assembly do designer do provedor de tipos '{0}' da pasta '{1}' porque uma dependência estava ausente ou não pôde ser carregada. Todas as dependências do assembly do designer do provedor de tipos precisam estar localizadas na mesma pasta que esse assembly. A exceção relatada foi: {2} – {3}
ru: Не удалось загрузить сборку конструктора поставщика типа "{0}" из папки "{1}", так как зависимость отсутствует или не может быть загружена. Все зависимости для сборки конструктора поставщика типа должны находиться в папке сборки. Получено исключение: {2} — {3}
tr: '{0}' tür sağlayıcısı tasarımcı bütünleştirilmiş kodu, bir bağımlılık eksik olduğundan veya yüklenemediğinden '{1}' klasöründen yüklenemedi. Tür sağlayıcısı tasarımcısı bütünleştirilmiş kodunun tüm bağımlılıkları, ilgili bütünleştirilmiş kodun bulunduğu klasörde bulunmalıdır. Bildirilen özel durum: {2} - {3}
zh_hans: 无法从文件夹“{1}”加载类型提供程序设计器程序集“{0}”，因为依赖项缺失或无法加载。类型提供程序设计器程序集的所有依赖项必须与该程序集位于同一文件夹中。报告的异常是: {2} - {3}
zh_hant: 因為缺少相依性或相依性無法載入，導致無法從資料夾 '{1}' 載入類型提供者設計工具組件 '{0}'。類型提供者設計工具組件的所有相依性都必須位於該組件所在的資料夾內。回報的例外狀況: {2} - {3}

# etProviderHasDesignerAssemblyException
source: The type provider designer assembly '{0}' could not be loaded from folder '{1}'. The exception reported was: {2} - {3}
cs: Navržené sestavení poskytovatele typu {0} nešlo načíst ze složky {1}. Ohlášená výjimka: {2} – {3}
de: Die Typanbieter-Designerassembly "{0}" konnte aus dem Ordner "{1}" nicht geladen werden. Gemeldete Ausnahme: {2} – {3}
es: No se pudo cargar el ensamblado del diseñador de proveedores de tipos "{0}" desde la carpeta "{1}". Se notificó la excepción: {2} - {3}.
fr: Impossible de charger l'assembly de concepteur de fournisseur de type '{0}' à partir du dossier '{1}'. Exception signalée : {2} - {3}
it: Non è stato possibile caricare l'assembly '{0}' della finestra di progettazione del provider di tipi dalla cartella '{1}'. L'eccezione restituita è {2} - {3}
ja: 型プロバイダーのデザイナー アセンブリ '{0}' をフォルダー '{1}' から読み込めませんでした。次の例外が報告されました: {2} - {3}
ko: '{0}' 형식 공급자 디자이너 어셈블리를 '{1}' 폴더에서 로드할 수 없습니다. 보고된 예외: {2} - {3}
pl: Nie można załadować zestawu projektanta dostawców typów „{0}” z folderu „{1}”. Zgłoszony wyjątek: {2} — {3}
pt_br: Não foi possível carregar o assembly do designer do provedor de tipos '{0}' da pasta '{1}'. A exceção relatada foi: {2} – {3}
ru: Не удалось загрузить сборку конструктора поставщика типа "{0}" из папки "{1}". Получено исключение: {2} — {3}
tr: '{0}' tür sağlayıcısı tasarımcı bütünleştirilmiş kodu '{1}' klasöründen yüklenemedi. Bildirilen özel durum: {2} - {3}
zh_hans: 未能从文件夹“{1}”加载类型提供程序设计器程序集“{0}”。报告的异常是: {2} - {3}
zh_hant: 無法從資料夾 '{1}' 載入類型提供者設計工具組件 '{0}'。回報的例外狀況: {2} - {3}

# etProviderHasWrongDesignerAssemblyNoPath
source: Assembly attribute '{0}' refers to a designer assembly '{1}' which cannot be loaded or doesn't exist. The exception reported was: {2} - {3}
cs: Atribut sestavení {0} odkazuje na navržené sestavení {1}, které se nedá načíst nebo neexistuje. Ohlášená výjimka: {2} – {3}
de: Das Assemblyattribut "{0}" verweist auf eine Designerassembly "{1}", die entweder nicht geladen werden kann oder nicht vorhanden ist. Gemeldete Ausnahme: {2} – {3}
es: El atributo de ensamblado "{0}" hace referencia a un ensamblado de diseñador "{1}" que no se puede cargar o no existe. Se notificó la excepción: {2} - {3}.
fr: L'attribut d'assembly '{0}' fait référence à un assembly de concepteur '{1}' qui ne peut pas être chargé ou qui n'existe pas. Exception signalée : {2} - {3}
it: L'attributo di assembly '{0}' fa riferimento a un assembly '{1}' della finestra di progettazione che non è stato caricato o non esiste. L'eccezione restituita è {2} - {3}
ja: アセンブリ属性 '{0}' は、デザイナー アセンブリ '{1}' を参照していますが、これは読み込むことができないか、存在していません。報告された例外: {2} - {3}
ko: '{0}' 어셈블리 특성이 로드할 수 없거나 존재하지 않는 디자이너 어셈블리'{1}'을(를) 참조합니다. 보고된 예외: {2} - {3}
pl: Atrybut zestawu „{0}” odwołuje się do zestawu projektanta „{1}”, którego nie można załadować lub który nie istnieje. Zgłoszony wyjątek: {2} — {3}
pt_br: O atributo de assembly '{0}' refere-se a um assembly de designer '{1}' que não pode ser carregado ou que não existe. A exceção relatada foi {2} – {3}
ru: Атрибут сборки "{0}" ссылается на сборку конструктора "{1}", которая не может быть загружена или не существует. Получено исключение: {2} — {3}
tr: '{0}' bütünleştirilmiş kod özniteliği, yüklenemeyen veya mevcut olmayan '{1}' tasarımcı bütünleştirilmiş koduna başvuruyor. Bildirilen özel durum: {2} - {3}
zh_hans: 程序集属性“{0}”引用了无法加载或不存在的设计器程序集“{1}”。报告的异常是: {2} - {3}
zh_hant: 無法載入組件屬性 '{0}' 參考的設計工具組件 '{1}' 或其不存在。回報的例外狀況: {2} - {3}

# featureAndBang
source: applicative computation expressions
cs: aplikativní výpočetní výrazy
de: applikative Berechnungsausdrücke
es: expresiones de cálculo aplicativas
fr: expressions de calcul applicatives
it: espressioni di calcolo applicativo
ja: 適用できる計算式
ko: 적용 가능한 계산 식
pl: praktyczne wyrażenia obliczeniowe
pt_br: expressões de computação aplicáveis
ru: применимые вычислительные выражения
tr: uygulama hesaplama ifadeleri
zh_hans: 适用的计算表达式
zh_hant: 適用的計算運算式

# featureDefaultInterfaceMemberConsumption
source: default interface member consumption
cs: využití člena výchozího rozhraní
de: standardmäßige Schnittstellenmembernutzung
es: consumo de miembros de interfaz predeterminados
fr: consommation par défaut des membres d'interface
it: utilizzo predefinito dei membri di interfaccia
ja: 既定のインターフェイス メンバーの消費
ko: 기본 인터페이스 멤버 사용
pl: domyślne użycie składowej interfejsu
pt_br: consumo de membro da interface padrão
ru: использование элемента интерфейса по умолчанию
tr: varsayılan arabirim üyesi tüketimi
zh_hans: 默认接口成员消耗
zh_hant: 預設介面成員使用

# featureDotlessFloat32Literal
source: dotless float32 literal
cs: literál float32 bez tečky
de: punktloses float32-Literal
es: literal float32 sin punto
fr: littéral float32 sans point
it: valore letterale float32 senza punti
ja: ドットなしの float32 リテラル
ko: 점이 없는 float32 리터럴
pl: bezkropkowy literał float32
pt_br: literal float32 sem ponto
ru: литерал float32 без точки
tr: noktasız float32 sabit değeri
zh_hans: 无点 float32 文本
zh_hant: 無點號的 float32 常值

# featureFixedIndexSlice3d4d
source: fixed-index slice 3d/4d
cs: řez 3d/4d s pevným indexem
de: Segment 3D/4D mit feststehendem Index
es: segmento de índice fijo 3d/4d
fr: section à index fixe 3D/4D
it: sezione a indice fisso 3D/4D
ja: 固定インデックス スライス 3d/4d
ko: 고정 인덱스 슬라이스 3d/4d
pl: część o stałym indeksie 3d/4d
pt_br: fatia de índice fixo 3d/4d
ru: срез с фиксированным индексом 3d/4d
tr: sabit dizinli dilim 3d/4d
zh_hans: 固定索引切片 3d/4d
zh_hant: 固定索引切割 3d/4d

# featureFromEndSlicing
source: from-end slicing
cs: řez od konce
de: Segmentierung ab Ende
es: segmentación desde el final
fr: découpage depuis la fin
it: sezionamento dalla fine
ja: 開始と終了を指定したスライス
ko: 끝에서부터 조각화
pl: wycinanie od końca
pt_br: divisão começando no final
ru: срезы от конца
tr: uçtan dilimleme
zh_hans: 从端切片
zh_hant: 從尾端切割

# featureImplicitYield
source: implicit yield
cs: implicitní yield
de: implizite yield-Anweisung
es: elemento yield implícito
fr: yield implicite
it: istruzione yield implicita
ja: 暗黙的な yield
ko: 암시적 yield
pl: niejawne słowo kluczowe yield
pt_br: yield implícito
ru: неявное использование yield
tr: örtük yield
zh_hans: 隐式 yield
zh_hant: 隱含 yield

# featureInterfacesWithMultipleGenericInstantiation
source: interfaces with multiple generic instantiation
cs: rozhraní s vícenásobným obecným vytvářením instancí
de: Schnittstellen mit mehrfacher generischer Instanziierung
es: interfaces con creación de instancias genéricas múltiples
fr: interfaces avec plusieurs instanciations génériques
it: interfacce con più creazioni di istanze generiche
ja: 複数のジェネリックのインスタンス化を含むインターフェイス
ko: 여러 제네릭 인스턴스화가 포함된 인터페이스
pl: interfejsy z wieloma ogólnymi wystąpieniami
pt_br: interfaces com várias instanciações genéricas
ru: интерфейсы с множественным универсальным созданием экземпляра
tr: birden çok genel örnek oluşturma içeren arabirimler
zh_hans: 具有多个泛型实例化的接口
zh_hant: 具有多個泛型具現化的介面

# featureNullableOptionalInterop
source: nullable optional interop
cs: nepovinný zprostředkovatel komunikace s možnou hodnotou null
de: Interop, NULL-Werte zulassend, optional
es: interoperabilidad opcional que admite valores NULL
fr: interopérabilité facultative pouvant accepter une valeur null
it: Interop facoltativo nullable
ja: Null 許容のオプションの相互運用
ko: nullable 선택적 interop
pl: opcjonalna międzyoperacyjność dopuszczająca wartość null
pt_br: interoperabilidade opcional anulável
ru: необязательное взаимодействие, допускающее значение NULL
tr: null atanabilir isteğe bağlı birlikte çalışma
zh_hans: 可以为 null 的可选互操作
zh_hant: 可為 Null 的選擇性 Interop

# featureOpenTypeDeclaration
source: open type declaration
cs: Otevřít deklaraci typu
de: Deklaration für offene Typen
es: declaración de tipo abierto
fr: déclaration de type ouverte
it: dichiarazione di tipo aperto
ja: オープン型宣言
ko: 개방형 형식 선언
pl: deklaracja typu otwartego
pt_br: declaração de tipo aberto
ru: объявление открытого типа
tr: açık tür bildirimi
zh_hans: 开放类型声明
zh_hant: 開放式類型宣告

# featureOverloadsForCustomOperations
source: overloads for custom operations
cs: přetížení pro vlastní operace
de: Überladungen für benutzerdefinierte Vorgänge
es: sobrecargas para operaciones personalizadas
fr: surcharges pour les opérations personnalisées
it: overload per le operazioni personalizzate
ja: カスタム操作のオーバーロード
ko: 사용자 지정 작업의 오버로드
pl: przeciążenia dla operacji niestandardowych
pt_br: sobrecargas para operações personalizadas
ru: перегрузки для настраиваемых операций
tr: özel işlemler için aşırı yüklemeler
zh_hans: 自定义操作的重载
zh_hant: 為自訂作業多載

# featurePackageManagement
source: package management
cs: správa balíčků
de: Paketverwaltung
es: administración de paquetes
it: gestione pacchetti
ja: パッケージの管理
ko: 패키지 관리
pl: zarządzanie pakietami
pt_br: gerenciamento de pacotes
ru: управление пакетами
tr: paket yönetimi
zh_hans: 包管理
zh_hant: 套件管理

# featureRelaxWhitespace
source: whitespace relexation
cs: uvolnění prázdných znaků
de: Lockerung für Leerraum
es: relajación de espacio en blanco
fr: assouplissement de la mise en retrait avec des espaces blancs
it: uso meno restrittivo degli spazi vuoti
ja: 空白の緩和
ko: 공백 완화
pl: rozluźnianie reguł dotyczących odstępów
pt_br: atenuação de espaço em branco
ru: уменьшение строгости для пробелов
tr: boşluk genişlemesi
zh_hans: 空格松弛法
zh_hant: 空白字元放寬

# featureSingleUnderscorePattern
source: single underscore pattern
cs: vzor s jedním podtržítkem
de: Muster mit einzelnem Unterstrich
es: patrón de subrayado simple
fr: modèle de trait de soulignement unique
it: criterio per carattere di sottolineatura singolo
ja: 単一のアンダースコア パターン
ko: 단일 밑줄 패턴
pl: wzorzec z pojedynczym podkreśleniem
pt_br: padrão de sublinhado simples
ru: шаблон с одним подчеркиванием
tr: tek alt çizgi deseni
zh_hans: 单下划线模式
zh_hant: 單一底線模式

# featureStringInterpolation
source: string interpolation
cs: interpolace řetězce
de: Zeichenfolgeninterpolation
es: interpolación de cadena
fr: interpolation de chaîne
it: interpolazione di stringhe
ja: 文字列の補間
ko: 문자열 보간
pl: interpolacja ciągu
pt_br: interpolação da cadeia de caracteres
ru: интерполяция строк
tr: dizede düz metin arasına kod ekleme
zh_hans: 字符串内插
zh_hant: 字串內插補點

# featureWildCardInForLoop
source: wild card in for loop
cs: zástupný znak ve smyčce for
de: Platzhalter in for-Schleife
es: carácter comodín en bucle for
fr: caractère générique dans une boucle for
it: carattere jolly nel ciclo for
ja: for ループのワイルド カード
ko: for 루프의 와일드카드
pl: symbol wieloznaczny w pętli for
pt_br: curinga para loop
ru: подстановочный знак в цикле for
tr: for döngüsünde joker karakter
zh_hans: for 循环中的通配符
zh_hant: for 迴圈中的萬用字元
