Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# tcPredefinedTypeCannotBeUsedAsSuperType
source: The types System.ValueType, System.Enum, System.Delegate, System.MulticastDelegate and System.Array cannot be used as super types in an object expression or class
cs: Typy System.ValueType, System.Enum, System.Delegate, System.MulticastDelegate a System.Array se v objektovém výrazu nebo ve třídě objektu nedají použít jako nadřazené.
de: Die Typen "System.ValueType", "System.Enum", "System.Delegate", "System.MulticastDelegate" und "System.Array" dürfen nicht als übergeordnete Typen in einem Objektausdruck oder einer Klasse verwendet werden.
es: Los tipos System.ValueType, System.Enum, System.Delegate, System.MulticastDelegate y System.Array no se pueden usar como tipos superiores en una clase o expresión de objeto.
fr: Impossible d'utiliser les types System.ValueType, System.Enum, System.Delegate, System.MulticastDelegate et System.Array en tant que super types dans une classe ou une expression d'objet
it: I tipi System.ValueType, System.Enum, System.Delegate, System.MulticastDelegate e System.Array non possono essere usati come tipi super in una classe o un'espressione di oggetto
ja: 型 System.ValueType、System.Enum、System.Delegate、System.MulticastDelegate、および System.Array は、オブジェクト式またはクラスのスーパー型として使用できません
ko: System.ValueType, System.Enum, System.Delegate, System.MulticastDelegate 및 System.Array 형식은 개체 식 또는 클래스에서 상위 형식으로 사용할 수 없습니다.
pl: Typy System.ValueType, System.Enum, System.Delegate, System.MulticastDelegate i System.Array nie mogą być używane jako supertypy w wyrażeniu obiektu lub klasie.
pt_br: Os tipos System.ValueType, System.Enum, System.Delegate, System.MulticastDelegate e System.Array não podem ser usados como supertipos em uma expressão ou classe de objeto
ru: Типы System.ValueType, System.Enum, System.Delegate, System.MulticastDelegate и System.Array не могут использоваться в качестве супертипа в выражении объекта или классе объекта
tr: System.ValueType, System.Enum, System.Delegate, System.MulticastDelegate ve System.Array türleri bir nesne ifadesinde veya sınıfta üst tür olarak kullanılamaz
zh_hans: 类型 System.ValueType、System.Enum、System.Delegate、System.MulticastDelegate 和 System.Array 不能用作对象表达式或类中的超类型
zh_hant: 類型 System.ValueType、System.Enum、System.Delegate、System.MulticastDelegate 和 System.Array 不能做為物件運算式或類別中的超級類型使用

# tcNewMustBeUsedWithNamedType
source: 'new' must be used with a named type
cs: U new se musí použít pojmenovaný typ.
de: new muss für einen benannten Typ verwendet werden.
es: 'new' debe usarse con un tipo con nombre.
fr: 'new' doit être utilisé avec un type nommé
it: 'new' deve essere utilizzato con un tipo denominato
ja: 名前付き型には 'new' を使用してください
ko: 'new'는 명명된 형식에 사용해야 합니다.
pl: Element „new” musi być używany z nazwanym typem
pt_br: 'new' deve ser usado com um tipo nomeado
ru: new необходимо использовать с именованным типом
tr: 'new' adlandırılmış türle kullanılmalıdır
zh_hans: “new”必须用于命名类型
zh_hant: 'new' 必須搭配具名類型一起使用

# tcCannotCreateExtensionOfSealedType
source: Cannot create an extension of a sealed type
cs: Nejde vytvořit rozšíření zapečetěného typu.
de: Erweiterung eines versiegelten Typs kann nicht erstellt werden.
es: No se puede crear una extensión de un tipo sellado.
fr: Impossible de créer une extension d'un type sealed
it: Non è possibile creare un'estensione di tipo Sealed
ja: シールド型の拡張は作成できません
ko: 봉인된 형식의 확장을 만들 수 없습니다.
pl: Nie można utworzyć rozszerzenia zapieczętowanego typu
pt_br: Não é possível criar uma extensão de um tipo selado
ru: Не удается создать расширение запечатанного типа
tr: Mühürlü türün uzantısı oluşturulamıyor
zh_hans: 无法创建密封类型的扩展
zh_hant: 無法建立密封類型的擴充

# tcNoArgumentsForRecordValue
source: No arguments may be given when constructing a record value
cs: Při vytváření hodnoty záznamu nejde zadávat argumenty.
de: Beim Erstellen eines Datensatzwerts dürfen keine Argumente angegeben werden.
es: No se pueden proporcionar argumentos cuando se construye un valor de registro.
fr: Aucun argument ne peut être fourni lors de la construction d'une valeur d'enregistrement
it: Non è possibile specificare argomenti durante la costruzione di un valore di record
ja: レコード値を構築するときに指定できる引数はありません
ko: 레코드 값을 생성할 때는 인수를 지정할 수 없습니다.
pl: Podczas tworzenia wartości rekordu nie można określić żadnych argumentów
pt_br: Nenhum argumento pode ser dado na construção de um valor de registro
ru: Невозможно предоставить аргументы при формировании значения записи.
tr: Kayıt değeri oluşturulurken bir bağımsız değişken verilemez
zh_hans: 在构造记录值时，可能未给定任何参数
zh_hant: 建構記錄值時未指定任何引數

# tcNoInterfaceImplementationForConstructionExpression
source: Interface implementations cannot be given on construction expressions
cs: Implementace rozhraní se s výrazy konstrukcí nedají předávat.
de: Schnittstellenimplementierungen dürfen nicht für Konstruktionsausdrücke verwendet werden.
es: No se pueden proporcionar implementaciones de interfaz en expresiones de construcción.
fr: Impossible de fournir des implémentations d'interfaces pour des expressions de construction
it: Non è possibile specificare implementazioni di interfaccia in espressioni di costruzione
ja: 構築式ではインターフェイスの実装を指定できません
ko: 인터페이스 구현은 생성 식에서 지정할 수 없습니다.
pl: Implementacje interfejsów nie mogą być określane w wyrażeniach konstrukcji
pt_br: Implementações de interface não podem ser fornecidas em expressões de construção
ru: Реализации интерфейса не могут быть даны в выражениях конструкций
tr: Arabirim uygulamaları oluşturma ifadelerinde verilemez
zh_hans: 不能在构造表达式中提供接口实现
zh_hant: 不能在建構運算式中指定介面實作

# tcObjectConstructionCanOnlyBeUsedInClassTypes
source: Object construction expressions may only be used to implement constructors in class types
cs: Výrazy konstruktoru objektu se dají použít jenom k implementaci konstruktorů v typech tříd.
de: Objektkonstruktionsausdrücke dürfen nur zur Implementierung von Konstruktoren in Klassentypen verwendet werden.
es: Las expresiones de construcción de objeto se pueden usar solo para implementar constructores en tipos de clase.
fr: Les expressions de construction d'objet ne peuvent être utilisées que pour implémenter des constructeurs dans les types classe
it: Le espressioni di costruzione degli oggetti possono essere utilizzate solo per implementare costruttori in tipi di classe
ja: オブジェクト構築式は、クラス型のコンストラクターを実装する場合にのみ使用できます
ko: 개체 생성 식은 클래스 형식의 생성자를 구현하는 데에만 사용할 수 있습니다.
pl: Wyrażenia konstrukcji obiektów mogą być używane tylko do implementowania konstruktorów w typach klas
pt_br: Expressões de construção de objeto só podem ser usadas para implementar construtores nos tipos de classe
ru: Выражения конструкции объекта могут использоваться только для реализации конструкторов в типах классов
tr: Nesne oluşturma ifadeleri yalnızca sınıf türlerinde oluşturucuları uygulamak için kullanılabilir
zh_hans: 对象构造表达式只能用于实现类类型中的构造函数
zh_hant: 物件建構運算式只能用來實作類別類型中的建構函式

# tcOnlySimpleBindingsCanBeUsedInConstructionExpressions
source: Only simple bindings of the form 'id = expr' can be used in construction expressions
cs: Ve výrazech konstrukcí se dají použít jenom jednoduché vazby s notací id = expr.
de: In Konstruktionsausdrücken dürfen nur einfache Bindungen im Format "id = expr" verwendet werden.
es: Solo se pueden usar enlaces simples con el formato 'id = expr' en expresiones de construcción.
fr: Seules les liaisons simples sous la forme 'id = expr' peuvent être utilisées dans les expressions de construction
it: Solo i binding semplici nel formato 'id = expr' possono essere usati in espressioni di costruzione
ja: 構築式に使用できるのは、'id = expr' という形式の単純な束縛のみです
ko: 'id = expr' 형식의 단순 바인딩만 생성 식에 사용할 수 있습니다.
pl: W wyrażeniach konstrukcji mogą być używane tylko proste powiązania w postaci „identyfikator = wyrażenie”
pt_br: Apenas associações simples da forma 'id = expr' podem ser usadas em expressões de construções
ru: Только простые привязки вида "id = expr" могут использоваться в выражениях конструкции
tr: Yalnızca 'id = expr' biçimindeki basit bağlamalar oluşturma ifadelerinde kullanılabilir
zh_hans: 只能在构造表达式中使用“id = expr”格式的简单绑定
zh_hant: 只有 'id = expr' 形式的簡單繫結可以用在建構運算式中

# tcObjectsMustBeInitializedWithObjectExpression
source: Objects must be initialized by an object construction expression that calls an inherited object constructor and assigns a value to each field
cs: Objekty se musí inicializovat pomocí výrazu konstruktoru objektu, který volá zděděný konstruktor objektu a přiřazuje hodnoty ke všem polím.
de: Objekte müssen von einem Objektkonstruktionsausdruck initialisiert werden, der einen geerbten Objektkonstruktor aufruft und jedem Feld einen Wert zuweist.
es: Los objetos deben inicializarse con una expresión de construcción de objeto que llame a un constructor de objeto heredado y asigne un valor a cada campo.
fr: Les objets doivent être initialisés par une expression de construction d'objet qui appelle un constructeur d'objet hérité et assigne une valeur à chaque champ
it: Gli oggetti devono essere inizializzati da un'espressione di costruzione degli oggetti che chiama un costruttore di oggetto ereditato e assegna un valore a ogni campo
ja: オブジェクトを初期化するには、継承したオブジェクト コンストラクターを呼び出し、値を各フィールドに割り当てるオブジェクト構築式を使用してください。
ko: 개체는 상속된 개체 생성자를 호출하고 각 필드에 값을 할당하는 개체 생성 식으로 초기화해야 합니다.
pl: Obiekty muszą być inicjowane przez wyrażenie konstrukcji obiektu, które wywołuje dziedziczonego konstruktora obiektów i przypisuje wartość do każdego pola
pt_br: Objetos devem ser inicializados por uma expressão de construção de objeto que chame um construtor de objeto herdado e atribua um valor para cada campo
ru: Объекты должны инициализироваться выражением конструкции объекта, вызывающим конструктор унаследованного объекта и назначающим значение для каждого поля
tr: Nesneler devralınan nesne oluşturucusunu çağıran ve her alana bir değer atayan bir nesne oluşturma ifadesi ile başlatılmalıdır
zh_hans: 对象必须由一个对象构造表达式进行初始化，该表达式将调用继承的对象构造函数并为每个字段赋值
zh_hant: 物件必須用物件建構運算式初始化，該運算式必須呼叫繼承的物件建構函式，並為每個欄位指派值

# tcExpectedInterfaceType
source: Expected an interface type
cs: Očekával se typ rozhraní.
de: Ein Schnittstellentyp wurde erwartet.
es: Se esperaba un tipo de interfaz.
fr: Type interface attendu
it: Previsto tipo di interfaccia
ja: インターフェイスの型を指定してください
ko: 인터페이스 형식이 필요합니다.
pl: Oczekiwano typu interfejsu
pt_br: Um tipo de interface é esperado
ru: Требуется интерфейсный тип
tr: Arabirim türü bekleniyordu
zh_hans: 应为接口类型
zh_hant: 必須是介面類型

# tcConstructorForInterfacesDoNotTakeArguments
source: Constructor expressions for interfaces do not take arguments
cs: Výrazy konstruktorů pro rozhraní nepřebírají argumenty.
de: Konstruktorausdrücke für Schnittstellen akzeptieren keine Argumente.
es: Las expresiones de constructor para interfaces no toman argumentos.
fr: Les expressions de constructeur pour les interfaces n'acceptent pas d'arguments
it: Le espressioni dei costruttori per le interfacce non utilizzano argomenti
ja: インターフェイスのコンストラクター式には引数を使用できません
ko: 인터페이스에 대한 생성자 식에는 인수가 사용되지 않습니다.
pl: Wyrażenia konstruktora interfejsów nie akceptują argumentów
pt_br: Expressões de construtor para interfaces não possuem argumentos
ru: Выражения конструктора для интерфейсов не принимают аргументы
tr: Arabirimlerin oluşturucu ifadeleri bağımsız değişken almaz
zh_hans: 接口的构造函数表达式不采用参数
zh_hant: 介面的建構函式運算式不接受引數

# tcConstructorRequiresArguments
source: This object constructor requires arguments
cs: Tento konstruktor objektu vyžaduje argumenty.
de: Dieser Objektkonstruktor erfordert Argumente.
es: Este constructor de objeto requiere argumentos.
fr: Ce constructeur d'objet requiert des arguments
it: Argomenti necessari per il costruttore di oggetto
ja: このオブジェクト コンストラクターには引数が必要です
ko: 이 개체 생성자에는 인수가 필요합니다.
pl: Ten konstruktor obiektów wymaga argumentów
pt_br: Este construtor do objeto requer argumentos
ru: Данный конструктор объекта требует аргументов.
tr: Bu nesne oluşturucusu bağımsız değişken gerektirir
zh_hans: 此对象构造函数需要参数
zh_hant: 這個物件建構函式需要引數

# tcNewRequiresObjectConstructor
source: 'new' may only be used with object constructors
cs: Klíčové slovo new se dá použít jenom s konstruktory objektů.
de: new darf nur für Objektkonstruktoren verwendet werden.
es: 'new' se puede usar sólo con constructores de objeto.
fr: 'new' ne peut être utilisé qu'avec des constructeurs d'objets
it: 'new' può essere usato solo con costruttori di oggetto
ja: 'new' を使用できるのは、オブジェクト コンストラクターのみです
ko: 'new'는 개체 생성자에만 사용할 수 있습니다.
pl: Element „new” może być używany tylko z konstruktorami obiektów
pt_br: 'new' deve ser usado com construtores de objeto
ru: new может использоваться только с конструкторами объектов
tr: 'new' yalnızca nesne oluşturucularla kullanılabilir
zh_hans: “new”只能用于对象构造函数
zh_hant: 'new' 只能搭配物件建構函式一起使用

# tcAtLeastOneOverrideIsInvalid
source: At least one override did not correctly implement its corresponding abstract member
cs: Nejmíň jedno přepsání neimplementovalo správně odpovídající abstraktní člen.
de: In mindestens einer Überschreibung ist der entsprechende abstrakte Member nicht korrekt implementiert.
es: Al menos una invalidación no implementó correctamente su correspondiente miembro abstracto.
fr: Au moins une substitution n'a pas implémenté correctement son membre abstrait correspondant
it: Almeno un override non implementa correttamente il membro astratto corrispondente
ja: 少なくとも 1 つのオーバーライドが対応する抽象メンバーを正しく実装していません
ko: 하나 이상의 재정의가 해당하는 추상 멤버를 올바르게 구현하지 않았습니다.
pl: Co najmniej jedno przesłonięcie nie zawiera poprawnej implementacji odpowiadającego mu abstrakcyjnego elementu członkowskiego
pt_br: Pelo menos uma substituição não foi implementada corretamente no membro abstrato correspondente
ru: Как минимум в одном переопределении неправильно реализован соответствующий абстрактный элемент
tr: En az bir geçersiz kılma işlemi kendisine karşılık gelen soyut üyeyi doğru uygulamadı
zh_hans: 至少有一个重写未正确实现其相应的抽象成员
zh_hant: 至少有一個覆寫未正確實作對應的抽象成員

# tcNumericLiteralRequiresModule
source: This numeric literal requires that a module '{0}' defining functions FromZero, FromOne, FromInt32, FromInt64 and FromString be in scope
cs: Tento číselný literál vyžaduje, aby modul {0} definující funkce FromZero, FromOne, FromInt32, FromInt64 a FromString byl v definičním oboru.
de: Für dieses numerische Literal muss sich das Modul "{0}" im Bereich befinden, das die Funktionen "FromZero", "FromOne", "FromInt32", "FromInt64" und "FromString" definiert.
es: Este literal numérico requiere que un módulo '{0}' que define las funciones FromZero, FromOne, FromInt32, FromInt64 y FromString esté en el ámbito.
fr: Ce littéral numérique requiert qu'un module '{0}' définissant les fonctions FromZero, FromOne, FromInt32, FromInt64 et FromString se trouve dans la portée
it: Il valore letterale numerico richiede che nell'ambito sia presente un modulo '{0}' che definisce funzioni FromZero, FromOne, FromInt32, FromInt64 e FromString
ja: 数値リテラルの場合、関数 FromZero、FromOne、FromInt32、FromInt64、および FromString を定義するモジュール '{0}' がスコープに含まれている必要があります
ko: 이 숫자 리터럴을 사용하려면 FromZero, FromOne, FromInt32, FromInt64 및 FromString 함수를 정의하는 '{0}' 모듈이 범위 내에 있어야 합니다.
pl: Ten literał liczbowy wymaga, aby moduł „{0}” definiujący funkcje FromZero, FromOne, FromInt32, FromInt64 i FromString mieścił się w zakresie
pt_br: Este literal numérico requer que um módulo '{0}' que define funções FromZero, FromOne, FromInt32, FromInt64 e FromString esteja no escopo
ru: Данный числовой литерал требует наличия в области модуля "{0}" определяющих функций FromZero, FromOne, FromInt32, FromInt64 и FromString
tr: Bu sayısal sabit değer FromZero, FromOne, FromInt32, FromInt64 ve FromString işlevlerini tanımlayan '{0}' modülünün kapsamda olmasını gerektirir
zh_hans: 此数值文本要求定义函数 FromZero、FromOne、FromInt32、FromInt64 和 FromString 的模块“{0}”位于范围内
zh_hant: 這個數值常值要求定義函式 FromZero、FromOne、FromInt32、FromInt64 和 FromString 的模組 '{0}' 必須在範圍內

# tcInvalidRecordConstruction
source: Invalid record construction
cs: Neplatná konstrukce záznamu
de: Ungültige Datensatzkonstruktion.
es: Construcción de registro no válida.
fr: Construction d'enregistrement non valide
it: Costruzione record non valida
ja: レコードの構造が無効です
ko: 레코드 생성이 잘못되었습니다.
pl: Nieprawidłowa konstrukcja rekordu
pt_br: Construção de registros inválida
ru: Недопустимая конструкция записи
tr: Geçersiz kayıt oluşturma
zh_hans: 记录构造无效
zh_hant: 無效的記錄建構

# tcExpressionFormRequiresRecordTypes
source: The expression form {{ expr with ... }} may only be used with record types. To build object types use {{ new Type(...) with ... }}
cs: Notace {{ expr with ... }} se dá ve výrazech použít jenom u typů záznamu. Pokud chcete vytvořit objektové typy, použijte formulaci {{ new Type(...) with ... }}.
de: Das Ausdrucksformat {{ expr with ... }} darf nur für Datensatztypen verwendet werden. Verwenden Sie zum Erstellen von Objekttypen {{ new Type(...) with ... }}.
es: El formato de expresión {{ expr with ... }} se puede usar sólo con tipos de registro. Para compilar tipos de objeto, use {{ new Type(...) with ... }}.
fr: La forme d'expression {{ expr with ... }} ne peut être utilisée qu'avec des types enregistrement. Pour générer des types d'objets, utilisez {{ new Type(...) with ... }}
it: Il formato di espressione {{ expr with ... }} può essere utilizzato solo con tipi di record. Per compilare tipi di oggetto utilizzare {{ new Type(...) with ... }}
ja: {{ expr with ... }} という形式の式を使用できるのはレコード型のみです。オブジェクトの型を構築するには、{{ new Type(...) with ... }} を使用してください。
ko: 식 형식 {{ expr with ... }}는 레코드 형식에만 사용할 수 있습니다. 개체 형식을 빌드하려면 {{ new Type(...) with ... }}를 사용하세요.
pl: Wyrażenie w postaci {{ wyrażenie with ... }} może być używane tylko z typami rekordów. Aby utworzyć typy obiektów, użyj wyrażenia {{ new Typ(...) with ... }}
pt_br: A forma de expressão {{ expr with ... }} só pode ser usada com tipos de registro. Para compilar tipos de objeto, use {{ new Type(...) with ... }}
ru: Форма выражения {{ expr with ... }} может использоваться только с типами записи. Для сборки типов объекта используется {{ new Type(...) with ... }}
tr: {{ expr with ... }} ifade biçimi yalnızca kayıt türleriyle kullanılabilir. Nesne türleri oluşturmak için {{ new Type(...) with ... }} kullanın
zh_hans: 表达式格式 {{ expr with ... }} 只能用于记录类型。若要生成对象类型，请使用 {{ new Type(...) with ... }}
zh_hant: 運算式形式 {{ expr with ... }} 只能搭配記錄類型一起使用。若要建置物件類型，請使用 {{ new Type(...) with ... }}

# tcInheritedTypeIsNotObjectModelType
source: The inherited type is not an object model type
cs: Zděděný typ není typem objektového modelu.
de: Der geerbte Typ ist kein Objektmodelltyp.
es: El tipo heredado no es un tipo de modelo de objeto.
fr: Le type hérité n'est pas un type de modèle objet
it: Il tipo ereditato non è un tipo di modello a oggetti
ja: 継承された型はオブジェクト モデル型ではありません
ko: 상속된 형식이 개체 모델 형식이 아닙니다.
pl: Dziedziczony typ nie jest typem modelu obiektów
pt_br: O tipo herdado não é um tipo de objeto modelo
ru: Унаследованный тип не является типом модели объекта
tr: Devralınan tür bir nesne modeli türü değil
zh_hans: 继承的类型不是对象模型类型
zh_hant: 繼承類型不是物件模型類型

# tcObjectConstructionExpressionCanOnlyImplementConstructorsInObjectModelTypes
source: Object construction expressions (i.e. record expressions with inheritance specifications) may only be used to implement constructors in object model types. Use 'new ObjectType(args)' to construct instances of object model types outside of constructors
cs: Výrazy konstruktoru objektu (třeba výrazy záznamu se specifikací dědičnosti) se dají použít jenom k implementaci konstruktorů v typech objektového modelu. K vytvoření instancí typů objektového modelu mimo konstruktory použijte new ObjectType(args).
de: Objektkonstruktionsausdrücke (also Datensatzausdrücke mit Vererbungsspezifikationen) dürfen nur zur Implementierung von Konstruktoren in Objektmodelltypen verwendet werden. Verwenden Sie "new ObjectType(args)", um Instanzen von Objektmodelltypen außerhalb von Konstruktoren zu erstellen.
es: Las expresiones de construcción de objeto (es decir, expresiones de registro con especificaciones de herencia) se pueden usar solo para implementar constructores en tipos de modelo de objeto. Use 'new ObjectType(args)' para construir instancias de tipos de modelo de objeto fuera de los constructores.
fr: Les expressions de construction d'objet (c'est-à-dire les expressions d'enregistrement avec des spécifications d'héritage) ne peuvent être utilisées que pour implémenter des constructeurs dans les types de modèles objet. Utilisez 'new ObjectType(args)' pour construire des instances de types de modèles objet hors des constructeurs
it: Le espressioni di costruzione degli oggetti (ad esempio espressioni di record con specifiche di ereditarietà) possono essere utilizzate solo per implementare costruttori in tipi di modello a oggetti. Utilizzare 'new ObjectType(args)' per costruire istanze di tipi di modello a oggetti all'esterno di costruttori
ja: オブジェクト構築式 (つまり、継承の指定があるレコード式) は、オブジェクト モデル型のコンストラクターを実装する場合にのみ使用できます。コンストラクターの外側でオブジェクト モデル型のインスタンスを構築するには、'new ObjectType(args)' を使用してください。
ko: 개체 생성 식, 즉 상속 지정이 있는 레코드 식은 개체 모델 형식의 생성자를 구현하는 데에만 사용할 수 있습니다. 'new ObjectType(args)'을 사용하여 생성자 외부에 개체 모델 형식의 인스턴스를 생성하세요.
pl: Wyrażenia konstrukcji obiektów (czyli wyrażenia rekordów ze specyfikacjami dziedziczenia) mogą być używane w celu implementowania konstruktorów w typach modeli obiektów. Aby utworzyć wystąpienia typów modeli obiektów poza konstruktorami, użyj wyrażenia „new ObjectType(args)”
pt_br: Expressões de construção de objeto (isto é, expressões de registros com especificações de herança) só podem ser usadas para implementar construtores em tipos de modelo de objeto. Use 'new ObjectType(args)' para instâncias de tipos de modelo de objeto fora dos construtores
ru: Выражения конструкции объекта (напр. выражений записи со спецификациями наследования) могут использоваться только для реализации конструкторов в типах моделей объектов. Для формирования экземпляров типов моделей объектов вне конструкторов используется "new ObjectType(args)"
tr: Nesne oluşturma ifadeleri (yani devralma belirtimleri olan kayıt ifadeleri) yalnızca nesne modeli türlerinde oluşturucuları uygulamak için kullanılabilir. Nesne modeli türlerinin örneklerini oluşturucuların dışında oluşturmak için 'new ObjectType(args)' kullanın
zh_hans: 对象构造函数表达式(即，具有继承规范的记录表达式)只能用于实现对象模型类型中的构造函数。请使用“new ObjectType(args)”在构造函数的外部构造对象模型类型的实例
zh_hant: 物件建構運算式 (亦即，含繼承規格的記錄運算式) 只能用來實作物件模型類型中的建構函式。請使用 'new ObjectType(args)' 來建構在建構函式外之物件模型類型的執行個體
