Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# tcInvalidMixtureOfRecursiveForms
source: This recursive binding uses an invalid mixture of recursive forms
cs: Tato rekurzivní vazba používá neplatnou kombinaci rekurzivních tvarů.
de: Diese rekursive Bindung verwendet eine unzulässige Mischung von rekursiven Formaten.
es: Este enlace recursivo usa una mezcla no válida de formatos recursivos.
fr: Cette liaison récursive utilise une combinaison non valide de formes récursives
it: Questo binding ricorsivo usa una combinazione non valida di formati ricorsivi
ja: この再帰的束縛に使用されている再帰形式の混合は無効です
ko: 이 재귀적 바인딩은 잘못된 재귀적 형식 조합을 사용합니다.
pl: Powiązanie cykliczne używa nieprawidłowej kombinacji form cyklicznych
pt_br: Esta associação recursiva usa uma mistura inválida de formas recursivas
ru: Данная рекурсивная привязка использует недопустимое совмещение рекурсивных форм
tr: Bu özyinelemeli bağlama özyinelemeli biçimlerin geçersiz bir karışımını kullanıyor
zh_hans: 此递归绑定使用的递归格式组合无效
zh_hant: 這個遞迴繫結使用無效的混合遞迴形式

# tcInvalidObjectConstructionExpression
source: This is not a valid object construction expression. Explicit object constructors must either call an alternate constructor or initialize all fields of the object and specify a call to a super class constructor.
cs: Toto není platný výraz konstruktoru objektu. Explicitní konstruktor objektu musí buď volat alternativní konstruktor, nebo inicializovat všechna pole objektu a specifikovat volání konstruktoru nadřazené třídy.
de: Dies ist kein gültiger Objektkonstruktionsausdruck. Explizite Objektkonstruktoren müssen entweder einen alternativen Konstruktor aufrufen oder alle Felder des Objekts initialisieren und einen Aufruf an einen übergeordneten Klassenkonstruktor angegeben.
es: Esta no es una expresión de construcción de objeto válida. Los constructores de objeto explícitos deben llamar a un constructor alternativo o inicializar todos los campos del objeto y especificar una llamada a un constructor de superclase.
fr: Expression de construction d'objet non valide. Les constructeurs d'objets doivent appeler un autre constructeur ou initialiser tous les champs de l'objet et spécifier un appel à un constructeur de superclasse.
it: Espressione di costruzione di oggetti non valida. I costruttori di oggetto espliciti devono chiamare un costruttore alternativo o inizializzare tutti i campi dell'oggetto e specificare una chiamata al costruttore di super classe.
ja: これは有効なオブジェクト構築式ではありません。明示的なオブジェクト コンストラクターでは、代わりのコンストラクターを呼び出すかまたはオブジェクトのすべてのフィールドを初期化し、スーパークラス コンストラクターの呼び出しを指定する必要があります。
ko: 올바른 개체 생성 식이 아닙니다. 명시적 개체 생성자에서는 대체 생성자를 호출하거나 개체의 모든 필드를 초기화한 후 상위 클래스 생성자에 대한 호출을 지정해야 합니다.
pl: To nie jest prawidłowe wyrażenie konstrukcji obiektu. Jawne konstruktory obiektów muszą wywoływać konstruktora alternatywnego lub inicjować wszystkie pola obiektu i określić wywołanie konstruktora superklasy.
pt_br: Esta não é uma expressão de construção de objeto válida. Construtores de objeto explícitos devem chamar um construtor alternativo ou então iniciar todos os campos do objeto e especificar uma chamada para um construtor de superclasse.
ru: Это недопустимое выражение конструкции объекта. Конструкторы явных объектов должны либо вызывать альтернативный конструктор, либо инициализировать все поля объекта и указывать вызов конструктора суперкласса.
tr: Bu geçerli bir nesne oluşturma ifadesi değil. Açık nesne oluşturucular ya alternatif bir oluşturucu çağırmalı ya da nesnenin tüm alanlarını başlatmalı ve üst sınıf oluşturucuya çağrı belirtmelidir.
zh_hans: 这不是有效的对象构造表达式。显式对象构造函数必须调用一个替换构造函数，或者初始化对象的所有字段并指定一个对超类构造函数的调用。
zh_hant: 這不是有效的物件建構運算式。明確物件建構函式必須呼叫替代建構函式，或初始化該物件的所有欄位並且指定超級類別建構函式的呼叫。

# tcInvalidConstraint
source: Invalid constraint
cs: Neplatné omezení
de: Ungültige Einschränkung.
es: Restricción no válida.
fr: Contrainte non valide
it: Vincolo non valido
ja: 制約が無効です
ko: 제약 조건이 잘못되었습니다.
pl: Nieprawidłowe ograniczenie
pt_br: Restrição inválida
ru: Недопустимое ограничение
tr: Geçersiz kısıtlama
zh_hans: 约束无效
zh_hant: 無效的條件約束

# tcInvalidConstraintTypeSealed
source: Invalid constraint: the type used for the constraint is sealed, which means the constraint could only be satisfied by at most one solution
cs: Neplatné omezení: Typ použitý pro toto omezení je zapečetěný. Znamená to, že tomuto omezení může vyhovovat maximálně jedno řešení.
de: Ungültige Einschränkung: Der für diese Einschränkung verwendete Typ ist versiegelt; das bedeutet, die Einschränkung wurde von höchstens einer Projektmappe erfüllt.
es: Restricción no válida: el tipo usado para la restricción está sellado, lo que significa que la restricción solo se podría satisfacer con una solución como máximo.
fr: Contrainte non valide : le type utilisé pour la contrainte est sealed, ce qui signifie que la contrainte ne peut être satisfaite que par une seule solution
it: Vincolo non valido: il tipo usato per il vincolo è sealed, il che significa che il vincolo può essere soddisfatto al massimo da una soluzione
ja: 無効な制約: 制約に使用された型がシールドです。つまり、制約を満たすことができるのは、最高でも 1 つの解です。
ko: 제약 조건이 잘못되었습니다. 제약 조건에 사용된 형식이 봉인되었습니다. 즉, 최대 하나의 솔루션을 통해서만 해당 제약 조건을 만족시킬 수 있습니다.
pl: Nieprawidłowe ograniczenie: typ użyty dla ograniczenia jest zapieczętowany, co oznacza, że ograniczenie może spełnić maksymalnie jedno rozwiązanie
pt_br: Restrição inválida: o tipo usado para restrição está selado, o que significa que a restrição só pode ser satisfeita por no máximo uma solução
ru: Недопустимое ограничение: тип, использованный для ограничения, запечатан, это означает, что ограничение может быть удовлетворено максимум одним решением.
tr: Geçersiz kısıtlama: kısıtlama için kullanılan tür mühürlü, yani bu kısıtlama yalnızca en çok tek çözümde karşılanabilir
zh_hans: 约束无效: 用于约束的类型为 “sealed”，这表示最多只能有一个解决方案满足约束的条件
zh_hant: 無效的條件約束: 用於條件約束的類型是密封的，表示條件約束最多只能由一個方案滿足

# tcInvalidEnumConstraint
source: An 'enum' constraint must be of the form 'enum<type>'
cs: Omezení enum musí být ve formátu enum<typ>.
de: Eine "enum"-Einschränkung muss das Format "enum<type>" aufweisen.
es: Una restricción "enum" debe tener el formato "enum<type>"
fr: Une contrainte 'enum' doit être de la forme 'enum<type>'
it: Il formato di un vincolo 'enum' deve essere 'enum<tipo>'
ja: 'enum' 制約の形式は 'enum<type>' にする必要があります
ko: 'enum' 제약 조건의 형식은 'enum<type>'이어야 합니다.
pl: Ograniczenie „enum” musi mieć postać „enum<typ>”
pt_br: Uma restrição 'enum' deve ser da forma 'enum<type>'
ru: Ограничение 'enum' должно иметь вид 'enum<type>'
tr: Bir 'enum' kısıtlaması, 'enum<type>' biçiminde olmalıdır
zh_hans: "enum" 约束必须采用 "enum<type>" 形式
zh_hant: 'enum' 條件約束的形式必須為 'enum<類型>'

# tcInvalidNewConstraint
source: 'new' constraints must take one argument of type 'unit' and return the constructed type
cs: Omezení new musí přebírat jeden argument typu unit a vracet konstruovaný typ.
de: New-Einschränkungen müssen ein Argument vom Typ "unit" annehmen und den konstruierten Typ zurückgeben.
es: Las restricciones 'new' deben tomar un argumento de tipo 'unit' y devolver el tipo construido.
fr: Les contraintes 'new' doivent accepter un argument de type 'unit' et retourner le type construit
it: I vincoli 'new' devono usare un argomento di tipo 'unit' e restituire il tipo costruito
ja: 'new' 制約は型 'unit' の引数を 1 つ指定し、構築された型を返す必要があります
ko: 'new' 제약 조건은 'unit' 형식의 인수 하나를 사용하고 생성된 형식을 반환해야 합니다.
pl: Ograniczenia „new” muszą pobierać jeden argument typu „unit” i zwracać utworzony typ
pt_br: Restrições 'new' devem pegar um argumento do tipo 'unit' e retornar o tipo construído
ru: Ограничения "new" должны принять один аргумент типа "unit" и возвратить сформированный тип.
tr: 'new' kısıtlamaları 'unit' türünde bir bağımsız değişken almalı ve oluşturulan türü döndürmelidir
zh_hans: “new”约束必须采用一个类型为“unit”的参数并返回构造化类型
zh_hant: 'new' 條件約束必須接受一個類型 'unit' 的引數，並傳回建構的類型

# tcInvalidPropertyType
source: This property has an invalid type. Properties taking multiple indexer arguments should have types of the form 'ty1 * ty2 -> ty3'. Properties returning functions should have types of the form '(ty1 -> ty2)'.
cs: Tato vlastnost nemá platný typ. Vlastnosti, které přebírají více argumentů indexeru, by měly mít typy s notací ty1 * ty2 -> ty3. Vlastnosti, které vrací funkce, by měly mít typy s notací (ty1 -> ty2).
de: Diese Eigenschaft weist einen ungültigen Typ auf. Eigenschaften mit mehreren Indexerargumenten sollten Typen im Format "ty1 * ty2 -> ty3" aufweisen. Eigenschaften, die Funktionen aufweisen, sollten Typen im Format "(ty1 -> ty2)" aufweisen.
es: Esta propiedad tiene un tipo no válido. Las propiedades que toman múltiples argumentos de indexador deben tener tipos de la forma "ty1 * ty2 -> ty3". Las propiedades que devuelven funciones deben tener tipos de la forma "(ty1 -> ty2)".
fr: Cette propriété a un type non valide. Les propriétés qui prennent plusieurs arguments d'indexeur doivent avoir des types de la forme 'ty1 * ty2 -> ty3'. Les propriétés qui retournent des fonctions doivent avoir des types de la forme '(ty1 -> ty2)'.
it: La proprietà contiene un tipo non valido. Le proprietà che usano più argomenti di indicizzatore devono avere tipi nel formato 'ty1 * ty2 -> ty3'. Le proprietà che restituiscono funzioni devono avere tipi nel formato '(ti1 -> ti2)'.
ja: このプロパティに無効な型があります。複数のインデクサー引数を取るプロパティの型の形式は 'ty1 * ty2 -> ty3' でなければなりません。関数を返すプロパティの型の形式は '(ty1 -> ty2)' にする必要があります。
ko: 이 속성에는 잘못된 형식이 있습니다. 다중 인덱서 인수를 사용하는 속성에는 'ty1 * ty2 -> ty3'과 같은 형식이 있어야 합니다. 함수를 반환하는 속성에는 '(ty1 -> ty2)'와 같은 형식이 있어야 합니다.
pl: Ta właściwość ma nieprawidłowy typ. Właściwości z wieloma argumentami indeksatora powinny mieć typy w postaci „ty1 * ty2 -> ty3”. Właściwości zwracające funkcje powinny mieć typy w postaci „(ty1 -> ty2)”.
pt_br: Essa propriedade tem um tipo inválido. Propriedades que usam vários argumentos do indexador devem ter tipos da forma 'ty1 * ty2 -> ty3'. Propriedades retornando funções devem ter tipos da forma '(ty1 -> ty2)'.
ru: Это свойство имеет недопустимый тип. Свойства, принимающие несколько аргументов индексатора, должны иметь типы 'ty1 * ty2 -> ty3'. Свойства, возвращающие функции, должны иметь типы '(ty1 -> ty2)'.
tr: Bu özelliğin türü geçersiz. Birden çok dizin oluşturucu bağımsız değişkeni alan özellikler 'ty1 * ty2 -> ty3' biçiminde olmalıdır. İşlev döndüren özellikler, '(ty1 -> ty2)' biçiminde türlere sahip olmalıdır.
zh_hans: 此属性的类型无效。采用多个索引器参数的属性应具有 "ty1 * ty2 -> ty3" 形式的类型。返回函数的属性应具有 "(ty1 -> ty2)" 形式的类型。
zh_hant: 此屬性的類型無效。採用多個索引子引數的屬性類型形式應為 'ty1 * ty2 -> ty3'。傳回函式的屬性類型形式應為 '(ty1 -> ty2)'。

# tcExpectedUnitOfMeasureMarkWithAttribute
source: Expected unit-of-measure parameter, not type parameter. Explicit unit-of-measure parameters must be marked with the [<Measure>] attribute.
cs: Očekával se parametr měrné jednotky, ne parametr typu. Explicitní parametry měrných jednotek musí být označené atributem [<Measure>].
de: Es wurde ein Maßeinheitparameter, kein Typparameter erwartet. Explizite Maßeinheitparameter müssen mit dem [<Measure>]-Attribut gekennzeichnet werden.
es: Se esperaba un parámetro de unidad de medida, no un parámetro de tipo. Los parámetros explícitos de unidad de medida deben marcarse con el atributo[<Measure>].
fr: Paramètre d'unité de mesure attendu et non un paramètre de type. Les paramètres d'unité de mesure explicites doivent être marqués avec l'attribut [<Measure>].
it: È previsto un parametro di unità di misura, non di tipo. I parametri di unità di misura espliciti devono essere contrassegnati con l'attributo [<Measure>].
ja: 必要なのは型パラメーターではなく測定単位パラメーターです。明示的な測定単位パラメーターは、[<Measure>] 属性でマークされている必要があります。
ko: 형식 매개 변수가 아니라 측정 단위 매개 변수가 필요합니다. 명시적 측정 단위 매개 변수는 [<Measure>] 특성으로 표시해야 합니다.
pl: Oczekiwano parametru jednostki miary, a nie parametru typu. Jawne parametry jednostki miary muszą być oznaczone atrybutem [<Measure>].
pt_br: Um parâmetro de unidade de medida é esperado, não um parâmetro de tipo. Parâmetros de unidade de medida explícitos devem ser marcados com o atributo [<Measure>].
ru: Ожидается параметр единицы измерения, а не параметр типа. Явные параметры единиц измерения должны быть помечены атрибутом [<Measure>].
tr: Tür parametresi değil unit-of-measure parametresi bekleniyordu. Açık unit-of-measure parametreleri [<Measure>] özniteliğiyle işaretlenmelidir.
zh_hans: 应为度量单位参数，而不是类型参数。显式度量单位参数必须用 [<Measure>] 属性进行标记。
zh_hant: 應為測量單位參數，而非類型參數。必須以 [<Measure>] 屬性標示明確的測量單位參數。

# tcExpectedTypeParameter
source: Expected type parameter, not unit-of-measure parameter
cs: Očekával se parametr typu, ne parametr měrné jednotky.
de: Ein Typparameter wurde erwartet, kein Maßeinheitenparameter.
es: Se esperaba un parámetro de tipo, no un parámetro de unidad de medida.
fr: Paramètre de type attendu à la place d'un paramètre d'unité de mesure
it: È previsto un parametro di tipo, non di unità di misura
ja: 単位パラメーターではなく型パラメーターを指定してください
ko: 측정 단위 매개 변수가 아니라 형식 매개 변수가 필요합니다.
pl: Oczekiwano parametru typu, a nie parametru jednostki miary
pt_br: Um parâmetro de tipo é esperado, não um parâmetro de unidade de medida
ru: Требуется параметр типа, а не параметр единицы измерения
tr: Ölçü birimi parametresi değil tür parametresi bekleniyordu
zh_hans: 应为类型参数，而非度量单位参数
zh_hant: 必須是型別參數，不是測量單位參數

# tcExpectedTypeNotUnitOfMeasure
source: Expected type, not unit-of-measure
cs: Očekával se typ, ne měrná jednotka.
de: Ein Typ wurde erwartet, keine Maßeinheit.
es: Se esperaba un tipo, no una unidad de medida.
fr: Type attendu à la place d'une unité de mesure
it: È previsto un tipo, non un'unità di misura
ja: 単位ではなく型を指定してください
ko: 측정 단위가 아니라 형식이 필요합니다.
pl: Oczekiwano typu, a nie jednostki miary
pt_br: Tipo esperado, não unidade de medida
ru: Требуется тип, а не единица измерения
tr: Ölçü birimi değil tür bekleniyordu
zh_hans: 应为类型，而非度量单位
zh_hant: 必須是類型，不是測量單位

# tcExpectedUnitOfMeasureNotType
source: Expected unit-of-measure, not type
cs: Očekávala se měrná jednotka, ne typ.
de: Eine Maßeinheit wurde erwartet, kein Typ.
es: Se esperaba una unidad de medida, no un tipo.
fr: Unité de mesure attendue à la place d'un type
it: È prevista un'unità di misura, non un tipo
ja: 型ではなく単位を指定してください
ko: 형식이 아니라 측정 단위가 필요합니다.
pl: Oczekiwano jednostki miary, a nie typu
pt_br: Unidade de medida esperada, não tipo
ru: Требуется единица измерения, а не тип
tr: Tür değil ölçü birimi bekleniyordu
zh_hans: 应为度量单位，而非类型
zh_hant: 必須是測量單位，不是類型

# tcInvalidUnitsOfMeasurePrefix
source: Units-of-measure cannot be used as prefix arguments to a type. Rewrite as postfix arguments in angle brackets.
cs: Měrné jednotky se nedají použít jako argumenty předpony typu. Přepište je na argumenty přípony v lomených závorkách.
de: Maßeinheiten dürfen nicht als Präfixargumente für einen Typ verwendet werden. Ändern Sie sie in Postfixargumente in spitzen Klammern.
es: No se pueden usar unidades de medida como argumentos de prefijo para un tipo. Escríbalo de nuevo con argumentos de postfijo entre paréntesis angulares.
fr: Impossible d'utiliser des unités de mesure en tant qu'arguments de préfixe pour un type. Réécrivez-les en tant qu'arguments postfixés dans des crochets pointus.
it: Non è possibile usare l'unità di misura come argomenti di prefisso per un tipo. Riscrivere come argomenti di suffisso tra parentesi quadre.
ja: 型に対するプレフィックス引数として単位を使用することはできません。山かっこで囲んだ後置引数として書き換えてください。
ko: 측정 단위는 형식에 대한 접두사 인수로 사용할 수 없습니다. 꺾쇠 괄호 안에 후위 인수로 다시 작성하세요.
pl: Jednostki miary nie mogą być używane jako argumenty prefiksu typu. Zapisz je ponownie jako argumenty postfiksowe w nawiasach ostrych.
pt_br: As unidades de medida não podem ser usadas como argumentos de prefixo para um tipo. Reescreva como argumentos de sufixo entre colchetes.
ru: Единицы измерения нельзя использовать как аргументы-префиксы для типа. Перепишите аргументы-постфиксы в угловых скобках.
tr: Ölçü birimleri bir türün ön ek bağımsız değişkenleri olarak kullanılamaz. Açılı ayraç içinde son ek bağımsız değişkeni olarak yeniden yazın.
zh_hans: 度量单位不能用作类型的前缀参数。请重新编写为用尖括号括起的后缀参数。
zh_hant: 測量單位不能做為類型的前置引數使用。請重寫成括在角括號中的後置引數。

# tcUnitsOfMeasureInvalidInTypeConstructor
source: Unit-of-measure cannot be used in type constructor application
cs: Měrná jednotka se v použití konstruktoru typu použít nedá.
de: Eine Maßeinheit kann nicht in einer Typkonstruktoranwendung verwendet werden.
es: No se puede usar una unidad de medida en una aplicación de constructor de tipo.
fr: Impossible d'utiliser l'unité de mesure dans l'application de constructeur de type
it: Non è possibile usare un'unità di misura in un'applicazione del costruttore di tipo
ja: 型コンストラクター応用には単位を使用できません
ko: 측정 단위는 형식 생성자 적용 시 사용할 수 없습니다.
pl: Jednostka miary nie może być używana w aplikacji konstruktora typów
pt_br: A unidade de medida não pode ser usada em aplicativos de construtor de tipo
ru: Единица измерения не может быть использована в приложении конструктора типов
tr: Tür oluşturucu uygulamasında ölçü birimi kullanılamaz
zh_hans: 不能在类型构造函数应用程序中使用度量单位
zh_hant: 測量單位不能用在類型建構函式應用程式中

# tcRequireBuilderMethod
source: This control construct may only be used if the computation expression builder defines a '{0}' method
cs: Tento řídicí konstruktor se dá použít jenom v případě, že tvůrce výrazu výpočtu definuje metodu {0}.
de: Dieses Steuerkonstrukt darf nur verwendet werden, wenn vom Berechnungsausdrucks-Generator eine {0}-Methode definiert wird.
es: Esta construcción de control se puede usar solo si el generador de expresiones de cómputo define un método '{0}'.
fr: Cette construction de contrôle ne peut être utilisée que si le générateur d'expressions de calcul définit une méthode '{0}'
it: Questo costrutto di controllo può essere utilizzato solo se il generatore di espressioni di calcolo definisce un metodo '{0}'
ja: この制御コンストラクトを使用できるのは、コンピュテーション式ビルダーが '{0}' メソッドを定義する場合のみです
ko: 계산 식 작성기가 '{0}' 메서드를 정의하는 경우에만 이 제어 구문을 사용할 수 있습니다.
pl: Ta konstrukcja kontrolna może być używana tylko wtedy, gdy konstruktor wyrażeń obliczeń definiuje metodę „{0}”
pt_br: Esta construção de controle só é usada se o compilador de expressões de computação definir um método '{0}'
ru: Конструкция данного элемента управления может использоваться только в том случае, если построитель вычислительного выражения определяет метод "{0}"
tr: Bu denetim yapısı, yalnızca hesaplama ifadesi oluşturucu '{0}' metodunu tanımlıyorsa kullanılabilir
zh_hans: 只有在计算表达式生成器定义“{0}”方法时才能使用此控制构造
zh_hant: 這個控制建構只能用在計算運算式產生器定義 '{0}' 方法時

# tcTypeHasNoNestedTypes
source: This type has no nested types
cs: Tento typ nemá žádné vnořené typy.
de: Dieser Typ enthält keine geschachtelten Typen.
es: Este tipo no tiene tipos anidados.
fr: Ce type n'a aucun type imbriqué
it: Questo tipo non dispone di tipi annidati
ja: この型に入れ子の型はありません
ko: 이 형식에는 중첩 형식이 없습니다.
pl: Ten typ nie ma typów zagnieżdżonych
pt_br: Este tipo não possui tipos aninhados
ru: Этот тип не имеет вложенных типов
tr: Bu türde hiç iç içe tür yok
zh_hans: 此类型不具有嵌套类型
zh_hant: 這種類型沒有巢狀類型

# tcUnexpectedSymbolInTypeExpression
source: Unexpected {0} in type expression
cs: Neočekávalo se {0} ve výrazu typu.
de: Unerwartetes {0} in Typenausdruck.
es: {0} inesperado en la expresión de tipo.
fr: {0} inattendu dans l'expression de type
it: Elemento {0} non previsto in espressione di tipo
ja: 型式に予期しない {0} があります:
ko: 형식 식에 예기치 않은 {0}이(가) 있습니다.
pl: Nieoczekiwany symbol {0} w wyrażeniu typu
pt_br: {0} inesperado na expressão de tipo
ru: Недопустимый {0} в выражении типа
tr: Tür ifadesinde beklenmeyen {0}
zh_hans: 类型表达式中的意外的 {0}
zh_hant: 類型運算式中有未預期的 {0}

# tcTypeParameterInvalidAsTypeConstructor
source: Type parameter cannot be used as type constructor
cs: Parametr typu se jako konstruktor typu použít nedá.
de: Der Typparameter kann nicht als Typkonstruktor verwendet werden.
es: Un parámetro de tipo no se puede usar como constructor de tipo.
fr: Impossible d'utiliser le paramètre de type en tant que constructeur de type
it: Non è possibile usare un parametro di tipo come costruttore di tipo
ja: 型パラメーターは型コンストラクターとして使用できません
ko: 형식 매개 변수는 형식 생성자로 사용할 수 없습니다.
pl: Nie można użyć parametru typu jako konstruktora typów
pt_br: O parâmetro de tipo não pode ser usado como construtor de tipo
ru: Тип параметра нельзя использовать в качестве конструктора типа
tr: Tür parametresi tür oluşturucusu olarak kullanılamaz
zh_hans: 类型参数不能用作类型构造函数
zh_hant: 型別參數不能作為型別建構函式使用

# tcIllegalSyntaxInTypeExpression
source: Illegal syntax in type expression
cs: Neplatná syntaxe ve výrazu typu
de: Unzulässige Syntax in Typenausdruck.
es: Sintaxis no válida en expresión de tipo.
fr: Syntaxe non conforme dans l'expression de type
it: Sintassi non valida in espressione di tipo
ja: 型式の構文が正しくありません
ko: 형식 식의 구문이 잘못되었습니다.
pl: Niedozwolona składnia w wyrażeniu typu
pt_br: Sintaxe inválida na expressão de tipo
ru: Недопустимый синтаксис в выражении типа
tr: Tür ifadesinde geçersiz sözdizimi
zh_hans: 类型表达式中的非法语法
zh_hant: 類型運算式中不合法的語法

# tcAnonymousUnitsOfMeasureCannotBeNested
source: Anonymous unit-of-measure cannot be nested inside another unit-of-measure expression
cs: Anonymní měrná jednotka se nedá vnořit do jiného výrazu měrné jednotky.
de: Anonyme Maßeinheiten können nicht innerhalb eines anderen Maßeinheitenausdrucks geschachtelt werden.
es: Una unidad de medida anónima no puede estar anidada en otra expresión de unidad de medida.
fr: Impossible d'imbriquer une unité de mesure anonyme dans une autre expression d'unité de mesure
it: Non è possibile annidare unità di misura anonime all'interno di un'altra espressione di unità di misura
ja: 匿名の単位は、別の単位式の中に入れ子にすることはできません
ko: 익명 측정 단위는 다른 측정 단위 식 내에 중첩할 수 없습니다.
pl: Anonimowa jednostka miary nie może być zagnieżdżona w innym wyrażeniu jednostki miary
pt_br: Uma medida de unidade anônima não poder ser aninhada dentro de outra expressão de unidade de medida
ru: Не допускается вложение анонимной единицы измерения в другое выражение единицы измерения
tr: Anonim ölçü birimi başka bir ölçü birimi ifadesinin içine konamaz
zh_hans: 不能将匿名度量单位嵌入另一个度量单位表达式中
zh_hant: 匿名的測量單位無法巢狀於另一個測量單位運算式內

# tcAnonymousTypeInvalidInDeclaration
source: Anonymous type variables are not permitted in this declaration
cs: Anonymní typy proměnných nejsou v této deklaraci povolené.
de: Anonyme Typvariablen sind in dieser Deklaration nicht zulässig.
es: No se permiten variables de tipo anónimo en esta declaración.
fr: Les variables de type anonyme ne sont pas autorisées dans cette déclaration
it: Variabili di tipo anonime non consentite in questa dichiarazione
ja: この宣言で匿名型の変数は使用できません
ko: 익명 형식 변수는 이 선언에서 허용되지 않습니다.
pl: Zmienne typów anonimowych nie są dozwolone w tej deklaracji
pt_br: Variáveis de tipos anônimos não são permitidas nesta declaração
ru: Использование анонимных переменных типа в этом объявлении не допускается
tr: Bu bildirimde anonim tür değişkenlerine izin verilmez
zh_hans: 此声明中不允许有匿名类型变量
zh_hant: 不允許在這個宣告中使用匿名的類型變數

# tcUnexpectedSlashInType
source: Unexpected / in type
cs: V typu se neočekávalo lomítko (/).
de: Unerwarteter Schrägstrich ("/") im Typ.
es: Barra / inesperada en el tipo.
fr: / inattendu dans le type
it: / non previsto in tipo
ja: 型に予期しない / があります:
ko: 형식에 예기치 않은 /가 있습니다.
pl: Nieoczekiwany znak / w typie
pt_br: Inesperado / em tipo
ru: Недопустимый / в типе
tr: Türde beklenmeyen /
zh_hans: 类型中的意外的 /
zh_hant: 類型中有未預期的 /

# tcUnexpectedTypeArguments
source: Unexpected type arguments
cs: Neočekávané argumenty typu
de: Unerwartete Typargumente.
es: Argumentos de tipo inesperados.
fr: Arguments de type inattendus
it: Argomenti tipo non previsti
ja: 予期しない型引数です:
ko: 예기치 않은 형식 인수입니다.
pl: Nieoczekiwane argumenty typu
pt_br: Argumentos de tipo inesperados
ru: Недопустимые аргументы типа
tr: Beklenmeyen tür bağımsız değişkenleri
zh_hans: 意外的类型参数
zh_hant: 未預期的類型引數
