Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# tcNonUniformMemberUse
source: The generic member '{0}' has been used at a non-uniform instantiation prior to this program point. Consider reordering the members so this member occurs first. Alternatively, specify the full type of the member explicitly, including argument types, return type and any additional generic parameters and constraints.
cs: Použili jste obecný člen {0} v neuniformní instanci před tímto místem v programu. Zvažte možnost změnit pořadí členů tak, aby se tento uvedl jako první. Případně specifikujte úplný typ člena explicitně, včetně typů argumentů, návratového typu a všech dalších obecných parametrů a omezení.
de: Der generische Member "{0}" wurde bei einer nicht einheitlichen Instanziierung vor diesem Programmpunkt verwendet. Ordnen Sie die Member ggf. neu an, damit dieser Member zuerst angezeigt wird. Sie können auch explizit den vollständigen Typ des Members angeben, einschließlich Argumenttypen, des Rückgabetyps und aller zusätzlichen generischen Parametern und Einschränkungen.
es: El miembro genérico '{0}' se ha usado en una creación de instancia no uniforme anterior a este punto del programa. Considere reordenar los miembros para que este miembro esté en primer lugar. También puede especificar el tipo completo del miembro de forma explícita, incluidos los tipos de argumento, el tipo de valor devuelto y posibles restricciones y parámetros genéricos adicionales.
fr: Le membre générique '{0}' a été utilisé au niveau d'une instanciation non uniforme avant ce point du programme. Réorganisez les membres afin que ce membre se produise en premier. Vous pouvez également spécifier le type complet du membre de façon explicite, y compris les types d'arguments, le type de retour et d'autres paramètres et contraintes génériques.
it: Il membro generico '{0}' è stato utilizzato in una creazione di istanza non uniforme prima di questo punto del programma. Provare a riordinare i membri in modo che questo si trovi prima. In alternativa, specificare il tipo completo del membro in modo esplicito, con tipi di argomento, tipo restituito ed eventuali vincoli e parametri generici aggiuntivi.
ja: このプログラム ポイントよりも前の同型でないインスタンス化で、汎用メンバー '{0}' が使用されています。このメンバーが最初に出現するようにメンバーの順序を変えることを検討してください。または、引数の型、戻り値の型、および追加のジェネリック パラメーターと制約を含む、メンバーの完全な型を明示的に指定してください。
ko: 제네릭 멤버 '{0}'이(가) 이 프로그램 지점 전의 비균일 인스턴스화에 사용되었습니다. 이 멤버가 처음에 오도록 멤버들을 다시 정렬해 보세요. 또는, 인수 형식, 반환 형식 및 추가 제네릭 매개 변수와 제약 조건을 포함한 멤버의 전체 형식을 명시적으로 지정하세요.
pl: Ogólny element członkowski „{0}” został użyty w niejednolitym utworzeniu wystąpienia przed tym punktem programu. Rozważ zmianę kolejności elementów członkowskich, aby ten element członkowski występował jako pierwszy. Możesz też jawnie określić pełny typ elementu członkowskiego, łącznie z typami argumentów, zwracanym typem i wszelkimi dodatkowymi ogólnymi parametrami i ograniczeniami.
pt_br: O membro genérico '{0}' foi usado em uma instanciação não uniforme anterior a este ponto de programa. Considere reordenar os membros para que ele venha antes. Como alternativa, especifique o tipo completo do membro explicitamente, incluindo tipos de argumentos, tipo de retorno e todos parâmetros e restrições genéricas adicionais.
ru: Базовый элемент "{0}" использовался при неоднородном создании экземпляров ранее этой точки программы. Рассмотрите возможность изменения порядка элементов таким образом, чтобы данный элемент следовал первым. Альтернативное решение - задать полный тип элемента в явном виде, включая типы аргументов, тип возвращаемого значения и все дополнительные универсальные параметры и ограничения.
tr: '{0}' genel üyesi, bu program noktasından önce düzenli olmayan bir örneklemede kullanıldı. Bu üye önce olacak şekilde üyeleri yeniden sıralamayı düşünün. Alternatif olarak, bağımsız değişken türleri, dönüş türü ve diğer ek genel parametreler ve kısıtlamalar dahil üyenin tam türünü açık olarak belirtin.
zh_hans: 在此程序点之前，已在非统一实例化中使用了泛型成员“{0}”。请考虑重新排列成员顺序，以使此成员先出现。或者，也可以显式指定该成员的完整类型，包括实参类型、返回类型以及其他任何泛型形参和约束。
zh_hant: 在這個程式點之前，泛型成員 '{0}' 已用於非統一具現化。請考慮重新排列此成員，以便讓此成員最先出現。或者，明確指定此成員的完整型別，包括引數型別、傳回型別和任何其他泛型參數和條件約束。

# tcAttribArgsDiffer
source: The attribute '{0}' appears in both the implementation and the signature, but the attribute arguments differ. Only the attribute from the signature will be included in the compiled code.
cs: Atribut {0} se vyskytuje jak v implementaci, tak v signatuře, ale argumenty atributu se liší. Do kompilovaného kódu se zahrne jenom atribut ze signatury.
de: Das Attribut "{0}" ist sowohl in der Implementierung als auch in der Signatur enthalten, die Attributargumente unterscheiden sich jedoch. In den kompilierten Code wird nur das Attribut aus der Signatur eingefügt.
es: El atributo '{0}' aparece tanto en la implementación como en la signatura, pero los argumentos de atributo difieren. Solo se incluirá el atributo de la signatura en el código compilado.
fr: L'attribut '{0}' est présent dans l'implémentation et dans la signature, mais les arguments de l'attribut sont différents. Seul l'attribut de la signature sera inclus dans le code compilé.
it: L'attributo '{0}' è presente nell'implementazione e nella firma, ma gli argomenti degli attributi differiscono. Nel codice compilato verrà incluso solo l'attributo della firma.
ja: 属性 '{0}' が実装とシグネチャの双方に出現していますが、属性の引数が異なります。コンパイル済みコードには、シグネチャの属性のみが含まれます。
ko: '{0}' 특성이 구현과 시그니처 모두에 나타나지만 특성 인수가 다릅니다. 컴파일된 코드에는 시그니처에 있는 특성만 포함됩니다.
pl: Atrybut „{0}” występuje w implementacji i sygnaturze, ale argumenty atrybutu różnią się między sobą. W kompilowanym kodzie zostanie uwzględniony tylko atrybut z sygnatury.
pt_br: O atributo '{0}' parece tanto na implementação quanto na assinatura, mas os argumentos de atributos são diferentes. Apenas o atributo da assinatura será incluído no código compilado.
ru: Атрибут "{0}" присутствует как в реализации, так и в сигнатуре, но с разными аргументами. В скомпилированный код будет включен только атрибут из сигнатуры.
tr: '{0}' özniteliği hem uygulamada hem de imzada görünüyor ancak özniteliğin bağımsız değişkenleri farklı. Derlenmiş koda yalnızca imzadaki öznitelik eklenecek.
zh_hans: 特性“{0}”同时出现在实现和签名中，但它们的参数有所不同。只有签名中的该特性才会包括在已编译代码中。
zh_hant: 屬性 '{0}' 同時出現在實作和簽章中，但是屬性引數不同。編譯的程式碼中將只包含來自簽章的屬性。

# tcCannotCallAbstractBaseMember
source: Cannot call an abstract base member: '{0}'
cs: Nejde volat abstraktní základní člen: {0}.
de: Ein abstrakter Basismember kann nicht aufgerufen werden: "{0}"
es: No se puede llamar a un miembro base abstracto: '{0}'
fr: Impossible d'appeler un membre de base abstrait : '{0}'
it: Non è possibile chiamare un membro di base astratto: '{0}'
ja: 抽象基本メンバーを呼び出すことはできません:'{0}'
ko: 추상 기본 멤버를 호출할 수 없습니다. '{0}'
pl: Nie można wywołać abstrakcyjnego podstawowego elementu członkowskiego: „{0}”
pt_br: Não é possível chamar o membro de base abstrata: '{0}'
ru: Не удается вызвать абстрактный член базового класса: '{0}'
tr: Soyut bir temel üye çağrılamaz: '{0}'
zh_hans: 无法调用抽象基成员:“{0}”
zh_hant: 無法呼叫抽象基底成員: '{0}'

# typrelCannotResolveAmbiguityInUnmanaged
source: Could not resolve the ambiguity in the use of a generic construct with an 'unmanaged' constraint at or near this position
cs: Nepovedlo se vyřešit nejednoznačnost v použití obecného konstruktoru s omezením unmanaged na této pozici nebo blízko ní.
de: Die Mehrdeutigkeit bei der Verwendung eines generischen Konstrukts mit einer unmanaged-Einschränkung an dieser Position oder in ihrer Umgebung konnte nicht aufgelöst werden.
es: No se pudo resolver la ambigüedad en el uso de una construcción genérica con una restricción 'unmanaged' en esta posición o cerca de ella.
fr: Impossible de résoudre l'ambigüité liée à l'utilisation d'une construction générique avec une contrainte 'unmanaged' à cette position ou à proximité
it: Non è stato possibile risolvere l'ambiguità relativa all'uso di un costrutto generico con un vincolo 'unmanaged' in questa posizione o in prossimità di essa
ja: この位置、またはこの位置付近にある 'unmanaged' 制約を含むジェネリック コンストラクトの使用に関して、あいまいさを解決できませんでした
ko: 이 위치 또는 이 위치 근처에서 'unmanaged' 제약 조건을 사용하여 제네릭 구문 사용의 모호성을 해결할 수 없습니다.
pl: Nie można usunąć niejednoznaczności w przypadku użycia konstrukcji ogólnej z ograniczeniem „unmanaged” w tym miejscu lub w jego pobliżu
pt_br: Não foi possível resolver a ambiguidade no uso do constructo genérico com uma restrição 'unmanaged' nesta posição ou próxima a ela
ru: Не удалось разрешить неоднозначность в использовании базовой конструкции с ограничением "unmanaged" в этой позиции или рядом с ней
tr: 'unmanaged' kısıtlaması olan bir genel yapının bu konumda veya yakınında kullanılmasındaki belirsizlik çözümlenemedi
zh_hans: 对于在此位置或附近使用“unmanaged”约束的泛型构造的用法，无法解析其多义性
zh_hant: 無法解決在這個位置或附近使用具有 'unmanaged' 條件約束的泛型建構時造成的模稜兩可

# mlCompatMessage
source: This construct is for ML compatibility. {0}. You can disable this warning by using '--mlcompatibility' or '--nowarn:62'.
cs: Tento konstruktor je určený pro kompatibilitu ML. {0}. Toto upozornění můžete pomocí --mlcompatibility nebo --nowarn:62 vypnout.
de: Dieses Konstrukt dient der ML-Kompatibilität. {0}. Die Warnung lässt sich mit "--mlcompatibility" oder "--nowarn:62" deaktivieren.
es: Esta construcción es para la compatibilidad con ML. {0}. Puede deshabilitar esta advertencia usando '--mlcompatibility' o '--nowarn:62'.
fr: Cette construction est pour la compatibilité ML. {0}. Vous pouvez désactiver cet avertissement en utilisant '--mlcompatibility' ou '--nowarn:62'.
it: Il costruttore è per la compatibilità ML. {0}. È possibile disabilitare questo avviso tramite '--mlcompatibility' o '--nowarn:62'.
ja: このコンストラクターは ML 互換用です。{0}。'--mlcompatibility' または '--nowarn:62' を使用して、この警告を無効にできます。
ko: 이 구문은 ML 호환성을 위해 사용됩니다. {0}. 이 경고가 나타나지 않게 하려면 '--mlcompatibility' 또는 '--nowarn:62'를 사용합니다.
pl: Ta konstrukcja zapewnia zgodność z językiem ML. {0}. Możesz wyłączyć to ostrzeżenie, używając opcji „--mlcompatibility” lub opcji „--nowarn:62”.
pt_br: Este constructo serve para a compatibilidade ML. {0}. Você pode desabilitar esse aviso usando '--mlcompatibility' ou '--nowarn:62'.
ru: Эта конструкция предназначена для многоязыковой совместимости. {0}. Это предупреждение можно отключить с помощью параметра "--mlcompatibility" или "--nowarn:62".
tr: Bu yapı ML uyumluluğu içindir. {0}. '--mlcompatibility' veya '--nowarn:62' kullanarak bu uyarıyı devre dışı bırakabilirsiniz.
zh_hans: 此构造适用于 ML 兼容性。{0}。可以通过使用“--mlcompatibility”或“--nowarn:62”来禁用此警告。
zh_hant: 這個建構是用於 ML 相容性。{0}。您可以使用 '--mlcompatibility' 或 '--nowarn:62' 停用這項警告

# ilFieldDoesNotHaveValidOffsetForStructureLayout
source: The type '{0}' has been marked as having an Explicit layout, but the field '{1}' has not been marked with the 'FieldOffset' attribute
cs: Typ {0} je označený jako typ s explicitním rozložením, ale u pole {1} chybí atribut FieldOffset.
de: Der Typ "{0}" wurde als Typ mit explizitem Layout markiert, das Feld "{1}" wurde jedoch nicht mit dem FieldOffset-Attribut versehen.
es: El tipo '{0}' se ha marcado como que tiene un diseño explícito, pero el campo '{1}' no se ha marcado con el atributo 'FieldOffset'.
fr: Le type '{0}' a été marqué comme ayant une disposition Explicit, mais le champ '{1}' n'a pas été marqué avec l'attribut 'FieldOffset'
it: Il tipo '{0}' è stato contrassegnato con il layout esplicito, ma il campo '{1}' non è stato contrassegnato con l'attributo 'FieldOffset'
ja: 型 '{0}' は明示的なレイアウトがあるとしてマークされていますが、フィールド '{1}' は 'FieldOffset' 属性でマークされていません
ko: {0}' 형식이 명시적 레이아웃을 포함한다고 표시되어 있지만 '{1}' 필드가 'FieldOffset' 특성으로 표시되어 있지 않습니다.
pl: Typ „{0}” został oznaczony jako mający układ Explicit, ale pole „{1}” nie zostało oznaczone za pomocą atrybutu „FieldOffset”
pt_br: O tipo '{0}' foi marcado como tendo um layout explícito, mas o campo '{1}' não tinha sido marcado com o atributo 'FieldOffset'
ru: Тип "{0}" был помечен как имеющий явно заданный макет, но поле "{1}" не было помечено атрибутом FieldOffset
tr: {0}' türünün Açık düzeni olduğu işaretlenmiş, ancak '{1}' alanı 'FieldOffset' özniteliğiyle işaretlenmemiş
zh_hans: 类型“{0}”已标记为具有显式布局，但字段“{1}”尚未用“FieldOffset”特性进行标记
zh_hant: 類型 '{0}' 已標記為有明確配置，但是 '{1}' 卻未以 'FieldOffset' 屬性標記

# tcInterfacesShouldUseInheritNotInterface
source: Interfaces inherited by other interfaces should be declared using 'inherit ...' instead of 'interface ...'
cs: Rozhraní zděděná jinými rozhraními by se měla deklarovat pomocí inherit ... a ne pomocí interface...
de: Von anderen Schnittstellen geerbte Schnittstellen müssen mit "inherit ..." (und nicht mit "interface ...") deklariert werden.
es: Las interfaces heredadas por otras interfaces deben declararse con 'inherit ...' en lugar de 'interface ...'.
fr: Les interfaces héritées d'autres interfaces doivent être déclarées avec 'inherit ...' à la place de 'interface ...'
it: Le interfacce ereditate da altre interfacce devono essere dichiarate tramite 'inherit ...' anziché 'interface ...'
ja: 他のインターフェイスによって継承されたインターフェイスは、'interface ...' ではなく 'inherit ...' を使用して宣言する必要があります
ko: 다른 인터페이스에서 상속된 인터페이스는 'interface ...' 대신 'inherit ...'를 사용하여 선언해야 합니다.
pl: Interfejsy dziedziczone przez inne interfejsy powinny być deklarowane przy użyciu ciągu „inherit ...” zamiast ciągu „interface ...”
pt_br: Interfaces herdadas de outras interfaces devem ser declaradas com o uso de 'inherit ...' ao invés de 'interface ...'
ru: Для объявления интерфейсов, наследуемых другими интерфейсами, следует использовать "inherit ...", а не "interface ..."
tr: Diğer arabirimlerce devralınan arabirimler 'interface ...' yerine 'inherit ...' kullanılarak tanımlanmalıdır
zh_hans: 由其他接口继承的接口应使用“inherit ...”而非“interface ...”进行声明
zh_hant: 由其他介面繼承的介面應該使用 'inherit ...' 宣告，不要使用 'interface ...'

# parsInvalidPrefixOperator
source: Invalid prefix operator
cs: Neplatný operátor předpony
de: Ungültiger Präfixoperator
es: Operador de prefijo no válido
fr: Opérateur de préfixe non valide
it: Operatore prefisso non valido
ja: 無効なプレフィックス演算子です
ko: 잘못된 전위 연산자
pl: Nieprawidłowy operator prefiksu
pt_br: Operador pré-fixo inválido
ru: Недопустимый префиксный оператор
tr: Geçersiz ön ek işleci
zh_hans: 无效的前缀运算符
zh_hant: 無效的前置運算子

# parsInvalidPrefixOperatorDefinition
source: Invalid operator definition. Prefix operator definitions must use a valid prefix operator name.
cs: Neplatná definice operátora. Definice operátorů předpon musí používat platné názvy těchto operátorů.
de: Ungültige Operatordefinition. Für Präfixoperatordefinitionen muss ein gültiger Präfixoperatorname verwendet werden.
es: Definición de operador no válida. Las definiciones de operador de prefijo deben usar un nombre de operador de prefijo válido.
fr: Définition d'opérateur non valide. Les définitions d'opérateur de préfixe doivent utiliser un nom d'opérateur de préfixe valide.
it: Definizione di operatore non valida. Le definizioni di operatore prefisso devono utilizzare un nome di operatore prefisso valido.
ja: 無効な演算子の定義です。プレフィックス演算子の定義には、有効なプレフィックス演算子名を使用する必要があります。
ko: 잘못된 연산자 정의입니다. 전위 연산자 정의에서는 유효한 전위 연산자 이름을 사용해야 합니다.
pl: Nieprawidłowa definicja operatora. Definicje operatora prefiksu muszą używać prawidłowej nazwy operatora prefiksu.
pt_br: Definição de operador inválida. Definições de operadores pré-fixos precisam usar um nome de operador válido.
ru: Недопустимое определение оператора. Определения префиксных операторов должны использовать допустимые имена префиксных операторов.
tr: Geçersiz işleç tanımı. Ön ek işleç tanımları geçerli bir ön ek işleci adı kullanmalıdır.
zh_hans: 运算符定义无效。前缀运算符定义必须使用有效的前缀运算符名称。
zh_hant: 無效的運算子定義。前置運算子定義必須使用有效的前置運算子名稱。

# buildCompilingExtensionIsForML
source: The file extensions '.ml' and '.mli' are for ML compatibility
cs: Přípony .ml a .mli zajišťují kompatibilitu s ML.
de: Die Dateierweiterungen ".ml" und ".mli" dienen der ML-Kompatibilität.
es: Las extensiones de archivo '.ml' y '.mli' son para la compatibilidad con ML.
fr: Les extensions de fichiers '.ml' et '.mli' sont utilisées pour la compatibilité ML
it: Le estensioni di file '.ml' e '.mli' sono per la compatibilità ML
ja: ファイル拡張子 '.ml' および '.mli' は ML 互換用です
ko: 파일 확장명 '.ml' 및 '.mli'는 ML 호환성을 위한 것입니다.
pl: Rozszerzenia pliku „ml” i „mli” są używane na potrzeby zgodności z językiem ML
pt_br: As extensões de arquivo '.ml' e '.mli' são para compatibilidade com ML
ru: Расширения файлов ".ml" и ".mli" предназначены для многоязыковой совместимости
tr: '.ml' ve '.mli' dosya uzantıları ML uyumluluğu içindir
zh_hans: 文件扩展名“.ml”和“.mli”适用于 ML 兼容性
zh_hant: 副檔名 '.ml' 和 '.mli' 是使用於 ML 相容性

# lexIndentOffForML
source: Consider using a file with extension '.ml' or '.mli' instead
cs: Zvažte možnost použít místo toho soubor s příponou .ml nebo .mli.
de: Verwenden Sie stattdessen eine Datei mit der Erweiterung ".ml" oder ".mli".
es: En su lugar, considere el uso de un archivo con la extensión '.ml' o '.mli'.
fr: Utilisez un fichier avec l'extension '.ml' ou '.mli' à la place
it: Provare a utilizzare un file con estensione '.ml' o '.mli'
ja: 代わりに、ファイル拡張子に '.ml' または '.mli' を使用してください
ko: 대신 확장명이 '.ml' 또는 '.mli'인 파일을 사용해 보세요.
pl: Rozważ użycie pliku z rozszerzeniem „ml” lub „mli”
pt_br: Considere usar um arquivo com extensão '.ml' ou '.mli' em vez disso
ru: Рассмотрите возможность использования файла с расширением ".ml" или ".mli"
tr: Bunun yerine uzantısı '.ml' veya '.mli' olan dosya kullanmayı düşünün
zh_hans: 请考虑改用扩展名为“.ml”或“.mli”的文件
zh_hant: 請考慮改用副檔名為 '.ml' 或 '.mli' 的檔案

# activePatternIdentIsNotFunctionTyped
source: Active pattern '{0}' is not a function
cs: Aktivní vzor {0} není funkce.
de: Das aktive Muster "{0}" ist keine Funktion.
es: El patrón activo '{0}' no es una función
fr: Le modèle actif '{0}' n'est pas une fonction
it: I criteri attivi '{0}' non sono una funzione
ja: アクティブ パターン '{0}' が関数ではありません
ko: 활성 패턴 '{0}'이(가) 함수가 아닙니다.
pl: Aktywny wzorzec „{0}” nie jest funkcją
pt_br: O padrão ativo '{0}' não é uma função
ru: Активный шаблон "{0}" не является функцией
tr: '{0}' etkin deseni bir işlev değil
zh_hans: 活动模式“{0}”不是一个函数
zh_hant: 現用模式 '{0}' 不是函式

# activePatternChoiceHasFreeTypars
source: Active pattern '{0}' has a result type containing type variables that are not determined by the input. The common cause is a when a result case is not mentioned, e.g. 'let (|A|B|) (x:int) = A x'. This can be fixed with a type constraint, e.g. 'let (|A|B|) (x:int) : Choice<int,unit> = A x'
cs: Typ výsledku aktivního vzoru {0} obsahuje proměnné typu, které nejsou určené vstupem. Příčinou je obvykle chybějící zmínka o rozlišení velkých a malých písmen výsledku, třeba výraz let (|A|B|) (x:int) = A x. Dá se to opravit omezením typu, třeba použitím výrazu let (|A|B|) (x:int) : Choice<int,jednotka> = A x.
de: Das aktive Muster "{0}" weist einen Ergebnistyp auf, der Typvariablen enthält, die nicht durch die Eingabe festgelegt werden. Häufig liegt die Ursache darin, dass kein Ergebnisfall erwähnt wird, z.B. "let (|A|B|) (x:int) = A x". Dies kann mit einer Typbeschränkung behoben werden, z.B. "let (|A|B|) (x:int) : Choice<int,unit> = A x".
es: El modelo activo "{0}" tiene un tipo de resultado que contiene las variables de tipo que no están determinadas por la entrada. La causa común es cuando un caso de resultado no se menciona, por ejemplo, "let (|A|B|) (x:int) = A x". Esto se puede solucionar con una restricción de tipo, por ejemplo, "let (|A|B|) (x:int) : Choice<int,unit> = A x"
fr: Le modèle actif '{0}' a un type de résultat contenant des variables de type non déterminées par l'entrée. Souvent, il s'agit d'un cas de résultat non mentionné, par ex. 'let (|A|B|) (x:int) = A x'. Le problème peut être corrigé avec une contrainte de type, par ex. 'let (|A|B|) (x:int) : Choice<int,unit> = A x'
it: I criteri attivi '{0}' hanno un tipo di risultati contenente variabili di tipo che non sono determinate dall'input. Probabilmente il case di risultato non è menzionato, ad esempio 'let (|A|B|) (x:int) = A x'. Il problema può essere risolto con un vincolo di tipo, ad esempio 'let (|A|B|) (x:int) : Choice<int,unit> = A x'
ja: アクティブ パターン '{0}' には、入力によって判別されていない型変数が含まれる結果型があります。一般に考えられる原因は、'let (|A|B|) (x:int) = A x' のように、結果ケースが言及されていない場合です。これは、'let (|A|B|) (x:int) : Choice<int,unit> = A x' などのように型制約を使用して解決できます
ko: 활성 패턴 '{0}'에 입력으로 확인되지 않는 형식 변수가 포함된 결과 형식이 있습니다. 이는 일반적으로 결과 케이스가 지정되지 않은 경우 발생합니다(예 'let (|A|B|) (x:int) = A x'). 이 문제는 형식 제약 조건을 지정하여 해결할 수 있습니다(예: 'let (|A|B|) (x:int) : Choice<int,unit> = A x').
pl: Aktywny wzorzec „{0}” ma typ wyniku zawierający zmienne typu, które nie są określone przez dane wejściowe. Częstą przyczyną jest brak podanego przypadku wyniku, np. „let (|A|B|) (x:int) = A x”. Można to naprawić za pomocą ograniczenia typu, np. „let (|A|B|) (x:int) : Choice<int,unit> = A x”
pt_br: O padrão ativo '{0}' tem um tipo de resultado que contém variáveis de tipo que não são determinadas pela entrada. A causa mais comum é quando um caso de resultado não é mencionado, ex.: 'let (|A|B|) (x:int) = A x'. Isso pode ser corrigido com uma restrição de tipo, ex.: 'let (|A|B|) (x:int) : Choice<int,unit> = A x'
ru: Активный шаблон " {0}" имеет тип результата, содержащий переменные типа, которые не определены входными данными. Обычно эта ошибка возникает, когда не упоминается тестовый случай результата, например, 'let (|A|B|) (x:int) = A x'. Чтобы исправить эту ошибку, можно ввести ограничение типа, например, 'let (|A|B|) (x:int) : Choice<int,unit> = A x'
tr: '{0}' etkin deseninin, giriş tarafından belirlenmeyen tür değişkenleri içeren bir sonuç türü var. Genellikle bunun nedeni, bir sonuç durumunun (ör. 'let (|A|B|) (x:int) = A x') belirtilmemesidir. Bu bir tür kısıtlamasıyla düzeltilebilir, ör. 'let (|A|B|) (x:int) : Choice<int,unit> = A x'
zh_hans: 活动模式“{0}”的结果类型包含未由输入确定的类型变量。常见的原因是未提及结果用例，例如 "let (|A|B|) (x:int) = A x"。可采用类型约束来解决此问题，例如 "let (|A|B|) (x:int) : Choice<int,unit> = A x"
zh_hant: 使用中模式 '{0}' 的結果類型包含類型變數，但輸入無法予以判斷。最常見的原因是未提及結果案例，例如 'let (|A|B|) (x:int) = A x'。您可使用類型條件約束予以修正，例如 'let (|A|B|) (x:int) : Choice<int,unit> = A x'

# ilFieldHasOffsetForSequentialLayout
source: The FieldOffset attribute can only be placed on members of types marked with the StructLayout(LayoutKind.Explicit)
cs: Atribut FieldOffset jde použít jenom pro členy typů s deklarací StructLayout(LayoutKind.Explicit).
de: Das FieldOffset-Attribut kann nur für Member des mit "StructLayout(LayoutKind.Explicit)" markierten Typs festgelegt werden.
es: El atributo FieldOffset solo se puede colocar en miembros de tipos marcados con StructLayout(LayoutKind.Explicit)
fr: L'attribut FieldOffset ne peut être placé que sur des membres de types marqués avec StructLayout(LayoutKind.Explicit)
it: L'attributo FieldOffset può essere usato solo in membri di tipo contrassegnati con StructLayout(LayoutKind.Explicit)
ja: FieldOffset 属性は、StructLayout(LayoutKind.Explicit) でマークされた型のメンバーでのみ使用できます
ko: FieldOffset 특성은 StructLayout(LayoutKind.Explicit)으로 표시된 형식의 멤버에만 배치할 수 있습니다.
pl: Atrybut FieldOffset można umieścić tylko w składowych o typie oznaczonym przy użyciu atrybutu StructLayout(LayoutKind.Explicit).
pt_br: O atributo FieldOffset só pode ser colocado em membros de tipos marcados com StructLayout(LayoutKind.Explicit)
ru: Атрибут FieldOffset может назначаться только членам типов, для которых используется StructLayout(LayoutKind.Explicit).
tr: FieldOffset özniteliği yalnızca StructLayout(LayoutKind.Explicit) ile işaretlenmiş türlerdeki üyelere koyulabilir
zh_hans: FieldOffset 特性只能放置在标记为 StructLayout(LayoutKind.Explicit) 的类型的成员上
zh_hant: FieldOffset 屬性僅能置於標記為 StructLayout(LayoutKind.Explicit) 類型的成員上
