Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# chkNoAddressOfArrayElementAtThisPoint
source: The address of an array element cannot be used at this point
cs: Adresa prvku pole se na tomto místě použít nedá.
de: Die Adresse eines Arrayelements kann an diesem Punkt nicht verwendet werden.
es: La dirección de un elemento de matriz no se puede usar en este punto.
fr: Impossible d'utiliser l'adresse d'un élément de tableau actuellement
it: Non è possibile usare l'indirizzo di un elemento di matrice in questo punto
ja: この時点で配列要素のアドレスは使用できません
ko: 배열 요소의 주소를 현재 사용할 수 없습니다.
pl: Nie można użyć adresu elementu tablicy w tym momencie
pt_br: O endereço de um elemento de matriz não pode ser usado neste ponto
ru: В этой точке нельзя использовать адрес элемента массива
tr: Dizi öğesinin adresi bu noktada kullanılamaz
zh_hans: 此时无法使用某个数组元素的地址
zh_hant: 目前無法使用陣列元素的位址

# chkFirstClassFuncNoByref
source: The type of a first-class function cannot contain byrefs
cs: Typ funkce první třídy nemůže obsahovat parametry typu ByRef.
de: Der Typ einer Funktion erster Klasse darf keine Byrefs enthalten.
es: El tipo de una función de primera clase no puede contener byrefs.
fr: Une fonction de première classe ne peut pas contenir de types byref
it: Il tipo di una funzione di prima classe non può contenere byref
ja: ファーストクラス関数の型に byref を含むことはできません
ko: 첫 번째 클래스 함수의 형식에는 byref를 포함할 수 없습니다.
pl: Typ funkcji pierwszoklasowej nie może zawierać typów byref
pt_br: O tipo de uma função de primeira classe não pode conter byrefs
ru: Тип функции первого класса не может содержать параметры типа byref
tr: Birinci sınıf bir işlevin türü byref'ler içeremez
zh_hans: 第一类函数的类型不能包含 byref
zh_hant: 第一級函式的類型不能包含 ByRef

# chkReturnTypeNoByref
source: A method return type would contain byrefs which is not permitted
cs: Návratový typ metody by obsahoval parametry ByRef a to není povolené.
de: Ein Methodenrückgabetyp würde Byrefs enthalten; das ist nicht zulässig.
es: Un tipo de valor devuelto de método contenía byrefs y esto no se permite.
fr: Le type de retour d'une méthode contient des types byref, ce qui n'est pas autorisé
it: Il tipo restituito di un metodo conterrebbe byref, il che non è consentito
ja: メソッドの戻り値の型に許可されていない byref が含まれています
ko: 메서드 반환 형식에 허용되지 않는 byref가 포함됩니다.
pl: Zwracany typ metody może zawierać wartości typu byref, co jest niedozwolone
pt_br: Um tipo de retorno de método conteria byrefs que não são permitidos
ru: Тип возвращаемого значения метода будет содержать параметры типа byref, что не допускается
tr: Bir metot dönüş türü byref'ler içeriyordu, buna izin verilmez
zh_hans: 方法返回类型将包含不允许使用的 byref
zh_hant: 方法傳回型別會包含不允許的 ByRef

# chkInvalidCustAttrVal
source: Invalid custom attribute value (not a constant or literal)
cs: Neplatná hodnota vlastního atributu (není to konstanta nebo literál)
de: Ungültiger benutzerdefinierter Attributwert (keine Konstante und kein Literal).
es: Valor de atributo personalizado no válido (no es una constante ni un literal).
fr: Valeur d'attribut personnalisé non valide (n'est pas une constante ou un littéral)
it: Valore di attributo personalizzato non valido (non è una costante o un valore letterale)
ja: カスタム属性値が無効です (定数またはリテラルではありません)
ko: 사용자 지정 특성 값이 잘못되었습니다(상수 또는 리터럴이 아님).
pl: Nieprawidłowa wartość atrybutu niestandardowego (nie jest to stała ani literał)
pt_br: Valor do atributo personalizado inválido (não é uma constante ou um literal)
ru: Недопустимое значение пользовательского атрибута (не является константой или литералом)
tr: Geçersiz özel öznitelik değeri (sabit veya değişmez değerli değil)
zh_hans: 自定义特性值无效(不是常数或文本)
zh_hant: 無效的自訂屬性值 (不是常數或常值)

# chkAttrHasAllowMultiFalse
source: The attribute type '{0}' has 'AllowMultiple=false'. Multiple instances of this attribute cannot be attached to a single language element.
cs: Typ atributu {0} má nastavení AllowMultiple=false. K elementu s jedním jazykem se nedá připojit víc instancí tohoto atributu.
de: Für den Attributtyp "{0}" ist "AllowMultiple=false" festgelegt. Mehrere Instanzen dieses Attributs können nicht einem einzigen Sprachelement angefügt werden.
es: El tipo de atributo '{0}' tiene 'AllowMultiple=false'. No se pueden asociar varias instancias de este atributo a un solo elemento de lenguaje.
fr: Le type d'attribut '{0}' a 'AllowMultiple=false'. Impossible d'attacher plusieurs instances de cet attribut à un élément de langage unique.
it: Per il tipo di attributo '{0}' è specificato 'AllowMultiple=false'. Non è possibile collegare più istanze di questo attributo a un singolo elemento del linguaggio.
ja: 属性の型 '{0}' に 'AllowMultiple=false' があります。この属性を持つ複数のインスタンスは、単一の言語要素にアタッチできません。
ko: 특성 형식 '{0}'에 'AllowMultiple=false'가 있습니다. 이 특성의 여러 인스턴스를 단일 언어 요소에 연결할 수 없습니다.
pl: Typ atrybutu „{0}” zawiera wartość „AllowMultiple=false”. Do pojedynczego elementu języka nie można dołączyć wielu wystąpień tego atrybutu.
pt_br: O tipo de atributo '{0}' possui 'AllowMultiple=false'. Instâncias múltiplas deste atributo não podem ser conectadas a um elemento de linguagem simples.
ru: Тип атрибута "{0}" имеет значение "AllowMultiple=false". Нельзя присоединить несколько экземпляров этого атрибута к одному элементу языка.
tr: '{0}' öznitelik türünde 'AllowMultiple=false' değeri var. Bu özniteliğin birden çok örneği tek bir dil öğesine iliştirilemez.
zh_hans: 特性类型“{0}”具有“AllowMultiple=false”。不能向单个语言元素附加此特性的多个实例。
zh_hant: 屬性類型 '{0}' 有 'AllowMultiple=false'。無法將這個屬性的多個執行個體附加到單一語言項目。

# chkMemberUsedInInvalidWay
source: The member '{0}' is used in an invalid way. A use of '{1}' has been inferred prior to its definition at or near '{2}'. This is an invalid forward reference.
cs: Člen {0} je použitý neplatným způsobem. Použití členu {1} se odvozuje před jeho definicí na pozici {2} nebo blízko ní. To je neplatný dopředný odkaz.
de: Die Verwendung des Members "{0}" ist ungültig. Die Verwendung von "{1}" wurde vor der Definition bei oder in der Nähe von "{2}" per Rückschluss abgeleitet. Dies ist ein ungültiger Vorwärtsverweis.
es: El miembro '{0}' se usa de forma no válida. Se ha inferido un uso de '{1}' antes de su definición en '{2}' o cerca. Esta es una referencia adelantada no válida.
fr: Le membre '{0}' est utilisé de manière incorrecte. Une utilisation de '{1}' a été déduite avant sa définition au niveau ou à proximité de '{2}'. Il s'agit d'une référence anticipée non valide.
it: Il membro '{0}' è utilizzato in modo non valido. Un utilizzo di '{1}' è stato dedotto prima della relativa definizione in o in prossimità di '{2}'. Si tratta di un riferimento in avanti non valido.
ja: メンバー '{0}' の使用方法に誤りがあります。'{2}' またはその付近の定義の前に '{1}' の使用が推論されました。これは無効な前方参照です。
ko: ’{0}' 멤버가 잘못된 방식으로 사용되었습니다. '{1}'이(가) 정의되기 전에 '{2}' 또는 그 근처에서 해당 사용이 유추되었습니다. 이는 잘못된 전방 참조입니다.
pl: Element członkowski „{0}” jest używany w nieprawidłowy sposób. Użycie „{1}” zostało wywnioskowane przed jego definicją w „{2}” lub w pobliżu tego miejsca. Jest to nieprawidłowe odwołanie w przód.
pt_br: O membro '{0}' é usado de uma forma inválida. Um uso de '{1}' foi inferido anteriormente para sua definição em '{2}' ou próximo a ele. Esta é uma referência de encaminhamento inválida.
ru: Недопустимый способ использования элемента "{0}". Использование "{1}" выведено до его определения в строке "{2}" или близлежащих строках. Недопустимая опережающая ссылка.
tr: {0}' üyesi geçersiz bir biçimde kullanılmış. '{1}' kullanımı, '{2}' konumunda veya yakınındaki tanımından önce çıkarılmış. Bu geçersiz bir ileriye doğru başvurudur.
zh_hans: 成员“{0}”的使用方式无效。在“{2}”处或其附近给出定义之前，已推理使用了“{1}”。这是无效的前向引用。
zh_hant: 成員 '{0}' 的使用方式無效。系統推斷 '{1}' 在其定義之前已在 '{2}' 或附近使用過。這是無效的向前參考。

# chkNoByrefAsTopValue
source: A byref typed value would be stored here. Top-level let-bound byref values are not permitted.
cs: Hodnota typu ByRef by se uložila tady. Hodnoty ByRef s vazbou na let na nejvyšší úrovni nejsou povolené.
de: Ein Wert vom Typ "byref" würde hier gespeichert werden. byref-Werte der obersten Ebene vom Typ "let-bound" sind nicht zulässig.
es: Aquí se almacenaría un valor de tipo byref. No se permiten valores byref enlazados a let de nivel superior.
fr: Une valeur typée byref doit être stockée ici. Les valeurs byref liées à let de niveau supérieur ne sont pas autorisées.
it: In questa posizione verrebbe archiviato un valore di tipo byref. Non sono consentiti valori byref associati a let di livello superiore.
ja: byref 型の値がここに保存されます。トップレベルの let-bound byref 値は許可されていません。
ko: byref 형식의 값이 여기에 저장됩니다. 최상위 let 바인딩 byref 값은 허용되지 않습니다.
pl: Może tutaj być przechowywana wartość typu byref. Wartości typu byref najwyższego poziomu wiązane słowem kluczowym let są niedozwolone.
pt_br: Um valor do tipo byref seria armazenado aqui. Não são permitidos valores de alto nível associados a let byref.
ru: Здесь будет храниться значение типа byref. Использование значений верхнего уровня типа byref с привязкой let не допускается.
tr: Türü byref olarak belirtilmiş bir değer buraya depolanacaktı. Üst düzeyde let ile bağlanmış byref değerlerine izin verilmez.
zh_hans: 将在此处存储 byref 类型化值。不允许使用顶级的 let 绑定的 byref 值。
zh_hant: ByRef 類型的值將儲存在這裡。不允許最上層 LET 繫結的 ByRef 值。

# chkReflectedDefCantSplice
source: [<ReflectedDefinition>] terms cannot contain uses of the prefix splice operator '%'
cs: Výrazy [<ReflectedDefinition>] nemůžou obsahovat použití operátoru spojení předpon %.
de: [< ReflectedDefinition >]-Begriffe dürfen keinen Präfix-Splice-Operator "%" enthalten.
es: Los términos de [< ReflectedDefinition >] no pueden contener usos del operador de inserción de prefijo "%"
fr: Les conditions de [<ReflectedDefinition>] ne peuvent pas contenir d'utilisations de l'opérateur d'ajout de préfixe '%'
it: I termini [<ReflectedDefinition>] non possono contenere usi dell'operatore di splicing del prefisso '%'
ja: [<ReflectedDefinition>] 用語には、プレフィックスのスプライス演算子 '%' を使用できません
ko: [<ReflectedDefinition>] 용어에는 접두사 스플라이스 연산자 '%'을(를) 포함할 수 없습니다.
pl: W warunkach [<ReflectedDefinition>] nie można używać operatora łączenia prefiksu „%”
pt_br: Termos [<ReflectedDefinition>] não podem conter usos de operador da união pré-fixo '%'
ru: В условиях [<ReflectedDefinition>] не может использоваться оператор объединения префикса '%'
tr: [<ReflectedDefinition>] terimleri, '%' ön ek birleştirme işlecinin kullanımını içeremez
zh_hans: [<ReflectedDefinition>] 条件中不能使用前缀拼接运算符 "%"
zh_hant: [<ReflectedDefinition>] 字詞不能包含前置詞接合運算子 '%' 的用法

# chkEntryPointUsage
source: A function labeled with the 'EntryPointAttribute' attribute must be the last declaration in the last file in the compilation sequence.
cs: Funkce označená atributem EntryPointAttribute musí být poslední deklarací v posledním souboru v sekvenci kompilace.
de: Eine Funktion mit dem EntryPointAttribute-Attribut muss die letzte Deklaration in der letzten Datei der Kompilierungssequenz sein.
es: Una función etiquetada con el atributo "EntryPointAttribute" debe ser la última declaración en el último archivo de la secuencia de compilación.
fr: Une fonction étiquetée avec l'attribut 'EntryPointAttribute' doit être la dernière déclaration du dernier fichier de la séquence de compilation.
it: Una funzione con l'attributo 'EntryPointAttribute' come etichetta deve essere l'ultima dichiarazione nell'ultimo file della sequenza di compilazione.
ja: 'EntryPointAttribute' 属性のラベルを付けた関数は、コンパイル シーケンスの最後のファイルの最後の宣言にする必要があります。
ko: 'EntryPointAttribute' 특성을 사용하여 레이블이 지정된 함수는 컴파일 시퀀스에서 마지막 파일의 마지막 선언이어야 합니다.
pl: Funkcja z etykietą i atrybutem „EntryPointAttribute” musi być ostatnią deklaracją w ostatnim pliku sekwencji kompilacji.
pt_br: Uma função rotulada com o atributo 'EntryPointAttribute' deve ser a última declaração no último arquivo na sequência de compilação.
ru: Функция, помеченная атрибутом "EntryPointAttribute", должна быть последним объявлением в последнем файле последовательности компиляции.
tr: 'EntryPointAttribute' özniteliği ile etiketlenmiş bir işlev, derleme dizisinin sonuncu dosyasındaki sonuncu bildirim olmalıdır.
zh_hans: 用 "EntryPointAttribute" 特性标记的函数必须是编译序列中最后一个文件中的最后一个声明。
zh_hant: 標記了 'EntryPointAttribute' 屬性的函式必須是編譯順序中最後一個檔案中的最後一個宣告。

# chkUnionCaseCompiledForm
source: compiled form of the union case
cs: Zkompilovaná forma případu typu union
de: kompilierte Form des Union-Falls
es: forma compilada del caso de unión
fr: forme compilée du cas d'union
it: form compilato del case di unione
ja: 共用体ケースのコンパイル済みの形式
ko: 공용 구조체 케이스의 컴파일 형식
pl: skompilowanej postaci przypadku unii
pt_br: forma compilada do caso união
ru: откомпилированная форма ветви объединения
tr: birleşim durumunun derlenmiş biçimi
zh_hans: 联合用例的已编译形式
zh_hant: 聯集的編譯形式

# chkUnionCaseDefaultAugmentation
source: default augmentation of the union case
cs: Výchozí rozšíření případu typu union
de: Standardaugmentation des Union-Falls
es: aumento predeterminado del caso de unión
fr: augmentation par défaut du cas d'union
it: aumento predefinito del case di unione
ja: 共用体ケースの既定の拡張
ko: 공용 구조체 케이스의 기본 확대
pl: domyślnym rozszerzeniu przypadku unii
pt_br: aumento padrão do caso união
ru: приращение по умолчанию для ветви объединения
tr: birleşim durumunun varsayılan genişletmesi
zh_hans: 联合用例的默认扩大
zh_hant: 聯集的預設增強指定

# chkPropertySameNameMethod
source: The property '{0}' has the same name as a method in type '{1}'.
cs: Vlastnost {0} má stejný název jako metoda v typu {1}.
de: Die Eigenschaft "{0}" hat denselben Namen wie eine Methode im Typ "{1}".
es: La propiedad "{0}" tiene el mismo nombre que un método del tipo "{1}".
fr: La propriété '{0}' a le même nom qu'une méthode dans le type '{1}'.
it: Il nome della proprietà '{0}' corrisponde a quello di un metodo nel tipo '{1}'.
ja: プロパティ '{0}' は、型 '{1}' のメソッドと名前が同じです。
ko: {0}' 속성의 이름이 '{1}' 형식의 메서드와 같습니다.
pl: Właściwość „{0}” ma taką samą nazwę co metoda w typie „{1}”.
pt_br: A propriedade '{0}' tem o mesmo nome que um método no tipo '{1}'.
ru: Имя свойства "{0}" аналогично имени метода в типе "{1}".
tr: {0}' özelliği, '{1}' türündeki bir metotla aynı ada sahip.
zh_hans: 属性“{0}”与类型“{1}”中的某个方法具有相同的名称。
zh_hant: 屬性 '{0}' 與類型 '{1}' 中的方法同名。

# chkGetterSetterDoNotMatchAbstract
source: The property '{0}' of type '{1}' has a getter and a setter that do not match. If one is abstract then the other must be as well.
cs: Metody get a set vlastnosti {0} typu {1} si neodpovídají. Pokud je jedna z nich abstraktní, musí být abstraktní i ta druhá.
de: Der Getter und der Setter der Eigenschaft "{0}" vom Typ "{1}" stimmen nicht überein. Wenn einer abstrakt ist, muss es der andere ebenfalls sein.
es: La propiedad "{0}" de tipo "{1}" tiene un captador y un establecedor que no coinciden. Si uno es abstracto, el otro debe serlo también.
fr: La propriété '{0}' de type '{1}' a une méthode getter et une méthode setter qui ne correspondent pas. Si l'une est abstraite, l'autre doit l'être également.
it: La proprietà '{0}' di tipo '{1}' contiene un getter e un setter che non corrispondono. Se uno di essi è astratto, è necessario che lo sia anche l'altro.
ja: 型 '{1}' のプロパティ '{0}' には一致しないゲッターとセッターがあります。一方が抽象の場合、もう一方も抽象にします。
ko: {1}' 형식의 '{0}' 속성에 일치하지 않는 getter와 setter가 있습니다. 하나가 추상 요소인 경우 다른 하나도 추상 요소여야 합니다.
pl: Właściwość „{0}” typu „{1}” ma metodę pobierającą i metodę ustawiającą, które są niezgodne. Jeśli jedna z nich jest abstrakcyjna, druga również musi taka być.
pt_br: A propriedade '{0}' do tipo '{1}' tem um getter e um setter que não são correspondentes. Se um deles for abstrato, o outro também deverá ser.
ru: Свойство "{0}" типа "{1}" содержит несовпадающие методы получения и задания. Если один из этих методов является абстрактным, второй также должен быть абстрактным.
tr: {1}' türündeki '{0}' özelliğinin alıcısı ve ayarlayıcısı eşleşmiyor. Biri soyut ise diğeri de soyut olmalıdır.
zh_hans: 类型为“{1}”的属性“{0}”存在不匹配的 Getter 和 Setter。如果其中一个是抽象的，则另一个也必须是抽象的。
zh_hant: 類型為 '{1}' 之屬性 '{0}' 的 getter 與 setter 不匹配。若其中一個為抽象，另一個也必須為抽象。

# chkPropertySameNameIndexer
source: The property '{0}' has the same name as another property in type '{1}', but one takes indexer arguments and the other does not. You may be missing an indexer argument to one of your properties.
cs: Vlastnost {0} má stejný název jako jiná vlastnost v typu {1}, ale jedna z nich přebírá argumenty indexeru a druhá ne. Je možné, že u jedné z vlastností chybí argument indexeru.
de: Die Eigenschaft "{0}" hat denselben Namen wie eine andere Eigenschaft im Typ "{1}", allerdings akzeptiert eine Eigenschaft Indexerargumente und die andere nicht. Möglicherweise fehlt ein Indexerargument für eine der Eigenschaften.
es: La propiedad "{0}" tiene el mismo nombre que otra propiedad del tipo "{1}", pero una toma argumentos de indizador y la otra no. Puede que falte un argumento de indizador en una de las propiedades.
fr: La propriété '{0}' a le même nom qu'une autre propriété dans le type '{1}'. Toutefois, l'une d'elles accepte les arguments de l'indexeur mais pas l'autre. Il manque peut-être un argument d'indexeur dans l'une de vos propriétés.
it: Il nome della proprietà '{0}' corrisponde a quello di un'altra proprietà nel tipo '{1}', tuttavia una accetta argomenti di indicizzatore e l'altra no. È possibile che in una delle proprietà manchi un argomento di indicizzatore.
ja: プロパティ '{0}' は型 '{1}' の別のプロパティと名前が同じですが、一方はインデクサー引数を使用し、もう一方は使用していません。一方のプロパティでインデクサー引数を失う可能性があります。
ko: {0}' 속성의 이름이 '{1}' 형식의 다른 속성과 같지만 하나는 인덱서 인수를 사용하고 다른 하나는 그렇지 않습니다. 속성 중 하나에 대한 인덱서 인수가 없을 수 있습니다.
pl: Właściwość „{0}” ma taką samą nazwę co inna właściwość w typie „{1}”, ale pobiera argumenty indeksatora, których druga właściwość nie pobiera. Być może brakuje argumentu indeksatora jednej z właściwości.
pt_br: A propriedade '{0}' tem o mesmo nome que outra propriedade no tipo '{1}', mas uma tem argumentos de indexador e a outra não. Talvez você precise de um argumento de indexador para uma das suas propriedades.
ru: Имена свойства "{0}" и другого свойства в типе "{1}" совпадают, но только одно из этих свойств принимает аргументы индексатора. Возможно, в одном из свойств отсутствует аргумент индексатора.
tr: {0}' özelliği, '{1}' türündeki başka bir özellikle aynı ada sahip ancak bunlardan biri dizin oluşturucu bağımsız değişkenleri alırken diğeri almıyor. Özelliklerinizden birinde dizin oluşturucu bağımsız değişkeni eksik olabilir.
zh_hans: 属性“{0}”与类型“{1}”中的另一个属性具有相同的名称，但是其中一个属性采用了索引器参数，而另一个属性未采用。可能缺少其中一个属性的索引器参数。
zh_hant: 屬性 '{0}' 與類型 '{1}' 中的另一個屬性同名，但其中一個接受索引子引數，另一個不接受。您的其中一個屬性可能缺少了索引子引數。

# chkCantStoreByrefValue
source: A type would store a byref typed value. This is not permitted by Common IL.
cs: Typ by uložil hodnotu typu ByRef. To ale Common IL nepovoluje.
de: In einem Typ würde ein Wert vom Typ "byref" gespeichert werden. Dies ist mit der Common IL nicht zulässig.
es: Un tipo almacenaría un valor de tipo byref. Esto no se permite en Common IL.
fr: Un type doit stocker une valeur typée byref. Cela n'est pas autorisé par le langage CIL (Common Intermediate Language).
it: Un valore di tipo byref verrebbe archiviato in un tipo. Ciò non è consentito dall'IL comune.
ja: 型に byref 型の値が保存されています。この操作は Common IL では許可されていません。
ko: 형식에 byref 형식의 값이 저장됩니다. 이는 공통 IL에서 허용되지 않습니다.
pl: Typ będzie przechowywać wartość typu byref. Nie jest to dozwolone przez język Common IL.
pt_br: Um tipo armazenaria um valor do tipo byref. Isso não é permitido pelo IL Comum.
ru: Тип обычно используется для хранения значения типа byref. В общем промежуточном языке это не допускается.
tr: Bir türde byref olarak belirtilmiş değer depolanmak istendi. Ortak Ara Dilde (CIL) buna izin verilmez.
zh_hans: 某个类型将存储 byref 类型化值。通用 IL 不允许这样做。
zh_hant: 類型將儲存 ByRef 類型的值。這是 Common IL 所不允許的作法。

# chkDuplicateMethod
source: Duplicate method. The method '{0}' has the same name and signature as another method in type '{1}'.
cs: Duplicitní metoda. Metoda {0} má stejný název a signaturu jako jiná metoda v typu {1}.
de: Doppelte Methode. Die Methode "{0}" hat denselben Namen und dieselbe Signatur wie eine andere Methode im Typ "{1}".
es: Método duplicado. El método "{0}" tiene el mismo nombre y la misma signatura que otro método del tipo "{1}".
fr: Méthode dupliquée. La méthode '{0}' a le même nom et la même signature qu'une autre méthode dans le type '{1}'.
it: Metodo duplicato. Il nome e la firma del metodo '{0}' corrispondono a quelli di un altro metodo nel tipo '{1}'.
ja: 重複したメソッド。メソッド '{0}' は、名前とシグネチャが型 '{1}' の別のメソッドと同じです。
ko: 메서드가 중복되었습니다. '{0}' 메서드의 이름 및 시그니처가 '{1}' 형식의 다른 메서드와 같습니다.
pl: Zduplikowana metoda. Metoda „{0}” ma taką samą nazwę i sygnaturę co inna metoda w typie „{1}”.
pt_br: Método duplicado. O método '{0}' tem o mesmo nome e assinatura que outro método no tipo '{1}'.
ru: Повторяющийся метод. Имя и сигнатура метода "{0}" аналогичны другому методу в типе "{1}".
tr: Yinelenen metot. '{0}' metodu, '{1}' türündeki başka bir metotla aynı ada ve imzaya sahip.
zh_hans: 重复方法。方法“{0}”与类型“{1}”中的另一个方法具有相同的名称和签名。
zh_hant: 方法重複。方法 '{0}' 與類型 '{1}' 中另一個方法同名，且簽章也相同。

# chkDuplicateMethodWithSuffix
source: Duplicate method. The method '{0}' has the same name and signature as another method in type '{1}' once tuples, functions, units of measure and/or provided types are erased.
cs: Duplicitní metoda. Metoda {0} má po vymazání řazených kolekcí členů, funkcí, měrných jednotek a poskytnutých typů stejný název a signaturu jako jiná metoda v typu {1}.
de: Doppelte Methode. Die Methode "{0}" hat denselben Namen und dieselbe Signatur wie eine andere Methode im Typ "{1}", nachdem Tupel, Funktionen, Maßeinheiten und/oder angegebene Typen gelöscht wurden.
es: Método duplicado. El método "{0}" tiene el mismo nombre y la misma signatura que otro método del tipo "{1}" una vez borradas las tuplas, funciones, unidades de medida o tipos proporcionados.
fr: Méthode dupliquée. La méthode '{0}' a le même nom et la même signature qu'une autre méthode dans le type '{1}', une fois les tuples, fonctions, unités de mesure et/ou types fournis effacés.
it: Metodo duplicato. Il nome e la firma del metodo '{0}' corrispondono a quelli di un altro metodo nel tipo '{1}' dopo la cancellazione di tuple, funzioni, unità di misura e/o tipi forniti.
ja: 重複したメソッド。メソッド '{0}' は、タプル、関数、測定単位、指定された型が消去されると、名前とシグネチャが型 '{1}' の他のメソッドと同じになります。
ko: 메서드가 중복되었습니다. '{0}' 메서드의 이름 및 시그니처가 '{1}' 형식의 다른 메서드와 같습니다(튜플, 함수, 측정 단위 및/또는 제공된 형식을 지울 경우).
pl: Zduplikowana metoda. Metoda „{0}” ma taką samą nazwę i sygnaturę co inna metoda w typie „{1}” po wymazaniu krotek, funkcji, jednostek miary i/lub udostępnionych typów.
pt_br: Método duplicado. O método '{0}' tem o mesmo nome e assinatura que outro método no tipo '{1}' assim que tuplas, funções, unidades de medida e/ou tipos fornecidos são apagados.
ru: Повторяющийся метод. Имя и сигнатура метода "{0}" аналогичны другому методу в типе "{1}" после удаления кортежей, функций, единиц измерения и предоставляемых типов.
tr: Yinelenen metot. Demetler, işlevler, ölçü birimleri ve/veya sağlanan türler silindikten sonra '{0}' metodu, '{1}' türündeki başka bir metotla aynı ada ve imzaya sahip oluyor.
zh_hans: 重复方法。清除元组、函数、度量单位和/或提供的类型后，方法“{0}”与类型“{1}”中的另一个方法具有相同的名称和签名。
zh_hant: 方法重複。當元組、函式、測量單位及 (或) 提供的類型清除之後，方法 '{0}' 與類型 '{1}' 中另一個方法同名，且簽章也相同。
