Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DefinitionsInSigAndImplNotCompatibleDotNetTypeRepresentationIsHidden
source: The {0} definitions for type '{1}' in the signature and implementation are not compatible because a CLI type representation is being hidden by a signature
cs: Definice {0} pro typ {1} v signatuře a implementaci nejsou kompatibilní, protože signatura skrývá reprezentaci typu CLI.
de: Die {0} Definitionen für den Typ "{1}" in der Signatur und in der Implementierung sind nicht kompatibel, weil eine CLI-Typdarstellung von einer Signatur verdeckt wird.
es: Las definiciones de {0} para el tipo "{1}" en la signatura y la implementación no son compatibles porque una signatura oculta una representación de tipo CLI
fr: Les {0} définitions pour le type '{1}' dans la signature et l'implémentation ne sont pas compatibles, car une représentation de type CLI est masquée par une signature
it: Le definizioni di {0} per il tipo '{1}' nella firma e nell'implementazione non sono compatibili perché una rappresentazione di tipo CLI è nascosta da una firma
ja: CLI の型表現がシグネチャによって隠ぺいされているため、シグネチャおよび実装内の型 '{1}' の {0} 定義は互換性がありません
ko: 시그니처에 의해 CLI 형식 표현이 숨겨져 있으므로 시그니처 및 구현의 '{1}' 형식에 대한 {0} 정의가 호환되지 않습니다.
pl: Definicje {0} dla typu „{1}” w sygnaturze i implementacji są niezgodne, ponieważ reprezentacja typu infrastruktury CLI jest ukrywana przez sygnaturę
pt_br: As definições {0} para o tipo '{1}' na assinatura e implementação não são compatíveis, pois uma representação do tipo CLI foi ocultada pela assinatura
ru: Определения {0} для типа "{1}" в сигнатуре и реализации несовместимы, так как представление типа CLI скрывается сигнатурой.
tr: Bir CLI tür temsili imza ile gizlendiğinden, imza ve uygulamadaki '{1}' türü için {0} tanımları uyumlu değil
zh_hans: 签名和实现中类型“{1}”的 {0} 定义不兼容，因为签名将隐藏 CLI 类型表示形式
zh_hant: 簽章與實作中類型 '{1}' 的 {0} 定義不相容，因為簽章隱藏了某 CLI 類型表示法

# DefinitionsInSigAndImplNotCompatibleTypeIsHidden
source: The {0} definitions for type '{1}' in the signature and implementation are not compatible because a type representation is being hidden by a signature
cs: Definice {0} pro typ {1} v signatuře a implementaci nejsou kompatibilní, protože signatura skrývá reprezentaci typu.
de: Die {0} Definitionen für den Typ "{1}" in der Signatur und in der Implementierung sind nicht kompatibel, weil eine Typdarstellung von einer Signatur verdeckt wird.
es: Las definiciones de {0} para el tipo "{1}" en la signatura y la implementación no son compatibles porque una signatura oculta una representación de tipo
fr: Les {0} définitions pour le type '{1}' dans la signature et l'implémentation ne sont pas compatibles, car une représentation de type est masquée par une signature
it: Le definizioni di {0} per il tipo '{1}' nella firma e nell'implementazione non sono compatibili perché una rappresentazione di tipo è nascosta da una firma
ja: 型表現がシグネチャによって隠ぺいされているため、シグネチャおよび実装内の型 '{1}' の {0} 定義は互換性がありません
ko: 시그니처에 의해 형식 표현이 숨겨져 있으므로 시그니처 및 구현의 '{1}' 형식에 대한 {0} 정의가 호환되지 않습니다.
pl: Definicje {0} dla typu „{1}” w sygnaturze i implementacji są niezgodne, ponieważ reprezentacja typu jest ukrywana przez sygnaturę
pt_br: As definições {0} para o tipo '{1}' na assinatura e implementação não são compatíveis, pois uma representação de tipo está sendo ocultada por uma assinatura
ru: Определения {0} для типа "{1}" в сигнатуре и реализации несовместимы, так как представление типа скрывается сигнатурой.
tr: Bir tür temsili imza ile gizlendiğinden, imza ve uygulamadaki '{1}' türü için {0} tanımları uyumlu değil
zh_hans: 签名和实现中类型“{1}”的 {0} 定义不兼容，因为签名将隐藏类型表示形式
zh_hant: 簽章與實作中類型 '{1}' 的 {0} 定義不相容，因為簽章隱藏了某類型表示法

# DefinitionsInSigAndImplNotCompatibleTypeIsDifferentKind
source: The {0} definitions for type '{1}' in the signature and implementation are not compatible because the types are of different kinds
cs: Definice {0} pro typ {1} v signatuře a implementaci nejsou kompatibilní, protože typy jsou různého druhu.
de: Die {0} Definitionen für den Typ "{1}" in der Signatur und in der Implementierung sind nicht kompatibel, weil die Typen unterschiedlich sind.
es: Las definiciones de {0} para el tipo "{1}" en la signatura y la implementación no son compatibles porque los tipos son de tipo diferente
fr: Les {0} définitions pour le type '{1}' dans la signature et l'implémentation ne sont pas compatibles, car les types sont de différents genres
it: Le definizioni di {0} per il tipo '{1}' nella firma e nell'implementazione non sono compatibili perché i tipi sono di genere diverso
ja: 型の種類が異なるため、シグネチャおよび実装内の型 '{1}' の {0} 定義は互換性がありません
ko: 형식의 종류가 서로 다르므로 시그니처 및 구현의 '{1}' 형식에 대한 {0} 정의가 호환되지 않습니다.
pl: Definicje {0} dla typu „{1}” w sygnaturze i implementacji są niezgodne, ponieważ typy są różnego rodzaju
pt_br: As definições {0} para o tipo '{1}' na assinatura e implementação não são compatíveis, pois os tipos são de diferentes tipos
ru: Определения {0} для типа "{1}" в сигнатуре и реализации несовместимы, так как типы принадлежат разным разновидностям.
tr: Türler farklı çeşitlerde olduğundan, imza ve uygulamadaki '{1}' türü için {0} tanımları uyumlu değil
zh_hans: 签名和实现中类型“{1}”的 {0} 定义不兼容，因为类型的种类不相同
zh_hant: 簽章與實作中類型 '{1}' 的 {0} 定義不相容，因為類型屬於不同類型

# DefinitionsInSigAndImplNotCompatibleILDiffer
source: The {0} definitions for type '{1}' in the signature and implementation are not compatible because the IL representations differ
cs: Definice {0} pro typ {1} v signatuře a implementaci nejsou kompatibilní, protože se liší reprezentace IL.
de: Die {0} Definitionen für den Typ "{1}" in der Signatur und in der Implementierung sind nicht kompatibel, weil die IL-Darstellungen unterschiedlich sind.
es: Las definiciones de {0} para el tipo "{1}" en la signatura y la implementación no son compatibles porque las representaciones de IL difieren
fr: Les {0} définitions pour le type '{1}' dans la signature et l'implémentation ne sont pas compatibles, car les représentations IL (Intermediate Language) sont différentes
it: Le definizioni di {0} per il tipo '{1}' nella firma e nell'implementazione non sono compatibili perché le rappresentazioni IL sono diverse
ja: IL 表現が異なるため、シグネチャおよび実装内の型 '{1}' の {0} 定義は互換性がありません
ko: IL 표현이 서로 다르므로 시그니처 및 구현의 '{1}' 형식에 대한 {0} 정의가 호환되지 않습니다.
pl: Definicje {0} dla typu „{1}” w sygnaturze i implementacji są niezgodne z powodu różnych reprezentacji obiektu IL
pt_br: As definições {0} para o tipo '{1}' na assinatura e implementação não são compatíveis, pois as representações de nível de integridade são diferentes
ru: Определения {0} для типа "{1}" в сигнатуре и реализации несовместимы, так как представления IL различаются.
tr: IL temsilleri farklı olduğundan, imza ve uygulamadaki '{1}' türü için {0} tanımları uyumlu değil
zh_hans: 签名和实现中类型“{1}”的 {0} 定义不兼容，因为 IL 表示形式不同
zh_hant: 簽章與實作中類型 '{1}' 的 {0} 定義不相容，因為 IL 表示法不同

# DefinitionsInSigAndImplNotCompatibleRepresentationsDiffer
source: The {0} definitions for type '{1}' in the signature and implementation are not compatible because the representations differ
cs: Definice {0} pro typ {1} v signatuře a implementaci nejsou kompatibilní, protože se liší reprezentace.
de: Die {0} Definitionen für den Typ "{1}" in der Signatur und in der Implementierung sind nicht kompatibel, weil die Darstellungen unterschiedlich sind.
es: Las definiciones de {0} para el tipo "{1}" en la signatura y la implementación no son compatibles porque las representaciones difieren
fr: Les {0} définitions pour le type '{1}' dans la signature et l'implémentation ne sont pas compatibles, car les représentations sont différentes
it: Le definizioni di {0} per il tipo '{1}' nella firma e nell'implementazione non sono compatibili perché le rappresentazioni sono diverse
ja: シグネチャおよび実装内の型 '{1}' の {0} 定義は、表現が異なるため、互換性がありません
ko: 표현이 서로 다르므로 시그니처 및 구현의 '{1}' 형식에 대한 {0} 정의가 호환되지 않습니다.
pl: Definicje {0} dla typu „{1}” w sygnaturze i implementacji są niezgodne, ponieważ reprezentacje są różne
pt_br: As definições {0} para o tipo '{1}' na assinatura e implementação não são compatíveis, pois as representações são diferentes
ru: Определения {0} для типа "{1}" в сигнатуре и реализации несовместимы, так как представления различаются.
tr: Temsiller farklı olduğundan, imza ve uygulamadaki '{1}' türü için {0} tanımları uyumlu değil
zh_hans: 签名和实现中类型“{1}”的 {0} 定义不兼容，因为表示形式不同
zh_hant: 簽章與實作中類型 '{1}' 的 {0} 定義不相容，因為表示法不同

# DefinitionsInSigAndImplNotCompatibleFieldWasPresent
source: The {0} definitions for type '{1}' in the signature and implementation are not compatible because the field {2} was present in the implementation but not in the signature
cs: Definice {0} pro typ {1} v signatuře a implementaci nejsou kompatibilní, protože pole {2} se nacházelo v implementaci, ale v signatuře ne.
de: Die {0} Definitionen für den Typ "{1}" in der Signatur und in der Implementierung sind nicht kompatibel, weil das Feld "{2}" in der Implementierung vorhanden war, nicht aber in der Signatur.
es: Las definiciones de {0} para el tipo "{1}" en la signatura y la implementación no son compatibles porque el campo {2} estaba presente en la implementación pero no en la signatura
fr: Les {0} définitions pour le type '{1}' dans la signature et l'implémentation ne sont pas compatibles, car le champ {2} était présent dans l'implémentation mais pas dans la signature
it: Le definizioni di {0} per il tipo '{1}' nella firma e nell'implementazione non sono compatibili perché il campo {2} è presente nell'implementazione ma non nella firma
ja: フィールド {2} が実装にはありますがシグネチャにはないため、シグネチャおよび実装内の型 '{1}' の {0} 定義は互換性がありません
ko: {2}' 필드가 구현에 있었지만 시그니처에는 없었으므로 시그니처 및 구현의 '{1}' 형식에 대한 {0} 정의가 호환되지 않습니다.
pl: Definicje {0} dla typu „{1}” w sygnaturze i implementacji są niezgodne, ponieważ pole {2} było obecne w implementacji, ale nie w sygnaturze
pt_br: As definições {0} para o tipo '{1}' na assinatura e implementação não são compatíveis, pois o campo {2} estava presente na implementação, mas não na assinatura
ru: Определения {0} для типа "{1}" в сигнатуре и реализации несовместимы, так как поле {2} присутствует в реализации, но отсутствует в сигнатуре.
tr: {2} alanı uygulamada mevcut olmasına rağmen imzada mevcut olmadığından, imza ve uygulamadaki '{1}' türü için {0} tanımları uyumlu değil
zh_hans: 签名和实现中类型“{1}”的 {0} 定义不兼容，因为实现中具有字段“{2}”，而签名中没有该字段
zh_hant: 簽章與實作中類型 '{1}' 的 {0} 定義不相容，因為實作中有欄位 {2}，但簽章中沒有

# DefinitionsInSigAndImplNotCompatibleFieldOrderDiffer
source: The {0} definitions for type '{1}' in the signature and implementation are not compatible because the order of the fields is different in the signature and implementation
cs: Definice {0} pro typ {1} v signatuře a implementaci nejsou kompatibilní, protože se signatura a implementace liší pořadím polí.
de: Die {0} Definitionen für den Typ "{1}" in der Signatur und in der Implementierung sind nicht kompatibel, weil die Reihenfolge der Felder in der Signatur und in der Implementierung unterschiedlich ist.
es: Las definiciones de {0} para el tipo "{1}" en la signatura y la implementación no son compatibles porque el orden de los campos es diferente en la signatura y la implementación
fr: Les {0} définitions pour le type '{1}' dans la signature et l'implémentation ne sont pas compatibles, car l'ordre des champs est différent entre la signature et l'implémentation
it: Le definizioni di {0} per il tipo '{1}' nella firma e nell'implementazione non sono compatibili perché l'ordine dei campi nella firma e nell'implementazione è diverso
ja: フィールドの順序がシグネチャと実装とで異なるため、シグネチャおよび実装内の型 '{1}' の {0} 定義は互換性がありません
ko: 시그니처와 구현에서 필드의 순서가 서로 다르므로 시그니처 및 구현의 '{1}' 형식에 대한 {0} 정의가 호환되지 않습니다.
pl: Definicje {0} dla typu „{1}” w sygnaturze i implementacji są niezgodne z powodu różnej kolejności pól w sygnaturze i implementacji
pt_br: As definições {0} para o tipo '{1}' na assinatura e implementação não são compatíveis, pois a ordem dos campos está diferente na assinatura e na implementação
ru: Определения {0} для типа "{1}" в сигнатуре и реализации несовместимы, так как порядок полей в сигнатуре и реализации различается.
tr: Alanların sırası imzada ve uygulamada farklı olduğundan, imza ve uygulamadaki '{1}' türü için {0} tanımları uyumlu değil
zh_hans: 签名和实现中类型“{1}”的 {0} 定义不兼容，因为签名和实现中的字段顺序不同
zh_hant: 簽章與實作中類型 '{1}' 的 {0} 定義不相容，因為簽章與實作中的欄位順序不同

# DefinitionsInSigAndImplNotCompatibleFieldRequiredButNotSpecified
source: The {0} definitions for type '{1}' in the signature and implementation are not compatible because the field {2} was required by the signature but was not specified by the implementation
cs: Definice {0} pro typ {1} v signatuře a implementaci nejsou kompatibilní, protože signatura vyžadovala pole {2}, které ale v implementaci zadané nebylo.
de: Die {0} Definitionen für den Typ "{1}" in der Signatur und in der Implementierung sind nicht kompatibel, weil das Feld "{2}" für die Signatur erforderlich war, in der Implementierung aber nicht angegeben wurde.
es: Las definiciones de {0} para el tipo "{1}" de la signatura y la implementación no son compatibles porque la signatura requería el campo {2} pero la implementación no lo especificó
fr: Les {0} définitions pour le type '{1}' dans la signature et l'implémentation ne sont pas compatibles, car le champ {2} a été demandé par la signature mais n'a pas été spécifié par l'implémentation
it: Le definizioni di {0} per il tipo '{1}' nella firma e nell'implementazione non sono compatibili perché per la firma è necessario il campo {2}, che però non è stato specificato dall'implementazione
ja: シグネチャにはフィールド {2} が必要ですが、実装では指定されていないため、シグネチャおよび実装内の型 '{1}' の {0} 定義は互換性がありません
ko: {2}' 필드가 시그니처에 필요했지만 구현에 의해 지정되지 않았으므로 시그니처 및 구현의 '{1}' 형식에 대한 {0} 정의가 호환되지 않습니다.
pl: Definicje {0} dla typu „{1}” w sygnaturze i implementacji są niezgodne, ponieważ pole {2} było wymagane przez sygnaturę, ale nie zostało określone przez implementację
pt_br: As definições {0} para o tipo '{1}' na assinatura e implementação não são compatíveis, pois o campo {2} foi solicitado pela assinatura, mas não foi especificado pela implementação
ru: Определения {0} для типа "{1}" в сигнатуре и реализации несовместимы, так как поле {2} является обязательным в сигнатуре, но не указано в реализации.
tr: {2} alanı imza için gerekmesine rağmen uygulama tarafından belirtilmediğinden, imza ve uygulamadaki '{1}' türü için {0} tanımları uyumlu değil
zh_hans: 签名和实现中类型“{1}”的 {0} 定义不兼容，因为签名需要字段“{2}”，而实现未指定该字段
zh_hant: 簽章與實作中類型 '{1}' 的 {0} 定義不相容，因為簽章需要欄位 {2}，但實作卻未指定

# DefinitionsInSigAndImplNotCompatibleFieldIsInImplButNotSig
source: The {0} definitions for type '{1}' in the signature and implementation are not compatible because the field '{2}' was present in the implementation but not in the signature. Struct types must now reveal their fields in the signature for the type, though the fields may still be labelled 'private' or 'internal'.
cs: Definice {0} pro typ {1} v signatuře a implementaci nejsou kompatibilní, protože pole {2} se nacházelo v implementaci, ale v signatuře ne. Typy Struct teď musí zobrazovat svoje pole v signatuře typu. Přesto můžou mít pole označení private nebo internal.
de: Die {0} Definitionen für den Typ "{1}" in der Signatur und in der Implementierung sind nicht kompatibel, weil das Feld "{2}" in der Implementierung vorhanden war, nicht aber in der Signatur. Strukturtypen müssen jetzt ihre Felder in der Signatur für den Typ offen legen, auch wenn die Felder möglicherweise noch als "private" oder "internal" bezeichnet werden.
es: Las definiciones de {0} para el tipo "{1}" en la signatura y la implementación no son compatibles porque el campo "{2}" estaba presente en la implementación pero no en la signatura. Los tipos struct deben revelar ahora sus campos en la signatura del tipo, aunque los campos pueden continuar etiquetados como "private" o "internal".
fr: Les {0} définitions pour le type '{1}' dans la signature et l'implémentation ne sont pas compatibles, car le champ '{2}' était présent dans l'implémentation mais pas dans la signature. Les types struct doivent désormais révéler leurs champs dans la signature relative au type ; toutefois, les champs peuvent continuer à être étiquetés 'private' ou 'internal'.
it: Le definizioni di {0} per il tipo '{1}' nella firma e nell'implementazione non sono compatibili perché il campo '{2}' è presente nell'implementazione ma non nella firma. I tipi struct devono ora mostrare i relativi campi nella firma per il tipo, nonostante i campi possano comunque essere associati alle etichette 'private' o 'internal'.
ja: フィールド '{2}' が実装にはありますがシグネチャにはないため、シグネチャおよび実装内の型 '{1}' の {0} 定義は互換性がありません。この型のシグネチャでは、構造体型のフィールドを公開する必要があります。ただし、フィールドのラベルは 'private' または 'internal' のままにすることもできます。
ko: {2}' 필드가 구현에 있었지만 시그니처에는 없었으므로 시그니처 및 구현의 '{1}' 형식에 대한 {0} 정의가 호환되지 않습니다. 이제 구조체 형식은 시그니처에서 형식에 대해 필드를 표시해야 하지만 필드의 레이블은 계속 'private' 또는 'internal'로 지정할 수 있습니다.
pl: Definicje {0} dla typu „{1}” w sygnaturze i implementacji są niezgodne, ponieważ pole „{2}” było obecne w implementacji, ale nie w sygnaturze. Typy struktury muszą teraz udostępniać swoje pola w sygnaturze dla typu, chociaż pola nadal mogą mieć etykietę „private” lub „internal”.
pt_br: As definições {0} para o tipo '{1}' na assinatura e implementação não são compatíveis, pois o campo '{2}' estava presente na implementação, mas não na assinatura. Os tipos struct agora devem revelar seus campos na assinatura para o tipo, embora os campos ainda possam ser rotulados como 'private' ou 'internal'.
ru: Определения {0} для типа "{1}" в сигнатуре и реализации несовместимы, так как поле "{2}" присутствует в реализации, но отсутствует в сигнатуре. Типы-структуры теперь должны показывать свои поля в сигнатуре для типа, несмотря на то что поля по-прежнему могут помечаться как private или internal.
tr: {2}' alanı uygulamada mevcut olmasına rağmen imzada mevcut olmadığından, imza ve uygulamadaki '{1}' türü için {0} tanımları uyumlu değil. Struct türleri artık tür imzasında alanlarını göstermelidir, ancak bu alanlar yine de 'private' veya 'internal' olarak etiketlenebilir.
zh_hans: 签名和实现中类型“{1}”的 {0} 定义不兼容，因为实现中具有字段“{2}”，而签名中没有该字段。虽然这些字段可能仍标记为“私有”或“内部”，但是结构类型此时必须在该类型的签名中显示其字段。
zh_hant: 簽章與實作中類型 '{1}' 的 {0} 定義不相容，因為實作中有欄位 '{2}'，但簽章中沒有。結構類型現在必須在類型的簽章中顯示其欄位，但欄位仍可以標示為 'private' 或 'internal'。

# DefinitionsInSigAndImplNotCompatibleAbstractMemberMissingInImpl
source: The {0} definitions for type '{1}' in the signature and implementation are not compatible because the abstract member '{2}' was required by the signature but was not specified by the implementation
cs: Definice {0} pro typ {1} v signatuře a implementaci nejsou kompatibilní, protože signatura vyžadovala abstraktního člena {2}, který ale v implementaci zadaný nebyl.
de: Die {0} Definitionen für den Typ "{1}" in der Signatur und in der Implementierung sind nicht kompatibel, weil der abstrakte Member "{2}" für die Signatur erforderlich war, in der Implementierung aber nicht angegeben wurde.
es: Las definiciones de {0} para el tipo "{1}" de la signatura y la implementación no son compatibles porque la signatura requería el miembro abstracto "{2}" pero la implementación no lo especificó
fr: Les {0} définitions pour le type '{1}' dans la signature et l'implémentation ne sont pas compatibles, car le membre abstrait '{2}' a été requis par la signature mais n'a pas été spécifié par l'implémentation
it: Le definizioni di {0} per il tipo '{1}' nella firma e nell'implementazione non sono compatibili perché per la firma è necessario il membro astratto '{2}', che però non è stato specificato dall'implementazione
ja: シグネチャには抽象メンバー '{2}' が必要ですが、実装では指定されていないため、シグネチャおよび実装内の型 '{1}' の {0} 定義は互換性がありません
ko: 추상 멤버 '{2}'이(가) 시그니처에 필요했지만 구현에 의해 지정되지 않았으므로 시그니처 및 구현의 '{1}' 형식에 대한 {0} 정의가 호환되지 않습니다.
pl: Definicje {0} dla typu „{1}” w sygnaturze i implementacji są niezgodne, ponieważ abstrakcyjny element członkowski „{2}” był wymagany przez sygnaturę, ale nie został określony przez implementację
pt_br: As definições {0} para o tipo '{1}' na assinatura e implementação não são compatíveis, pois o membro abstrato '{2}' foi requerido pela assinatura, mas não foi especificado pela implementação
ru: Определения {0} для типа "{1}" в сигнатуре и реализации несовместимы, так как абстрактный элемент "{2}" задан в сигнатуре, но не указан в реализации.
tr: {2}' soyut üyesi imza için gerekmesine rağmen uygulama tarafından belirtilmediğinden, imza ve uygulamadaki '{1}' türü için {0} tanımları uyumlu değil
zh_hans: 签名和实现中类型“{1}”的 {0} 定义不兼容，因为签名需要抽象成员“{2}”，而实现未指定该成员
zh_hant: 簽章與實作中類型 '{1}' 的 {0} 定義不相容，因為簽章需要抽象成員 '{2}'，但實作卻未指定

# DefinitionsInSigAndImplNotCompatibleAbstractMemberMissingInSig
source: The {0} definitions for type '{1}' in the signature and implementation are not compatible because the abstract member '{2}' was present in the implementation but not in the signature
cs: Definice {0} pro typ {1} v signatuře a implementaci nejsou kompatibilní, protože abstraktní člen {2} se nacházel v implementaci, ale v signatuře ne.
de: Die {0} Definitionen für den Typ "{1}" in der Signatur und in der Implementierung sind nicht kompatibel, weil der abstrakte Member "{2}" in der Implementierung vorhanden war, nicht aber in der Signatur.
es: Las definiciones de {0} para el tipo "{1}" en la signatura y la implementación no son compatibles porque el miembro abstracto "{2}" estaba presente en la implementación pero no en la signatura
fr: Les {0} définitions pour le type '{1}' dans la signature et l'implémentation ne sont pas compatibles, car le membre abstrait '{2}' était présent dans l'implémentation mais pas dans la signature
it: Le definizioni di {0} per il tipo '{1}' nella firma e nell'implementazione non sono compatibili perché il membro astratto '{2}' è presente nell'implementazione ma non nella firma
ja: 抽象メンバー '{2}' が実装にはありますがシグネチャにはないため、シグネチャおよび実装内の型 '{1}' の {0} 定義は互換性がありません
ko: 추상 멤버 '{2}'이(가) 구현에 있었지만 시그니처에는 없었으므로 시그니처 및 구현의 '{1}' 형식에 대한 {0} 정의가 호환되지 않습니다.
pl: Definicje {0} dla typu „{1}” w sygnaturze i implementacji są niezgodne, ponieważ abstrakcyjny element członkowski „{2}” był obecny w implementacji, ale nie w sygnaturze
pt_br: As definições {0} para o tipo '{1}' na assinatura e implementação não são compatíveis, pois o membro abstrato '{2}' estava presente na implementação, mas não na assinatura
ru: Определения {0} для типа "{1}" в сигнатуре и реализации несовместимы, так как абстрактный элемент "{2}" присутствует в реализации, но отсутствует в сигнатуре.
tr: {2}' soyut üyesi uygulamada mevcut olmasına rağmen imzada mevcut olmadığından, imza ve uygulamadaki '{1}' türü için {0} tanımları uyumlu değil
zh_hans: 签名和实现中类型“{1}”的 {0} 定义不兼容，因为实现中具有抽象成员“{2}”，而签名中没有该成员
zh_hant: 簽章與實作中類型 '{1}' 的 {0} 定義不相容，因為實作中有抽象成員 '{2}'，但簽章中沒有
