Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# tcUninitializedValFieldsMustBeMutable
source: Uninitialized 'val' fields must be mutable and marked with the '[<DefaultValue>]' attribute. Consider using a 'let' binding instead of a 'val' field.
cs: Neinicializovaná pole val musí být měnitelná a musí být označená atributem [<DefaultValue>]. Zvažte možnost použít místo pole val vazbu let.
de: Nicht initialisierte "val"-Felder müssen änderbar und mit dem Attribut "[<DefaultValue>]" gekennzeichnet sein. Verwenden Sie eine "let"-Bindung statt einem "val"-Feld.
es: Los campos "val" sin inicializar deben ser mutables y marcarse con el atributo "[<DefaultValue>]". Considere la posibilidad de usar un enlace "let" en lugar de un campo "val".
fr: Les champs 'val' non initialisés doivent être mutables et marqués avec l'attribut '[<DefaultValue>]'. Utilisez une liaison 'let' au lieu d'un champ 'val'.
it: I campi 'val' non inizializzati devono essere modificabili e contrassegnati con l'attributo '[<DefaultValue>]'. Provare a usare un binding 'let' invece di un campo 'val'.
ja: 初期化されていない 'val' フィールドは変更可能で、'[<DefaultValue>]' 属性によってマークされている必要があります。'val' フィールドの代わりに 'let' バインディングの使用を検討してください。
ko: 초기화되지 않은 'val' 필드는 변경할 수 있어야 하며 '[<DefaultValue>]' 특성으로 표시되어야 합니다. 'val' 필드 대신 'let' 바인딩을 사용해 보세요.
pl: Niezainicjowane pola „val” muszą być modyfikowalne i oznaczone przy użyciu atrybutu „[<DefaultValue>]”. Rozważ użycie powiązania „let” zamiast pola „val”.
pt_br: Campos 'val' não inicializados devem ser mutáveis e marcados com o atributo '[<DefaultValue>]'.Use uma associação 'let' em vez de um campo 'val'.
ru: Неинициализированные поля 'val' должны быть изменяемыми и должны быть помечены атрибутом '[<DefaultValue>]'. Используйте привязку 'let' вместо поля 'val'.
tr: Başlatılmamış 'val' alanları değiştirilebilir olmalı ve '[<DefaultValue>]' özniteliğiyle işaretlenmelidir. Bir 'val' alanı yerine 'let' kullanmayı göz önünde bulundurun.
zh_hans: 未初始化的 "val" 字段必须是可变的且标记有 "[<DefaultValue>]" 属性。请考虑使用 "let" 绑定而不是 "val" 字段。
zh_hant: 未初始化的 'val'欄位必須是可變的，並以 '[<DefaultValue>]' 屬性標示。請考慮使用 'let' 繫結，而不使用 'val' 欄位。

# tcStaticValFieldsMustBeMutableAndPrivate
source: Static 'val' fields in types must be mutable, private and marked with the '[<DefaultValue>]' attribute. They are initialized to the 'null' or 'zero' value for their type. Consider also using a 'static let mutable' binding in a class type.
cs: Statická pole val v typech musí být měnitelná, privátní a označená atributem [<DefaultValue>]. Inicializují se na hodnotu null nebo zero podle jejich typu. Zvažte možnost použít v typu třídy také vazbu static let mutable.
de: Statische "val"-Felder in Typen müssen änderbar, privat und mit dem "[<DefaultValue>]"-Attribut gekennzeichnet sein. Sie werden mit dem "NULL"- oder "0"-Wert ihres Typs initalisiert. Verwenden Sie eine "static let mutable"-Bindung in einem Klassentyp.
es: Los campos "val" estáticos en los tipos deben ser mutables y privados y estar marcados con el atributo "[& lt; DefaultValue & gt;]". Se inicializan en el valor "null" o "zero" para su tipo. Considere también usar un enlace "static let mutable" en un tipo de clase.
fr: Les champs 'val' statiques dans les types doivent être mutables, privés et marqués avec l'attribut '[<DefaultValue>]'. Ils sont initialisés sur la valeur 'null' ou 'zero' pour leur type. Utilisez aussi une liaison 'static let mutable' dans un type de classe.
it: I campi 'val' statici nei tipi devono essere modificabili, privati e contrassegnati con l'attributo '[<DefaultValue>]'. Tali campi vengono inizializzati sul valore 'Null' o 'zero' per il relativo tipo. Provare inoltre a usare un binding 'static let mutable' in un tipo di classe.
ja: 型の静的な 'val' フィールドは変更可能で、プライベートで、さらには'[<DefaultValue>]' 属性でマークされている必要があります。これらの型では、'null' 値または 'zero' 値に初期化されます。クラス型で 'static let mutable' バインディングを使用することも検討してください。
ko: 형식의 정적 'val' 필드는 변경할 수 있어야 하고 Private이어야 하며 '[<DefaultValue>]' 특성으로 표시되어야 합니다. 이러한 필드는 해당 형식에 맞게 'null' 또는 '0' 값으로 초기화됩니다. 클래스 형식에 'static let mutable' 바인딩도 사용해 보세요.
pl: Statyczne pola „val” w typach muszą być modyfikowalne, prywatne i oznaczone przy użyciu atrybutu „[<DefaultValue>]”. Są one inicjowane dla swoich typów przy użyciu wartości „null” lub „zero”. Rozważ też użycie powiązania „static let mutable” w typie klasy.
pt_br: Os campos estáticos 'val' nos tipos devem ser mutáveis, particulares e marcados com o atributo '[<DefaultValue>]'. Eles são inicializados com o valor 'null' ou 'zero' para seu tipo. Use também uma associação 'static let mutable' em um tipo de classe.
ru: Статические поля 'val' в типах должны быть изменяемыми, закрытыми и должны быть помечены атрибутом '[<DefaultValue>]'. Они инициализируются значениями 'null' или 'zero' для своего типа. Вы также можете использовать привязку 'static let mutable' в типе класса.
tr: Türlerdeki statik 'val' alanları değiştirilebilir, özel olmalı ve '[<DefaultValue>]' özniteliğiyle işaretlenmelidir. Bunlar türleri için 'null' veya 'zero' değerine başlatılır. Bir sınıf türünde 'static let mutable' bağlamasını kullanmayı da göz önünde bulundurun.
zh_hans: 类型中的静态 "val" 字段必须是可变的和私有的，并标记了 "[<DefaultValue>]" 属性。这些字段将初始化为各自类型的 "null" 或“零”值。请考虑在类类型中也使用 "static let mutable" 绑定。
zh_hant: 類型中的靜態 'val' 欄位必須是可變、私人的，並以 '[<DefaultValue>]' 標示。這些欄位會依據其類型，初始化為 'null' 或 'zero' 值。請考慮也在類別類型中使用 'static let mutable' 繫結。

# tcFieldRequiresName
source: This field requires a name
cs: Toto pole vyžaduje název.
de: Für dieses Feld ist ein Name erforderlich.
es: Este campo requiere un nombre.
fr: Ce champ requiert un nom
it: Per questo campo è necessario un nome
ja: このフィールドには名前が必要です
ko: 이 필드에는 이름이 필요합니다.
pl: To pole wymaga nazwy
pt_br: Este campo requer um nome
ru: Для этого поля требуется имя
tr: Bu alan için ad gerekiyor
zh_hans: 此字段需要名称
zh_hant: 這個欄位需要名稱

# tcInvalidNamespaceModuleTypeUnionName
source: Invalid namespace, module, type or union case name
cs: Neplatný název oboru názvů, modulu, typu nebo případu typu union
de: Ungültiger Namespace-, Modul-, Typ- oder Union-Fallname.
es: Nombre de espacio de nombres, módulo, tipo o caso de unión no válido.
fr: Nom d'espace de noms, de module, de type ou de cas d'union non valide
it: Nome di case di unione, tipo, modulo o spazio dei nomi non valido
ja: 名前空間、モジュール、型、または共用体ケースの名前が無効です
ko: 네임스페이스, 모듈, 형식 또는 공용 구조체 케이스 이름이 잘못되었습니다.
pl: Nieprawidłowa nazwa przestrzeni nazw, modułu, typu lub przypadku unii
pt_br: Nome de namespace, módulo, tipo ou caso união inválido
ru: Недопустимое имя пространства имен, типа или ветви объединения
tr: Geçersiz ad alanı, modül, tür veya birleşim durumu adı
zh_hans: 命名空间、模块、类型或联合用例名称无效
zh_hant: 無效的命名空間、模組、類型或聯集名稱

# tcIllegalFormForExplicitTypeDeclaration
source: Explicit type declarations for constructors must be of the form 'ty1 * ... * tyN -> resTy'. Parentheses may be required around 'resTy'
cs: Explicitní deklarace typu pro konstruktory musí mít formát ty1 * ... * tyN -> resTy. Je možné, že výraz resTy bude potřeba uzavřít do závorek.
de: Explizite Typdeklarationen für Konstruktoren müssen der Form "ty1 * ... * tyN -> resTy" entsprechen. Klammern um "resTy" können erforderlich sein.
es: Las declaraciones de tipo explícito para constructores deben tener el formato ''ty1 * ... * tyN -> resTy". Se podrían requerir paréntesis alrededor de "resTy".
fr: Les déclarations de type explicites pour les constructeurs doivent être de la forme 'ty1 * ... * tyN -> resTy'. Des parenthèses peuvent être nécessaires autour de 'resTy'
it: Le dichiarazioni di tipo esplicito per i costruttori devono essere nel formato 'ty1 * ... * tyN -> resTy'. Potrebbe essere necessario racchiudere 'resTy' tra parentesi
ja: コンストラクターの明示的な型宣言の形式は 'ty1 * ... * tyN -> resTy' でなければなりません。'resTy' をかっこで囲まなければならない場合があります
ko: 생성자에 대한 명시적 형식 선언의 형식은 'ty1 * ... * tyN -> resTy'여야 합니다. 'resTy'를 괄호로 묶어야 할 수 있습니다.
pl: Jawne deklaracje typów w przypadku konstruktorów muszą mieć postać „ty1 * ... * tyN -> resTy”. Może być konieczne ujęcie ciągu „resTy” w nawias
pt_br: Declarações de tipo explícito para construtores devem estar na forma 'ty1 * ... * tyN -> resTy'. Pode ser necessário usar parênteses em torno de 'resTy'
ru: Объявления явных типов для конструкторов должны иметь вид 'ty1 * ... * tyN -> resTy'. Может потребоваться заключить 'resTy' в скобки
tr: Oluşturuculara yönelik açık tür bildirimleri 'ty1 * ... * tyN -> resTy' biçiminde olmalıdır. 'resTy' ifadesinin parantez içine alınması gerekebilir
zh_hans: 构造函数的显式类型声明必须采用 "ty1 * ... * tyN -> resTy" 格式。"resTy" 两侧可能需要加括号
zh_hant: 建構函式的明確類型宣告形式必須為 'ty1 * ... * tyN -> resTy'。'resTy' 前後可能需要括號

# tcReturnTypesForUnionMustBeSameAsType
source: Return types of union cases must be identical to the type being defined, up to abbreviations
cs: Návratové typy případů typu union musí být identické s typem, který se definuje, a to až po zkratky.
de: Rückgabetypen von Union-Fällen müssen genau mit dem definierten Typ übereinstimmen, bis hin zu den Abkürzungen.
es: Los tipos devueltos de casos de unión deben ser idénticos al tipo que se va a definir, hasta las abreviaciones.
fr: Les types de retour des cas d'union doivent être identiques au type défini, jusqu'aux abréviations
it: I tipi restituiti di case di unione devono essere identici al tipo in fase di definizione, fino alle abbreviazioni
ja: 共用体ケースの戻り値の型は、省略形に従い、定義されている型と同じにする必要があります
ko: 공용 구조체 케이스의 반환 형식은 약어까지 정의 대상 형식과 동일해야 합니다.
pl: Zwracane typy przypadków unii muszą być identyczne z definiowanym typem, łącznie ze skrótami
pt_br: Tipos de retorno de casos união devem ser idênticos aos tipos que estão sendo definidos, até as abreviações
ru: Типы возвращаемых значений случаев объединений должны быть идентичны определяемому типу, вплоть до сокращений
tr: Birleşim durumlarının dönüş türleri tanımlanmakta olan türle kısaltmalara kadar özdeş olmalıdır
zh_hans: 联合用例的返回类型必须与要定义的类型(直至类型的缩写词)相同
zh_hant: 聯集的傳回類型必須與所定義的類型一樣，直到縮寫為止

# tcInvalidEnumerationLiteral
source: This is not a valid value for an enumeration literal
cs: Toto není platná hodnota pro literál výčtu.
de: Dies ist kein gültiger Wert für ein Enumerationsliteral.
es: Este no es un valor válido para un literal de enumeración.
fr: Valeur non valide pour un littéral d'énumération
it: Valore non valido per un valore letterale di enumerazione
ja: 列挙型リテラルの有効な値ではありません
ko: 열거형 리터럴에 대한 올바른 값이 아닙니다.
pl: To nie jest prawidłowa wartość literału wyliczenia
pt_br: Este não é um valor válido para um literal de enumeração
ru: Это не является допустимым значением для литерала перечисления
tr: Bu, sabit listesi değeri olarak geçerli bir değer değil
zh_hans: 对于枚举文本来说，这不是有效的值
zh_hant: 這不是列舉常值的有效值

# tcTypeIsNotInterfaceType1
source: The type '{0}' is not an interface type
cs: Typ {0} není typ rozhraní.
de: Der Typ "{0}" ist kein Schnittstellentyp.
es: El tipo '{0}' no es un tipo de interfaz.
fr: Le type '{0}' n'est pas un type interface
it: Il tipo '{0}' non è un tipo di interfaccia
ja: 型 '{0}' はインターフェイス型ではありません
ko: '{0}' 형식은 인터페이스 형식이 아닙니다.
pl: Typ „{0}” nie jest typem interfejsu
pt_br: O tipo '{0}' não é um tipo de interface
ru: Тип "{0}" не является интерфейсным типом
tr: '{0}' türü bir arabirim türü değil
zh_hans: 类型“{0}”不是接口类型
zh_hant: 類型 '{0}' 不是介面類型

# tcDuplicateSpecOfInterface
source: Duplicate specification of an interface
cs: Duplicitní specifikace rozhraní
de: Doppelte Schnittstellenspezifikation.
es: Especificación duplicada en una interfaz.
fr: Spécification dupliquée d'une interface
it: Specifica di un'interfaccia duplicata
ja: インターフェイスの指定に重複があります
ko: 인터페이스가 중복 지정되었습니다.
pl: Zduplikowana specyfikacja interfejsu
pt_br: Especificação duplicada de uma interface
ru: Дублированная спецификация интерфейса
tr: Yinelenen arabirim belirtimi
zh_hans: 重复的接口规范
zh_hant: 介面有重複的規格

# tcFieldValIllegalHere
source: A field/val declaration is not permitted here
cs: Deklarace pole nebo hodnoty tady není povolená.
de: Eine Feld/Wert-Deklaration ist an dieser Stelle nicht zulässig.
es: Aquí no se permite una declaración de campo o val.
fr: Aucune déclaration de champ/valeur n'est autorisée ici
it: Dichiarazione di campo/valore non consentita in questa posizione
ja: ここでは field/val の宣言を使用できません
ko: 필드/val 선언은 여기에 허용되지 않습니다.
pl: Deklaracja pola/wartości nie jest tutaj dozwolona
pt_br: Uma declaração de campo/val não é permitida aqui
ru: Объявление field/val здесь не разрешено
tr: Alan/değer bildirimine burada izin verilmez
zh_hans: 此处不允许使用字段/值声明
zh_hant: 此處不允許欄位/val 宣告

# tcInheritIllegalHere
source: A inheritance declaration is not permitted here
cs: Zděděná deklarace tady není povolená.
de: Eine Vererbungsdeklaration ist an dieser Stelle nicht zulässig.
es: Aquí no se permite una declaración de herencia.
fr: Aucune déclaration d'héritage n'est autorisée ici
it: Dichiarazione di ereditarietà non consentita in questa posizione
ja: ここでは継承の宣言を使用できません
ko: 상속 선언은 여기에 허용되지 않습니다.
pl: Deklaracja dziedziczenia nie jest tutaj dozwolona
pt_br: Não é permitido usar uma declaração herdada aqui
ru: Объявление наследования здесь не разрешено
tr: Devralma bildirimine burada izin verilmiyor
zh_hans: 此处不允许使用继承声明
zh_hant: 此處不允許繼承宣告

# tcModuleRequiresQualifiedAccess
source: This declaration opens the module '{0}', which is marked as 'RequireQualifiedAccess'. Adjust your code to use qualified references to the elements of the module instead, e.g. 'List.map' instead of 'map'. This change will ensure that your code is robust as new constructs are added to libraries.
cs: Tato deklarace otevírá modul {0}, který má označení RequireQualifiedAccess. Upravte kód tak, aby místo toho používal kvalifikované odkazy na elementy modulu, třeba místo map použijte List.map. Touto změnou zajistíte, že bude kód funkční i v případě, že se budou do knihoven přidávat nové konstruktory.
de: Diese Deklaration öffnet das Modul "{0}", das als "RequireQualifiedAccess" markiert ist. Passen Sie den Code an, indem Sie stattdessen qualifizierte Verweise auf die Modulelemente verwenden. Beispiel: "List.map" anstelle von "map". Durch diese Änderung stellen Sie sicher, dass der Code auch dann stabil bleibt, wenn die Bibliotheken um neue Konstrukte ergänzt werden.
es: Esta declaración abre el módulo '{0}', que está marcado como 'RequireQualifiedAccess'. Ajuste el código para usar referencias completas a los elementos del módulo; por ejemplo, 'List.map' en lugar de 'map'. Este cambio garantizará la solidez del código conforme se agreguen nuevas construcciones a las bibliotecas.
fr: Cette déclaration ouvre le module '{0}', qui est marqué comme 'RequireQualifiedAccess'. Modifiez votre code pour utiliser des références qualifiées aux éléments du module à la place. Par exemple, utilisez 'List.map' au lieu de 'map'. Cette modification garantit la fiabilité de votre code au fur et à mesure de l'ajout de nouvelles constructions aux bibliothèques.
it: La dichiarazione apre il modulo '{0}' che è contrassegnato come 'RequireQualifiedAccess'. Modificare il codice in modo da utilizzare riferimenti qualificati agli elementi del modulo, ad esempio 'List.map' invece di 'map'. Questa modifica assicurerà l'affidabilità del codice quando verranno aggiunti nuovi costrutti alle librerie.
ja: この宣言は 'RequireQualifiedAccess' とマークされているモジュール '{0}' を開きます。代わりにモジュールの要素に対する限定参照を使用するようにコードを変更してください (たとえば、'map' の代わりに 'List.map')。この変更によってコードが堅牢になり、新しいコンストラクターがライブラリに追加された場合にも対応できます。
ko: 이 선언은 'RequireQualifiedAccess'로 표시된 '{0}' 모듈을 엽니다. 대신 모듈의 요소에 대해 한정된 참조를 사용하도록 코드를 조정하십시오(예: 'map' 대신 'List.map'). 이렇게 변경하면 라이브러리에 새 구문이 추가될 때 코드가 견고성을 잃지 않게 됩니다.
pl: Ta deklaracja powoduje otwarcie modułu „{0}”, który jest oznaczony jako „RequireQualifiedAccess”. Dostosuj kod, aby używał odwołań kwalifikowanych do elementów modułu, na przykład „List.map” zamiast „map”. Ta zmiana pozwoli zagwarantować niezawodność kodu, gdy do bibliotek zostaną dodane nowe konstrukcje.
pt_br: Esta declaração abre o módulo '{0}', que é marcado como 'RequireQualifiedAccess'. Ajuste seus códigos para usar referências qualificadas aos elementos do módulo, por exemplo 'List.map' ao invés de 'map'. Esta mudança garantirá que seu código seja robusto porque novos construtores são adicionados às bibliotecas.
ru: Данное объявление открывает модуль "{0}", помеченный как "RequireQualifiedAccess". Измените код так, чтобы вместо этого использовались квалифицированные ссылки на элементы модуля, напр. 'List.map' вместо 'map'. Данное изменение обеспечит надежность кода при добавлении конструкций в библиотеки.
tr: Bu bildirim, 'RequireQualifiedAccess' olarak işaretlenmiş '{0}' modülünü açar. Bunun yerine, kodunuzu modülün öğelerine yapılan nitelikli başvuruları kullanacak şekilde ayarlayın, örn. 'map' yerine 'List.map'. Bu değişiklik, kitaplıklara yeni yapılar eklendikçe kodunuzun sağlam kalmasını sağlar.
zh_hans: 此声明将打开标记为“RequireQualifiedAccess”的模块“{0}”。请调整您的代码以改用对模块元素的限定引用，例如“List.map”而非“map”。此更改将确保您的代码在库中不断添加新构造的情况下依然可靠。
zh_hant: 這個宣告會開啟標記為 'RequireQualifiedAccess' 的模組 '{0}'。請將您的程式碼調整為改用模組項目的限定參考，例如 'List.map'，而不是 'map'。這項變更將確保在新建構加入至程式庫時，您的程式碼可以更為強固。

# tcOpenUsedWithPartiallyQualifiedPath
source: This declaration opens the namespace or module '{0}' through a partially qualified path. Adjust this code to use the full path of the namespace. This change will make your code more robust as new constructs are added to the F# and CLI libraries.
cs: Tato deklarace otevírá obor názvů nebo modul {0} prostřednictvím částečně kvalifikované cesty. Upravte tento kód tak, aby používal úplnou cestu oboru názvů. Touto změnou zajistíte, že bude kód funkční i v případě, že se budou do knihoven F# a CLI přidávat nové konstruktory.
de: Mit dieser Deklaration wird der Namespace oder das Modul "{0}" über einen teilweise qualifizierten Pfad geöffnet. Passen Sie den Code an, und fügen Sie den vollständigen Pfad des Namespace hinzu. Durch diese Änderung bleibt der Code auch dann stabil, wenn die F#- und CLI-Bibliotheken um neue Konstrukte ergänzt werden.
es: Esta declaración abre el espacio de nombres o modelo '{0}' a través de una ruta de acceso parcial. Ajuste este código para usar la ruta de acceso completa del espacio de nombres. Este cambio hará que el código sea más sólido conforme se agreguen nuevas construcciones a las bibliotecas de F# y CLI.
fr: Cette déclaration ouvre l'espace de noms ou le module '{0}' via un chemin d'accès partiellement qualifié. Modifiez ce code pour utiliser le chemin d'accès complet de l'espace de noms. Cette modification garantit la fiabilité de votre code au fur et à mesure de l'ajout de nouvelles constructions aux bibliothèques F# et CLI.
it: Questa dichiarazione apre lo spazio dei nomi o modulo '{0}' tramite un percorso parziale. Modificare il codice in modo da utilizzare il percorso completo dello spazio dei nomi. Questa modifica renderà il codice più affidabile in caso di aggiunta di nuovi costrutti alle librerie F# e CLI.
ja: この宣言は部分的な修飾パスを介して名前空間またはモジュール '{0}' を開きます。名前空間の完全パスを使用するようにコードを変更してください。この変更によってコードが堅牢になり、新しいコンストラクターが F# ライブラリや CLI ライブラリに追加された場合にも対応できます。
ko: 이 선언은 부분적으로 정규화된 경로를 통해 '{0}' 네임스페이스 또는 모듈을 엽니다. 네임스페이스의 전체 경로가 사용되도록 이 코드를 조정하세요. 이렇게 변경하면 F# 및 CLI 라이브러리에 새 구문이 추가될 때 코드가 더 견고해집니다.
pl: Ta deklaracja powoduje otwarcie przestrzeni nazw lub modułu „{0}” za pośrednictwem częściowo kwalifikowanej ścieżki. Dostosuj ten kod, aby używał pełnej ścieżki przestrzeni nazw. Dzięki tej zmianie kod będzie bardziej niezawodny, gdy do bibliotek języka F# i infrastruktury CLI zostaną dodane nowe konstrukcje.
pt_br: Esta declaração abre o namespace ou módulo '{0}' através de um caminho parcialmente qualificado. Ajuste este código par usar o caminho completo do namespace. Esta mudança deixará seu código mais robusto uma vez que novos construtores são adicionados a F# e bibliotecas CLI.
ru: Это объявление открывает пространство имен или модуль "{0}" через частичный путь. Измените этот код для использования полного пути пространства имен. Данное изменение обеспечит надежность кода при добавлении новых конструкций в библиотеки F# и CLI.
tr: Bu bildirim, ad alanını veya '{0}' modülünü kısmen nitelenmiş yol aracılığıyla açıyor. Bu kodu, ad alanının tam yolunu kullanacak şekilde ayarlayın. Bu değişiklik, F# ve CLI kitaplıklarına yeni yapılar eklendikçe kodunuzun daha sağlam kılar.
zh_hans: 此声明通过部分限定的路径来打开命名空间或模块“{0}”。请调整此代码以使用命名空间的完整路径。此更改将使您的代码在 F# 和 CLI 库中不断添加新构造的情况下更为可靠。
zh_hant: 這個宣告會透過部分限定名稱開啟命名空間或模組 '{0}'。請調整這個程式碼，使用命名空間的完整路徑。這項變更將確保在新建構加入至 F# 和 CLI 程式庫時，您的程式碼可以更為強固。

# tcLocalClassBindingsCannotBeInline
source: Local class bindings cannot be marked inline. Consider lifting the definition out of the class or else do not mark it as inline.
cs: Vazby lokální třídy nemůžou mít označení inline. Zvažte možnost rozšíření definice mimo třídu. V opačném případě neoznačujte jako inline.
de: Lokale Klassenbindungen können nicht als "inline" markiert werden. Entfernen Sie die Definition aus der Klasse, oder markieren Sie sie nicht als "inline".
es: Los enlaces de clase locales no se pueden marcar como 'inline'. Considere extraer la definición de la clase o no lo marque como 'inline'.
fr: Impossible de marquer les liaisons de classe locales inline. Enlevez la définition de la classe ou ne la marquez pas inline.
it: I binding di classe locali non possono essere contrassegnati come inline. Provare a spostare la definizione fuori della classe oppure non contrassegnarla come inline.
ja: ローカル クラスの束縛に 'inline' とマークすることはできません。クラスから定義を取り除くか、'inline' とマークしないでください。
ko: 지역 클래스 바인딩은 inline으로 표시할 수 없습니다. 정의를 클래스 밖으로 이동하거나 inline으로 표시하지 마세요.
pl: Lokalne powiązania klas nie mogą być oznaczone jako śródwierszowe. Rozważ przeniesienie definicji poza klasę lub nie oznaczaj jej jako śródwierszowej.
pt_br: Associações de classes locais não podem ser marcadas como embutidas. Considere elevar a definição de classe ou não marcá-la como embutida.
ru: Привязки локального класса нельзя пометить как "inline" Рекомендуется удалить определение из класса, или не помечать его как "inline".
tr: Yerel sınıf bağlamaları satır içi olarak işaretlenemez. Tanımı sınıftan çıkarmayı düşünün veya satır içi olarak işaretlemeyin.
zh_hans: 不能将本地类绑定标记为“inline”。请考虑将定义放到类的外部，否则不要将该类标记为“inline”。
zh_hant: 區域類別繫結不能標記為內嵌。請考慮將定義移出類別，或不將它標記為內嵌。

# tcTypeAbbreviationsMayNotHaveMembers
source: Type abbreviations cannot have members
cs: Zkratky typů nemůžou mít členy.
de: Typabkürzungen dürfen keine Member aufweisen.
es: Las abreviaciones de tipo no pueden tener miembros.
fr: Les abréviations de type ne peuvent pas avoir de membres
it: Le abbreviazioni di tipo non possono avere membri
ja: 型略称にメンバーを含めることはできません
ko: 형식 약어에는 멤버를 지정할 수 없습니다.
pl: Skróty typów nie mogą mieć elementów członkowskich
pt_br: Abreviações de tipo não podem ter membros
ru: Сокращения типов не могут иметь элементов
tr: Tür kısaltmalarının üyeleri olamaz
zh_hans: 类型缩写词不能具有成员
zh_hant: 類型縮寫不能有成員
