Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# optsStaticlink
source: Statically link the given assembly and all referenced DLLs that depend on this assembly. Use an assembly name e.g. mylib, not a DLL name.
cs: Staticky propojit zadané sestavení a všechny odkazované knihovny DLL, které jsou na tomto sestavení závislé. Použít název sestavení, třeba mylib, ne název knihovny DLL
de: Die angegebene Assembly und alle davon abhängigen DLLs, auf die verwiesen wird, statisch verknüpfen. Hierfür ist ein Assemblyname wie "mylib" zu verwenden, kein DLL-Name.
es: Vincular de forma estática el ensamblado dado y todos los archivos DLL a los que se hace referencia que dependen de este ensamblado. Use un nombre de ensamblado (por ejemplo, mylib), no un nombre de DLL.
fr: Lier statiquement l'assembly donné et toutes les DLL référencées qui en dépendent. Utilisez un nom d'assembly tel que mylib au lieu d'un nom de DLL.
it: Collega in modo statico l'assembly specificato e tutte le DLL da questo dipendenti a cui viene fatto riferimento. Usare un nome di assembly, ad esempio lib, non un nome di DLL.
ja: 指定したアセンブリと、そのアセンブリに依存するすべての参照 DLL を静的にリンクします。DLL 名ではなく、アセンブリ名 (たとえば、mylib) を使用してください。
ko: 지정한 어셈블리 및 이 어셈블리에 종속된 모든 참조 DLL을 정적으로 링크합니다. DLL 이름이 아니라 어셈블리 이름을 사용하십시오(예: mylib).
pl: Statycznie połącz podany zestaw i wszystkie przywoływane biblioteki DLL, które zależą od tego zestawu. Użyj nazwy zestawu (np. mojabiblioteka), a nie nazwy biblioteki DLL.
pt_br: Vincule estaticamente o assembly fornecido e todas as DLLs referenciadas que dependem deste assembly. Use um nome de assembly como mylib, por exemplo, não um nome de DLL.
ru: Статическая компоновка заданной сборки и всех зависимых от нее библиотек DLL, на которые существуют ссылки. Используйте имя сборки, например, mylib, вместо имени библиотеки DLL.
tr: Verilen bütünleştirilmiş kodu ve bu bütünleştirilmiş koda bağlı tüm başvurulan DLL'leri, statik olarak bağlayın. DLL adı değil bütünleştirilmiş kod adı kullanın, örn. mylib.
zh_hans: 以静态方式链接给定程序集与依赖于此程序集的所有引用的 DLL。使用程序集名称(例如 mylib)而非 DLL 名称。
zh_hant: 靜態連結指定的組件和所有依存於這個組件的被參考 DLL。請使用組件名稱 (例如 mylib) 而不是 DLL 名稱。

# optsResident
source: Use a resident background compilation service to improve compiler startup times.
cs: Použít rezidentní službu kompilace na pozadí ke zlepšení časů spuštění kompilátoru
de: Verwenden Sie einen residenten Hintergrundkompilierungsdienst, um die Startzeiten des Compilers zu verbessern.
es: Use un servicio de compilación en segundo plano residente para mejorar los tiempos de inicio del compilador.
fr: Utilisez un service de compilation en arrière-plan résident pour améliorer les temps de démarrage du compilateur.
it: Utilizzare un servizio di compilazione residente in background per migliorare i tempi di avvio del compilatore.
ja: バックグラウンドに常駐するコンパイル サービスを使用して、コンパイラの起動時間を改善します。
ko: 컴파일러 시작 시간을 단축하기 위해 상주 백그라운드 컴파일 서비스를 사용합니다.
pl: Użyj rezydentnej usługi kompilacji działającej w tle w celu poprawienia czasów uruchamiania kompilatora.
pt_br: Use um serviço de compilação em segundo plano residente para aprimorar os tempos de inicialização do compilador.
ru: Используйте службу фоновой резидентной компиляции, чтобы сократить время запуска компилятора.
tr: Derleyici başlatma sürelerini geliştirmek için yerleşik bir arka planda derleme hizmetini kullanın.
zh_hans: 使用驻留后台编译服务缩短编译器启动时间。
zh_hant: 使用常駐背景編譯服務改善編譯器的啟動時間。

# optsPdb
source: Name the output debug file
cs: Pojmenovat výstupní ladicí soubor
de: Ausgabedebugdatei benennen
es: Nombre del archivo de depuración de salida
fr: Nommer le fichier de débogage de sortie
it: Nome del file di debug di output
ja: 出力デバッグ ファイルの名前を指定します
ko: 출력 디버그 파일의 이름입니다.
pl: Nazwa wyjściowego pliku debugowania
pt_br: Nomear o arquivo de depuração de saída
ru: Имя выходного файла отладки
tr: Çıkış hata ayıklama dosyasını adlandır
zh_hans: 对输出调试文件进行命名
zh_hant: 為輸出偵錯檔命名

# optsSimpleresolution
source: Resolve assembly references using directory-based rules rather than MSBuild resolution
cs: Přeložit odkazy na sestavení pomocí pravidel založených na adresáři, ne pomocí MSBuild
de: Assemblyverweise mithilfe von verzeichnisbasierten Regeln anstelle von MSBuild-Auflösung auflösen
es: Resolver las referencias de ensamblado con reglas basadas en directorio en lugar de la resolución de MSBuild
fr: Résoudre les références d'assembly à l'aide des règles basées sur les répertoires au lieu de la résolution MSBuild
it: Risolvere i riferimenti ad assembly mediante regole basate su directory anziché mediante la risoluzione MSBuild
ja: MSBuild の解決ではなく、ディレクトリベースの規則を使用してアセンブリの参照を解決します
ko: MSBuild 확인이 아니라 디렉터리 기반의 규칙을 사용하여 어셈블리 참조를 확인합니다.
pl: Rozpoznaj odwołania do zestawu przy użyciu reguł opartych na katalogu, a nie rozpoznawania narzędzia MSBuild
pt_br: Resolver referências de assembly usando regras baseadas em diretório em vez da resolução do MSBuild
ru: Разрешать ссылки на сборку с помощью основанных на каталоге правил вместо разрешения MSBuild
tr: Bütünleştirilmiş kod başvurularını MSBuild çözümlemesi yerine dizin tabanlı kurallar kullanarak çözümle
zh_hans: 使用基于目录的规则而非 MSBuild 解析来解析程序集引用
zh_hant: 使用以目錄為基礎的規則解析組件參考，而不使用 MSBuild 解析

# optsUnrecognizedTarget
source: Unrecognized target '{0}', expected 'exe', 'winexe', 'library' or 'module'
cs: Nerozpoznaný cíl {0}. Očekávané jsou exe, winexe, library nebo module.
de: Unbekanntes Ziel "{0}", "exe", "winexe", "library" oder "module" wurde erwartet.
es: '{0}' de destino no reconocido, se esperaba 'exe', 'winexe', 'library' o 'module'.
fr: Cible '{0}' non reconnue, 'exe', 'winexe', 'library' ou 'module' attendu
it: Destinazione '{0}' non riconosciuta. Previsto 'exe', 'winexe', 'library' o 'module'
ja: 認識されないターゲット '{0}'。'exe'、'winexe'、'library'、または 'module' を指定してください。
ko: 인식할 수 없는 대상 '{0}'입니다. 'exe', 'winexe', 'library' 또는 'module'이 필요합니다.
pl: Nierozpoznany cel „{0}”. Oczekiwano celu „exe”, „winexe”, „library” lub „module”
pt_br: Destino desconhecido '{0}', 'exe', 'winexe', 'library' ou 'module' era esperado
ru: Нераспознанный целевой формат "{0}"; требуется "exe", "winexe", "library" или "module"
tr: Tanınmayan hedef '{0}'; 'exe', 'winexe', 'library' veya 'module' bekleniyordu
zh_hans: 无法识别的目标“{0}”，应为“exe”、“winexe”、“library”或“module”
zh_hant: 無法辨識的目標 '{0}'，必須是 'exe'、'winexe'、'library' 或 'module'

# optsUnrecognizedDebugType
source: Unrecognized debug type '{0}', expected 'pdbonly' or 'full'
cs: Nerozpoznaný typ ladění {0}. Očekávané typy jsou pdbonly nebo full.
de: Unbekannter Debugtyp "{0}", "pdbonly" oder "full" wurde erwartet.
es: Tipo de depuración '{0}' no reconocido, se esperaba 'pdbonly' o 'full'.
fr: Type de débogage '{0}' non reconnu, 'pdbonly' ou 'full' attendu
it: Tipo debug '{0}' non riconosciuto. Previsto 'pdbonly' o 'full'
ja: 認識されないデバッグの種類 '{0}'。'pdbonly' または 'full' を指定してください。
ko: 인식할 수 없는 디버그 형식 '{0}'입니다. 'pdbonly' 또는 'full'이 필요합니다.
pl: Nierozpoznany typ debugowania „{0}”. Oczekiwano typu „pdbonly” lub „full”
pt_br: Tipo de depuração desconhecida '{0}', 'pdbonly' ou 'full' era esperado
ru: Нераспознанный тип отладки "{0}"; требуется "pdbonly" или "full"
tr: Tanınmayan hata ayıklama türü: '{0}'; 'pdbonly' veya 'full' bekleniyordu
zh_hans: 无法识别的调试类型“{0}”，应为“pdbonly”或“full”
zh_hant: 無法辨識的偵錯類型 '{0}'，必須是 'pdbonly' 或 'full'

# optsInvalidWarningLevel
source: Invalid warning level '{0}'
cs: Neplatná úroveň pro upozornění {0}
de: Ungültige Warnstufe "{0}".
es: Nivel de advertencia no válido: '{0}'.
fr: Niveau d'avertissement non valide '{0}'
it: Livello di avviso '{0}' non valido
ja: 警告レベル '{0}' が無効です
ko: 경고 수준 '{0}'이(가) 잘못되었습니다.
pl: Nieprawidłowy poziom ostrzeżenia „{0}”
pt_br: Nível de aviso '{0}' inválido
ru: Недопустимый уровень предупреждения "{0}".
tr: Geçersiz uyarı düzeyi '{0}'
zh_hans: 警告等级“{0}”无效
zh_hant: 無效的警告層級 '{0}'

# optsShortFormOf
source: Short form of '{0}'
cs: Krátký tvar pro {0}
de: Kurzform von "{0}"
es: Forma corta de '{0}'
fr: Forme abrégée de '{0}'
it: Forma breve di '{0}'
ja: '{0}' の短い形式
ko: '{0}'의 약식입니다.
pl: Krótka wersja dla „{0}”
pt_br: Forma abreviada de '{0}'
ru: Краткая форма "{0}"
tr: '{0}' öğesinin kısa biçimi
zh_hans: “{0}”的缩写
zh_hant: '{0}' 的簡短形式

# optsClirootDeprecatedMsg
source: The command-line option '--cliroot' has been deprecated. Use an explicit reference to a specific copy of mscorlib.dll instead.
cs: Možnost příkazového řádku --cliroot je zastaralá. Použijte místo ní explicitní odkaz na specifickou kopii knihovny mscorlib.dll.
de: Die Befehlszeilenoption "--cliroot" ist veraltet. Verwenden Sie stattdessen einen expliziten Verweis auf eine bestimmte Kopie von "mscorlib.dll".
es: La opción de la línea de comandos '--cliroot' está en desuso. En su lugar, use una referencia explícita a una copia específica de mscorlib.dll.
fr: L'option de ligne de commande '--cliroot' est déconseillée. Utilisez une référence explicite à une copie spécifique de mscorlib.dll à la place.
it: Opzione della riga di comando '--cliroot' deprecata. Al suo posto usare un riferimento esplicito a una copia specifica di mscorlib.dll.
ja: コマンド ライン オプション '--cliroot' は非推奨になりました。代わりに mscorlib.dll の特定のコピーに対する明示的な参照を使用してください。
ko: 명령줄 옵션 '--cliroot'는 사용되지 않습니다. mscorlib.dll의 특정 복사본에 대한 명시적 참조를 대신 사용하세요.
pl: Opcja wiersza polecenia „--cliroot” jest przestarzała. Użyj odwołania jawnego do konkretnej kopii pliku mscorlib.dll.
pt_br: A opção de linha de comando '--cliroot' foi preterida. Use uma referência explicita para uma cópia específica de mscorlib.dll em seu lugar.
ru: Параметр командной строки "--cliroot" не рекомендуется к использованию. Используйте явную ссылку на конкретную копию библиотеки mscorlib.dll.
tr: Komut satırı seçeneği '--cliroot' kullanım dışı bırakıldı. Onun yerine özel bir mscorlib.dll kopyasına açık başvuru kullanın.
zh_hans: 命令行选项“--cliroot”已弃用。请改用对 mscorlib.dll 的特定副本的显式引用。
zh_hant: 命令列選項 '--cliroot' 已被取代。請改用明確參考，來指定 mscorlib.dll 的複本。

# optsClirootDescription
source: Use to override where the compiler looks for mscorlib.dll and framework components
cs: Používá se k přepsání umístění, kde kompilátor hledá knihovnu mscorlib.dll a komponenty rozhraní.
de: Dient zum Überschreiben des Speicherorts, an dem der Compiler nach "mscorlib.dll" und den Frameworkkomponenten sucht.
es: Úselo para invalidar cuando el compilador busque mscorlib.dll y componentes del marco de trabajo.
fr: Permet de substituer l'emplacement où le compilateur recherche mscorlib.dll et les composants .NET Framework
it: Da utilizzare per eseguire l'override nella posizione in cui il compilatore cerca mscorlib.dll e i componenti del framework
ja: コンパイラが mscorlib.dll およびフレームワーク コンポーネントを検索する場所をオーバーライドするために使用します
ko: 컴파일러가 mscorlib.dll 및 프레임워크 구성 요소를 찾는 위치를 재정의하는 데 사용합니다.
pl: Użyj do przesłonięcia miejsca, w którym kompilator szuka pliku mscorlib.dll i składników struktury
pt_br: Use para substituir onde o compilador deve procurar por mscorlib.dll e componentes de framework
ru: Используйте этот параметр, чтобы переопределить место для поиска компилятором библиотеки mscorlib.dll и компонентов инфраструктуры
tr: Derleyicinin mscorlib.dll ve çerçeve bileşenlerini aradığı yeri geçersiz kılmak için kullanın
zh_hans: 用于重写编译器查找 mscorlib.dll 和 Framework 组件的位置
zh_hant: 用來覆寫編譯器尋找 mscorlib.dll 和 Framework 元件的位置

# optsHelpBannerOutputFiles
source: - OUTPUT FILES -
cs: - VÝSTUPNÍ SOUBORY -
de: - AUSGABEDATEIEN -
es: - ARCHIVOS DE SALIDA -
fr: - FICHIERS DE SORTIE -
it: - FILE DI OUTPUT -
ja: - 出力ファイル -
ko: - 출력 파일 -
pl: - PLIKI WYJŚCIOWE -
pt_br: - ARQUIVOS DE SAÍDA -
ru: - ВЫХОДНЫЕ ФАЙЛЫ -
tr: - ÇIKIŞ DOSYALARI -
zh_hans: - 输出文件 -
zh_hant: - 輸出檔 -

# optsHelpBannerInputFiles
source: - INPUT FILES -
cs: - VSTUPNÍ SOUBORY -
de: – EINGABEDATEIEN –
es: - ARCHIVOS DE ENTRADA -
fr: - FICHIERS D'ENTRÉE -
it: - FILE DI INPUT -
ja: - 入力ファイル -
ko: - 입력 파일 -
pl: - PLIKI WEJŚCIOWE -
pt_br: - ARQUIVOS DE ENTRADA -
ru: - ВХОДНЫЕ ФАЙЛЫ -
tr: - GİRİŞ DOSYALARI -
zh_hans: - 输入文件 -
zh_hant: - 輸入檔 -

# optsHelpBannerResources
source: - RESOURCES -
cs: - PROSTŘEDKY -
de: - RESSOURCEN -
es: - RECURSOS -
fr: - RESSOURCES -
it: - RISORSE -
ja: - リソース -
ko: - 리소스 -
pl: - ZASOBY -
pt_br: - RECURSOS -
ru: - РЕСУРСЫ -
tr: - KAYNAKLAR -
zh_hans: - 资源 -
zh_hant: - 資源 -

# optsHelpBannerCodeGen
source: - CODE GENERATION -
cs: - GENEROVÁNÍ KÓDU -
es: - GENERACIÓN DE CÓDIGO -
fr: - GÉNÉRATION DE CODE -
it: - GENERAZIONE CODICE -
ja: - コード生成 -
ko: - 코드 생성 -
pl: - GENEROWANIE KODU -
pt_br: - GERAÇÃO DE CÓDIGO -
ru: - ФОРМИРОВАНИЕ КОДА -
tr: - KOD ÜRETİMİ -
zh_hans: - 代码生成 -
zh_hant: - 程式碼產生 -

# optsHelpBannerAdvanced
source: - ADVANCED -
cs: - UPŘESNIT -
de: - ERWEITERT -
es: - AVANZADAS -
fr: - AVANCÉ -
it: - AVANZATE -
ja: - 詳細 -
ko: - 고급 -
pl: - ZAAWANSOWANE -
pt_br: - AVANÇADO -
ru: - ДОПОЛНИТЕЛЬНО -
tr: - GELİŞMİŞ -
zh_hans: - 高级 -
zh_hant: - 進階 -

# optsHelpBannerMisc
source: - MISCELLANEOUS -
cs: - RŮZNÉ -
de: – VERSCHIEDENES –
es: - VARIOS -
fr: - DIVERS -
it: - VARIE -
ja: - その他 -
ko: - 기타 -
pl: - RÓŻNE -
pt_br: - DIVERSOS -
ru: - ПРОЧЕЕ -
tr: - ÇEŞİTLİ -
zh_hans: - 杂项 -
zh_hant: - 其他 -

# optsHelpBannerLanguage
source: - LANGUAGE -
cs: - JAZYK -
de: – SPRACHE –
es: - LENGUAJE -
fr: - LANGAGE -
it: - LINGUAGGIO -
ja: - 言語 -
ko: - 언어 -
pl: - JĘZYK -
pt_br: - LINGUAGEM -
ru: - ЯЗЫК -
tr: - DİL -
zh_hans: - 语言 -
zh_hant: - 語言 -

# optsHelpBannerErrsAndWarns
source: - ERRORS AND WARNINGS -
cs: - CHYBY A UPOZORNĚNÍ -
de: – FEHLER UND WARNUNGEN –
es: - ERRORES Y ADVERTENCIAS -
fr: - ERREURS ET AVERTISSEMENTS -
it: - ERRORI E AVVISI -
ja: - エラーと警告 -
ko: - 오류 및 경고 -
pl: - BŁĘDY I OSTRZEŻENIA -
pt_br: - ERROS E AVISOS -
ru: - ОШИБКИ И ПРЕДУПРЕЖДЕНИЯ -
tr: - HATALAR VE UYARILAR -
zh_hans: - 错误和警告 -
zh_hant: - 錯誤和警告 -

# optsUnknownArgumentToTheTestSwitch
source: Unknown --test argument: '{0}'
cs: Neznámý argument --test: {0}
de: Unbekannt – Testargument: '{0}'
es: Argumento --test desconocido: '{0}'
fr: Inconnu --argument de test : '{0}'
it: Argomento --test sconosciuto: '{0}'
ja: 不明 -- テスト引数:'{0}'
ko: 알 수 없는 --test 인수입니다. '{0}'
pl: Nieznany argument --test: „{0}”
pt_br: Argumento --test desconhecido: '{0}'
ru: Неизвестный аргумент --test: '{0}'
tr: Bilinmeyen --test bağımsız değişkeni: '{0}'
zh_hans: 未知的测试参数: '{0}'
zh_hant: 未知的 --test 引數: '{0}'

# optsUnknownPlatform
source: Unrecognized platform '{0}', valid values are 'x86', 'x64', 'Itanium', 'anycpu32bitpreferred', and 'anycpu'
cs: Nerozpoznaná platforma {0}. Platné hodnoty jsou x86, x64, Itanium, anycpu32bitpreferred a anycpu.
de: Unbekannte Plattform "{0}", gültige Werte sind "x86", "x64", "Itanium", "anycpu32bitpreferred" und "anycpu".
es: Plataforma '{0}' no reconocida. Los valores válidos son 'x86', 'x64', 'Itanium', 'anycpu32bitpreferred' y 'anycpu'
fr: Plateforme '{0}' non reconnue, les valeurs valides sont 'x86', 'x64', 'Itanium', 'anycpu32bitpreferred' et 'anycpu'
it: Piattaforma '{0}' non riconosciuta. I valori validi sono 'x86', 'x64', 'Itanium', 'anycpu32bitpreferred' e 'anycpu'
ja: 認識されないプラットフォーム '{0}'。有効な値は 'x86'、'x64'、'Itanium'、'anycpu32bitpreferred'、および 'anycpu' です。
ko: 인식할 수 없는 플랫폼 '{0}'입니다. 올바른 값은 'x86', 'x64', 'Itanium', 'anycpu32bitpreferred' 및 'anycpu'입니다.
pl: Nierozpoznana platforma „{0}”. Prawidłowe wartości to „x86”, „x64”, „Itanium”, „anycpu32bitpreferred” i „anycpu”
pt_br: Plataforma não reconhecida '{0}', os valores válidos são 'x86', 'x64', 'Itanium', 'anycpu32bitpreferred' e 'anycpu'
ru: Нераспознанная платформа "{0}"; допустимые значения: x86, x64, Itanium, anycpu32bitpreferred и anycpu
tr: Tanınmayan platform '{0}', geçerli değerler: 'x86', 'x64', 'Itanium', 'anycpu32bitpreferred' ve 'anycpu'
zh_hans: 无法识别的平台“{0}”，有效值为“x86”、“x64”、“Itanium”、“anycpu32bitpreferred”和“anycpu”
zh_hant: 無法辨識的平台 '{0}'，有效的值是 'x86'、'x64'、'Itanium'、'anycpu32bitpreferred' 和 'anycpu'

# optsInternalNoDescription
source: The command-line option '{0}' is for test purposes only
cs: Možnost příkazového řádku {0} je určená jenom pro testovací účely.
de: Die Befehlszeilenoption "{0}" ist ausschließlich für Testzwecke bestimmt.
es: La opción de la línea de comandos '{0}' es solo para uso de pruebas
fr: L'option de ligne de commande '{0}' ne doit servir qu'à des fins de test
it: L'opzione della riga di comando '{0}' deve essere usata solo per i test
ja: コマンド ライン オプション '{0}' はテスト目的でのみ使用できます
ko: 명령줄 옵션 '{0}'은(는) 테스트를 위해서만 사용됩니다.
pl: Opcja wiersza polecenia „{0}” jest tylko do celów testowych
pt_br: A opção de linha de comando '{0}' é somente para propósitos de teste
ru: Параметр командной строки "{0}" предназначен только для тестирования
tr: '{0}' komut satırı seçeneği yalnızca test amaçlıdır
zh_hans: 命令行选项“{0}”仅用于测试目的
zh_hant: 命令列選項 '{0}' 僅供測試用途

# optsDCLONoDescription
source: The command-line option '{0}' has been deprecated
cs: Možnost příkazového řádku {0} je zastaralá.
de: Die Befehlszeilenoption "{0}" ist veraltet.
es: La opción de la línea de comandos '{0}' está en desuso.
fr: L'option de ligne de commande '{0}' est déconseillée
it: Opzione della riga di comando '{0}' deprecata
ja: コマンド ライン オプション '{0}' は使用されなくなりました
ko: 명령줄 옵션 '{0}'은(는) 사용되지 않습니다.
pl: Opcja wiersza polecenia „{0}” jest przestarzała
pt_br: A opção de linha de comando '{0}' foi preterida
ru: Параметр командной строки "{0}" не рекомендуется к использованию
tr: Komut satırı seçeneği '{0}' kullanım dışı bırakıldı
zh_hans: 命令行选项“{0}”已弃用
zh_hant: 命令列選項 '{0}' 已被取代

# optsDCLODeprecatedSuggestAlternative
source: The command-line option '{0}' has been deprecated. Use '{1}' instead.
cs: Možnost příkazového řádku {0} je zastaralá. Použijte místo ní {1}.
de: Die Befehlszeilenoption "{0}" ist veraltet. Verwenden Sie stattdessen "{1}".
es: La opción de la línea de comandos '{0}' está en desuso. Use '{1}' en su lugar.
fr: L'option de ligne de commande '{0}' est déconseillée. Utilisez '{1}' à la place.
it: Opzione della riga di comando '{0}' deprecata. Al suo posto usare '{1}'.
ja: コマンド ライン オプション '{0}' は非推奨になりました。代わりに '{1}' を使用してください。
ko: 명령줄 옵션 '{0}'은(는) 사용되지 않습니다. 대신 '{1}'을(를) 사용하세요.
pl: Opcja wiersza polecenia „{0}” jest przestarzała. Użyj opcji „{1}”.
pt_br: A opção de linha de comando '{0}' foi preterida. Use '{1}' em seu lugar.
ru: Параметр командной строки "{0}" не рекомендуется к использованию. Вместо этого используйте объект "{1}".
tr: Komut satırı seçeneği '{0}' kullanım dışı bırakıldı. Onun yerine '{1}' kullanın.
zh_hans: 命令行选项“{0}”已弃用。请改用“{1}”。
zh_hant: 命令列選項 '{0}' 已被取代。請改用 '{1}'。

# optsDCLOHtmlDoc
source: The command-line option '{0}' has been deprecated. HTML document generation is now part of the F# Power Pack, via the tool FsHtmlDoc.exe.
cs: Možnost příkazového řádku {0} je zastaralá. Generování dokumentu HTML je teď součástí knihovny F# Power Pack a je přístupné prostřednictvím nástroje FsHtmlDoc.exe.
de: Die Befehlszeilenoption "{0}" ist veraltet. Das Generieren von HTML-Dokumenten ist jetzt über das Tool "FsHtmlDoc.exe" Bestandteil des F# Power Packs.
es: La opción de la línea de comandos '{0}' está en desuso. La generación de documentos HTML forma parte ahora de F# Power Pack, a través de la herramienta FsHtmlDoc.exe.
fr: L'option de ligne de commande '{0}' est déconseillée. La génération de documents HTML fait désormais partie de F# Power Pack, via l'outil FsHtmlDoc.exe.
it: Opzione della riga di comando '{0}' deprecata. La generazione di documenti HTML è ora inclusa in F# Power Pack, tramite lo strumento FsHtmlDoc.exe.
ja: コマンド ライン オプション '{0}' は使用されなくなりました。HTML ドキュメントの生成は、F# Power Pack のツール FsHtmlDoc.exe で実行できるようになりました。
ko: 명령줄 옵션 '{0}'은(는) 사용되지 않습니다. HTML 문서 생성은 이제 FsHtmlDoc.exe를 통해 F# Power Pack에 포함됩니다.
pl: Opcja wiersza polecenia „{0}” jest przestarzała. Generowanie dokumentów HTML jest teraz częścią pakietu Power Pack języka F# i jest wykonywane za pośrednictwem narzędzia FsHtmlDoc.exe.
pt_br: A opção de linha de comando '{0}' foi preterida. A geração de documento HTML é agora parte do pacote de energia F#, através da ferramenta FsHtmlDoc.exe.
ru: Параметр командной строки "{0}" не рекомендуется к использованию. Функции создания документа HTML теперь реализуются с помощью средства из состава пакета F# Power Pack.
tr: Komut satırı seçeneği '{0}' kullanım dışı bırakıldı. HTML belgesi oluşturma şimdi FsHtmlDoc.exe aracı yoluyla F# Power Pack'in bir parçası.
zh_hans: 命令行选项“{0}”已弃用。HTML 文档生成现在是 F# Power Pack 的一部分(借助 FsHtmlDoc.exe 工具)。
zh_hant: 命令列選項 '{0}' 已被取代。HTML 文件產生現在是 F# Power Pack 的一部分，會透過工具 FsHtmlDoc.exe 進行。

# optsConsoleColors
source: Output warning and error messages in color
cs: Barevně rozlišená upozornění výstupu a chybové zprávy
de: Warnungen und Fehlermeldungen farbig ausgeben
es: Advertencia de salida y mensajes de error en color
fr: Générer les messages d'avertissement et d'erreur en couleur
it: Visualizzare messaggi di errore e di avviso a colori
ja: 警告メッセージとエラー メッセージを色つきで表示します
ko: 경고 및 오류 메시지를 색으로 구분하여 출력
pl: Ostrzeżenia i komunikaty o błędzie wyróżnione kolorem
pt_br: Mensagens de aviso e erro de saída em cores
ru: Цветные выходные предупреждения и сообщения об ошибках
tr: Renkli çıkış uyarısı ve hata iletileri
zh_hans: 以彩色输出警告和错误消息
zh_hant: 輸出彩色的警告和錯誤訊息

# optsUseHighEntropyVA
source: Enable high-entropy ASLR
cs: Povolit technologii ASLR s vysokou entropií
de: ASLR mit hoher Entropie aktivieren
es: Habilitar ASLR de alta entropía
fr: Activer la randomisation du format d'espace d'adresse d'entropie élevée
it: Abilita ASLR a entropia elevata
ja: 高エントロピ ASLR の有効化
ko: 높은 엔트로피 ASLR 사용
pl: Włącz losowe generowanie układu przestrzeni adresowej o wysokiej entropii
pt_br: Habilitar ASLR de alta entropia
ru: Включить технологию ASLR с высокой энтропией
tr: Yüksek entropili ASLR'yi etkinleştir
zh_hans: 启用高熵 ASLR
zh_hant: 啟用高熵 ASLR

# optsSubSystemVersion
source: Specify subsystem version of this assembly
cs: Zadejte verzi subsystému tohoto sestavení.
de: Subsystemversion für diese Assembly festlegen
es: Especificar la versión del subsistema de este ensamblado
fr: Spécifier la version du sous-système de cet assembly
it: Specificare la versione del sottosistema di questo assembly
ja: このアセンブリのサブシステム バージョンを指定してください
ko: 이 어셈블리의 하위 시스템 버전을 지정하세요.
pl: Określi wersję podsystemu tego zestawu
pt_br: Especificar a versão do subsistema deste assembly
ru: Укажите версию подсистемы этой сборки
tr: Bu derlemenin alt sistem sürümünü belirtin
zh_hans: 指定此程序集的子系统版本
zh_hant: 指定這個組件的子系統版本
