Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# tcImplementsIEquatableExplicitly
source: The struct, record or union type '{0}' implements the interface 'System.IEquatable<_>' explicitly. Apply the 'CustomEquality' attribute to the type and provide a consistent implementation of the non-generic override 'System.Object.Equals(obj)'.
cs: Typ struktury, záznamu nebo sjednocení {0} explicitně implementuje rozhraní System.IEquatable<_>. Použijte pro typ atribut CustomEquality a poskytněte konzistentní implementaci neobecného přepsání System.Object.Equals(obj).
de: Der Struktur-, Datensatz oder Union-Typ "{0}" implementiert die Schnittstelle "System.IEquatable<_>" explizit. Wenden Sie das "CustomEquality"-Attribut auf den Typ an, und stellen Sie eine konsistente Implementierung des nicht generischen überschriebenen Objekts "System.Object.Equals(obj)" bereit.
es: El tipo de estructura, registro o unión "{0}'"implementa la interfaz "System.IEquatable<_>" explícitamente. Aplique el atributo "CustomEquality" al tipo y proporcione una implementación coherente de la anulación no genérica "System.Object.Equals(obj)".
fr: Le type de struct, d'enregistrement ou d'union '{0}' implémente l'interface 'System.IEquatable<_>' explicitement. Appliquez l'attribut 'CustomEquality' au type et fournissez une implémentation cohérente du remplacement non générique 'System.Object.Equals(obj)'.
it: Il tipo di struct, record o unione '{0}' implementa l'interfaccia 'System.IEquatable<_>' in modo esplicito. Applicare l'attributo 'CustomEquality' al tipo e fornire un'implementazione coerente dell'override non generico 'System.Object.Equals(obj)'.
ja: 構造体型、レコード型、共用体型の '{0}' がインターフェース 'System.IEquatable<_>' を明示的に実装しています。この型に 'CustomEquality' 属性を適用し、非ジェネリック オーバーライド 'System.Object.Equals(obj)' の整合性のある実装を用意します。
ko: 구조체, 레코드 또는 공용 구조체 형식 '{0}'은(는) 'System.IEquatable<_>' 인터페이스를 명시적으로 구현합니다. 형식에 'CustomEquality' 특성을 적용하고 제네릭이 아닌 재정의 'System.Object.Equals(obj)'에 대한 일관된 구현을 제공하세요.
pl: Typ struktury, rekordu lub unii „{0}” zawiera jawną implementację interfejsu „System.IEquatable<_>”. Zastosuj atrybut „CustomEquality” do typu i określ spójną implementację nieogólnego przesłonięcia „System.Object.Equals(obiekt)”.
pt_br: O tipo de struct, registro ou união '{0}' implementa a interface 'System.IEquatable<_>' explicitamente. Aplique o atributo 'CustomEquality' ao tipo e forneça uma implementação consistente da substituição não genérica 'System.Object.Equals(obj)'.
ru: Тип структуры, записи или объединения '{0}' явно реализует интерфейс 'System.IEquatable<_>'. Примените к типу атрибут 'CustomEquality' и укажите согласованную реализацию для неуниверсальной перегрузки 'System.Object.Equals(obj)'.
tr: Yapı, kayıt veya birleşim türü '{0}', 'System.IEquatable<_>' arabirimini açıkça uyguluyor. Türe 'CustomEquality' özniteliğini uygulayın ve genel olmayan 'System.Object.Equals(obj)' geçersiz kılmasının tutarlı bir uygulamasını sağlayın.
zh_hans: 结构、记录或联合类型“{0}”显式实现接口 "System.IEquatable<_>"。请将 "CustomEquality" 属性应用于该类型，并提供非泛型重写 "System.Object.Equals(obj)" 的一致实现。
zh_hant: 結構、記錄或等位型別 '{0}' 會明確實作介面 'System.IEquatable<_>'。請將 'CustomEquality' 屬性套用到類型，並提供一致的非泛型覆寫 'System.Object.Equals(obj)' 實作。

# tcExplicitTypeSpecificationCannotBeUsedForExceptionConstructors
source: Explicit type specifications cannot be used for exception constructors
cs: Explicitní specifikace typu se nedají použít u konstruktorů výjimek.
de: Explizite Typspezifikationen dürfen nicht für Ausnahmekonstruktoren verwendet werden.
es: No se pueden usar especificaciones de tipo explícitas para constructores de excepciones.
fr: Impossible d'utiliser des spécifications de type explicite pour des constructeurs d'exception
it: Le specifiche di tipo esplicito possono essere utilizzate per i costruttori di eccezione
ja: 明示的な型の指定は、例外のコンストラクターには使用できません
ko: 명시적 형식 지정은 예외 생성자에 대해 사용할 수 없습니다.
pl: Jawne specyfikacje typów nie mogą być używane w przypadku konstruktorów wyjątków
pt_br: Especificações de tipo explícitas não podem ser usadas para construtores de exceção
ru: Явные спецификации типа не могут быть использованы для конструкторов исключений
tr: Açık tür belirtimleri özel durum oluşturucuları için kullanılamaz
zh_hans: 显式类型规范不能用于异常构造函数
zh_hant: 明確的類型規格不能用於例外狀況建構函式

# tcExceptionAbbreviationsShouldNotHaveArgumentList
source: Exception abbreviations should not have argument lists
cs: Zkratky výjimek by neměly mít seznamy argumentů.
de: Ausnahmeabkürzungen sollten keine Argumentlisten aufweisen.
es: Las abreviaciones de excepciones no deben tener listas de argumentos.
fr: Les abréviations d'exceptions ne doivent pas avoir de listes d'arguments
it: Le abbreviazioni di eccezioni non possono avere elenchi di argomenti
ja: 例外の省略形に引数リストを含めることはできません
ko: 예외 약어에는 인수 목록을 지정하면 안 됩니다.
pl: Skróty wyjątków nie powinny zawierać list argumentów
pt_br: Abreviações de exceção não devem ter listas de argumentos
ru: Сокращения исключений не должны иметь списков аргументов
tr: Özel durum kısaltmalarının bağımsız değişken listeleri olmamalıdır
zh_hans: 异常缩写词不应具有参数列表
zh_hant: 例外狀況縮寫不應該有引數清單

# tcAbbreviationsFordotNetExceptionsCannotTakeArguments
source: Abbreviations for Common IL exceptions cannot take arguments
cs: Zkratky pro výjimky Common IL nemůžou přebírat argumenty.
de: Abkürzungen für Common IL-Ausnahmen können keine Argumente akzeptieren.
es: Las abreviaciones para excepciones de Common IL no pueden tomar argumentos.
fr: Les abréviations des exceptions CIL (Common Intermediate Language) ne peuvent pas accepter d'arguments
it: Le abbreviazioni per le eccezioni di IL comune non accettano argomenti
ja: Common IL の例外型の場合、省略形には引数を使用できません
ko: 공통 IL 예외에 대한 약어에는 인수를 사용할 수 없습니다.
pl: Skróty wyjątków Common IL nie mogą pobierać argumentów
pt_br: Abreviações para exceções do IL Comum não podem pegar argumentos
ru: Сокращенные формы исключений общего промежуточного языка не поддерживают получение аргументов
tr: Ortak Ara Dil özel durumlarının kısaltmaları bağımsız değişken alamaz
zh_hans: 通用 IL 异常的缩写词不能采用参数
zh_hant: Common IL 例外狀況的縮寫不能接受引數

# tcExceptionAbbreviationsMustReferToValidExceptions
source: Exception abbreviations must refer to existing exceptions or F# types deriving from System.Exception
cs: Zkratky výjimek musí odkazovat na existující výjimky nebo typy F# odvozené od třídy System.Exception.
de: Ausnahmeabkürzungen müssen auf vorhandene Ausnahmen oder F#-Typen verweisen, die von "System.Exception" abgeleitet sind.
es: Las abreviaciones de excepciones deben hacer referencia a excepciones existentes o tipos de F# que se deriven de System.Exception.
fr: Les abréviations d'exceptions doivent faire référence à des exceptions existantes ou des types F# dérivant de System.Exception
it: Le abbreviazioni di eccezioni devono fare riferimento a eccezioni esistenti o a tipi F# derivanti da System.Exception
ja: 例外の省略形は、既存の例外、または System.Exception から派生した F# 型を参照する必要があります
ko: 예외 약어는 기존 예외 또는 System.Exception에서 파생되는 F# 형식을 참조해야 합니다.
pl: Skróty wyjątków muszą odwoływać się do istniejących wyjątków lub typów języka F# pochodzących od elementu System.Exception
pt_br: Abreviações de exceção devem referir-se às exceções existentes ou tipos F# derivados de System.Exception
ru: Сокращения исключений должны ссылаться на существующие исключения или типы F#, производные от System.Exception
tr: Özel durum kısaltmaları mevcut özel durumlara veya System.Exception'dan türeyen F# türlerine başvurmalıdır
zh_hans: 异常缩写词必须引用现有异常或派生自 System.Exception 的 F# 类型
zh_hant: 例外狀況縮寫必須參考現有的例外狀況，或衍生自 System.Exception 的 F# 類型

# tcAbbreviationsFordotNetExceptionsMustHaveMatchingObjectConstructor
source: Abbreviations for Common IL exception types must have a matching object constructor
cs: Zkratky pro typy výjimek Common IL musí mít odpovídající konstruktor objektu.
de: Abkürzungen für Common IL-Ausnahmetypen müssen einen entsprechenden Objektkonstruktor aufweisen.
es: Las abreviaciones para tipos de excepción de Common IL deben tener un constructor de objeto coincidente.
fr: Les abréviations des types d'exceptions CIL (Common Intermediate Language) doivent avoir un constructeur d'objet correspondant
it: Le abbreviazioni dei tipi di eccezione di IL comune devono disporre di un costruttore di oggetto corrispondente
ja: Common IL の例外型の場合、省略形には対応するオブジェクト コンストラクターが必要です
ko: 공통 IL 예외 형식에 대한 약어에는 일치하는 개체 생성자가 있어야 합니다.
pl: Skróty typów wyjątków Common IL muszą mieć zgodnego konstruktora obiektów
pt_br: Abreviações para tipos de exceção do IL Comum devem ter um construtor de objeto correspondente
ru: Сокращенные формы исключений общего промежуточного языка должны иметь соответствующий конструктор объекта
tr: Ortak Ara Dil özel durum türlerinin kısaltmalarının kendileriyle eşleşen nesne oluşturucuları olmalıdır
zh_hans: 通用 IL 异常类型的缩写词必须具有匹配的对象构造函数
zh_hant: Common IL 例外狀況類型的縮寫必須有對應的物件建構函式

# tcNotAnException
source: Not an exception
cs: Není výjimka.
de: Keine Ausnahme.
es: No es una excepción.
fr: N'est pas une exception
it: Non si tratta di un'eccezione
ja: 例外ではありません
ko: 예외가 아닙니다.
pl: To nie jest wyjątek
pt_br: Não é uma exceção
ru: Не является исключением
tr: Özel durum değil
zh_hans: 不是一个异常
zh_hant: 不是例外狀況

# tcInvalidModuleName
source: Invalid module name
cs: Neplatný název modulu
de: Ungültiger Modulname.
es: Nombre de módulo no válido.
fr: Nom de module non valide
it: Nome modulo non valido
ja: モジュール名が無効です
ko: 모듈 이름이 잘못되었습니다.
pl: Nieprawidłowa nazwa modułu
pt_br: Nome de módulo inválido
ru: Недопустимое имя модуля
tr: Geçersiz modül adı
zh_hans: 模块名称无效
zh_hant: 無效的模組名稱

# tcInvalidTypeExtension
source: Invalid type extension
cs: Neplatné rozšíření typu
de: Ungültige Typerweiterung.
es: Extensión de tipo no válida.
fr: Extension de type non valide
it: Estensione di tipo non valido
ja: 型の拡張が無効です
ko: 형식 확장이 잘못되었습니다.
pl: Nieprawidłowe rozszerzenie typu
pt_br: Extensão de tipo inválida
ru: Недопустимое расширение типа
tr: Geçersiz tür uzantısı
zh_hans: 类型扩展无效
zh_hant: 無效的類型擴充

# tcAttributesOfTypeSpecifyMultipleKindsForType
source: The attributes of this type specify multiple kinds for the type
cs: Atributy tohoto typu určují pro typ víc druhů.
de: Die Attribute dieses Typs geben mehrere Arten für den Typ an.
es: Los atributos de este tipo especifican varios tipos para el tipo.
fr: Les attributs de ce type spécifient plusieurs genres pour le type
it: Gli attributi di questo tipo specificano più generi per il tipo
ja: この型の属性は、その型に対して複数の種類を指定しています
ko: 이 형식의 특성은 형식에 대한 많은 종류를 지정합니다.
pl: Atrybuty tego typu określają wiele rodzajów typu
pt_br: Os atributos deste tipo especificam múltiplas variedades para este tipo
ru: Атрибуты этого типа задают несколько видов типа
tr: Bu tür öznitelikler türün birden çok çeşidini belirtir
zh_hans: 此类型的特性指定此类型的多个种类
zh_hant: 這種類型的屬性為類型指定了多種類型

# tcKindOfTypeSpecifiedDoesNotMatchDefinition
source: The kind of the type specified by its attributes does not match the kind implied by its definition
cs: Druh typu určeného jeho atributy se neshoduje s druhem odvozeným jeho definicí.
de: Der von den Attributen angegebene Typ stimmt nicht mit der von der Definition implizierten Art überein.
es: El tipo del tipo especificado por sus atributos no coincide con el tipo que implica su definición.
fr: Le genre du type spécifié par ses attributs ne correspond pas au genre impliqué par sa définition
it: Il genere di tipo specificato dai relativi attributi non corrisponde a quello che implica la sua definizione
ja: この属性によって指定された型の種類は、定義が示す種類と一致しません
ko: 해당 특성으로 지정된 형식의 종류가 해당 정의에 의해 암시된 종류와 일치하지 않습니다.
pl: Rodzaj typu określony przez jego atrybuty nie jest zgodny z rodzajem implikowanym przez jego definicję
pt_br: A espécie do tipo especificado por seus atributos não corresponde à espécie sugerida por sua definição
ru: Вид типа, указанный его атрибутами, не совпадает с видом, подразумеваемым его определением
tr: Öznitelikleriyle belirtilen türün çeşidi tanımıyla kastedilen çeşitle eşleşmiyor
zh_hans: 类型的特性所指定的类型种类与类型的定义暗示的种类不匹配
zh_hant: 由其屬性指定的類型類型不符合其定義所隱含的類型

# tcMeasureDefinitionsCannotHaveTypeParameters
source: Measure definitions cannot have type parameters
cs: Definice míry nemůžou mít parametry typu.
de: Maßeinheitendefinitionen dürfen keine Typparameter aufweisen.
es: Las definiciones de medida no pueden tener parámetros de tipo.
fr: Les déclarations de mesure ne peuvent pas avoir de paramètres de type
it: Le definizioni di misura non possono avere parametri di tipo
ja: 単位の定義に型パラメーターは使用できません
ko: 측정값 정의에는 형식 매개 변수를 지정할 수 없습니다.
pl: Definicje miary nie mogą mieć parametrów typu
pt_br: Definições de medida não podem ter parâmetros de tipo
ru: Определения измерений не могут иметь параметры типа
tr: Ölçü tanımlarının tür parametreleri olamaz
zh_hans: 度量定义不能具有类型参数
zh_hant: 測量定義不能有類型參數

# tcTypeRequiresDefinition
source: This type requires a definition
cs: Teto typ vyžaduje definici.
de: Dieser Typ erfordert eine Definition.
es: Este tipo requiere una definición.
fr: Ce type requiert une définition
it: Questo tipo richiede una definizione
ja: この型には定義が必要です
ko: 이 형식을 사용하려면 정의가 필요합니다.
pl: Ten typ wymaga definicji
pt_br: Este tipo requer uma definição
ru: Для этого типа требуется определение
tr: Bu tür için tanım gerekiyor
zh_hans: 此类型需要定义
zh_hant: 這個類型需要定義

# tcTypeAbbreviationHasTypeParametersMissingOnType
source: This type abbreviation has one or more declared type parameters that do not appear in the type being abbreviated. Type abbreviations must use all declared type parameters in the type being abbreviated. Consider removing one or more type parameters, or use a concrete type definition that wraps an underlying type, such as 'type C<'a> = C of ...'.
cs: Tato zkratka typu má aspoň jeden parametr deklarovaného typu, který se u zkracovaného typu nevyskytuje. Při zkracování typů se musí použít všechny parametry deklarovaného typu. Zvažte možnost odebrání jednoho nebo více parametrů typu, nebo použijte konkrétní definici typu, která zabaluje nadřízený typ, třeba type C<'a> = C of ...
de: Für diese Typabkürzung ist mindestens ein Typparameter deklariert, der in dem abgekürzten Typ nicht erscheint. Typabkürzungen müssen alle deklarierten Typparameter im abgekürzten Typ verwenden. Entfernen Sie mindestens einen Typparameter, oder verwenden Sie eine konkrete Typdefinition, die einen zugrundeliegenden Typ umschließt, z.B. "type C<'a> = C of ...".
es: Esta abreviatura de tipo tiene uno o varios parámetros de tipo declarados que no aparecen en el tipo que se está abreviando. Las abreviaturas de tipo deben utilizar todos los parámetros de tipo declarado en el tipo que se está abreviando. Considere la eliminación de uno o más parámetros de tipo, o utilice una definición de tipo concreta que envuelva un tipo subyacente, como "type C<'a> = C of ...".
fr: Cette abréviation de type a un ou plusieurs paramètres de type déclarés qui n'apparaissent pas dans le type abrégé. Les abréviations de type doivent utiliser tous les paramètres de type déclarés dans le type abrégé. Supprimez un ou plusieurs paramètres de type ou utilisez une définition de type concrète qui encapsule un type sous-jacent, par ex. 'type C<'a> = C of ...'.
it: Questa abbreviazione di tipo ha uno o più parametri di tipo dichiarati non inclusi nel tipo da abbreviare. Le abbreviazioni di tipo devono usare tutti i parametri di tipo dichiarati nel tipo da abbreviare. Provare a rimuovere uno o più parametri di tipo oppure a usare una definizione di tipo concreto che esegue il wrapping di un tipo sottostante, ad esempio 'type C<'a> = C of ...'.
ja: この型の省略形では、省略される型に出現しない型パラメーターが 1 つまたは複数宣言されました。型の省略形には、省略される型のすべての宣言済み型パラメーターを使用する必要があります。1 つまたは複数のパラメーターを削除するか、基底となる型をラップする具象型定義を使用してください (たとえば、'type C<'a> = C of ...')。
ko: 이 형식 약어에는 간략화되는 형식에 나타나지 않는 하나 이상의 선언된 형식 매개 변수가 있습니다. 형식 약어는 간략화되는 형식에 있는 모든 선언된 형식 매개 변수를 사용해야 합니다. 하나 이상의 형식 매개 변수를 제거하거나 내부 형식을 래핑하는 구체적인 형식 정의(예: 'type C<'a> = C of ...'.)를 사용하세요.
pl: Ten skrót typu zawiera co najmniej jeden zadeklarowany parametr typu, który nie występuje w skracanym typie. Skróty typu muszą używać wszystkich zadeklarowanych parametrów typu w skracanym typie. Rozważ usunięcie co najmniej jednego parametru typu lub użyj konkretnej definicji typu, która opakowuje typ podstawowy, na przykład „type C<'a> = C of ...”.
pt_br: Essa abreviação de tipo tem um ou mais parâmetros de tipo declarados que não aparecem no tipo que está sendo abreviado. Abreviações de tipo devem usar todos os parâmetros de tipo declarados no tipo que está sendo abreviado. Remova um ou mais parâmetros de tipo ou use uma definição de tipo concreta que envolva um tipo subjacente, como 'type C<'a> = C of ...'.
ru: Сокращенная форма типа содержит один или несколько объявляемых параметров типа, которые не появляются в сокращаемом типе. В сокращенных формах типа должны использоваться все объявляемые параметры типа для сокращаемого типа. Удалите один или несколько параметров типа или используйте определение типа, включающее базовый тип, например, 'type C<'a> = C of ...'.
tr: Bu tür kısaltması, kısaltılan türde görünmeyen bir veya daha fazla bildirilen tür parametresine sahip. Tür kısaltmaları, kısaltılan türdeki tüm bildirilen tür parametrelerini kullanılmalıdır. Bir veya daha fazla tür parametresini kaldırmayı ya da temel bir türü sarmalayan 'type C<'a> = C of ...' gibi somut bir tür kullanmayı göz önünde bulundurun.
zh_hans: 此类型缩写词的一个或多个已声明的类型参数不在要缩写的类型中显示。类型缩写词必须使用要缩写的类型中的所有已声明类型参数。请考虑删除一个或多个类型参数，或使用包装基础类型的具体类型定义，例如 "type C<'a> = C of ..."。
zh_hant: 這個類型縮寫有一或多個已宣告的類型參數未出現在接受縮寫的類型中。類型縮寫必須使用接受縮寫的類型中所有已宣告的類型參數。請考慮移除一或多個類型參數，或使用會包裝基礎類型的實體類型定義，例如 'type C<'a> = C of ...'。

# tcStructsInterfacesEnumsDelegatesMayNotInheritFromOtherTypes
source: Structs, interfaces, enums and delegates cannot inherit from other types
cs: Struktury, rozhraní, výčty ani delegáti nemůžou dědit z jiných typů.
de: Strukturen, Schnittstellen, Enumerationen und Delegaten können nicht von anderen Typen erben.
es: Los structs, interfaces, enumeraciones y delegados no pueden heredarse de otros tipos.
fr: Les structs, interfaces, enums et délégués ne peuvent pas hériter d'autres types
it: Struct, interfacce, enumerazioni e delegati non possono ereditare da altri tipi
ja: 構造体、インターフェイス、列挙型、およびデリゲートは、他の型から継承できません
ko: 구조체, 인터페이스, 열거형 및 대리자는 다른 형식에서 상속될 수 없습니다.
pl: Struktury, interfejsy, wyliczenia i delegaty nie mogą dziedziczyć po innych typach.
pt_br: Structs, interfaces, enums e delegados não podem ser herdados de outros tipos
ru: Структуры, интерфейсы, перечисления и делегаты не могут наследовать от других типов
tr: Yapılar, arabirimler, sabit listeleri ve temsilciler diğer türlerden devralamaz
zh_hans: 结构、接口、枚举和委托不能从其他类型继承
zh_hant: 結構、介面、列舉和委派不能繼承自其他類型

# tcTypesCannotInheritFromMultipleConcreteTypes
source: Types cannot inherit from multiple concrete types
cs: Typy nemůžou dědit od více konkrétních typů.
de: Typen können nicht von mehreren konkreten Typen erben.
es: Los tipos no pueden heredarse de varios tipos concretos.
fr: Les types ne peuvent pas hériter de plusieurs types concrets
it: I tipo non possono ereditare da più tipi concreti
ja: 型は複数の具象型から継承できません
ko: 형식은 여러 구체적인 형식에서 상속될 수 없습니다.
pl: Typy nie mogą dziedziczyć po wielu konkretnych typach
pt_br: Tipos não podem ser herdados de tipos concretos múltiplos
ru: Типы не могут наследовать от множественных конкретных типов
tr: Türler birden çok somut türden devralamaz
zh_hans: 类型不能从多个具体类型继承
zh_hant: 類型不能繼承自多個具象類型

# tcRecordsUnionsAbbreviationsStructsMayNotHaveAllowNullLiteralAttribute
source: Records, union, abbreviations and struct types cannot have the 'AllowNullLiteral' attribute
cs: Typy záznam, sjednocení, zkratka a struktura nemůžou mít atribut AllowNullLiteral.
de: Datensatz, Union-, Abkürzungs- und Strukturtypen dürfen nicht das AllowNullLiteral-Attribut aufweisen.
es: Los tipos de registro, unión, abreviación y struct no pueden tener el atributo 'AllowNullLiteral'.
fr: Les types enregistrement, union, abréviation et struct ne peuvent pas avoir l'attribut 'AllowNullLiteral'
it: Tipi di struct, record, unioni e abbreviazioni non possono avere l'attributo 'AllowNullLiteral'
ja: レコード型、共用体型、省略形型、および構造体型に 'AllowNullLiteral' 属性を指定することはできません
ko: 레코드, 공용 구조체, 약어 및 구조체 형식에는 'AllowNullLiteral' 특성을 지정할 수 없습니다.
pl: Typy rekordów, unii, skrótów i struktur nie mogą zawierać atrybutu „AllowNullLiteral”
pt_br: Tipos de registros, união, abreviações e struct não podem ter o atributo 'AllowNullLiteral'
ru: Типы записей, объединений, сокращений и структур не могут иметь атрибут "AllowNullLiteral"
tr: Kayıtlar, birleşim, kısaltmalar ve yapı türlerinin 'AllowNullLiteral' özniteliği olamaz
zh_hans: 记录、联合、缩写词和结构类型不能具有“AllowNullLiteral”特性
zh_hant: 記錄、等位、縮寫和結構類型不能有 'AllowNullLiteral' 屬性

# tcAllowNullTypesMayOnlyInheritFromAllowNullTypes
source: Types with the 'AllowNullLiteral' attribute may only inherit from or implement types which also allow the use of the null literal
cs: Typy s atributem AllowNullLiteral můžou dědit jenom od typů, které umožňují použít taky literál s hodnotou null, nebo tyto typy můžou implementovat.
de: Typen mit dem AllowNullLiteral-Attribut können nur von Typen erben bzw. diese implementieren, die die Verwendung des NULL-Literals ebenfalls zulassen.
es: Los tipos con el atributo 'AllowNullLiteral' pueden implementar o se pueden heredar solo de tipos que también permitan el uso del literal null.
fr: Les types avec l'attribut 'AllowNullLiteral' ne peuvent hériter que des types ou implémenter que les types qui autorisent également l'utilisation du littéral null
it: I tipi con attributo 'AllowNullLiteral' possono solo implementare o ereditare da tipi che consentono anche l'utilizzo di valori letterali Null
ja: 'AllowNullLiteral' 属性を持つ型が継承または実装できるのは、null のリテラルも使用できる型のみです
ko: 'AllowNullLiteral' 특성이 지정된 형식은 null 리터럴도 사용할 수 있는 형식을 구현하거나 이 형식에서 상속되어야 합니다.
pl: Typy z atrybutem „AllowNullLiteral” mogą dziedziczyć tylko po typach, które również zezwalają na używanie literału o wartości null, lub zawierać ich implementację
pt_br: Tipos com o atributo 'AllowNullLiteral' só podem implementar ou herdar tipos que também permitem o uso do literal nulo.
ru: Типы с атрибутом "AllowNullLiteral" могут наследоваться только от типов, поддерживающих пустые литералы, и реализовать только такие типы
tr: 'AllowNullLiteral' özniteliğine sahip türler yalnızca null sabit değerinin kullanılmasına da izin veren türlerden devralabilir veya böyle türleri uygulayabilir
zh_hans: 具有“AllowNullLiteral”特性的类型只能继承自或实现也允许使用 null 文本的类型
zh_hant: 具 'AllowNullLiteral' 屬性的類型只能繼承自或實作允許使用 null 常值的類型

# tcGenericTypesCannotHaveStructLayout
source: Generic types cannot be given the 'StructLayout' attribute
cs: Obecným typům se nemůže předávat atribut StructLayout.
de: Generische Typen können nicht mit dem StructLayout-Attribut versehen werden.
es: A los tipos genéricos no se les puede dar el atributo 'StructLayout'.
fr: Impossible de donner aux types génériques l'attribut 'StructLayout'
it: Non è possibile assegnare l'attributo 'StructLayout' a tipi generici
ja: ジェネリック型に 'StructLayout' 属性を指定することはできません
ko: 제네릭 형식에는 'StructLayout' 특성을 지정할 수 없습니다.
pl: Typy ogólne nie mogą mieć atrybutu „StructLayout”
pt_br: O atributo 'StructLayout' não pode ser dado a tipos genéricos
ru: Базовые типы не могут получать атрибут "StructLayout"
tr: Genel türlere 'StructLayout' özniteliği verilemez
zh_hans: 不能为泛型类型给定“StructLayout”特性
zh_hant: 不能為泛型類型指定 'StructLayout' 屬性
