Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# implicitlyDiscardedInSequenceExpression
source: This expression returns a value of type '{0}' but is implicitly discarded. Consider using 'let' to bind the result to a name, e.g. 'let result = expression'. If you intended to use the expression as a value in the sequence then use an explicit 'yield'.
cs: Tento výraz vrátí hodnotu typu {0}, ale implicitně se zahodí. Zvažte vytvoření vazby mezi výsledkem a názvem pomocí klíčového slova let, např. let výsledek = výraz. Pokud jste chtěli výraz použít jako hodnotu v sekvenci, použijte explicitní klíčové slovo yield.
de: Dieser Ausdruck gibt einen Wert des Typs "{0}" zurück, wird aber implizit verworfen. Verwenden Sie ggf. "let", um das Ergebnis an einen Namen zu binden. Beispiel: "let Ergebnis = Ausdruck". Falls Sie den Ausdruck als Wert in der Sequenz einsetzen möchten, verwenden Sie explizit "yield".
es: Esta expresión devuelve un valor de tipo “{0}”, pero se descarta de forma implícita. Considere el uso de “let” para enlazar el resultado a un nombre; por ejemplo, “let result = expression”. Si su intención es utilizar la expresión como un valor en la secuencia, utilice “yield” de forma explícita.
fr: Cette expression retourne une valeur de type '{0}', mais est implicitement ignorée. Utilisez 'let' pour lier le résultat à un nom, par ex. 'let result = expression'. Si vous voulez utiliser l'expression comme valeur dans la séquence, utilisez un 'yield' explicite.
it: Questa espressione restituisce un valore di tipo '{0}' ma viene rimossa in modo implicito. Provare a usare 'let' per eseguire il binding del risultato a un nome, ad esempio 'let risultato = espressione'. Se si intende usare l'espressione come valore nella sequenza, usare l'operando 'yield' esplicito.
ja: この式は型 '{0}' の値を返しますが、暗黙的に破棄されます。'let' を使用して結果を名前にバインドすることを検討してください。例: 'let result = expression'。式をシーケンス内で値として使用する場合は、明示的に 'yield' を使用してください。
ko: 이 식은 '{0}' 형식의 값을 반환하지만 암시적으로 삭제됩니다. 'let'을 사용하여 결과를 이름에 바인딩하세요(예: 'let result = expression'). 식을 시퀀스의 값으로 사용하려면 명시적 'yield'를 사용하세요.
pl: To wyrażenie zwraca wartość typu „{0}”, ale jest niejawnie odrzucane. Rozważ użycie instrukcji „let” do powiązania wyniku z nazwą, np. „let wynik = wyrażenie”. Jeśli chcesz użyć tego wyrażenia jako wartości w sekwencji, użyj jawnej instrukcji „yield”.
pt_br: Essa expressão retorna um valor de tipo '{0}', mas é descartada de forma implícita. Considere o uso de 'let' para associar o resultado a um nome, por exemplo, 'let result = expression'. Se você pretende usar a expressão como um valor na sequência, use um “yield” explícito.
ru: Это выражение возвращает значение типа "{0}", но оно неявно отбрасывается. Чтобы привязать результат к какому-то имени, используйте "let", например: "let <результат> = <выражение>". Если вы собирались использовать выражение как значение в последовательности, используйте в явном виде "yield".
tr: Bu ifade '{0}' türünde bir değer döndürür ancak örtük olarak atılır. Sonucu bir ada bağlamak için 'let' kullanabilirsiniz, örn. 'let sonuc = ifade'. İfadeyi dizide bir değer olarak kullanmayı amaçladıysanız açık bir 'yield' kullanın.
zh_hans: 此表达式返回类型为“{0}”的值，但被隐式放弃。请考虑使用 "let" 将结果绑定到名称，例如 "let result = expression"。如果要使用该表达式作为序列中的值，则使用显式 "yield"。
zh_hant: 此運算式會傳回類型為 '{0}' 的值，但會被間接捨棄。請考慮使用 'let' 將結果繫結到名稱。例如 'let result = expression'。若您想要在序列中，以值的形式使用運算式，請直接使用 'yield'。

# implicitlyDiscardedSequenceInSequenceExpression
source: This expression returns a value of type '{0}' but is implicitly discarded. Consider using 'let' to bind the result to a name, e.g. 'let result = expression'. If you intended to use the expression as a value in the sequence then use an explicit 'yield!'.
cs: Tento výraz vrátí hodnotu typu {0}, ale implicitně se zahodí. Zvažte vytvoření vazby mezi výsledkem a názvem pomocí klíčového slova let, např. let výsledek = výraz. Pokud jste chtěli výraz použít jako hodnotu v sekvenci, použijte explicitní klíčové slovo yield!.
de: Dieser Ausdruck gibt einen Wert des Typs "{0}" zurück, wird aber implizit verworfen. Verwenden Sie ggf. "let", um das Ergebnis an einen Namen zu binden. Beispiel: "let Ergebnis = Ausdruck". Falls Sie den Ausdruck als Wert in der Sequenz einsetzen möchten, verwenden Sie explizit "yield!".
es: Esta expresión devuelve un valor de tipo “{0}”, pero se descarta de forma implícita. Considere el uso de “let” para enlazar el resultado a un nombre; por ejemplo, “let result = expression”. Si su intención es utilizar la expresión como un valor en la secuencia, utilice “yield” de forma explícita.
fr: Cette expression retourne une valeur de type '{0}', mais est implicitement ignorée. Utilisez 'let' pour lier le résultat à un nom, par ex. 'let result = expression'. Si vous voulez utiliser l'expression comme valeur dans la séquence, utilisez un 'yield!' explicite.
it: Questa espressione restituisce un valore di tipo '{0}' ma viene rimossa in modo implicito. Provare a usare 'let' per eseguire il binding del risultato a un nome, ad esempio 'let risultato = espressione'. Se si intende usare l'espressione come valore nella sequenza, usare l'operando 'yield!' esplicito.
ja: この式は型 '{0}' の値を返しますが、暗黙的に破棄されます。'let' を使用して結果を名前にバインドすることを検討してください。例: 'let result = expression'。式をシーケンス内で値として使用する場合は、明示的に 'yield!' を使用してください。
ko: 이 식은 '{0}' 형식의 값을 반환하지만 암시적으로 삭제됩니다. 'let'을 사용하여 결과를 이름에 바인딩하세요(예: 'let result = expression'). 식을 시퀀스의 값으로 사용하려면 명시적 'yield!'를 사용하세요.
pl: To wyrażenie zwraca wartość typu „{0}”, ale jest niejawnie odrzucane. Rozważ użycie instrukcji „let” do powiązania wyniku z nazwą, np. „let wynik = wyrażenie”. Jeśli chcesz użyć tego wyrażenia jako wartości w sekwencji, użyj jawnej instrukcji „yield!”.
pt_br: Essa expressão retorna um valor de tipo '{0}', mas é descartada de forma implícita. Considere o uso de 'let' para associar o resultado a um nome, por exemplo, 'let result = expression'. Se você pretende usar a expressão como um valor na sequência, use um “yield!” explícito.
ru: Это выражение возвращает значение типа "{0}", но оно неявно отбрасывается. Чтобы привязать результат к какому-то имени, используйте "let", например: "let <результат> = <выражение>". Если вы собирались использовать выражение как значение в последовательности, используйте в явном виде "yield!".
tr: Bu ifade '{0}' türünde bir değer döndürür ancak örtük olarak atılır. Sonucu bir ada bağlamak için 'let' kullanabilirsiniz, örn. 'let sonuc = ifade'. İfadeyi dizide bir değer olarak kullanmayı amaçladıysanız açık bir 'yield!' kullanın.
zh_hans: 此表达式返回类型为“{0}”的值，但被隐式放弃。请考虑使用 "let" 将结果绑定到名称，例如 "let result = expression"。如果要使用该表达式作为序列中的值，则使用显式 "yield!"。
zh_hant: 此運算式會傳回類型為 '{0}' 的值，但會被間接捨棄。請考慮使用 'let' 將結果繫結到名稱。例如 'let result = expression'。若您想要在序列中，以值的形式使用運算式，請直接使用 'yield!'。

# keywordDescriptionMatchBang
source: Used in computation expressions to pattern match directly over the result of another computation expression.
cs: Používá se ve výrazech výpočtu k přímému porovnání vzorů s výsledkem jiného výrazu výpočtu.
de: Wird in Berechnungsausdrücken zur Musterübereinstimmung direkt über dem Ergebnis eines anderen Berechnungsausdrucks verwendet.
es: Se utiliza en expresiones de cálculo para hacer coincidir patrones directamente sobre el resultado de otra expresión de cálculo.
fr: Permet dans les expressions de calcul d'appliquer directement des critères spéciaux au résultat d'une autre expression de calcul.
it: Usata nelle espressioni di calcolo per includere direttamente nei criteri di ricerca il risultato di un'altra espressione di calcolo.
ja: 別のコンピュテーション式の結果に対して直接パターン マッチを適用するコンピュテーション式の中で使用します。
ko: 다른 계산 식의 결과에 대해 직접적으로 패턴 일치에 대한 계산 식에 사용됩니다.
pl: Używane w wyrażeniach obliczenia do dopasowania do wzorca bezpośrednio w wyniku innego wyrażenia obliczenia.
pt_br: Usado em expressões de computação para corresponder ao padrão diretamente sobre o resultado de outra expressão de computação.
ru: Используется в выражениях вычислений для сопоставления шаблонов непосредственно с результатом другого выражения вычислений.
tr: Başka bir hesaplama ifadesinin sonucu üzerinde doğrudan desen eşleştirmesi için hesaplama ifadelerinde kullanılır.
zh_hans: 在计算表达式中用于直接对另一个计算表达式的结果进行模式匹配。
zh_hant: 用於計算運算式中，直接對另一個計算運算式的結果進行模式比對。

# ilreadFileChanged
source: The file '{0}' changed on disk unexpectedly, please reload.
cs: Soubor {0} se na disku neočekávaně změnil, opakujte prosím načtení.
de: Die Datei "{0}" wurde auf dem Datenträger unerwartet geändert. Laden Sie sie erneut.
es: El archivo "{0}" cambió en el disco de manera inesperada; cárguelo de nuevo.
fr: Changement inattendu du fichier '{0}' sur le disque. Rechargez le fichier.
it: Il file '{0}' è stato modificato su disco in modo imprevisto. Ricaricare.
ja: ファイル '{0}' がディスク上で予期せず変更されました。再度読み込んでください。
ko: '{0}' 파일이 디스크에서 예기치 않게 변경되었습니다. 다시 로드하세요.
pl: Plik „{0}” nieoczekiwanie uległ zmianie na dysku. Załaduj go ponownie.
pt_br: O arquivo '{0}' foi alterado no disco inesperadamente. Recarregue-o.
ru: Файл "{0}" был неожиданно изменен на диске, повторите загрузку.
tr: Diskte '{0}' dosyası beklenmedik şekilde değiştirildi. Lütfen yeniden yükleyin.
zh_hans: 文件“{0}”在磁盘上意外更改，请重新加载。
zh_hant: 檔案 '{0}' 在磁碟上意外變更，請重新載入。

# writeToReadOnlyByref
source: The byref pointer is readonly, so this write is not permitted.
cs: Ukazatel byref je jen pro čtení, proto tento zápis není povolený.
de: Der byref-Zeiger ist schreibgeschützt, daher ist dieser Schreibvorgang unzulässig.
es: El puntero byref es de solo lectura, por lo que no se permite esta operación de escritura.
fr: Le pointeur byref étant en lecture seule, cette écriture n'est pas autorisée.
it: Il puntatore byref è di sola lettura, di conseguenza questa operazione di scrittura non è consentita.
ja: byref ポインターは読み取り専用であるため、この書き込みは許可されません。
ko: byref 포인터는 읽기 전용이므로 이 쓰기가 허용되지 않습니다.
pl: Wskaźnik byref jest tylko do odczytu, więc ten zapis nie jest dozwolony.
pt_br: O ponteiro byref é somente leitura. Portanto, esta gravação não é permitida.
ru: Указатель byref доступен только для чтения, поэтому операция записи запрещена.
tr: Byref işaretçisi salt okunur olduğundan bu yazma işlemine izin verilmiyor.
zh_hans: 此 byref 指针为只读，因此，不允许此写入。
zh_hant: byref 指標為唯讀指標，所以不允許此寫入。

# tastValueMustBeMutable
source: A value must be mutable in order to mutate the contents or take the address of a value type, e.g. 'let mutable x = ...'
cs: Hodnota musí být proměnlivá, aby se dal změnit obsah nebo aby se dala převzít adresa typu hodnoty, třeba let mutable x = ...
de: Ein Wert muss änderbar sein, um die Inhalte eines Werttyps zu mutieren oder seine Adresse zu übernehmen, z.B. "let mutable x = ...".
es: Un valor debe ser mutable para poder mutar el contenido o tomar la dirección de un tipo de valor; por ejemplo, 'let mutable x = ...'
fr: Une valeur doit être mutable pour pouvoir muter le contenu ou accepter l'adresse d'un type valeur, par exemple 'let mutable x = ...'
it: Un valore deve essere modificabile per poter modificare i contenuti oppure utilizzare l'indirizzo di un tipo di valore, ad esempio 'let mutable x = ...'
ja: 値の型の内容を変更するか、値の型のアドレスを使用するために、値は変更可能にする必要があります (たとえば、'let mutable x = ...')
ko: 내용을 변경하거나 값 형식의 주소를 사용하려면 값을 변경할 수 있어야 합니다(예: 'let mutable x = ...').
pl: Aby można było zmodyfikować zawartość lub pobrać adres typu wartości, wartość musi być modyfikowalna, na przykład „let mutable x = ...”
pt_br: Um valor deve ser mutável para que seja possível mudar o conteúdo ou pegar o endereço de um tipo de valor, por exemplo: 'let mutable x = ...'
ru: Чтобы изменить содержимое или получить адрес типа значения, значение должно быть изменяемым, например, "let mutable x = ..."
tr: İçeriği değiştirmek veya değer türünün adresini almak için bir değerin değiştirilebilir olması gerekir, örn. 'let mutable x = ...'
zh_hans: 值必须是可变的，以便更改内容或采用值类型的地址，例如“let mutable x = ...”
zh_hant: 值必須是可變動的，才能變動內容或接受實值類型的位址，例如 'let mutable x = ...'

# readOnlyAttributeOnStructWithMutableField
source: A ReadOnly attribute has been applied to a struct type with a mutable field.
cs: Atribut ReadOnly byl použit na typ struktury s měnitelným (proměnlivým) polem.
de: Auf einen Strukturtyp mit einem veränderbaren Feld wurde ein ReadOnly-Attribut angewendet.
es: Se ha aplicado el atributo ReadOnly a un tipo de estructura con un campo mutable.
fr: Un attribut ReadOnly a été appliqué à un type struct avec un champ mutable.
it: Un attributo ReadOnly è stato applicato a un tipo struct con campo modificabile.
ja: 読み取り専用の属性が、変更可能なフィールドを持つ構造体型に適用されました。
ko: 변경할 수 있는 필드가 있는 구조체 형식에 ReadOnly 특성이 적용되었습니다.
pl: Atrybut ReadOnly został zastosowany do typu struktury z polem modyfikowalnym.
pt_br: O atributo ReadOnly foi aplicado a um tipo de struct com um campo mutável.
ru: Атрибут ReadOnly был применен к типу структуры с изменяемым полем.
tr: Değiştirilebilir bir alana sahip bir yapı türüne ReadOnly özniteliği uygulandı.
zh_hans: 已对包含可变字段的结构类型应用只读属性。
zh_hant: 已將 ReadOnly 屬性套用至具備可變動欄位的結構類型。

# tcByrefReturnImplicitlyDereferenced
source: A byref pointer returned by a function or method is implicitly dereferenced as of F# 4.5. To acquire the return value as a pointer, use the address-of operator, e.g. '&f(x)' or '&obj.Method(arg1, arg2)'.
cs: K ukazateli byref vrácenému funkcí nebo metodou se od F# 4.5 implicitně přistupuje přes ukazatel. Pokud chcete návratovou hodnotu získat jako ukazatel, použijte operátor adresy, například &f(x) nebo &obj.Metoda(arg1, arg2).
de: Ein byref-Zeiger, der von einer Funktion oder Methode zurückgegeben wird, wird explizit als von F# 4.5 stammend dereferenziert. Verwenden Sie den &-Operator (z.B. "&f(x)" oder "&obj.Method(arg1, arg2)"), um den Rückgabewert als Zeiger abzurufen.
es: La referencia de un puntero byref devuelto por una función o un método se elimina implícitamente a partir de F# 4.5. Para adquirir el valor de retorno como un puntero, use el operador address-of, por ejemplo, "&f(x)' or '&obj.Method(arg1, arg2)".
fr: Un pointeur byref retourné par une fonction ou une méthode est implicitement déréférencé à partir de F# 4.5. Pour acquérir la valeur de retour sous forme de pointeur, utilisez l'opérateur d'adresse, par ex. '&f(x)' ou '&obj.Method(arg1, arg2)'.
it: Un puntatore byref restituito da una funzione o da un metodo è deferenziato in modo implicito a partire da F# 4.5. Per acquisire il valore restituito come puntatore, usare l'operatore address-of, ad esempio '&f(x)' or '&obj.Method(arg1, arg2)'.
ja: 関数またはメソッドによって返される byref ポインターが F# 4.5 の時点では暗黙的に逆参照されています。ポインターとして返り値を取得するには、address-of 演算子を使用して '&f(x)' または '&obj.Method(arg1, arg2)' などとします。
ko: 함수 또는 메서드에 의해 반환된 byref 포인터가 F# 4.5부터 암시적으로 역참조됩니다. 포인터로 반환 값을 가져오려면 address-of 연산자를 사용하세요(예: '&f(x)' 또는 '&obj.Method(arg1, arg2)').
pl: Wskaźnik byref zwracany przez funkcję lub metodę jest niejawnie wyłuskiwany w języku F# 4.5 i nowszych. Aby uzyskać wartość zwracaną jako wskaźnik, użyj operatora address-of, np. „&f(x)” lub „&obj.Method(argument1, argument2)”.
pt_br: Um ponteiro byref retornado por uma função ou um método é implicitamente desreferenciado a partir de F# 4.5. Para adquirir o valor de retorno como um ponteiro, use o operador de endereço, por exemplo, '&f(x)' ou '&obj.Method(arg1, arg2)'.
ru: Указатель на byref, возвращаемый функцией или методом, в F# 4.5 разрешается неявно. Чтобы получить возвращаемое значение в виде указателя, используйте оператор адреса, например, '&f(x)' или '&obj.Method(arg1, arg2)'.
tr: F# 4.5 sürümüyle birlikte, bir işlev veya metot tarafından döndürülen bir byref işaretçisinin referansı örtük olarak kaldırılır. Döndürülen değeri bir işaretçi olarak edinmek için address-of işlecini kullanın, ör. '&f(x)' veya '&obj.Method(arg1, arg2)'.
zh_hans: 自 F# 4.5 起，隐式取消引用由函数或方法返回的 byref 指针。要获取返回值作为指针，请使用 address-of 运算符，例如 "&f(x)" 或 "&obj.Method(arg1, arg2)"。
zh_hant: 自 F# 4.5 起，會對函式或方法所傳回的 byref 指標隱含取值。若要取得傳回值作為指標，請使用 address-of 運算子，例如 '&f(x)' 或 '&obj.Method(arg1, arg2)'。

# tcByRefLikeNotStruct
source: A type annotated with IsByRefLike must also be a struct. Consider adding the [<Struct>] attribute to the type.
cs: Typ označený IsByRefLike musí být také strukturou. Zvažte možnost přidat k typu atribut [<Struct>].
de: Ein mit "IsByRefLike" versehener Typ muss ebenfalls eine Struktur sein. Fügen Sie das [<Struct>]-Attribut zum Typ hinzu.
es: Un tipo anotado con IsByRefLike también debe ser una estructura. Considere agregar el atributo [<Struct>] al tipo.
fr: Un type annoté avec IsByRefLike doit aussi être un struct. Ajoutez l'attribut [<Struct>] au type.
it: Un tipo annotato con IsByRefLike deve essere anche uno struct. Provare ad aggiungere l'attributo [<Struct>] al tipo.
ja: IsByRefLike の注釈が付けられた型は構造体でもなければなりません。型に [<Struct>] 属性を追加することを検討してください。
ko: IsByRefLike로 주석이 추가된 형식은 구조체여야 합니다. 형식에 [<Struct>] 특성을 추가하세요.
pl: Typ z adnotacją IsByRefLike musi być również strukturą. Rozważ dodanie atrybutu [<Struct>] do typu.
pt_br: Um tipo anotado com IsByRefLike também deve ser um struct. Adicione o atributo [<Struct>] ao tipo.
ru: Тип, помеченный аннотацией IsByRefLike, обязательно должен быть структурой. Добавьте атрибут [<Struct>] к типу.
tr: IsByRefLike ek açıklamasına sahip bir tür, aynı zamanda bir yapı olmalıdır. Türe [<Struct>] özniteliğini eklemeyi göz önünde bulundurun.
zh_hans: 使用 IsByRefLike 注释的类型还必须是一个结构。请考虑向该类型添加 [<Struct>] 属性。
zh_hant: 有 IsByRefLike 標註的類型也必須是結構。請考慮將 [<Struct>] 屬性新增到類型。

# chkNoByrefAddressOfLocal
source: The address of the variable '{0}' or a related expression cannot be used at this point. This is to ensure the address of the local value does not escape its scope.
cs: Adresa proměnné {0} nebo související výraz nejde v tomto bodě použít. Je tím zajištěno, aby adresa lokální hodnoty neunikla ze svého rozsahu.
de: Die Adresse der Variablen "{0}" oder ein entsprechender Ausdruck kann zu diesem Zeitpunkt nicht verwendet werden. Hierdurch wird sichergestellt, dass die Adresse des lokalen Werts den zugehörigen Bereich nicht verlässt.
es: En este punto, no se puede usar la dirección de la variable “{0}” o una expresión relacionada. Esto es para asegurar que la dirección del valor local no escape de su ámbito.
fr: L'adresse de la variable '{0}' ou une expression associée ne peut pas être utilisée à ce stade. Cela permet de s'assurer que l'adresse de la valeur locale ne sort pas de sa portée.
it: In questo punto non è possibile usare l'indirizzo della variabile '{0}' o un'espressione correlata. Questo serve ad assicurare che l'indirizzo del valore locale non ignori il relativo ambito.
ja: 現時点で、変数 '{0}' または関連する式のアドレスは使用できません。これは、ローカル値のアドレスがスコープを回避しないようにするためです。
ko: 지금은 '{0}' 변수의 주소 또는 관련 식을 사용할 수 없습니다. 로컬 값의 주소가 범위를 벗어나지 않도록 하기 위한 것입니다.
pl: W tym miejscu nie można użyć adresu zmiennej „{0}” ani powiązanego wyrażenia. Ma to na celu uniemożliwienie adresowi wartości lokalnej wykroczenia poza zakres.
pt_br: O endereço da variável '{0}' ou de uma expressão relacionada não pode ser utilizado neste ponto. Isso tem como objetivo garantir que o endereço do valor local não escape de seu escopo.
ru: На этом этапе невозможно использовать адрес переменной "{0}" или связанного выражения. В этом случае гарантируется, что адрес локального значения не обходит свою область.
tr: Bu noktada '{0}' değişkeninin veya ilgili bir değişkenin adresi kullanılamaz. Bunun amacı, yerel değerin adresinin kapsamı dışına kaçmasını engellemektir.
zh_hans: 此时无法使用变量“{0}”或相关表达式的地址。这是为了确保本地值的地址不超出其范围。
zh_hant: 此時不可使用變數 '{0}' 或相關運算式的位址。如此可確保本機值的位址不會逸出其範圍。

# chkNoWriteToLimitedSpan
source: This value can't be assigned because the target '{0}' may refer to non-stack-local memory, while the expression being assigned is assessed to potentially refer to stack-local memory. This is to help prevent pointers to stack-bound memory escaping their scope.
cs: Tuto hodnotu nejde přiřadit, protože cíl {0} může odkazovat na paměť, která nepoužívá lokální zásobník (non-stack-local), zatímco přiřazovaný výraz je vyhodnocený tak, že může případně odkazovat na paměť s lokálním zásobníkem (stack-local). Díky tomu se zabraňuje, aby ukazatele na paměť svázanou se zásobníkem (stack-bound) unikly ze svého rozsahu.
de: Dieser Wert kann nicht zugewiesen werden, weil das Ziel "{0}" möglicherweise auf einen lokalen Nicht-Stapel-Arbeitsspeicher verweist, während der zugewiesene Ausdruck laut Auswertung möglicherweise auf einen lokalen Stapelarbeitsspeicher verweist. So wird verhindert, dass Zeiger auf stapelgebundenen Arbeitsspeicher ihren Bereich verlassen.
es: No se puede asignar este valor porque el destino “{0}” puede hacer referencia a memoria local fuera de la pila, mientras que la expresión que se va a asignar podría hacer referencia a memoria local de la pila. Esto es para evitar que los punteros de memoria ligada a la pila escapen de su ámbito.
fr: Impossible d’affecter cette valeur car la cible '{0}' peut faire référence à une mémoire non locale (hors de la pile), tandis que l'expression en cours d’affectation est évaluée comme faisant potentiellement référence à une mémoire locale (dans la pile). Cela permet d'éviter que les pointeurs vers la mémoire liée à la pile ne sortent de leur portée.
it: Non è possibile assegnare questo valore perché l'elemento '{0}' di destinazione può fare riferimento alla memoria locale non stack, mentre l'espressione da assegnare viene valutata in modo da fare potenzialmente riferimento alla memoria locale stack. Tale comportamento consente di evitare puntatori a memoria associata allo stack che ignorano il relativo ambito.
ja: この値をターゲット '{0}' に割り当てることはできません。このターゲットは非スタック ローカルのメモリを参照できるのに対して、割り当てられる式はスタック ローカルのメモリに評価される可能性があるためです。これは、スタックにバインドされたメモリへのポインターが自身のスコープを回避することを防止するために役立ちます。
ko: '{0}' 대상이 비스택 로컬 메모리를 참조할 수 있는데, 할당되는 식은 잠재적으로 스택 로컬 메모리를 참조하도록 평가되므로 이 값을 할당할 수 없습니다. 스택에 바인딩된 메모리에 대한 포인터가 범위를 벗어나지 않도록 하기 위한 것입니다.
pl: Ta wartość nie może zostać przypisana, ponieważ element docelowy „{0}” może odwoływać się do pamięci innej niż pamięć lokalna dla stosu, natomiast przypisywane wyrażenie może potencjalnie odwoływać się do pamięci lokalnej dla stosu. Dzięki temu łatwiej uniemożliwić wskaźnikom do pamięci powiązanej ze stosem wykroczenie poza ich zakres.
pt_br: Este valor não pode ser atribuído porque o destino '{0}' pode se referir a uma memória local não empilhada, enquanto a expressão que está sendo atribuída é avaliada para possivelmente se referir à memória local empilhada. Isso tem como objetivo ajudar a evitar que os ponteiros da memória vinculada à pilha escapem de seu escopo.
ru: Это значение не может быть назначено, так как целевой элемент "{0}" может ссылаться на отличную от локальной для стека память, тогда как назначаемое выражение оценивается как потенциально ссылающееся на локальную для стека память. В этом случае гарантируется, что указатели на привязанную к стеку память не обходят свою область.
tr: '{0}' hedefi yığında yerel olmayan belleğe başvurabileceğinden ve atanmakta olan ifadenin yığında yerel belleğe başvurma olasılığının olduğu tespit edildiğinden bu değer atanamaz. Bunun amacı, yığınla sınırlı belleğe yönelik işaretçilerin kapsamlarından kaçmasının önlenmesine yardımcı olmaktır.
zh_hans: 无法分配此值，因为目标“{0}”可能涉及非堆栈本地内存，而分配的表达式经评估可能涉及堆栈本地内存。这有助于防止指向堆栈绑定内存的指针超出其范围。
zh_hant: 因為目標 '{0}' 會參考非本機堆疊的記憶體，所以無法指派此值。而目前所指派的運算式則評定為可能會參考本機堆疊的記憶體。如此可有助於避免進入受堆疊拘束記憶體的指標會逸出其範圍。
