Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# tastValueMustBeLocal
source: A value defined in a module must be mutable in order to take its address, e.g. 'let mutable x = ...'
cs: Hodnot definovaná v modulu musí být měnitelná, aby se mohla převzít její adresa, např. let mutable x = ...
de: Ein in einem Modul definierter Wert muss änderbar sein, um die Adresse anzunehmen, z.B. "let mutable x = ...".
es: Un valor definido en un módulo debe ser mutable para tomar su dirección; por ejemplo, “let mutable x = ...”
fr: Une valeur définie dans un module doit être mutable pour prendre son adresse. Par exemple : 'let mutable x = ...'.
it: Un valore definito in un modulo deve essere modificabile per poterne accettare l'indirizzo, ad esempio 'let mutable x = ...'
ja: モジュール内で定義する値のアドレスを取得するには、その値を変更可能にする必要があります。例: 'let mutable x = ...'
ko: 해당 주소를 사용하려면 모듈에 정의된 값이 변경 가능해야 합니다(예: 'let mutable x = ...').
pl: Wartość zdefiniowana w module musi być modyfikowalna w celu uzyskania jej adresu, np. „let mutable x = ...”
pt_br: O valor definido em um módulo deve ser mutável para obter seu endereço, por exemplo, 'let mutable x = ...'
ru: Чтобы получить свой адрес, значение, определенное в модуле, должно быть изменяемым, например "let mutable x = ...".
tr: Bir modülde tanımlanan bir değerin adresini alabilmesi için değiştirilebilir olması gerekir. Örn. 'let mutable x = ...'
zh_hans: 在模块中定义的值必须是可变的，以便获取其地址，例如 “let mutable x = ...”
zh_hant: 模組中定義的值必須可以變動，才可取用其位址，例如 'let mutable x = ...'

# tcIsReadOnlyNotStruct
source: A type annotated with IsReadOnly must also be a struct. Consider adding the [<Struct>] attribute to the type.
cs: Typ označený IsReadOnly musí být také strukturou. Zvažte možnost přidat k typu atribut [<Struct>].
de: Ein Typ mit der Anmerkung "IsReadOnly" muss ebenfalls eine Struktur sein. Fügen Sie das [<Struct>]-Attribut zum Typ hinzu.
es: Un tipo anotado con IsReadOnly también debe ser una estructura. Considere agregar el atributo [<Struct>] al tipo.
fr: Un type annoté avec IsReadOnly doit aussi être un struct. Ajoutez l'attribut [<Struct>] au type.
it: Un tipo annotato con IsReadOnly deve essere anche uno struct. Provare ad aggiungere l'attributo [<Struct>] al tipo.
ja: IsReadOnly の注釈が付いた型も構造体にする必要があります。型に [<Struct>] 属性を追加してください。
ko: IsReadOnly로 주석이 추가된 형식은 구조체여야 합니다. 형식에 [<Struct>] 특성을 추가하세요.
pl: Typ z adnotacją IsReadOnly musi również być strukturą. Rozważ dodanie atrybutu [<Struct>] do typu.
pt_br: Um tipo anotado com IsReadOnly também deve ser um struct. Adicione o atributo [<Struct>] ao tipo.
ru: Тип с аннотацией IsReadOnly должен быть структурой. Добавьте к этому типу атрибут [<Struct>].
tr: IsReadOnly ek açıklamasına sahip bir tür, aynı zamanda bir yapı olmalıdır. Türe [<Struct>] özniteliğini eklemeyi göz önünde bulundurun.
zh_hans: 使用 IsReadOnly 注释的类型还必须是一个结构。请考虑向该类型添加 [<Struct>] 属性。
zh_hant: 有 IsReadOnly 標註的類型也必須是結構。請考慮將 [<Struct>] 屬性新增到該類型。

# chkStructsMayNotReturnAddressesOfContents
source: Struct members cannot return the address of fields of the struct by reference
cs: Členové struktury nemůžou vrátit adresu polí struktury podle odkazu.
de: Strukturmember können die Adresse von Feldern der Struktur nicht per Referenz zurückgeben.
es: Los miembros de estructura no pueden devolver la dirección de los campos de la estructura por referencia
fr: Les membres du struct ne peuvent pas retourner l'adresse des champs du struct par référence
it: I membri struct non possono restituire l'indirizzo di campi dello struct per riferimento
ja: 構造体メンバーは、構造体のフィールドのアドレスを参照渡しで返すことはできません
ko: 구조체 멤버는 구조체의 필드 주소를 참조로 반환할 수 없습니다.
pl: Składowe struktury nie mogą zwracać adresów pól struktury przez odwołanie
pt_br: Os membros do struct não podem retornar o endereço dos campos do struct por referência
ru: Члены структуры не могут возвращать адрес полей структуры по ссылке
tr: Yapı üyeleri, başvuruya göre yapı alanlarının adreslerini döndüremez
zh_hans: 结构成员无法通过引用返回此结构的字段地址
zh_hant: 結構成員無法經由參考方式，傳回結構欄位的位址

# chkNoByrefLikeFunctionCall
source: The function or method call cannot be used at this point, because one argument that is a byref of a non-stack-local Span or IsByRefLike type is used with another argument that is a stack-local Span or IsByRefLike type. This is to ensure the address of the local value does not escape its scope.
cs: Volání funkce nebo metody nejde v tomto bodě použít, protože jeden argument, který je byref typu Span nebo IsByRefLike, který nepoužívá lokální zásobník (non-stack-local), je použitý s jiným argumentem, který je typu Span nebo IsByRefLike, který používá lokální zásobník (stack-local). Je tím zajištěno, aby adresa lokální hodnoty neunikla ze svého rozsahu.
de: Der Funktions- oder Methodenaufruf kann zu diesem Zeitpunkt nicht verwendet werden, weil ein Argument, das ein byref-Zeiger eines lokalen Nicht-Stapel-Span- oder -IsByRefLike-Typs ist, mit einem anderen Argument verwendet wird, das ein lokaler Stapel-Span oder -IsByRefLike-Typ ist. Hierdurch wird sichergestellt, dass die Adresse des lokalen Werts den zugehörigen Bereich nicht verlässt.
es: En este punto, no se puede usar la función o el método, porque un argumento que es un parámetro byref de un tipo local Span o IsByRefLike fuera de la pila se utiliza con otro argumento que es un tipo local Span o IsByRefLike de la pila. Esto es para asegurar que la dirección del valor local no escape de su ámbito.
fr: Impossible d’utiliser l'appel de fonction ou de méthode à ce stade, car un argument qui est un byref d'un type Span ou IsByRefLike non local (hors de la pile) est utilisé avec un autre argument de type Span ou IsByRefLike local (dans la pile). Cela permet d'éviter que l'adresse de la valeur locale ne sorte de sa portée.
it: In questo punto non è possibile usare la chiamata al metodo o alla funzione perché un argomento che è un byref di un tipo Span o IsByRefLike locale non stack viene usato con un altro argomento che è un tipo Span o IsByRefLike locale stack. Questo serve ad assicurare che l'indirizzo del valore locale non ignori il relativo ambito.
ja: 現時点で、関数またはメソッドの呼び出しは使用できません。非スタック ローカルの Span または IsByRefLike 型の byref である 1 つの引数が、スタック ローカルの Span または IsByRefLike 型である別の引数と一緒に使用されています。これは、ローカル値のアドレスがスコープを回避しないようにするためです。
ko: 비스택 로컬 Span 또는 IsByRefLike 형식의 byref인 한 인수가 스택 로컬 Span 또는 IsByRefLike 형식인 다른 인수와 함께 사용되므로 지금은 함수 또는 메서드 호출을 사용할 수 없습니다. 로컬 값의 주소가 범위를 벗어나지 않도록 하기 위한 것입니다.
pl: W tym miejscu nie można użyć wywołania funkcji lub metody, ponieważ jeden argument, który jest elementem byref typu Span lub IsByRefLike innego niż lokalnego dla stosu, został użyty z innym argumentem, który jest typem Span lub IsByRefLike lokalnym dla stosu. Ma to na celu zapewnienie, że adres wartości lokalnej nie wykracza poza swój zakres.
pt_br: A função ou a chamada do método não pode ser utilizada neste ponto porque um argumento, que é um byref de um tipo Span ou IsByRefLike local não empilhado, é utilizado com outro argumento, que é um tipo Span ou IsByRefLike local empilhado. Isso tem como objetivo garantir que o endereço do valor local não escape de seu escopo.
ru: На этом этапе невозможно использовать вызов функции или метода, так как один аргумент, представляющий собой byref с отличным от локального для стека типом Span или IsByRefLike, используется с другим аргументом, имеющим локальный для стека тип Span или IsByRefLike. В этом случае гарантируется, что адрес локального значения не обходит свою область.
tr: Yığında yerel olmayan bir Span veya IsByRefLike türünün byref’i olan bir bağımsız değişken yığında yerel olan başka bir Span veya IsByRefLike türüyle birlikte kullanıldığından işlev veya metot çağrısı bu noktada kullanılamaz. Bunun amacı, yerel değerin adresinin kapsamından kaçmasının önlenmesine yardımcı olmaktır.
zh_hans: 此时无法使用函数或方法调用，因为结合使用了一个非堆栈本地 Span 或 IsByRefLike 类型的 byref 参数和另一堆栈本地 Span 或 IsByRefLike 类型的参数。这是为了确保本地值的地址不超出其范围。
zh_hant: 此時不可使用函式或方法呼叫，原因是非本機堆疊 Span 或 IsByRefLike 類型的 byref 引數，目前與本機堆疊 Span 或 IsByRefLike 類型的引數一起使用。如此可確保本機值的位址不會逸出其範圍。

# chkNoByrefAddressOfValueFromExpression
source: The address of a value returned from the expression cannot be used at this point. This is to ensure the address of the local value does not escape its scope.
cs: Adresa hodnoty vrácené z výrazu nejde v tomto bodě použít. Je tím zajištěno, aby adresa lokální hodnoty neunikla ze svého rozsahu.
de: Die Adresse eines vom Ausdruck zurückgegebenen Werts kann zu diesem Zeitpunkt nicht verwendet werden. Hierdurch wird sichergestellt, dass die Adresse des lokalen Werts den zugehörigen Bereich nicht verlässt.
es: En este punto, no se puede usar la dirección de un valor devuelto por la expresión. Esto es para asegurar que la dirección del valor local no escape de su ámbito.
fr: L'adresse d'une valeur retournée par l'expression ne peut pas être utilisée à ce stade. Cela permet d'éviter que l'adresse de la valeur locale ne sorte de sa portée.
it: In questo punto non è possibile usare l'indirizzo di un valore restituito dall'espressione. Questo serve ad assicurare che l'indirizzo del valore locale non ignori il relativo ambito.
ja: 現時点で、式から返される値のアドレスは使用できません。これは、ローカル値のアドレスがスコープを回避しないようにするためです。
ko: 지금은 식에서 반환된 값의 주소를 사용할 수 없습니다. 로컬 값의 주소가 범위를 벗어나지 않도록 하기 위한 것입니다.
pl: W tym miejscu nie można użyć adresu wartości zwróconej z wyrażenia. Ma to na celu uniemożliwienie adresowi wartości lokalnej wykroczenia poza zakres.
pt_br: O endereço de um valor retornado da expressão não pode ser utilizado neste ponto. Isso tem como objetivo garantir que o endereço do valor local não escape de seu escopo.
ru: На этом этапе невозможно использовать адрес значения, возвращаемого выражением. В этом случае гарантируется, что адрес локального значения не обходит свою область.
tr: Bu noktada ifadeden döndürülen bir değerin adresi kullanılamaz. Bunun amacı, yerel değerin adresinin kapsamı dışına kaçmasını engellemektir.
zh_hans: 此时无法使用从表达式返回的值的地址。这是为了确保本地值的地址不超出其范围。
zh_hant: 此時不可使用運算式傳回值的位址。如此可確保本機值的位址不會逸出其範圍。

# chkNoSpanLikeVariable
source: The Span or IsByRefLike variable '{0}' cannot be used at this point. This is to ensure the address of the local value does not escape its scope.
cs: Proměnná Span nebo IsByRefLike {0} nejde v tomto bodě použít. Je tím zajištěno, aby adresa lokální hodnoty neunikla ze svého rozsahu.
de: Die Span- oder IsByRefLike-Variable "{0}" kann zu diesem Zeitpunkt nicht verwendet werden. Hierdurch wird sichergestellt, dass die Adresse des lokalen Werts den zugehörigen Bereich nicht verlässt.
es: En este punto, no se puede usar la variable Span o IsByRefLike “{0}”. Esto es para asegurar que la dirección del valor local no escape de su ámbito.
fr: Impossible d’utiliser la variable Span ou IsByRefLike '{0}' à ce stade. Cela permet d'éviter que l'adresse de la valeur locale ne sorte de sa portée.
it: In questo punto non è possibile usare la variabile '{0}' di Span o IsByRefLike. Questo serve ad assicurare che l'indirizzo del valore locale non ignori il relativo ambito.
ja: 現時点で、Span または IsByRefLike 変数 '{0}' は使用できません。これは、ローカル値のアドレスがスコープを回避しないようにするためです。
ko: 지금은 Span 또는 IsByRefLike 변수 '{0}'을(를) 사용할 수 없습니다. 로컬 값의 주소가 범위를 벗어나지 않도록 하기 위한 것입니다.
pl: W tym miejscu nie można użyć zmiennej Span lub IsByRefLike „{0}”. Ma to na celu uniemożliwienie adresowi wartości lokalnej wykroczenia poza zakres.
pt_br: A variável '{0}' de Span ou IsByRefLike não pode ser utilizada neste ponto. Isso tem como objetivo garantir que o endereço do valor local não escape de seu escopo.
ru: На этом этапе невозможно использовать переменную Span или IsByRefLike "{0}". В этом случае гарантируется, что адрес локального значения не обходит свою область.
tr: Bu noktada Span veya IsByRefLike değişkeni '{0}' kullanılamaz. Bunun amacı, yerel değerin adresinin kapsamı dışına kaçmasını engellemektir.
zh_hans: 此时无法使用 Span 或 IsByRefLike 变量“{0}”。这是为了确保本地值的地址不超出其范围。
zh_hant: 此時不可使用 Span 或 IsByRefLike 變數 '{0}'。如此可確保本機值的位址不會逸出其範圍。

# chkNoSpanLikeValueFromExpression
source: A Span or IsByRefLike value returned from the expression cannot be used at ths point. This is to ensure the address of the local value does not escape its scope.
cs: Hodnota Span nebo IsByRefLike vrácená z výrazu nejde v tomto bodě použít. Je tím zajištěno, aby adresa lokální hodnoty neunikla ze svého rozsahu.
de: Ein vom Ausdruck zurückgegebener Span- oder IsByRefLike-Wert kann zu diesem Zeitpunkt nicht verwendet werden. Hierdurch wird sichergestellt, dass die Adresse des lokalen Werts den zugehörigen Bereich nicht verlässt.
es: En este punto, no se puede usar un valor Span o IsByRefLike devuelto por la expresión. Esto es para asegurar que la dirección del valor local no escape de su ámbito.
fr: Impossible d’utiliser une valeur Span ou IsByRefLike retournée par l'expression à ce stade. Cela permet d'éviter que l'adresse de la valeur locale ne sorte de sa portée.
it: In questo punto non è possibile usare un valore Span o IsByRefLike restituito dall'espressione. Questo serve ad assicurare che l'indirizzo del valore locale non ignori il relativo ambito.
ja: 現時点で、式から返される Span または IsByRefLike 値は使用できません。これは、ローカル値のアドレスがスコープを回避しないようにするためです。
ko: 지금은 식에서 반환된 Span 또는 IsByRefLike 값을 사용할 수 없습니다. 로컬 값의 주소가 범위를 벗어나지 않도록 하기 위한 것입니다.
pl: W tym miejscu nie można użyć wartości Span lub IsByRefLike zwróconej z wyrażenia. Ma to na celu uniemożliwienie adresowi wartości lokalnej wykroczenia poza zakres.
pt_br: O valor Span ou IsByRefLike retornado da expressão não pode ser utilizado neste ponto. Isso tem como objetivo garantir que o endereço do valor local não escape de seu escopo.
ru: На этом этапе невозможно использовать значение Span или IsByRefLike, возвращаемое выражением. В этом случае гарантируется, что адрес локального значения не обходит свою область.
tr: Bu noktada ifadeden döndürülen bir Span veya IsByRefLike değeri kullanılamaz. Bunun amacı, yerel değerin adresinin kapsamı dışına kaçmasını engellemektir.
zh_hans: 此时无法使用从表达式返回的 Span 或 IsByRefLike 值。这是为了确保本地值的地址不超出其范围。
zh_hant: 此時不可使用運算式傳回值的 Span 或 IsByRefLike。如此可確保本機值的位址不會逸出其範圍。

# tastCantTakeAddressOfExpression
source: Cannot take the address of the value returned from the expression. Assign the returned value to a let-bound value before taking the address.
cs: Adresa hodnoty vrácená výrazem nejde převzít. Před převzetím adresy přiřaďte vrácenou hodnotu hodnotě s vazbou na klauzuli Let.
de: Die Adresse des über den Ausdruck zurückgegebenen Werts kann nicht abgerufen werden. Weisen Sie den zurückgegebenen Wert einem let-bound-Wert zu, bevor Sie die Adresse abrufen.
es: No se puede tomar la dirección del valor devuelto de la expresión. Asigne el valor devuelto a un valor enlazado con let antes de tomar la dirección.
fr: Impossible de prendre l'adresse de la valeur retournée par l'expression. Assignez la valeur retournée à une valeur liée à let avant de prendre l'adresse.
it: Non è possibile accettare l'indirizzo del valore restituito dall'espressione. Assegnare il valore restituito a un valore associato a let prima di accettare l'indirizzo.
ja: 式から返された値のアドレスを取得できません。アドレスを取得する前に、let でバインドされた値に戻り値を割り当ててください。
ko: 식에서 반환된 값의 주소를 가져올 수 없습니다. 주소를 가져오기 전에 반환된 값을 let 바인딩 값에 할당하세요.
pl: Nie można uzyskać adresu wartości zwróconej przez wyrażenie. Przypisz zwróconą wartość do wartości powiązanej za pomocą instrukcji let przed uzyskaniem adresu.
pt_br: Não é possível obter o endereço do valor retornado da expressão. Atribua o valor retornado a um valor associado a let antes de obter o endereço.
ru: Невозможно получить адрес значения, возвращенного из выражения. Используйте возвращенное значение в качестве значения с привязкой let, прежде чем получить адрес.
tr: İfadeden döndürülen değerin adresi alınamaz. Adresi almadan önce, döndürülen değeri let ile bağlanmış bir değere atayın.
zh_hans: 无法采用从表达式返回的地址值。在采用地址前将返回值分配给 let 绑定值。
zh_hant: 無法使用運算式傳回值的位址。在使用位址前，先將傳回值指派給以 let 繫結的值。

# parsUnmatchedBraceBar
source: Unmatched '{{|'
cs: Nespárované znaky {{|
de: Keine Entsprechung für "{{" .
es: A "{{|" le falta el otro elemento correspondiente
fr: '{{|' incompatible
it: '{{|' senza corrispondenza
ja: '{{|' が対応しません
ko: '{{|'의 짝이 맞지 않습니다.
pl: Niedopasowany element „{{|”
pt_br: '{{|' incompatível
ru: Отсутствует парная скобка для '{{|'
tr: Eşleşmeyen '{{|'
zh_hans: 未匹配的 "{{|"
zh_hant: 不對稱的 '{{|'

# typeInfoAnonRecdField
source: anonymous record field
cs: pole anonymního záznamu
de: Feld für anonyme Datensätze
es: campo de registro anónimo
fr: champ d'enregistrement anonyme
it: campo del record anonimo
ja: 匿名レコード フィールド
ko: 무명 레코드 필드
pl: pole rekordu anonimowego
pt_br: campo de registro anônimo
ru: поле анонимной записи
tr: anonim kayıt alanı
zh_hans: 匿名记录字段
zh_hant: 匿名記錄欄位

# tcExceptionConstructorDoesNotHaveFieldWithGivenName
source: The exception '{0}' does not have a field named '{1}'.
cs: Výjimka {0} nemá žádné pole s názvem {1}.
de: Die Ausnahme "{0}" enthält kein Feld namens "{1}".
es: La excepción "{0}" no tiene un campo denominado "{1}".
fr: L'exception '{0}' n'a pas de champ nommé '{1}'.
it: L'eccezione '{0}' non include un campo denominato '{1}'.
ja: 例外 '{0}' には '{1}' という名前のフィールドはありません。
ko: '{0}' 예외에 '{1}'(이)라는 필드가 없습니다.
pl: Wyjątek „{0}” nie ma pola o nazwie „{1}”.
pt_br: A exceção '{0}' não tem um campo nomeado '{1}'.
ru: Исключение "{0}" не содержит поля с именем "{1}".
tr: '{0}' özel durumunun '{1}' adlı bir alanı yok.
zh_hans: 异常“{0}”没有名为“{1}”的字段。
zh_hant: 例外狀況 '{0}' 沒有名為 '{1}' 的欄位。

# tcActivePatternsDoNotHaveFields
source: Active patterns do not have fields. This syntax is invalid.
cs: Aktivní vzory nemají žádná pole. Tato syntaxe je neplatná.
de: Aktive Muster besitzen keine Felder. Diese Syntax ist ungültig.
es: Los patrones activos no tienen campos. Esta sintaxis no es válida.
fr: Les modèles actifs n'ont pas de champ. Cette syntaxe n'est pas valide.
it: Non esistono campi per i criteri attivi. Questa sintassi non è valida.
ja: アクティブなパターンにフィールドがありません。この構文は無効です。
ko: 활성 패턴에 필드가 없습니다. 이 구문은 유효하지 않습니다.
pl: Aktywne wzorce nie mają pól. Składnia jest nieprawidłowa.
pt_br: Padrões ativos não têm campos. Essa sintaxe é inválida.
ru: Активные шаблоны не имеют полей. Этот синтаксис является недопустимым.
tr: Etkin desenlerin alanı olmaz. Bu söz dizimi geçersiz.
zh_hans: 活动模式没有字段。此语法无效。
zh_hant: 使用中的模式沒有欄位。此語法無效。

# tcConstructorDoesNotHaveFieldWithGivenName
source: The constructor does not have a field named '{0}'.
cs: Konstruktor nemá žádné pole s názvem {0}.
de: Der Konstruktor hat kein Feld namens "{0}".
es: El constructor no tiene un campo denominado "{0}".
fr: Le constructeur n'a pas de champ nommé '{0}'.
it: Il costruttore non include un campo denominato '{0}'.
ja: コンストラクターには '{0}' という名前のフィールドはありません
ko: 생성자에 '{0}'(이)라는 필드가 없습니다.
pl: Konstruktor nie ma pola o nazwie „{0}”.
pt_br: O construtor não tem um campo nomeado '{0}'.
ru: Конструктор не содержит поля с именем '{0}'.
tr: Oluşturucunun '{0}' adlı bir alanı yok.
zh_hans: 构造函数没有名为“{0}”的字段。
zh_hant: 建構函式沒有名為 '{0}' 的欄位。

# tcAnonRecdCcuMismatch
source: Two anonymous record types are from different assemblies '{0}' and '{1}'
cs: Dva typy anonymních záznamů jsou z různých sestavení: {0} a {1}.
de: Zwei anonyme Datensatztypen stammen aus verschiedenen Assemblys: "{0}" und "{1}".
es: Dos tipos de registro anónimos provienen de diferentes ensamblados "{0}" y "{1}"
fr: Deux types d'enregistrement anonyme proviennent d'assemblys différents '{0}' et '{1}'
it: Due tipi di record anonimo provengono da assembly diversi, '{0}' e '{1}'
ja: 2 つの匿名レコードの種類は、'{0}' と '{1}' の異なるアセンブリからのものです
ko: 두 무명 레코드 형식은 서로 다른 어셈블리 '{0}' 및 '{1}'에서 가져왔습니다.
pl: Dwa typy rekordów anonimowych pochodzą z różnych zestawów: „{0}” i „{1}”
pt_br: Dois tipos de registro anônimos são de diferentes assemblies '{0}' e '{1}'
ru: Два типа анонимных записей принадлежат различным сборкам '{0}' и '{1}'
tr: İki anonim kayıt türü, birbirinden farklı olan '{0}' ve '{1}' derlemelerinden
zh_hans: 两个匿名记录类型来自不同的程序集“{0}”和“{1}”
zh_hant: 有兩個匿名的記錄類型來自不同的組件 '{0}' 和 '{1}'

# tcAnonRecdFieldNameMismatch
source: This anonymous record does not exactly match the expected shape. Add the missing fields {0} and remove the extra fields {1}.
cs: Tento anonymní záznam neodpovídá přesně očekávanému tvaru. Přidejte chybějící pole {0} a odeberte nadbytečná pole {1}.
de: Dieser anonyme Datensatz stimmt nicht genau mit der erwarteten Form überein. Fügen Sie die fehlenden Felder ({0}) hinzu, und entfernen Sie die zusätzlichen Felder ({1}).
es: Este registro anónimo no coincide exactamente con la forma esperada. Agregue los campos que faltan {0} y quite los campos adicionales {1}.
fr: Cet enregistrement anonyme ne correspond pas exactement à la forme attendue. Ajoutez les champs manquants {0} et supprimez les champs supplémentaires {1}.
it: Questo record anonimo non corrisponde esattamente alla forma prevista. Aggiungere i campi mancanti {0} e rimuovere i campi aggiuntivi {1}.
ja: この匿名レコードは、予期された形状と完全には一致していません。不足しているフィールド {0} を追加し、不要なフィールド {1} を削除してください。
ko: 이 익명 레코드는 필요한 도형과 정확하게 일치하지 않습니다. 누락된 필드 {0}을(를) 추가하고 추가 필드 {1}을(를) 제거하세요.
pl: Ten rekord anonimowy nie jest dokładnie zgodny z oczekiwanym kształtem. Dodaj brakujące pola {0} i usuń dodatkowe pola {1}.
pt_br: Este registro anônimo não corresponde exatamente à forma esperada. Adicione os campos ausentes {0} e remova os campos extras {1}.
ru: Эта анонимная запись не соответствует ожидаемой форме. Добавьте недостающие поля {0} и удалите лишние поля {1}.
tr: Bu anonim kayıt, beklenen şekille tam olarak eşleşmiyor. Eksik {0} alanlarını ekleyin ve ek {1} alanlarını kaldırın.
zh_hans: 此匿名记录与预期的形状不完全匹配。请添加缺少的字段 {0} 并删除额外的字段 {1}。
zh_hant: 此匿名記錄與預期的圖形未完全相符。請新增缺少的欄位 {0}，並移除額外的欄位 {1}。

# tcCannotCallExtensionMethodInrefToByref
source: Cannot call the byref extension method '{0}. The first parameter requires the value to be mutable or a non-readonly byref type.
cs: Nejde volat metodu rozšíření byref {0}. První parametr vyžaduje, aby hodnota byla měnitelná nebo typu byref, která není jen pro čtení.
de: Die ByRef-Erweiterungsmethode "{0}" kann nicht aufgerufen werden. Für den ersten Parameter muss der Wert änderbar sein oder einem nicht schreibgeschützten ByRef-Typ entsprechen.
es: No se puede llamar al método de extensión de byref "{0}". El primer parámetro requiere que el valor sea mutable o un tipo de byref que no sea de solo lectura.
fr: Impossible d’appeler la méthode d’extension byref « {0} ». Le premier paramètre nécessite que la valeur soit mutable ou un type byref autre qu'en lecture seule.
it: Non è possibile chiamare il metodo di estensione byref '{0}. Il valore del primo parametro deve essere modificabile oppure un tipo byref non di sola lettura.
ja: byref 拡張メソッド '{0} を呼び出すことはできません。最初のパラメーターでは、値を変更可能な byref 型または読み取り専用以外の byref 型にする必要があります。
ko: byref 확장 메서드 '{0}'을(를) 호출할 수 없습니다. 첫 번째 매개 변수는 변경할 수 있거나 읽기 전용이 아닌 byref 형식인 값이 필요합니다.
pl: Nie można wywołać metody rozszerzenia byref „{0}”. Pierwszy parametr wymaga, aby wartość była typem byref zmiennym lub innym niż tylko do odczytu.
pt_br: Não é possível chamar o método de extensão de byref '{0}. O primeiro parâmetro requer que o valor seja mutável ou não seja byref somente leitura.
ru: Не удается вызвать метод расширения byref "{0}". В качестве первого параметра необходимо указать изменяемое значение или значение типа byref, доступное не только для чтения.
tr: '{0}' byref genişletme metodu çağrılamıyor. İlk parametre, değerin değişebilir olmasını veya salt okunur olmayan bir byref türünde olmasını gerektiriyor.
zh_hans: 无法调用 byref 扩展方法 "{0}"。第一个参数要求该值是可变的或非只读的 byref 类型。
zh_hant: 無法呼叫 byref 擴充方法 '{0}。第一個參數需要值可變動，或為非唯讀 byref 類型。
