Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# buildMultipleToplevelModules
source: This file contains multiple declarations of the form 'module SomeNamespace.SomeModule'. Only one declaration of this form is permitted in a file. Change your file to use an initial namespace declaration and/or use 'module ModuleName = ...' to define your modules.
cs: Tento soubor obsahuje víc deklarací v podobě module SomeNamespace.SomeModule. V souboru se povoluje jenom jedna deklarace v této podobě. Upravte soubor tak, aby používal počáteční deklaraci oboru názvů, nebo použijte k definování modulů deklaraci v podobě module ModuleName = ...
de: Diese Datei enthält mehrere Deklarationen im Format "module SomeNamespace.SomeModule". Pro Datei ist nur eine Deklaration in diesem Format zulässig. Verwenden Sie eine Namespacedeklaration am Dateianfang und/oder "module ModuleName = ..." zur Definition der Module.
es: Este archivo contiene varias declaraciones con el formato 'module SomeNamespace.SomeModule'. Solo se permite una declaración con este formato en un archivo. Cambie el archivo para usar una declaración de espacio de nombres inicial o use 'module ModuleName = ...' para definir los módulos.
fr: Ce fichier contient plusieurs déclarations ayant la forme 'module SomeNamespace.SomeModule'. Seule une déclaration de cette forme est autorisée dans un fichier. Modifiez votre fichier pour utiliser une déclaration d'espace de noms initiale et/ou utilisez 'module ModuleName = ...' pour définir vos modules.
it: Il file contiene più dichiarazioni nel formato 'module SpazioNomi.Modulo'. In un file è consentita una sola dichiarazione di questo tipo. Modificare il file in modo che utilizzi una dichiarazione di spazio dei nomi iniziale e/o 'module NomeModulo = ...' per definire i moduli.
ja: このファイルには、'module SomeNamespace.SomeModule' という形式の宣言が複数含まれます。1 ファイル内で指定できるこの形式の宣言は 1 つのみです。最初の名前空間宣言を使用するようにファイルを変更するか、'module ModuleName = ...' を使用してモジュールを定義してください。
ko: 이 파일에는 'module SomeNamespace.SomeModule' 형식의 선언이 여러 개 포함되어 있습니다. 이러한 형식의 선언은 파일당 하나만 허용됩니다. 초기 네임스페이스 선언을 사용하도록 파일을 변경하거나 'module ModuleName = ...'을 사용하여 모듈을 정의하세요.
pl: Ten plik zawiera wiele deklaracji w postaci „module PrzestrzeńNazw.Moduł”. W pliku dozwolona jest tylko jedna deklaracja o takiej postaci. Zmień plik w celu użycia początkowej deklaracji przestrzeni nazw i/lub zastosuj konstrukcję „module NazwaModułu = ...” do zdefiniowania własnych modułów.
pt_br: Este arquivo possui declarações múltiplas da forma 'module SomeNamespace.SomeModule'. Apenas uma declaração deste forma é permitida no arquivo. Modifique seu arquivo para usar declaração de namespace inicial e/ou use 'module ModuleName = ...' para definir seus módulos.
ru: Этот файл содержит несколько объявлений вида "module SomeNamespace.SomeModule". В одном файле может присутствовать только одно объявление такого вида. Измените файл, объявив в нем исходное пространство имен или определив модули с помощью объявления "module ModuleName = ...".
tr: Bu dosya, 'module SomeNamespace.SomeModule' formunun birden çok bildirimini içeriyor. Bir dosyada, bu formun yalnızca bir bildirimine izin verilir. Dosyanızı başlangıç ad alanı bildirimi kullanacak şekilde değiştirin ve/veya modüllerinizi tanımlamak için 'module ModuleName = ...' kullanın.
zh_hans: 此文件包含形式为 "module SomeNamespace.SomeModule" 的多个声明。一个文件中只能有一个此形式的声明。将您的文件更改为使用初始命名空间声明并且/或者使用 "module ModuleName = ..." 定义模块。
zh_hant: 這個檔案包含 'module SomeNamespace.SomeModule' 形式的多個宣告。一個檔案只允許一個這種形式的宣告。請將檔案變更成使用初始命名空間宣告，和/或使用 'module ModuleName = ...' 來定義模組。

# buildOptionRequiresParameter
source: Option requires parameter: {0}
cs: Možnost vyžaduje parametr: {0}
de: Option erfordert einen Parameter: {0}
es: La opción requiere el parámetro: {0}.
fr: L'option requiert un paramètre : {0}
it: Parametro necessario per l'opzione: {0}
ja: オプションにパラメーターが必要です: {0}
ko: 옵션에 필요한 매개 변수: {0}
pl: Opcja wymaga parametru: {0}
pt_br: A opção requer o parâmetro: {0}
ru: Требуется параметр: {0}
tr: Seçenek şu parametreyi gerektiriyor: {0}
zh_hans: 选项需要参数: {0}
zh_hant: 選項需要參數: {0}

# buildCouldNotFindSourceFile
source: Source file '{0}' could not be found
cs: Zdrojový soubor {0} se nenašel.
de: Quelldatei "{0}" wurde nicht gefunden.
es: No se encuentra el archivo de código fuente '{0}'.
fr: Le fichier source '{0}' est introuvable
it: Il file di origine '{0}' non è stato trovato
ja: ソース ファイル '{0}' が見つかりませんでした
ko: 소스 파일 '{0}'을(를) 찾을 수 없습니다.
pl: Nie można znaleźć pliku źródłowego „{0}”
pt_br: O arquivo de origem '{0}' não pôde ser localizado
ru: Исходный файл "{0}" не найден
tr: Kaynak dosya '{0}' bulunamadı
zh_hans: 未能找到源文件“{0}”
zh_hant: 找不到原始程式檔 '{0}'

# buildInvalidSourceFileExtension
source: The file extension of '{0}' is not recognized. Source files must have extension .fs, .fsi, .fsx, .fsscript, .ml or .mli.
cs: Soubor {0} má nerozpoznanou příponu. Zdrojový soubor musí mít příponu .fs, .fsi, .fsx, .fsscript, .ml nebo .mli.
de: Die Dateierweiterung "{0}" wurde nicht erkannt. Quelldateien müssen die Erweiterung .fs, .fsi, .fsx, .fsscript, .ml oder .mli haben.
es: No se reconoce la extensión de archivo de '{0}'. Los archivos de código fuente deben tener la extensión .fs, .fsi, .fsx, .fsscript, .ml o .mli.
fr: L'extension de fichier de '{0}' n'est pas reconnue. Les fichiers sources doivent avoir l'extension .fs, .fsi, .fsx, .fsscript, .ml ou .mli.
it: Estensione di file di '{0}' non riconosciuta. I file di origine devono avere estensione .fs, .fsi, .fsx, .fsscript, .ml o .mli.
ja: '{0}' のファイル拡張子は認識されません。ソース ファイルの拡張子は .fs、.fsi、.fsx、.fsscript、.ml、または .mli にする必要があります。
ko: '{0}'의 파일 확장명을 인식할 수 없습니다. 소스 파일의 확장명은 .fs, .fsi, .fsx, .fsscript, .ml 또는 .mli여야 합니다.
pl: Rozszerzenie pliku „{0}” nie zostało rozpoznane. Pliki źródłowe muszą mieć rozszerzenie fs, fsi, fsx, fsscript, ml lub mli.
pt_br: A extensão de arquivo de '{0}' não é reconhecida. Arquivos de origem devem ter extensão .fs, .fsi, .fsx, .fsscript, .ml ou .mli.
ru: Нераспознанное расширение файла "{0}". Исходные файлы должны иметь расширения .fs, .fsi, .fsx, .fsscript, .ml или .mli.
tr: Dosya uzantısı '{0}' tanınmadı. Kaynak dosyaların uzantısı .fs, .fsi, .fsx, .fsscript, .ml veya .mli olmalıdır.
zh_hans: 无法识别“{0}”的文件扩展名。源文件的扩展名必须为 .fs、.fsi、.fsx、.fsscript、.ml 或 .mli。
zh_hant: 無法辨識 '{0}' 的副檔名。原始程式檔的副檔名必須是 .fs、.fsi、.fsx、.fsscript、.ml 或 .mli。

# buildCouldNotResolveAssembly
source: Could not resolve assembly '{0}'
cs: Sestavení {0} se nedalo přeložit.
de: Assembly "{0}" konnte nicht aufgelöst werden.
es: No se pudo resolver el ensamblado '{0}'.
fr: Impossible de résoudre l'assembly '{0}'
it: Non è stato possibile risolvere l'assembly '{0}'
ja: アセンブリ '{0}' を解決できませんでした
ko: '{0}' 어셈블리를 확인할 수 없습니다.
pl: Nie można rozpoznać zestawu „{0}”
pt_br: Não foi possível resolver o assembly '{0}'
ru: Не удалось разрешить сборку "{0}".
tr: '{0}' bütünleştirilmiş kodu çözümlenemedi
zh_hans: 无法解析程序集“{0}”
zh_hant: 無法解析組件 '{0}'

# buildCouldNotResolveAssemblyRequiredByFile
source: Could not resolve assembly '{0}' required by '{1}'
cs: Sestavení {0} požadované souborem {1} se nedalo přeložit.
de: Die für "{1}" erforderliche Assembly "{0}" konnte nicht aufgelöst werden.
es: No se pudo resolver el ensamblado '{0}' requerido por '{1}'.
fr: Impossible de résoudre l'assembly '{0}' requis par '{1}'
it: Non è stato possibile risolvere l'assembly '{0}' richiesto da '{1}'
ja: {1}' に必要なアセンブリ '{0}' を解決できませんでした
ko: {1}'에 필요한 '{0}' 어셈블리를 확인할 수 없습니다.
pl: Nie można rozpoznać zestawu „{0}” wymaganego przez „{1}”
pt_br: Não foi possível resolver o assembly '{0}' requerido por '{1}'
ru: Не удалось разрешить сборку "{0}", необходимую для "{1}"
tr: {1}' tarafından istenen '{0}' bütünleştirilmiş kodu çözümlenemedi
zh_hans: 无法解析“{1}”所需的程序集“{0}”
zh_hant: 無法解析 '{1}' 所需的組件 '{0}'

# buildErrorOpeningBinaryFile
source: Error opening binary file '{0}': {1}
cs: Chyba při otevírání binárního souboru {0}: {1}
de: Fehler beim Öffnen der Binärdatei "{0}": {1}
es: Error al abrir el archivo binario '{0}': {1}.
fr: Erreur lors de l'ouverture du fichier binaire '{0}' : {1}
it: Errore durante l'apertura del file binario '{0}': {1}
ja: バイナリ ファイル '{0}' を開くときにエラーが発生しました: {1}
ko: 이진 파일 '{0}'을(를) 여는 동안 오류가 발생했습니다. {1}
pl: Błąd podczas otwierania pliku binarnego „{0}”: {1}
pt_br: Erro ao abrir o arquivo binário '{0}': {1}
ru: Ошибка при открытии двоичного файла "{0}": {1}
tr: {0}': {1} ikili dosyasını açma işleminde hata
zh_hans: 打开二进制文件“{0}”时出错: {1}
zh_hant: 開啟二進位檔案 '{0}' 時發生錯誤: {1}

# buildDifferentVersionMustRecompile
source: The F#-compiled DLL '{0}' needs to be recompiled to be used with this version of F#
cs: Aby se knihovna DLL {0} zkompilovaná v F# dala použít v této verzi F#, musí se znovu zkompilovat.
de: Die kompilierte F#-DLL "{0}" muss erneut kompiliert werden, damit sie mit dieser Version von F# verwendet werden kann.
es: El archivo DLL '{0}' compilado por F# debe recompilarse para poder usarlo con esta versión de F#.
fr: La DLL compilée F# '{0}' doit être recompilée pour pouvoir être utilisée avec cette version de F#
it: È necessario ricompilare la DLL compilata in F# '{0}' per poterla utilizzare con questa versione di F#
ja: F# でコンパイルされたこの DLL '{0}' は、このバージョンの F# で使用するために再コンパイルする必要があります
ko: F# 컴파일 DLL '{0}'을(를) 이 버전의 F#에 사용하려면 다시 컴파일해야 합니다.
pl: Biblioteka DLL „{0}” skompilowana przy użyciu języka F# wymaga ponownego skompilowania, aby została użyta z tą wersją języka F#
pt_br: O DDL '{0}', que foi compilado por F#, precisa ser recompilado para ser usado com esta versão do F#
ru: Чтобы использовать библиотеку DLL "{0}", скомпилированную на языке F#, в этой версии F#, необходимо перекомпилировать ее
tr: F# ile derlenen '{0}' DLL dosyasının, F# dilinin bu sürümünde kullanılabilmesi için yeniden derlenmesi gerekiyor
zh_hans: 必须对 F# 编译的 DLL“{0}”进行重新编译，才能将其用于此版本的 F#
zh_hant: F# 編譯的 DLL '{0}' 必須重新編譯後，才能用於這個版本的 F#

# buildInvalidHashIDirective
source: Invalid directive. Expected '#I \"<path>\"'.
cs: Neplatná direktiva. Očekávalo se: #I \"<cesta>\".
de: Ungültige Anweisung. Erwartet wird: "#I \"<path>\".
es: Directiva no válida. Se esperaba "#I \"<path>\".
fr: Directive non valide. Attendu '#I \"<chemin>\"'.
it: Direttiva non valida. È previsto '#I \"<percorso>\"'.
ja: ディレクティブが無効です。'#I \"<path>\"' が必要でした。
ko: 지시문이 잘못되었습니다. '#I \"<path>\"'가 필요합니다.
pl: Nieprawidłowa dyrektywa. Oczekiwano dyrektywy „#I \"<ścieżka>\"”.
pt_br: Diretiva inválida. Esperado '#I \"<path>\"'.
ru: Недопустимая директива. Ожидается '#I \"<путь>\"'.
tr: Geçersiz yönerge. '#I \"<path>\"' bekleniyordu.
zh_hans: 指令无效。应为 #I \"<path>\"。
zh_hant: 指示詞無效。應為 '#I \"<path>\"'。

# buildInvalidHashrDirective
source: Invalid directive. Expected '#r \"<file-or-assembly>\"'.
cs: Neplatná direktiva. Očekávalo se #r \"<soubor-nebo-sestavení>\".
de: Ungültige Anweisung. Erwartet wird: "#r \"<file-or-assembly>\"".
es: Directiva no válida. Se esperaba "'#r \"<file-or-assembly>\"'.
fr: Directive non valide. Attendu '#r \"<fichier_ou_assembly>\"'.
it: Direttiva non valida. È previsto '#r \"<file-oppure-assembly>\"'.
ja: ディレクティブが無効です。'#r \"<file-or-assembly>\"' という形式で指定する必要があります。
ko: 지시문이 잘못되었습니다. '#r \"<file-or-assembly>\"'가 필요합니다.
pl: Nieprawidłowa dyrektywa. Oczekiwano dyrektywy „#r \"<plik-lub-zestaw>\"”.
pt_br: Diretiva inválida. Esperado '#r \"<file-or-assembly>\"'.
ru: Недопустимая директива. Ожидаемая директива: '#r \"<file-or-assembly>\"'.
tr: Geçersiz yönerge. '#r \"<file-or-assembly>\"' bekleniyordu.
zh_hans: 指令无效。应为 #r \"<file-or-assembly>\"。
zh_hant: 指示詞無效。應為 '#r \"<file-or-assembly>\"'。

# buildInvalidHashloadDirective
source: Invalid directive. Expected '#load \"<file>\" ... \"<file>\"'.
cs: Neplatná direktiva. Očekávalo se #load \"<soubor>\" ... \"<soubor>\"'.
de: Ungültige Anweisung. Erwartet wird: "#load \"<file>\" ... \"<file>\".
es: Directiva no válida. Se espera "#load \"<file>\" ... \"<file>\".
fr: Directive non valide. Attendu '#load \"<file>\" ... \"<file>\"'.
it: Direttiva non valida. È previsto '#load \"<file>\" ... \"<file>\"'.
ja: ディレクティブが無効です。'#load \"<file>\" ... \"<file>\"' が必要でした。
ko: 지시문이 잘못되었습니다. '#load \"<file>\" ... \"<file>\"'이 필요합니다.
pl: Nieprawidłowa dyrektywa. Oczekiwano dyrektywy „#load \"<plik>\" ... \"<plik>\"”.
pt_br: Diretiva inválida. Esperado '#load \"<file>\" ... \"<file>\"'.
ru: Недопустимая директива. Ожидаемая директива: '#load \"<файл>\" ... \"<файл>\"'.
tr: Geçersiz yönerge. '#load \"<file>\" ... \"<file>\"' bekleniyordu.
zh_hans: 指令无效。应为 #load \"<file>\" ... \"<file>\"。
zh_hant: 指示詞無效。應為 '#load \"<file>\" ... \"<file>\"'。

# buildInvalidHashtimeDirective
source: Invalid directive. Expected '#time', '#time \"on\"' or '#time \"off\"'.
cs: Neplatná direktiva. Očekávaná direktiva je #time, #time \"on\" nebo #time \"off\".
de: Ungültige Direktive. Erwartet wurde "#time", '#time \"on\"' oder '#time \"off\"'.
es: Directiva no válida. Se esperaba '#time', '#time \"on\"' o '#time \"off\"'.
fr: Directive non valide. '#time', '#time \"on\"' ou '#time \"off\"' attendu.
it: Direttiva non valida. Previsto '#time', '#time \"on\"' o '#time \"off\"'.
ja: ディレクティブが無効です。'#time'、'#time \"on\"'、または '#time \"off\"' という形式で指定する必要があります。
ko: 지시문이 잘못되었습니다. '#time', '#time \"on\"' 또는 '#time \"off\"'가 필요합니다.
pl: Nieprawidłowa dyrektywa. Oczekiwano „#time”, „#time \"on\"” lub „#time \"off\"”.
pt_br: Diretiva inválida. '#time', '#time \"on\"' ou '#time \"off\"' era esperado.
ru: Недопустимая директива. Требуется ''#time'', ''#time \"on\"'' или ''#time \"off\"''.
tr: Geçersiz yönerge. Beklenen: '#time', '#time \"on\"' veya '#time \"off\"'.
zh_hans: 指令无效。应为 '#time'、'#time \"on\"' 或 '#time \"off\"'。
zh_hant: 無效的指示詞。必須是 '#time'、'#time \"on\"' 或 '#time \"off\"'。

# buildDirectivesInModulesAreIgnored
source: Directives inside modules are ignored
cs: Direktivy uvnitř modulů se ignorují.
de: Direktiven innerhalb von Modulen werden ignoriert.
es: Las directivas dentro de módulos se omiten.
fr: Les directives contenues dans les modules sont ignorées
it: Le direttive all'interno dei moduli vengono ignorate
ja: モジュール内のディレクティブは無視されます
ko: 모듈 내의 지시문은 무시됩니다.
pl: Dyrektywy wewnątrz modułów są ignorowane
pt_br: Diretivas dentro de módulos são ignoradas
ru: Директивы внутри модулей пропущены
tr: Modül içi yönergeler yoksayılır
zh_hans: 模块中的指令被忽略
zh_hant: 已忽略模組內的指示詞

# buildSignatureAlreadySpecified
source: A signature for the file or module '{0}' has already been specified
cs: Signatura pro soubor nebo modul {0} už je zadaná.
de: Für Datei oder Modul "{0}" wurde bereits eine Signatur angegeben.
es: Ya se ha especificado una signatura para el archivo o módulo '{0}'.
fr: Une signature pour le fichier ou le module '{0}' a déjà été spécifiée
it: È già stata specificata una firma per il file o modulo '{0}'
ja: ファイルまたはモジュール '{0}' のシグネチャは指定済みです
ko: '{0}' 파일 또는 모듈의 시그니처가 이미 지정되었습니다.
pl: Sygnatura dla pliku lub modułu „{0}” została już określona
pt_br: A assinatura para o arquivo ou módulo '{0}' já tinha sido especificada
ru: Сигнатура файла или модуля "{0}" уже указана
tr: '{0}' dosyasının veya modülünün imzası zaten belirtilmiş
zh_hans: 已指定文件或模块“{0}”的签名
zh_hant: 已經指定檔案或模組 '{0}' 的簽章

# buildImplementationAlreadyGivenDetail
source: An implementation of file or module '{0}' has already been given. Compilation order is significant in F# because of type inference. You may need to adjust the order of your files to place the signature file before the implementation. In Visual Studio files are type-checked in the order they appear in the project file, which can be edited manually or adjusted using the solution explorer.
cs: Implementace souboru nebo modulu {0} už je zadaná. V F# záleží na pořadí kompilace, a to kvůli odvození typů proměnných. Pořadí souborů můžete upravit a podpisový soubor umístit před implementaci. V sadě Visual Studio se typ souborů kontroluje v tom pořadí, ve kterém se soubory objeví v souboru projektu, který se dá upravit ručně nebo pomocí Průzkumníka řešení.
de: Eine Implementierung der Datei oder des Moduls "{0}" wurde bereits angegeben. Die Kompilierungsreihenfolge ist in F# aufgrund des Typrückschlusses von Bedeutung. Möglicherweise müssen Sie die Reihenfolge der Dateien anpassen, um die Signaturdatei vor der Implementierung zu platzieren. In Visual Studio erfolgt die Typprüfung der Dateien in der Reihenfolge, in der sie in der Projektdatei aufgeführt sind; diese kann manuell bearbeitet oder im Projektmappen-Explorer angepasst werden.
es: Ya se ha proporcionado una implementación del archivo o módulo '{0}'. El orden de compilación es importante en F# debido a la inferencia de tipos. Puede ser necesario ajustar el orden de los archivos para poner el archivo de signatura antes de la implementación. En Visual Studio, el tipo de los archivos se comprueba en el orden en que aparecen en el archivo del proyecto, que se puede editar manualmente o ajustarse con el Explorador de soluciones.
fr: Une implémentation du fichier ou du module '{0}' a déjà été fournie. L'ordre de compilation est significatif en F# en raison de l'inférence de type. Vous pouvez modifier l'ordre de vos fichiers pour placer le fichier de signature avant l'implémentation. Dans Visual Studio, les fichiers font l'objet d'une vérification de type dans l'ordre où ils apparaissent dans le fichier projet, lequel peut être modifié manuellement ou à l'aide de l'Explorateur de solutions.
it: È già stata specificata un'implementazione del file o modulo '{0}'. In F# l'ordine di compilazione è significativo a causa dell'inferenza del tipo. Potrebbe essere necessario modificare l'ordine dei file per inserire il file di firma prima dell'implementazione. In Visual Studio il controllo del tipo viene eseguito nei file nell'ordine in cui questi ultimi sono inclusi nel file di progetto. Tale ordine può essere modificato manualmente oppure tramite Esplora soluzioni.
ja: ファイルまたはモジュール '{0}' の実装は指定済みです。型推論があるため、F# ではコンパイルの順序が重要です。必要に応じて、実装の前にシグネチャ ファイルを配置するよう、ファイルの順序を調整します。Visual Studio では、プロジェクト ファイル内の出現順にファイルが型チェックされます。プロジェクト ファイルは、手動で編集するか、ソリューション エクスプローラーを使用して調整することができます。
ko: '{0}' 파일 또는 모듈에 대한 구현이 이미 지정되었습니다. 형식 유추로 인해 F#에서는 컴파일 순서가 중요합니다. 구현하기 전에 시그니처 파일을 배치하기 위해 파일의 순서를 조정해야 할 수 있습니다. Visual Studio에서는 파일이 프로젝트 파일에 나타나는 순서대로 형식이 검사되며 이 순서는 수동으로 편집하거나 솔루션 탐색기를 사용하여 조정할 수 있습니다.
pl: Implementacja pliku lub modułu „{0}” została już podana. Kolejność kompilacji jest istotna w języku F# z powodu wnioskowania o typie. Może być wymagane dostosowanie kolejności plików w celu umieszczenia pliku sygnatury przed implementacją. W programie Visual Studio kontrola typów jest wykonywana dla plików w kolejności ich występowania w pliku projektu; kolejność ta może być edytowana ręcznie lub dostosowywana przy użyciu Eksploratora rozwiązań.
pt_br: Uma implementação de arquivo ou módulo '{0}' já foi fornecida. A ordem de compilação é significativa em F# devido à inferência de tipo. Talvez você precise ajustar a ordem dos arquivos para colocar o arquivo de assinatura antes da implementação. No Visual Studio, os arquivos são tipo verificado na ordem em que aparecem no arquivo de projeto, que pode ser editada manualmente ou ajustada por meio do gerenciador de soluções.
ru: Реализация файла или модуля "{0}" уже задана. В связи с использованием определения типа в F# имеет значение порядок компиляции. Перед выполнением реализации может потребоваться изменение порядка для размещения файла сигнатур. В среде Visual Studio файлы проверяются на типы в том порядке, в котором они отображаются в файле проекта, который можно изменить вручную или с помощью обозревателя решений.
tr: '{0}' dosyasını veya modülünü uygulama örneği zaten verildi. Tür çıkarımı nedeniyle F# dilinde derleme sırası önemlidir. Uygulamadan önce imza dosyasını yerleştirmek için dosyalarınızın sırasını ayarlamanız gerekebilir. Visual Studio'da dosyalar, el ile düzenlenebilen veya çözüm gezgini kullanılarak ayarlanabilen proje dosyasında göründükleri sırada türlerine göre denetlenir.
zh_hans: 已提供文件或模块“{0}”的实现。由于需要进行类型推理，因此编译顺序在 F# 中很重要。您可能需要调整文件的顺序，将签名文件放在实现之前。在 Visual Studio 中，将按照文件在项目文件中的显示顺序对这些文件执行类型检查，可以使用解决方案资源管理器手动编辑或调整此显示顺序。
zh_hant: 已經指定檔案或模組 '{0}' 的實作。因為類型推斷的關係，F# 中不同的編譯順序會有不同的結果。您必須調整檔案的順序，使簽章檔放在實作之前。在 Visual Studio 中，檔案會依照它們出現在專案檔中的順序進行類型檢查，這個順序可以用手動方式編輯，或使用方案總管調整。

# buildImplementationAlreadyGiven
source: An implementation of the file or module '{0}' has already been given
cs: Implementace souboru nebo modulu {0} už je zadaná.
de: Eine Implementierung der Datei oder des Moduls "{0}" wurde bereits angegeben.
es: Ya se ha proporcionado una implementación del archivo o módulo '{0}'.
fr: Une implémentation du fichier ou du module '{0}' a déjà été fournie
it: È già stata specificata un'implementazione del file o modulo '{0}'
ja: ファイルまたはモジュール '{0}' の実装は指定済みです
ko: '{0}' 파일 또는 모듈에 대한 구현이 이미 지정되었습니다.
pl: Implementacja pliku lub modułu „{0}” została już podana
pt_br: Uma implementação de arquivo ou módulo '{0}' já foi fornecida
ru: Реализация файла или модуля "{0}" уже задана
tr: '{0}' dosyasını veya modülünü uygulama örneği zaten verildi
zh_hans: 已提供文件或模块“{0}”的实现
zh_hant: 已經指定檔案或模組 '{0}' 的實作

# buildSignatureWithoutImplementation
source: The signature file '{0}' does not have a corresponding implementation file. If an implementation file exists then check the 'module' and 'namespace' declarations in the signature and implementation files match.
cs: Podpisový soubor {0} nemá odpovídající implementační soubor. Pokud implementační soubor existuje, zkontrolujte, jestli se deklarace module a namespace v podpisovém a implementačním souboru shodují.
de: Für die Signaturdatei "{0}" ist keine entsprechende Implementierungsdatei vorhanden. Falls eine Implementierungsdatei existiert, stellen Sie sicher, dass die module- und namespace-Deklarationen in der Signatur- und der Implementierungsdatei übereinstimmen.
es: El archivo de signatura '{0}' no tiene un archivo de implementación correspondiente. Si existe un archivo de implementación, compruebe que coinciden las declaraciones 'module' y 'namespace' de los archivos de signatura e implementación.
fr: Le fichier de signature '{0}' n'a pas de fichier d'implémentation correspondant. S'il existe un fichier d'implémentation, vérifiez que les déclarations 'module' et 'namespace' correspondent entre les fichiers de signature et d'implémentation.
it: Il file di firma '{0}' non dispone di un file di implementazione corrispondente. Se è disponibile un file di implementazione, verificare che le dichiarazioni 'module' e 'namespace' nei file di firma e di implementazione corrispondano.
ja: シグネチャ ファイル '{0}' に対応する実装ファイルがありません。実装ファイルが存在する場合、シグネチャ ファイルおよび実装ファイル内の 'module' 宣言や 'namespace' 宣言が一致することを確認してください。
ko: 시그니처 파일 '{0}'에 해당하는 구현 파일이 없습니다. 구현 파일이 있는 경우 시그니처 파일과 구현 파일의 'module' 및 'namespace' 선언이 일치하는지 확인하세요.
pl: Plik sygnatury „{0}” nie ma odpowiedniego pliku implementacji. Jeśli plik implementacji istnieje, sprawdź, czy istnieją zgodne deklaracje „module” i „namespace” w plikach sygnatury i implementacji.
pt_br: O arquivo de assinatura '{0}' não possui um arquivo de implementação correspondente. Se houver um arquivo de implementação, você deverá verificar as declarações de 'módulo' e 'namespace' na assinatura e a correspondência de arquivos de implementação.
ru: Отсутствует соответствующий файл реализации для файла сигнатур "{0}". Если файл реализации существует, убедитесь, что объявления "module" и "namespace" в файлах сигнатур и реализации совпадают.
tr: '{0}' imza dosyasında eşleşen bir uygulama dosyası yok. Bir uygulama dosyası varsa imza ve uygulama dosyalarındaki 'module' ve 'namespace' bildirimlerinin eşleştiğini kontrol edin.
zh_hans: 签名文件“{0}”没有相应的实现文件。如果存在实现文件，则检查签名文件和实现文件中的 "module" 和 "namespace" 声明是否匹配。
zh_hant: 簽章檔 '{0}' 沒有對應的實作檔。如果實作檔的確存在，請檢查簽章檔與實作檔中的 'module' 和 'namespace' 宣告是否相符。
