Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# chkProtectedOrBaseCalled
source: A protected member is called or 'base' is being used. This is only allowed in the direct implementation of members since they could escape their object scope.
cs: Volá se chráněný člen nebo se používá base. To je povolené jenom u přímé implementace členů, protože by se tak mohly dostat mimo definiční obor objektu.
de: Entweder wird ein geschützter Member aufgerufen oder "base" verwendet. Dies ist nur bei der direkten Implementierung von Membern zulässig, da diese ihren Objektbereich mit Escapevorgängen außer Kraft setzen könnten.
es: Se llama a un miembro protegido o se usa 'base'. Esto sólo se permite en la implementación directa de miembros, ya que podrían escaparse de su ámbito de objetos.
fr: Un membre protégé est appelé ou 'base' est utilisé. Cela n'est autorisé que dans l'implémentation directe des membres, car ils peuvent sortir de la portée de leurs objets.
it: È presente una chiamata a un membro protetto oppure viene usata la parola chiave 'base'. Ciò è consentito solo nell'implementazione diretta di membri perché questi ultimi potrebbero uscire dal relativo ambito di oggetto.
ja: プロテクト メンバーが呼び出されたか、'base' が使用されています。この操作が許可されているのはメンバーの直接実装の場合のみです。直接実装ではオブジェクトのスコープを回避できます。
ko: 보호된 멤버가 호출되었거나 'base'가 사용되고 있습니다. 이는 멤버를 직접 구현할 경우에만 허용됩니다. 이 경우 멤버가 개체 범위를 벗어날 수 있습니다.
pl: Wywołano chroniony element członkowski lub używane jest słowo kluczowe „base”. Jest to dozwolone tylko w bezpośredniej implementacji elementów członkowskich, ponieważ mogą one wykraczać poza swój zakres obiektu
pt_br: Um membro protegido é chamado ou a 'base' está sendo usada. Isso só é permitido na implementação direta dos membros, uma vez que eles poderiam escapar do escopo de seus objetos.
ru: Вызывается защищенный элемент, или используется класс "base". Это допускается только в прямых реализациях элементов, поскольку при этом возможен выход за пределы области видимости объекта.
tr: Korunan bir üye çağrıldı veya 'base' kullanılıyor. Üyeler nesne kapsamlarını kaçırabildikleri için buna yalnızca üyeler doğrudan uygulandığında izin verilir.
zh_hans: 调用了受保护的成员或正在使用 "base"。只能在对成员的直接实现中这样做，因为它们可能会超出其对象范围。
zh_hant: 呼叫受保護的成員，或使用 'base'。只有在成員的直接實作中才允許這種作法，因為它們可能會逸出其物件範圍。

# chkByrefUsedInInvalidWay
source: The byref-typed variable '{0}' is used in an invalid way. Byrefs cannot be captured by closures or passed to inner functions.
cs: Proměnná {0} typu ByRef se používá neplatným způsobem. Proměnné typu ByRef nejde zachytávat ukončením nebo předávat vnitřní funkci.
de: Die Verwendung der Variablen "{0}" vom Typ "byref" ist ungültig. Byrefs können nicht von Abschlüssen erfasst oder an innere Funktionen übergeben werden.
es: La variable "{0}" de tipo byref se usa de una forma no válida. Los tipos byref no pueden ser capturados por clausuras ni pasados a funciones internas.
fr: La variable typée byref '{0}' est utilisée de manière incorrecte. Impossible de capturer les types byref par des fermetures ou de les passer à des fonctions internes.
it: La variabile di tipo byref '{0}' è utilizzata in modo non valido. Le variabili di tipo byref non possono essere acquisite dalle chiusure o passate a funzioni interne.
ja: byref 型の変数 '{0}' の使用方法に誤りがあります。byref をクロージャでキャプチャすること、または内部関数に渡すことはできません。
ko: byref 형식의 변수 '{0}'이(가) 잘못된 방식으로 사용되었습니다. byref는 클로저로 캡처하거나 내부 함수로 전달할 수 없습니다.
pl: Zmienna z podanym typem byref „{0}” jest używana w nieprawidłowy sposób. Tego typu zmienne nie mogą być przechwytywane przez zamknięcia lub przekazywane do funkcji wewnętrznych.
pt_br: A variável do tipo byref '{0}' é usada de forma inválida. Byrefs não podem ser capturados por fechamentos ou transmitidos para funções de interiores.
ru: Недопустимый способ использования переменной "{0}" типа byref. Переменные типа byref нельзя зафиксировать с помощью замкнутых выражений или передать во внутренние функции.
tr: Byref olarak belirtilmiş '{0}' değişkeni geçersiz bir biçimde kullanılmış. Byref değerleri, kapanışlar ile yakalanamaz veya iç işlevlere geçirilemez.
zh_hans: byref 类型化变量“{0}”的使用方式无效。不能由闭包来捕获 Byref，也不能将其传递给内部函数。
zh_hant: ByRef 類型變數 '{0}' 的使用方式無效。ByRef 無法由關閉擷取或傳遞到內部函式。

# chkBaseUsedInInvalidWay
source: The 'base' keyword is used in an invalid way. Base calls cannot be used in closures. Consider using a private member to make base calls.
cs: Klíčové slovo base je použité neplatným způsobem. Volání base se u ukončení použít nedají. K volání base se dá použít privátní člen.
de: Die Verwendung des Schlüsselworts "base" ist ungültig. Base-Aufrufe können nicht in Abschlüssen verwendet werden. Verwenden Sie einen privaten Member für base-Aufrufe.
es: La palabra clave 'base' se usa de forma no válida. No se pueden usar llamadas base en clausuras. Considere el uso de un miembro privado para realizar llamadas base.
fr: Le mot clé 'base' est utilisé de manière incorrecte. Impossible d'utiliser les appels de base dans les fermetures. Utilisez un membre privé pour effectuer les appels de base.
it: La parola chiave 'base' è usata in modo non valido. Le chiamate di base non possono essere usate nelle chiusure. Provare a usare un membro privato per effettuare le chiamate di base.
ja: 'base' キーワードの使用方法に誤りがあります。'base' の呼び出しはクロージャに使用できません。'base' の呼び出しを行うには、プライベート メンバーを使用してください。
ko: 'base' 키워드가 잘못된 방식으로 사용되었습니다. 기본 호출은 클로저에 사용할 수 없습니다. 전용 멤버를 사용하여 기본 호출을 수행하세요.
pl: Słowo kluczowe „base” jest używane w nieprawidłowy sposób. Wywołania elementów podstawowych nie mogą być używane w zamknięciach. Rozważ użycie prywatnego elementu członkowskiego na potrzeby wywołań elementów podstawowych.
pt_br: A palavra-chave 'base' é usada de forma incorreta. Chamadas de base não podem ser usadas em fechamentos. Considere utilizar um membro particular para fazer chamadas de base.
ru: Недопустимый способ использования ключевого слова "base". Вызовы базового (base) класса не могут использоваться в замкнутых выражениях. Для вызовов базового класса рекомендуется использовать закрытый элемент.
tr: 'Base' anahtar sözcüğü geçersiz bir biçimde kullanılmış. Base çağrıları kapanışlarda kullanılamaz. Base çağrıları yapmak için özel üye kullanmayı düşünün.
zh_hans: "base" 关键字的使用方式无效。在闭包中不能使用 base 调用。请考虑使用私有成员进行 base 调用。
zh_hant: 'base' 關鍵字的使用方式無效。基本呼叫不能用在關閉中。請考慮使用私用成員來執行基本呼叫。

# chkVariableUsedInInvalidWay
source: The variable '{0}' is used in an invalid way
cs: Proměnná {0} je použitá neplatným způsobem.
de: Die Verwendung der Variablen "{0}" ist ungültig.
es: La variable '{0}' se usa de una forma no válida.
fr: La variable '{0}' est utilisée de manière incorrecte
it: La variabile '{0}' è usata in modo non valido
ja: 変数 '{0}' の使用方法に誤りがあります
ko: '{0}' 변수가 잘못된 방식으로 사용되었습니다.
pl: Zmienna „{0}” jest używana w nieprawidłowy sposób
pt_br: A variável '{0}' é usada de forma incorreta
ru: Недопустимый способ использования переменной "{0}"
tr: '{0}' değişkeni geçersiz bir biçimde kullanılmış
zh_hans: 变量“{0}”的使用方式无效
zh_hant: 變數 '{0}' 的使用方式無效

# chkTypeLessAccessibleThanType
source: The type '{0}' is less accessible than the value, member or type '{1}' it is used in.
cs: Typ {0} je méně dostupný než hodnota, člen nebo typ {1}, ve kterém se používá.
de: Der Typ "{0}" ist weniger zugreifbar als der Wert, Member oder Typ "{1}", in dem er verwendet wird.
es: El tipo '{0}' es menos accesible que el valor, miembro o tipo '{1}' en el que se usa.
fr: Le type '{0}' est moins accessible que la valeur, le membre ou le type '{1}' dans lequel il est utilisé.
it: Il tipo '{0}' è meno accessibile del valore, del membro o del tipo '{1}' in cui viene usato.
ja: 型 '{0}' は、使用されている値、メンバー、型 '{1}' よりもアクセシビリティが低く設定されています。
ko: {0}' 형식은 사용되는 '{1}' 값, 멤버 또는 형식보다 액세스하기 어렵습니다.
pl: Typ „{0}” jest mniej dostępny niż wartość, element członkowski lub typ „{1}”, w którym jest używany.
pt_br: O tipo '{0}' é menos acessível que o valor, membro ou tipo '{1}' no qual ele é usado.
ru: Тип "{0}" является менее доступным, чем значение, элемент или тип "{1}", в которых он используется.
tr: {0}' türünün erişilebilirliği, içinde kullanıldığı değer, üye veya '{1}' türünden daha düşük düzeyde.
zh_hans: 类型“{0}”的可访问性低于其所用于的值、成员或类型“{1}”。
zh_hant: 類型 '{0}' 比使用這個類型的值、成員或類型 '{1}' 更不容易存取。

# chkSystemVoidOnlyInTypeof
source: 'System.Void' can only be used as 'typeof<System.Void>' in F#
cs: System.Void se dá v F# použít jenom jako typeof<System.Void>.
de: "System.Void" kann in F# nur als "typeof<System.Void>" verwendet werden.
es: "System.Void" solo puede utilizarse como "'typeof<System.Void>" en F#
fr: 'System.Void' peut uniquement être utilisé sous la forme 'typeof<System.Void>' dans F#
it: 'System.Void' può essere usato solo come 'typeof<System.Void>' in F#
ja: F# では 'System.Void' は 'typeof<System.Void>' としてのみ使用できます
ko: 'System.Void'는 F#에서 'typeof<System.Void>'로만 사용할 수 있습니다.
pl: Typ „System.Void” może być używany w języku F# tylko w postaci „typeof<System.Void>”
pt_br: 'System.Void' só pode ser usado como 'typeof<System.Void>' em F#
ru: 'System.Void' может использоваться только как 'typeof<System.Void>' в F#
tr: F# dilinde 'System.Void' yalnızca 'typeof<System.Void>' olarak kullanılabilir
zh_hans: "System.Void" 只能在 F# 中用作 "typeof<System.Void>"
zh_hant: 'System.Void' 在 F# 中只能用作 'typeof<System.Void>'

# chkErrorUseOfByref
source: A type instantiation involves a byref type. This is not permitted by the rules of Common IL.
cs: Vytvoření instance typu zahrnuje typ ByRef. To ale pravidla Common IL nepovolují.
de: Eine Typinstanziierung enthält einen byref-Typ. Dies ist nach den Regeln der Common IL nicht zulässig.
es: La creación de una instancia de un tipo implica un tipo byref. Las reglas de Common IL no permiten esto.
fr: Une instanciation de type implique un type byref. Cela n'est pas autorisé par les règles du langage CIL (Common Intermediate Language).
it: La creazione dell'istanza di un tipo prevede un tipo byref. Ciò non è consentito dalle regole di IL comune.
ja: 型のインスタンス化に byref 型が使用されています。この操作は Common IL の規則では許可されていません。
ko: 형식 인스턴스에 byref 형식이 포함되어 있습니다. 이는 공통 IL의 규칙에서 허용되지 않습니다.
pl: Tworzenie wystąpienia typu obejmuje typ byref. Nie jest to dozwolone przez reguły języka Common IL.
pt_br: Uma instanciação de tipo inclui um tipo de byref. Isto não é permitido pelas regras do IL Comum.
ru: Создание экземпляра типа с использованием типа byref. В правилах общего промежуточного языка это не допускается.
tr: Tür örnek oluşturma işlemi byref türünü içerir. Ortak Ara Dil (CIL) kurallarında buna izin verilmez.
zh_hans: 某个类型实例化涉及 byref 类型。通用 IL 的规则不允许这样做。
zh_hant: 類型具現化涉及 ByRef 類型。這是 Common IL 的規則所不允許的作法。

# chkErrorContainsCallToRethrow
source: Calls to 'reraise' may only occur directly in a handler of a try-with
cs: Volání reraise se může vyskytovat jenom přímo v obslužné rutině try-with.
de: Aufrufe von "reraise" dürfen nicht direkt in einem Handler für "try-with" auftreten.
es: Las llamadas a 'reraise' se pueden realizar solo directamente en un controlador de un bloque try-with.
fr: Les appels à 'reraise' ne peuvent se produire directement que dans un gestionnaire de try-with
it: Le chiamate a 'reraise' possono essere presenti solo direttamente all'interno di un gestore di un'espressione try-with
ja: 'reraise' への呼び出しを直接実行できるのは、try-with ハンドラーの中のみです。
ko: 'reraise'에 대한 호출은 try-with의 처리기 내에서 직접 발생할 수만 있습니다.
pl: Wywołania „reraise” mogą występować tylko bezpośrednio w procedurze obsługi instrukcji try-with
pt_br: Chamadas para 'reraise' só podem ocorrer diretamente em um manipulador de um try-with
ru: Вызовы "reraise" могут выполняться только непосредственно из обработчика блока try-with
tr: 'Reraise' çağrıları yalnızca doğrudan try-with ifadesinin işleyicisinde oluşabilir
zh_hans: 只可以在 try-with 的处理程序中直接调用 "reraise"
zh_hant: 呼叫 'reraise' 只能直接發生在 try-with 的處理常式中

# chkSplicingOnlyInQuotations
source: Expression-splicing operators may only be used within quotations
cs: Operátory spojení výrazů je možné použít jenom uvnitř citace.
de: Splice-Operatoren für Ausdrücke dürfen nur in Anführungszeichen verwendet werden.
es: Los operadores de inserción de expresión se pueden usar solo en expresiones de código delimitadas.
fr: Les opérateurs d'ajout d'expressions ne peuvent être utilisés qu'entre des quotations
it: Gli operatori di splicing delle espressioni possono essere utilizzati solo in quotation
ja: 式スプライス演算子は引用符で囲む必要があります
ko: expression-splicing 연산자는 인용구 내에서만 사용할 수 있습니다.
pl: Operatory łączenia wyrażenia mogą być używane tylko w cudzysłowach
pt_br: Operadores da união de expressão só podem ser usados entre aspas
ru: Операторы expression-splicing можно использовать только в кавычках
tr: İfade ekleme işleçleri yalnızca tırnak içinde kullanılabilir
zh_hans: 表达式拼接运算符只能在引号内使用
zh_hant: 運算式接合運算子只能用在引號內

# chkNoFirstClassSplicing
source: First-class uses of the expression-splicing operator are not permitted
cs: Použití operátoru spojení výrazů se u první třídy nepovoluje.
de: Die Verwendung des expression-splicing-Operators in der ersten Klasse ist nicht zulässig.
es: No se permiten usos de primera clase del operador de inserción de expresión.
fr: Les utilisations de première classe de l'opérateur d'ajout d'expression ne sont pas autorisées
it: Utilizzi di prima classe dell'operatore di splicing delle espressioni non consentiti
ja: 式スプライス演算子のファーストクラスの使用は許可されていません
ko: expression-splicing 연산자의 첫 번째 클래스 사용은 허용되지 않습니다.
pl: Pierwszoklasowe użycia operatora łączenia wyrażenia są niedozwolone
pt_br: Não são permitidos usos de primeira classe do operador da união de expressão
ru: Использование операторов expression-splicing в первом классе не допускается
tr: İfade ekleme işlecinin birinci sınıf kullanımlarına izin verilmiyor
zh_hans: 不允许优先使用表达式拼接运算符
zh_hant: 不允許運算式接合運算子的第一級用法

# chkNoFirstClassAddressOf
source: First-class uses of the address-of operators are not permitted
cs: Použití operátorů address-of jako výrazů první třídy není povolené.
de: Die Verwendung der address-of-Operatoren in der ersten Klasse ist nicht zulässig.
es: No se permiten usos de primera clase de operadores address-of.
fr: Les utilisations de première classe d'opérateurs d'adresses ne sont pas autorisées
it: Utilizzi di prima classe di operatori address-of non consentiti
ja: アドレス演算子のファーストクラスの使用は許可されていません
ko: address-of 연산자의 첫 번째 클래스 사용은 허용되지 않습니다.
pl: Pierwszoklasowe użycia operatorów adresu są niedozwolone
pt_br: Utilizações de primeira classe dos operadores de endereço não são permitidas
ru: Использование операторов address-of в первом классе не допускается
tr: Address-of işleçlerinin birinci sınıf kullanımlarına izin verilmiyor
zh_hans: 不允许优先使用 address-of 运算符
zh_hant: 不允許傳址運算子的第一級用法

# chkNoFirstClassRethrow
source: First-class uses of the 'reraise' function is not permitted
cs: Použití funkce reraise jako výrazu první třídy není povolené.
de: Die Verwendung der reraise-Funktion in der ersten Klasse ist nicht zulässig.
es: No se permiten usos de primera clase de la función 'reraise'.
fr: Les utilisations de première classe de la fonction 'reraise' ne sont pas autorisées
it: Utilizzi di prima classe della funzione 'reraise' non consentiti
ja: 'reraise' 関数のファーストクラスの使用は許可されていません
ko: 'reraise' 함수의 첫 번째 클래스 사용은 허용되지 않습니다.
pl: Pierwszoklasowe użycia funkcji „reraise” są niedozwolone
pt_br: Não são permitidos usos de primeira classe da função 'reraise'
ru: Использование функции "reraise" в первом классе не допускается
tr: 'reraise' işlevinin birinci sınıf kullanımlarına izin verilmiyor
zh_hans: 不允许优先使用 "reraise" 函数
zh_hant: 不允許 'reraise' 函式的第一級用法

# chkNoByrefAtThisPoint
source: The byref typed value '{0}' cannot be used at this point
cs: Hodnota typu ByRef {0} se na tomto místě použít nedá.
de: Der Wert "{0}" vom Typ "byref" kann an diesem Punkt nicht verwendet werden.
es: El valor '{0}' de tipo byref no se puede usar en este punto.
fr: Impossible d'utiliser la valeur typée byref '{0}' actuellement
it: Non è possibile usare il valore di tipo byref '{0}' in questo punto
ja: この時点で byref 型の値 '{0}' は使用できません
ko: byref 형식의 값 '{0}'을(를) 현재 사용할 수 없습니다.
pl: Wartość z podanym typem byref „{0}” nie może być używana w tym momencie
pt_br: O valor do tipo byref '{0}' não pode ser usado neste ponto
ru: В этой точке нельзя использовать значение типа byref "{0}"
tr: Türü byref olarak belirtilmiş '{0}' değeri bu noktada kullanılamaz
zh_hans: 此时无法使用 byref 类型化值“{0}”
zh_hant: 目前無法使用 ByRef 類型的值 '{0}'

# chkLimitationsOfBaseKeyword
source: 'base' values may only be used to make direct calls to the base implementations of overridden members
cs: Hodnoty base se dají použít jenom k přímému volání implementací base přepsaných členů.
de: base-Werte dürfen nur für direkte Aufrufe der Basisimplementierungen von überschriebenen Membern verwendet werden.
es: Los valores 'base' se pueden usar solo para realizar llamadas directas a las implementaciones base de miembros invalidados.
fr: Les valeurs 'base' ne peuvent être utilisées que pour effectuer des appels directs aux implémentations de base des membres substitués
it: I valori 'base' possono essere utilizzati esclusivamente per effettuare chiamate dirette alle implementazioni di base dei membri sottoposti a override
ja: 'base' 値を使用できるのは、オーバーライドされたメンバーの基本実装に対して直接呼び出しを行う場合のみです。
ko: 'base' 값은 재정의된 멤버의 기본 구현에 대한 직접 호출을 수행하는 데에만 사용할 수 있습니다.
pl: Wartości „base” mogą być używane tylko w celu bezpośrednich wywołań, które dotyczą podstawowych implementacji przesłoniętych elementów członkowskich
pt_br: Valores 'base' só podem ser usados para fazer chamadas diretas às implementações de base de membros substituídos
ru: Значения "base" можно использовать только для выполнения прямых вызовов реализаций класса base для переопределенных элементов
tr: 'base' değerleri yalnızca geçersiz kılınmış üyelerin taban uygulamalarına doğrudan çağrı yapmak için kullanılabilir
zh_hans: "base" 值只能用于直接调用重写成员的基实现
zh_hant: 'base' 值只能用來直接呼叫覆寫成員的基底實作

# chkObjCtorsCantUseExceptionHandling
source: Object constructors cannot directly use try/with and try/finally prior to the initialization of the object. This includes constructs such as 'for x in ...' that may elaborate to uses of these constructs. This is a limitation imposed by Common IL.
cs: Konstruktory objektu nemůžou použít try/with a try/finally přímo, dokud se objekt neinicializuje. To zahrnuje i konstrukce, jako je třeba for x in ..., které se dají na použití těchto konstruktorů rozpracovat. Toto je omezení mezijazyka Common IL.
de: Objektkonstruktoren dürfen "try/with" und "try/finally" vor der Initialisierung des Objekts nicht direkt verwenden. Dies umfasst Konstrukte wie "for x in ...", bei denen diese Konstrukte u.U. verwendet werden. Dies ist eine Einschränkung der Common IL.
es: Los constructores de objetos no pueden usar directamente try/with y try/finally antes de la inicialización del objeto. Esto incluye constructores como 'for x in ...' que pueden dar lugar a usos de estos constructores. Esta es una limitación impuesta por Common IL.
fr: Les constructeurs d'objets ne peuvent pas utiliser directement try/with et try/finally avant l'initialisation de l'objet. Cela inclut les constructions telles que 'for x in ...' qui peuvent conduire aux utilisations de ces constructions. Il s'agit d'une limitation imposée par le langage CIL (Common Intermediate Language).
it: I costruttori di oggetti non possono utilizzare direttamente try/with e try/finally prima dell'inizializzazione dell'oggetto. Ciò include costrutti quali 'for x in ...' che potrebbero essere elaborati negli utilizzi di tali costrutti. Si tratta di una limitazione imposta dall'IL comune.
ja: オブジェクト コンストラクターでは、オブジェクトの初期化前に try/with および try/finally を直接使用できません。'for x in ...' などのコストラクトを呼び出す可能性があるようなコンストラクトがこれに含まれます。これは Common IL での制限事項です。
ko: 개체 생성자는 개체 초기화 전에 try/with 및 try/finally를 직접 사용할 수 없습니다. 여기에는 이러한 구문의 사용을 자세히 설명할 수 있는 'for x in ...'과 같은 구문이 포함됩니다. 이는 공통 IL의 제한입니다.
pl: Konstruktory obiektów nie mogą bezpośrednio używać instrukcji try/with i try/finally przed zainicjowaniem obiektu. Obejmuje to takie konstrukcje, jak „for x in ...”, które mogą skutkować użyciem takich konstrukcji. Jest to ograniczenie nałożone przez język Common IL.
pt_br: Construtores de objeto não podem usar try/with nem try/finally antes da inicialização do objeto. O que inclui construções como ' x in... ' que podem elaborar usos dessas construções. Esta é uma limitação imposta pelo IL Comum.
ru: В конструкторе объекта нельзя прямо использовать блоки try/with и try/finally до инициализации объекта. К таким вариантам использования также относятся и конструкции вида "for x in ...", применение которых может привести к использованию указанных конструкций. Это ограничение связано с требованиями общего промежуточного языка.
tr: Nesne oluşturucular, nesnenin başlatılmasından önce try/with ve try/finally ifadelerini doğrudan kullanamazlar. Buna bu yapıların kullanımını çeşitlendirebilen 'for x in ...' gibi yapılar da dahildir. Bu, Ortak Ara Dilin getirdiği bir kısıtlamadır.
zh_hans: 在初始化对象之前，对象构造函数不能直接使用 try/with 和 try/finally。这包括像 "for x in ..." 这样详细说明其构造使用方式的构造。这是由通用 IL 设定的限制。
zh_hant: 物件建構函式不能在物件初始化之前直接使用 try/with 和 try/finally。這包括 'for x in ...' 這類可以詳述這些建構用途的建構函式。這是 Common IL 的限制。

# chkNoAddressOfAtThisPoint
source: The address of the variable '{0}' cannot be used at this point
cs: Adresa proměnné {0} se na tomto místě použít nedá.
de: Die Adresse der Variablen "{0}" kann an diesem Punkt nicht verwendet werden.
es: La dirección de la variable '{0}' no se puede usar en este punto.
fr: Impossible d'utiliser l'adresse de la variable '{0}' actuellement
it: Non è possibile usare l'indirizzo della variabile '{0}' in questo punto
ja: この時点で変数 '{0}' のアドレスは使用できません
ko: '{0}' 변수의 주소를 현재 사용할 수 없습니다.
pl: Nie można użyć adresu zmiennej „{0}” w tym momencie
pt_br: O endereço da variável '{0}' não pode ser usado neste ponto
ru: В этой точке нельзя использовать адрес переменной "{0}"
tr: '{0}' değişkeninin adresi bu noktada kullanılamaz
zh_hans: 此时无法使用变量“{0}”的地址
zh_hant: 目前無法使用變數 '{0}' 的位址

# chkNoAddressStaticFieldAtThisPoint
source: The address of the static field '{0}' cannot be used at this point
cs: Adresa statického pole {0} se na tomto místě použít nedá.
de: Die Adresse des statischen Felds "{0}" kann an diesem Punkt nicht verwendet werden.
es: La dirección del campo estático '{0}' no se puede usar en este punto.
fr: Impossible d'utiliser l'adresse du champ statique '{0}' actuellement
it: Non è possibile usare l'indirizzo del campo statico '{0}' in questo punto
ja: この時点で静的フィールド '{0}' のアドレスは使用できません
ko: 정적 필드 '{0}'의 주소를 현재 사용할 수 없습니다.
pl: Nie można użyć adresu pola statycznego „{0}” w tym momencie
pt_br: O endereço do campo estático '{0}' não pode ser usado neste ponto
ru: В этой точке нельзя использовать адрес статического поля "{0}"
tr: '{0}' statik alanının adresi bu noktada kullanılamaz
zh_hans: 此时无法使用静态字段“{0}”的地址
zh_hant: 目前無法使用靜態欄位 '{0}' 的位址

# chkNoAddressFieldAtThisPoint
source: The address of the field '{0}' cannot be used at this point
cs: Adresa pole {0} se na tomto místě použít nedá.
de: Die Adresse des Felds "{0}" kann an diesem Punkt nicht verwendet werden.
es: La dirección del campo '{0}' no se puede usar en este punto.
fr: Impossible d'utiliser l'adresse du champ '{0}' actuellement
it: Non è possibile usare l'indirizzo del campo '{0}' in questo punto
ja: この時点でフィールド '{0}' のアドレスは使用できません
ko: '{0}' 필드의 주소를 현재 사용할 수 없습니다.
pl: Adres pola „{0}” nie może być używany w tym momencie
pt_br: O endereço do campo '{0}' não pode ser usado neste ponto
ru: В этой точке нельзя использовать адрес поля "{0}"
tr: '{0}' alanının adresi bu noktada kullanılamaz
zh_hans: 此时无法使用字段“{0}”的地址
zh_hant: 目前無法使用欄位 '{0}' 的位址
