Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ValueNotContainedMutabilityExtensionsDiffer
source: Module '{0}' contains\n {1} \nbut its signature specifies\n {2} \nOne is an extension member and the other is not
cs: Modul {0} obsahuje hodnotu\n {1}, \nale jeho signatura definuje hodnotu\n {2}. \nJedna je členem rozšíření a druhá ne.
de: Das Modul "{0}" enthält\n {1} \nDie Signatur gibt aber Folgendes an:\n {2} \nEine Angabe ist ein Erweiterungsmember, die andere nicht.
es: El módulo '{0}' contiene\n {1} \npero su signatura especifica\n {2} \nUno es un miembro de extensión y el otro no.
fr: Le module '{0}' contient\n {1} \nmais sa signature spécifie\n {2} \nL'un est un membre d'extension mais pas l'autre
it: Il modulo '{0}' contiene\n {1} \ntuttavia la relativa firma specifica\n {2} \nUno è un membro di estensione, l'altro no
ja: モジュール '{0}' には\n {1} \nが含まれますが、シグネチャには\n {2} \nを指定しています。一方は拡張メンバーですが、もう一方は違います。
ko: {0}' 모듈에\n {1}이(가) 포함되어 있지만 \n해당 시그니처는\n {2}을(를) 지정합니다. \n하나는 확장 멤버이고 다른 하나는 그렇지 않습니다.
pl: Moduł „{0}” zawiera element\n {1}, \nale jego sygnatura określa element\n {2} \nJeden element jest elementem członkowskim rozszerzenia, a drugi nie
pt_br: O módulo '{0}' contém\n {1} \n, mas sua assinatura especifica\n {2} \nUm é membro de extensão e o outro não
ru: Модуль "{0}" содержит\n {1} \nоднако его сигнатура задает\n {2} \nОдин является элементом расширения, другой - нет
tr: {0}' modülü\n {1} \niçeriyor ancak imzasında\n {2} \nbelirtiliyor. Biri uzantı üyesi, diğeri değil
zh_hans: 模块“{0}”包含\n {1} \n而其签名指定\n {2} \n一个是扩展成员，另一个不是扩展成员
zh_hant: 模組 '{0}' 包含\n {1} \n但它的簽章卻指定\n {2} \n其中一個是擴充成員，另一個卻不是

# ValueNotContainedMutabilityArityNotInferred
source: Module '{0}' contains\n {1} \nbut its signature specifies\n {2} \nAn arity was not inferred for this value
cs: Modul {0} obsahuje hodnotu\n {1}, \nale jeho signatura definuje hodnotu\n {2}. \nPro tuto hodnotu se neodvodila arita.
de: Das Modul "{0}" enthält\n {1} \nDie Signatur gibt aber Folgendes an:\n {2} \nFür diesen Wert wurde keine Stelligkeit per Rückschluss abgeleitet.
es: El módulo '{0}' contiene\n {1} \npero la signatura especifica\n {2} \nNo se infirió una aridad para este valor.
fr: Le module '{0}' contient\n {1} \nmais sa signature spécifie\n {2} \nAucune arité n'a été déduite pour cette valeur
it: Il modulo '{0}' contiene\n {1} \ntuttavia la relativa firma specifica\n {2} \nNon è stato dedotto un grado per questo valore
ja: モジュール '{0}' には\n {1} \nが含まれますが、シグネチャには\n {2} \nを指定しています。この値の項数は推論されませんでした。
ko: {0}' 모듈에\n {1}이(가) 포함되어 있지만 \n해당 시그니처는\n {2}을(를) 지정합니다. \n이 값에 대한 인자 수가 유추되지 않았습니다.
pl: Moduł „{0}” zawiera element\n {1}, \nale jego sygnatura określa element\n {2} \nLiczba argumentów nie została wywnioskowana dla tej wartości
pt_br: O módulo '{0}' contém\n {1} \n, mas sua assinatura especifica\n {2} \nUma aridade não foi inferida para este valor
ru: Модуль "{0}" содержит\n {1} \nоднако его сигнатура задает\n {2} \nАрность не была выведена для этого значения
tr: {0}' modülü\n {1} \niçeriyor ancak imzasında\n {2} \nbelirtiliyor. Bu değer için parametre sayısı çıkarılmadı
zh_hans: 模块“{0}”包含\n {1} \n而其签名指定\n {2} \n未为此值推理 arity
zh_hant: 模組 '{0}' 包含\n {1} \n但它的簽章卻指定\n {2} \n未針對這個值推斷 Arity

# ValueNotContainedMutabilityGenericParametersDiffer
source: Module '{0}' contains\n {1} \nbut its signature specifies\n {2} \nThe number of generic parameters in the signature and implementation differ (the signature declares {3} but the implementation declares {4}
cs: Modul {0} obsahuje hodnotu\n {1}, \nale jeho signatura definuje hodnotu\n {2}. \nPočet obecných parametrů v signatuře a implementaci se liší (signatura deklaruje {3}, ale implementace {4}).
de: Das Modul "{0}" enthält\n {1} \nDie Signatur gibt aber Folgendes an:\n {2} \nDie Anzahl der generischen Parameter in der Signatur und in der Implementierung ist unterschiedlich (in der Signatur werden {3} deklariert, in der Implementierung {4}).
es: El módulo '{0}' contiene\n {1} \npero su signatura especifica\n {2} \nEl número de parámetros genéricos en la signatura y la implementación difiere (la signatura declara {3} pero la implementación declara {4}).
fr: Le module '{0}' contient\n {1} \nmais sa signature spécifie\n {2} \nLe nombre de paramètres génériques est différent entre la signature et l'implémentation (la signature déclare {3} mais l'implémentation déclare {4}
it: Il modulo '{0}' contiene\n {1} \ntuttavia la relativa firma specifica\n {2} \nIl numero di parametri generici nella firma e nell'implementazione è diverso (la firma dichiara {3}, mentre l'implementazione dichiara {4})
ja: モジュール '{0}' には\n {1} \nが含まれますが、シグネチャには\n {2} \nを指定しています。シグネチャと実装のジェネリック パラメーター数が異なります (シグネチャは {3} 個を宣言しましたが、実装は {4} 個です)。
ko: {0}' 모듈에\n {1}이(가) 포함되어 있지만 \n해당 시그니처는\n {2}을(를) 지정합니다. \n시그니처와 구현의 제네릭 매개 변수 수가 서로 다릅니다. 시그니처는 {3}개를 선언하지만 구현은 {4}개를 선언합니다.
pl: Moduł „{0}” zawiera element\n {1}, \nale jego sygnatura określa element\n {2} \nLiczba parametrów ogólnych w sygnaturze i implementacji jest różna (sygnatura deklaruje {3}, ale implementacja deklaruje {4})
pt_br: O módulo '{0}' contém\n {1} \n, mas sua assinatura especifica\n {2} \nOs números de parâmetros genéricos na assinatura e na implementação são diferentes (a assinatura declara {3} mas sua implementação declara {4}
ru: Модуль "{0}" содержит\n {1} \nоднако его сигнатура задает\n {2} \nЧисло универсальных параметров в сигнатуре и реализации различаются (сигнатура объявляет {3}, однако реализация объявляет {4})
tr: {0}' modülü\n {1} \niçeriyor ancak imzasında\n {2} \nbelirtiliyor. İmzadaki ve uygulamadaki genel parametrelerin sayısı farklı (imzada {3}, ancak uygulamada {4} tanımlanıyor
zh_hans: 模块“{0}”包含\n {1} \n而其签名指定\n {2} \n签名和实现中的泛型参数数目不同(签名声明 {3} 个泛型参数，而实现声明 {4} 个泛型参数
zh_hant: 模組 '{0}' 包含\n {1} \n但它的簽章卻指定\n {2} \n簽章與實作中泛型參數的數目不同 (簽章宣告了 {3} 個，但實作宣告了 {4} 個

# ValueNotContainedMutabilityGenericParametersAreDifferentKinds
source: Module '{0}' contains\n {1} \nbut its signature specifies\n {2} \nThe generic parameters in the signature and implementation have different kinds. Perhaps there is a missing [<Measure>] attribute.
cs: Modul {0} obsahuje hodnotu\n {1}, \nale jeho signatura určuje hodnotu\n {2}. \nObecné parametry v signatuře a implementaci jsou různých druhů. Je možné, že chybí atribut [<Measure>].
de: Das Modul "{0}" enthält\n {1} \nDie Signatur gibt aber Folgendes an:\n {2} \nDie generischen Parameter in der Signatur und in der Implementierung haben einen unterschiedlichen Typ. Möglicherweise fehlt ein [<Measure>]-Attribut.
es: El módulo "{0}" contiene\n {1} \npero su firma especifica\n {2} \nLos parámetros genéricos en la firma y aplicación tienen diversas clases. Quizá falte un atributo [<Measure>].
fr: Le module '{0}' contient\n {1}, \nmais sa signature spécifie\n {2} \nLes paramètres génériques dans la signature et l'implémentation ont des genres différents. Un attribut [<Measure>] est peut-être manquant.
it: Il modulo '{0}' contiene\n {1} \nma la relativa firma specifica\n {2} \nI parametri generici nella firma e nell'implementazione sono di tipo diverso. È possibile che manchi l'attributo [<Measure>].
ja: モジュール '{0}' には\n {1} \nが含まれていますが、シグネチャで指定されているのは\n {2} です \nシグネチャと実装の汎用パラメーターの種類が異なります。[<Measure>] 属性が欠落している可能性があります。
ko: '{0}' 모듈에\n {1}이(가) 포함되어 있지만 \n해당 시그니처는\n {2}을(를) 지정합니다. \n시그니처와 구현의 제네릭 매개 변수 종류가 서로 다릅니다. [<Measure>] 특성이 없는 것 같습니다.
pl: Moduł „{0}” zawiera element\n {1}, \nale jego podpis określa element\n {2} \nParametry ogólne w podpisie i implementacji są różnego rodzaju. Być może brakuje atrybutu [<Measure>].
pt_br: O módulo '{0}' contém\n {1} \nmas sua assinatura especifica\n {2} \nOs parâmetros genéricos na assinatura e na implementação apresentam tipos diferentes. Talvez haja um atributo [<Measure>] ausente.
ru: Модуль "{0}" содержит\n {1}, \nно в его подписи указано\n {2} \nУниверсальные параметры в подписи и реализации имеют различные типы. Возможно, отсутствует атрибут [<Measure>].
tr: '{0}' modülü\n {1} \niçeriyor, ancak modülün imzası tarafından\n {2} belirtiliyor \nİmzadaki ve uygulamadaki genel parametrelerin türleri farklı. Bir [<Measure>] özniteliği eksik olabilir.
zh_hans: 模块“{0}”包含\n {1} \n而其签名指定了\n {2} \n签名和实现中的泛型参数具有不同的类型。可能是缺少 [<Measure>] 属性。
zh_hant: 模組 '{0}' 包含\n {1} \n但其特徵標記指定了\n {2} \n特徵標記和實作中的泛型參數種類不同。可能缺少 [<Measure>] 屬性。

# ValueNotContainedMutabilityAritiesDiffer
source: Module '{0}' contains\n {1} \nbut its signature specifies\n {2} \nThe arities in the signature and implementation differ. The signature specifies that '{3}' is function definition or lambda expression accepting at least {4} argument(s), but the implementation is a computed function value. To declare that a computed function value is a permitted implementation simply parenthesize its type in the signature, e.g.\n\tval {5}: int -> (int -> int)\ninstead of\n\tval {6}: int -> int -> int.
cs: Modul {0} obsahuje hodnotu\n {1}, \nale jeho signatura určuje hodnotu\n {2}. \nArity v signatuře a implementaci se liší. Signatura určuje, že {3} je definice funkce nebo výraz lambda přijímající argumenty aspoň v počtu {4}, ale implementace je vypočítaná hodnota funkce. Pokud chcete deklarovat vypočítanou hodnotu funkce jako povolenou implementaci, jednoduše ohraničte její typ v signatuře závorkami, třeba pomocí notace\n\tval {5}: int -> (int -> int),\nkterá nahradí notaci\n\tval {6}: int -> int -> int.
de: Das Modul "{0}" enthält\n {1}, \ndie Signatur legt jedoch\n {2} fest. \nDie Stelligkeit in der Signatur und der Implementierung unterscheidet sich. Die Signatur gibt an, dass es sich bei "{3}" um eine Funktionsdefinition oder einen Lambdaausdruck handelt, der mindestens {4} Argumente akzeptiert, bei der Implementierung handelt es sich jedoch um einen berechneten Funktionswert. Deklarieren Sie einen berechneten Funktionswert als zulässige Implementierung, indem Sie dessen Typ in der Signatur in Klammern setzen, z.B.\n "\tval {5}: int -> (int -> int)" \nstatt\n "\tval {6}: int -> int -> int".
es: El módulo "{0}" contiene\n {1} \npero su signatura especifica\n {2} \nLas aridades de la signatura y la implementación difieren. La signatura especifica que "{3}" es una definición de función o una expresión lambda que acepta al menos {4} argumentos, pero la implementación es un valor de función calculado. Para declarar que un valor de función calculado es una implementación permitida, simplemente ponga entre paréntesis el tipo en la signatura; por ejemplo\n\tval {5}: int -> (int -> int)\nen lugar de\n\tval {6}: int -> int -> int.
fr: Le module '{0}' contient\n {1}, \nmais sa signature spécifie\n {2} \nLes arités sont différentes dans la signature et dans l'implémentation. La signature spécifie que '{3}' est une définition de fonction ou une expression lambda qui accepte au moins {4} argument(s), mais l'implémentation est une valeur de fonction calculée. Pour déclarer qu'une valeur de fonction calculée est une implémentation autorisée, mettez simplement entre parenthèses son type dans la signature, par ex.\n\tval {5}: int -> (int -> int)\nau lieu de\n\tval {6}: int -> int -> int.
it: Il modulo '{0}' contiene\n {1} \nma la relativa firma specifica\n {2} \nI gradi nella firma e nell'implementazione sono diversi. La firma specifica che '{3}' è una definizione di funzione o un'espressione lambda che accetta un numero di argomenti almeno pari a {4}, tuttavia l'implementazione è un valore di funzione calcolato. Per dichiarare che un valore di funzione calcolato è un'implementazione consentita, è sufficiente racchiudere tra parentesi il relativo tipo nella firma, ad esempio\n\tval {5}: int -> (int -> int)\ninvece di\n\tval {6}: int -> int -> int.
ja: モジュール '{0}' には\n {1} が含まれていますが、 \nシグネチャでは\n {2} が指定されています \nシグネチャと実装の項数が異なります。シグネチャは、'{3}' が {4} 個以上の引数を受け入れる関数定義またはラムダ式であると指定していますが、実装は計算された関数値です。計算された関数値が許可された実装であることを宣言するには、シグネチャの型をかっこで囲んでください。たとえば、\n\tval {6}: int -> int -> int ではなく、\n\tval {5}: int -> (int -> int) と指定します。
ko: '{0}' 모듈에\n {1}이(가) 포함되어 있지만 \n해당 시그니처는\n {2}을(를) 지정합니다. \n시그니처와 구현의 인자 수가 서로 다릅니다. 시그니처는 '{3}'이(가) {4}개 이상의 인수를 적용하는 함수 정의 또는 람다 식임을 지정하지만 구현은 계산된 함수 값입니다. 계산된 함수 값이 허용되는 구현임을 선언하려면 시그니처에서 해당 형식을 괄호로 묶기만 하면 됩니다(예: \n\tval {5}: int -> (int -> int)\ninstead of\n\tval {6}: int -> int -> int).
pl: Moduł „{0}” zawiera element\n {1}, \nale jego podpis określa element\n {2} \nLiczby argumentów w podpisie i implementacji są różne. Podpis określa, że „{3}” to definicja funkcji lub wyrażenie lambda akceptujące liczbę argumentów wynoszącą co najmniej {4}, ale implementacja jest obliczaną wartością funkcji. Aby zadeklarować, że obliczana wartość funkcji to dozwolona implementacja, po prostu w podpisie umieść jej typ w nawiasie, np.\n\tval {5}: int -> (int -> int)\nzamiast\n\tval {6}: int -> int -> int.
pt_br: O módulo '{0}' contém\n {1} \n,mas sua assinatura especifica\n {2} \nAs aridades diferem na assinatura e na implementação. A assinatura especifica que '{3}' é definição de função ou expressão lambda aceitando pelo menos {4} argumentos, mas a implementação é um valor de função computado. Para declarar que um valor de função computado é uma implementação permitida, basta colocar seu tipo entre parênteses na assinatura, por exemplo,\n\tval {5}: int -> (int -> int)\nem vez de\n\tval {6}: int -> int -> int.
ru: Модуль '{0}' содержит\n {1}, \nно в его подписи указано\n {2} \nКоличество аргументов в подписи и реализации различаются. В подписи указано, что '{3}' является определением функции или лямбда-выражением, которое принимает не менее {4} аргументов, но в реализации это значение является значением вычисляемой функции. Чтобы объявить, что в реализации может использоваться значение вычисляемой функции, просто заключите его в скобки в подписи, например, \n\tval {5}: int -> (int -> int)\nвместо\n\tval {6}: int -> int -> int.
tr: '{0}' modülü\n {1} \niçeriyor, ancak imzasında şu belirtiliyor:\n {2} \nİmzadaki parametre sayısı ile uygulamadaki farklı. İmzada '{3}' öğesinin en az {4} bağımsız değişken kabul eden bir işlem tanımı veya lambda ifadesi olduğu belirtiliyor, ancak uygulama hesaplanan bir işlev değeri. Hesaplanan işlev değerinin izin verilen bir uygulama olduğunu bildirmek için imzada türünü ayraç içine almak yeterlidir, ör. \n\tval {6}: int -> int -> int yerine \n\tval {5}: int -> (int -> int)\n.
zh_hans: 模块“{0}”包含\n {1} \n而其签名指定\n {2} \n签名和实现中的 arity 不同。签名指定“{3}”为函数定义或为接受至少个 {4} 参数的 lambda 表达式，而实现是计算出的函数值。若要声明计算出的函数值为允许的实现，只需在签名中用括号将其类型括起来，例如\n\tval {5}: int -> (int -> int)\n而非\n\tval {6}: int -> int -> int。
zh_hant: 模組 '{0}' 包含\n {1} \n但其特徵標記指定了\n {2} \n特徵標記和實作中的發行項不同。特徵標記會指定 '{3}' 為函式定義或 lambda 運算式，並接受至少 {4} 個引數，但實作是計算函式值。若要宣告計算函式值為允許的實作，只要在特徵標記中將其類型括在括號內即可，例如\n\tval {5}: int -> (int -> int)\n而不是\n\tval {6}: int -> int -> int。

# ValueNotContainedMutabilityDotNetNamesDiffer
source: Module '{0}' contains\n {1} \nbut its signature specifies\n {2} \nThe CLI member names differ
cs: Modul {0} obsahuje hodnotu\n {1}, \nale jeho signatura definuje hodnotu\n {2}. \nLiší se názvy členů CLI.
de: Das Modul "{0}" enthält\n {1} \nDie Signatur gibt aber Folgendes an:\n {2} \nDie CLI-Membernamen sind unterschiedlich.
es: El módulo '{0}' contiene\n {1} \npero su signatura especifica\n {2} \nLos nombres de miembro CLI difieren.
fr: Le module '{0}' contient\n {1} \nmais sa signature spécifie\n {2} \nLes noms de membres CLI sont différents
it: Il modulo '{0}' contiene\n {1} \ntuttavia la relativa firma specifica\n {2} \nI nomi dei membri CLI sono diversi
ja: モジュール '{0}' には\n {1} \nが含まれますが、シグネチャには\n {2} \nを指定しています。CLI メンバー名が異なります。
ko: {0}' 모듈에\n {1}이(가) 포함되어 있지만 \n해당 시그니처는\n {2}을(를) 지정합니다. \nCLI 멤버 이름이 서로 다릅니다.
pl: Moduł „{0}” zawiera element\n {1}, \nale jego sygnatura określa element\n {2} \nNazwy elementów członkowskich infrastruktury CLI są różne
pt_br: O módulo '{0}' contém\n {1} \n, mas sua assinatura especifica\n {2} \nOs nomes de membros CLI são diferentes
ru: Модуль "{0}" содержит\n {1} \nоднако его сигнатура задает\n {2} \nИмена элементов CLI различаются
tr: {0}' modülü\n {1} \niçeriyor ancak imzasında\n {2} \nbelirtiliyor. CLI üye adları farklı
zh_hans: 模块“{0}”包含\n {1} \n而其签名指定\n {2} \nCLI 成员名称不同
zh_hant: 模組 '{0}' 包含\n {1} \n但它的簽章卻指定\n {2} \nCLI 成員名稱不同

# ValueNotContainedMutabilityStaticsDiffer
source: Module '{0}' contains\n {1} \nbut its signature specifies\n {2} \nOne is static and the other isn't
cs: Modul {0} obsahuje hodnotu\n {1}, \nale jeho signatura definuje hodnotu\n {2}. \nJedna je statická a druhá ne.
de: Das Modul "{0}" enthält\n {1} \nDie Signatur gibt aber Folgendes an:\n {2} \nEine statische Angabe steht einer nicht statischen gegenüber.
es: El módulo '{0}' contiene\n {1} \npero su signatura especifica\n {2} \nUno es estático y el otro no.
fr: Le module '{0}' contient\n {1} \nmais sa signature spécifie\n {2} \nL'un est statique mais pas l'autre
it: Il modulo '{0}' contiene\n {1} \ntuttavia la relativa firma specifica\n {2} \nUno è statico, l'altro no
ja: モジュール '{0}' には\n {1} \nが含まれますが、シグネチャには\n {2} \nを指定しています。一方は静的ですが、もう一方は違います。
ko: {0}' 모듈에\n {1}이(가) 포함되어 있지만 \n해당 시그니처는\n {2}을(를) 지정합니다. \n하나는 정적 요소이고 다른 하나는 그렇지 않습니다.
pl: Moduł „{0}” zawiera element\n {1}, \nale jego sygnatura określa element\n {2} \nJeden element jest elementem statycznym, a drugi nie
pt_br: O módulo '{0}' contém\n {1} \n, mas sua assinatura especifica\n {2} \nUm é estático e o outro não
ru: Модуль "{0}" содержит\n {1} \nоднако его сигнатура задает\n {2} \nОдин является статическим, другой - нет
tr: {0}' modülü\n {1} \niçeriyor ancak imzasında\n {2} \nbelirtiliyor. Biri statik, diğeri değil
zh_hans: 模块“{0}”包含\n {1} \n而其签名指定\n {2} \n一个是静态的，另一个不是静态的
zh_hant: 模組 '{0}' 包含\n {1} \n但它的簽章卻指定\n {2} \n其中一個是靜態的，另一個卻不是

# ValueNotContainedMutabilityVirtualsDiffer
source: Module '{0}' contains\n {1} \nbut its signature specifies\n {2} \nOne is virtual and the other isn't
cs: Modul {0} obsahuje hodnotu\n {1}, \nale jeho signatura definuje hodnotu\n {2}. \nJedna je virtuální a druhá ne.
de: Das Modul "{0}" enthält\n {1} \nDie Signatur gibt aber Folgendes an:\n {2} \nEine virtuelle Angabe steht einer nicht virtuellen gegenüber.
es: El módulo '{0}' contiene\n {1} \npero su signatura especifica\n {2} \nUno es virtual y el otro no.
fr: Le module '{0}' contient\n {1} \nmais sa signature spécifie\n {2} \nL'un est virtuel mais pas l'autre
it: Il modulo '{0}' contiene\n {1} \ntuttavia la relativa firma specifica\n {2} \nUno è virtuale, l'altro no
ja: モジュール '{0}' には\n {1} \nが含まれますが、シグネチャには\n {2} \nを指定しています。一方は仮想ですが、もう一方は違います。
ko: {0}' 모듈에\n {1}이(가) 포함되어 있지만 \n해당 시그니처는\n {2}을(를) 지정합니다. \n하나는 가상 요소이고 다른 하나는 그렇지 않습니다.
pl: Moduł „{0}” zawiera element\n {1}, \nale jego sygnatura określa element\n {2} \nJeden element jest elementem wirtualnym, a drugi nie
pt_br: O módulo '{0}' contém\n {1} \n, mas sua assinatura especifica\n {2} \nUm é virtual e o outro não
ru: Модуль "{0}" содержит\n {1} \nоднако его сигнатура задает\n {2} \nОдин является виртуальным, другой - нет
tr: {0}' modülü\n {1} \niçeriyor ancak imzasında\n {2} \nbelirtiliyor. Biri sanal, diğeri değil
zh_hans: 模块“{0}”包含\n {1} \n而其签名指定\n {2} \n一个是虚拟的，另一个不是虚拟的
zh_hant: 模組 '{0}' 包含\n {1} \n但它的簽章卻指定\n {2} \n其中一個是虛擬的，另一個卻不是

# ValueNotContainedMutabilityAbstractsDiffer
source: Module '{0}' contains\n {1} \nbut its signature specifies\n {2} \nOne is abstract and the other isn't
cs: Modul {0} obsahuje hodnotu\n {1}, \nale jeho signatura definuje hodnotu\n {2}. \nJedna je abstraktní a druhá ne.
de: Das Modul "{0}" enthält\n {1} \nDie Signatur gibt aber Folgendes an:\n {2} \nEine abstrakte Angabe steht einer nicht abstrakten gegenüber.
es: El módulo '{0}' contiene\n {1} \npero su signatura especifica\n {2} \nUno es abstracto y el otro no.
fr: Le module '{0}' contient\n {1} \nmais sa signature spécifie\n {2} \nL'un est abstrait mais pas l'autre
it: Il modulo '{0}' contiene\n {1} \ntuttavia la relativa firma specifica\n {2} \nUno è astratto, l'altro no
ja: モジュール '{0}' には\n {1} \nが含まれますが、シグネチャには\n {2} \nを指定しています。一方は抽象ですが、もう一方は違います。
ko: {0}' 모듈에\n {1}이(가) 포함되어 있지만 \n해당 시그니처는\n {2}을(를) 지정합니다. \n하나는 추상 요소이고 다른 하나는 그렇지 않습니다.
pl: Moduł „{0}” zawiera element\n {1}, \nale jego sygnatura określa element\n {2} \nJeden element jest abstrakcyjny, a drugi nie
pt_br: O módulo '{0}' contém\n {1} \n, mas sua assinatura especifica\n {2} \nUm é abstrato e outro não
ru: Модуль "{0}" содержит\n {1} \nоднако его сигнатура задает\n {2} \nОдин является абстрактным, другой - нет
tr: {0}' modülü\n {1} \niçeriyor ancak imzasında\n {2} \nbelirtiliyor. Biri soyut, diğeri değil
zh_hans: 模块“{0}”包含\n {1} \n而其签名指定\n {2} \n一个是抽象的，另一个不是抽象的
zh_hant: 模組 '{0}' 包含\n {1} \n但它的簽章卻指定\n {2} \n其中一個是抽象的，另一個卻不是

# ValueNotContainedMutabilityFinalsDiffer
source: Module '{0}' contains\n {1} \nbut its signature specifies\n {2} \nOne is final and the other isn't
cs: Modul {0} obsahuje hodnotu\n {1}, \nale jeho signatura definuje hodnotu\n {2}. \nJedna z nich je finální a druhá ne.
de: Das Modul "{0}" enthält\n {1} \nDie Signatur gibt aber Folgendes an:\n {2} \nEine finale Angabe steht einer nicht finalen gegenüber.
es: El módulo '{0}' contiene\n {1} \npero su signatura especifica\n {2} \nUno es final y el otro no.
fr: Le module '{0}' contient\n {1} \nmais sa signature spécifie\n {2} \nL'un est final mais pas l'autre
it: Il modulo '{0}' contiene\n {1} \ntuttavia la relativa firma specifica\n {2} \nUno è finale, l'altro no
ja: モジュール '{0}' には\n {1} \nが含まれますが、シグネチャには\n {2} \nを指定しています。一方は final ですが、もう一方は違います。
ko: {0}' 모듈에\n {1}이(가) 포함되어 있지만 \n해당 시그니처는\n {2}을(를) 지정합니다. \n하나는 최종 요소이고 다른 하나는 그렇지 않습니다.
pl: Moduł „{0}” zawiera element\n {1}, \nale jego sygnatura określa element\n {2} \nJeden element jest elementem finalnym, a drugi nie
pt_br: O módulo '{0}' contém\n {1} \n, mas sua assinatura especifica\n {2} \nUm é final e o outro não
ru: Модуль "{0}" содержит\n {1} \nоднако его сигнатура задает\n {2} \nОдин является финальным, другой - нет
tr: {0}' modülü\n {1} \niçeriyor ancak imzasında\n {2} \nbelirtiliyor. Biri nihai, diğeri değil
zh_hans: 模块“{0}”包含\n {1} \n而其签名指定\n {2} \n一个是最终的，另一个不是最终的
zh_hant: 模組 '{0}' 包含\n {1} \n但它的簽章卻指定\n {2} \n其中一個是最後的，另一個卻不是

# ValueNotContainedMutabilityOverridesDiffer
source: Module '{0}' contains\n {1} \nbut its signature specifies\n {2} \nOne is marked as an override and the other isn't
cs: Modul {0} obsahuje hodnotu\n {1}, \nale jeho signatura definuje hodnotu\n {2}. \nJedna je označená jako přepsání a druhá ne.
de: Das Modul "{0}" enthält\n {1} \nDie Signatur gibt aber Folgendes an:\n {2} \nEine Angabe ist als Überschreibung markiert, die andere nicht.
es: El módulo '{0}' contiene\n {1} \npero su signatura especifica\n {2} \nUno está marcado como invalidación y el otro no.
fr: Le module '{0}' contient\n {1} \nmais sa signature spécifie\n {2} \nL'un est marqué en tant que substitution mais pas l'autre
it: Il modulo '{0}' contiene\n {1} \ntuttavia la relativa firma specifica\n {2} \nUno è contrassegnato come override, l'altro no
ja: モジュール '{0}' には\n {1} \nが含まれますが、シグネチャには\n {2} \nを指定しています。一方はオーバーライドとマークされていますが、もう一方は違います。
ko: {0}' 모듈에\n {1}이(가) 포함되어 있지만 \n해당 시그니처는\n {2}을(를) 지정합니다. \n하나는 override로 표시되어 있고 다른 하나는 그렇지 않습니다.
pl: Moduł „{0}” zawiera element\n {1}, \nale jego sygnatura określa element\n {2} \nJeden element jest oznaczony jako przesłonięcie, a drugi nie
pt_br: O módulo '{0}' contém\n {1} \n, mas sua assinatura especifica\n {2} \nUm é marcado como uma substituição e o outro não
ru: Модуль "{0}" содержит\n {1} \nоднако его сигнатура задает\n {2} \nОдин помечен как "override", другой - нет
tr: {0}' modülü\n {1} \niçeriyor ancak imzasında\n {2} \nbelirtiliyor. Biri geçersiz kılma olarak işaretlenmiş, diğeri işaretlenmemiş
zh_hans: 模块“{0}”包含\n {1} \n而其签名指定\n {2} \n一个标记为重写，另一个未标记为重写
zh_hant: 模組 '{0}' 包含\n {1} \n但它的簽章卻指定\n {2} \n其中一個標記為覆寫，另一個卻不是
