Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# augNoCompCantImpIComp
source: A type with attribute 'NoComparison' should not usually have an explicit implementation of 'System.IComparable', 'System.IComparable<_>' or 'System.Collections.IStructuralComparable'. Disable this warning if this is intentional for interoperability purposes
cs: Není běžné, aby typ s atributem NoComparison měl explicitní implementaci System.IComparable, System.IComparable<_> nebo System.Collections.IStructuralComparable. Pokud je to záměr s cílem dosáhnout interoperability, pak toto upozornění vypněte.
de: Ein Typ mit dem NoComparison-Attribut sollte in der Regel keine explizite Implementierung von "System.IComparable" , "System.IComparable<_>" oder "System.Collections.IStructuralComparable" aufweisen. Deaktivieren Sie diese Warnung, wenn diese Implementierung aus Interoperabilitätsgründen beabsichtigt ist.
es: Un tipo con el atributo "NoComparison" normalmente no debería tener una implementación explícita de "System.IComparable", "System.IComparable & lt; _ & gt;" o "System.Collections.IStructuralComparable". Deshabilite esta advertencia si es intencional para fines de interoperabilidad
fr: Un type avec l'attribut 'NoComparison' ne doit généralement pas avoir d'implémentation explicite de 'System.IComparable', 'System.IComparable<_>' ou 'System.Collections.IStructuralComparable'. Désactivez cet avertissement si l'implémentation est intentionnelle ou à des fins d'interopérabilité
it: Un tipo con attributo 'NoComparison' non deve avere in genere un'implementazione esplicita di 'System.IComparable', 'System.IComparable<_>' o 'System.Collections.IStructuralComparable'. Disabilitare questo avviso se questa scelta è intenzionale per garantire l'interoperabilità
ja: 'NoComparison' 属性が含まれる型には 'System.IComparable'、'System.IComparable<_>'、または 'System.Collections.IStructuralComparable' の明示的な実装を通常は含めるべきではありません。相互運用のために意図的な場合には、この警告を無効にします
ko: 특성 'NoComparison'이 지정된 형식에는 일반적으로 'System.IComparable', 'System.IComparable<_>' 또는 'System.Collections.IStructuralComparable'에 대한 명시적 구현이 있으면 안 됩니다. 상호 운용성을 위해 의도적으로 이러한 구현을 사용한 경우에는 이 경고를 사용하지 마세요.
pl: Typ z atrybutem „NoComparison” nie powinien zwykle mieć jawnej implementacji interfejsu „System.IComparable”, interfejsu „System.IComparable<_>” ani interfejsu „System.Collections.IStructuralComparable”. Wyłącz to ostrzeżenie, jeśli jest to zamierzone na potrzeby współdziałania
pt_br: Um tipo com o atributo 'NoComparison' não deve normalmente ter uma implementação explícita de 'System.IComparable', 'System.IComparable<_>' ou 'System.Collections.IStructuralComparable'. Desabilite esse aviso se isso for intencional para fins de interoperabilidade
ru: Тип с атрибутом 'NoComparison' обычно не должен иметь явной реализации 'System.IComparable', 'System.IComparable<_>' или 'System.Collections.IStructuralComparable'. Отключите это предупреждение, если это сделано намеренно для целей взаимодействия
tr: 'NoComparison' özniteliğine sahip bir tür genellikle açık bir 'System.IComparable', 'System.IComparable<_>' veya 'System.Collections.IStructuralComparable' uygulamasına sahip olmamalıdır. Bunu birlikte çalışabilirlik amacıyla bilerek yaptıysanız bu uyarıyı devre dışı bırakın
zh_hans: 具有 "NoComparison" 属性的类型通常不应具有 "System.IComparable"、"System.IComparable<_>" 或 "System.Collections.IStructuralComparable" 的显式实现。如果专用于互操作性用途，请禁用此警告
zh_hant: 屬性為 'NoComparison' 的類型不應時常有 'System.IComparable'、'System.IComparable<_>' 或 'System.Collections.IStructuralComparable' 的明確實作。若是為了達成互通性而這樣做，則請停用此警示

# augCustomEqNeedsNoCompOrCustomComp
source: The 'CustomEquality' attribute must be used in conjunction with the 'NoComparison' or 'CustomComparison' attributes
cs: Atribut CustomEquality je potřeba použít ve spojení s atributem NoComparison nebo CustomComparison.
de: Das CustomEquality-Attribut muss in Verbindung mit den Attributen "NoComparison" oder "CustomComparison" verwendet werden.
es: El atributo 'CustomEquality' debe usarse junto con los atributos 'NoComparison' o 'CustomComparison'.
fr: L'attribut 'CustomEquality' doit être utilisé conjointement avec les attributs 'NoComparison' ou 'CustomComparison'
it: L'attributo 'CustomEquality' deve essere utilizzato insieme agli attributi 'NoComparison' o 'CustomComparison'
ja: 'CustomEquality' 属性は、'NoComparison' 属性または 'CustomComparison' 属性と組み合わせて使用する必要があります
ko: 'CustomEquality' 특성은 'NoComparison' 또는 'CustomComparison' 특성과 함께 사용해야 합니다.
pl: Atrybut „CustomEquality” musi być używany w połączeniu z atrybutami „NoComparison” lub „CustomComparison”
pt_br: O atributo 'CustomEquality' deve ser usado na conjunção com atributos 'NoComparison' ou 'CustomComparison'
ru: Атрибут "CustomEquality" необходимо использовать в сочетании с атрибутами "NoComparison" или "CustomComparison"
tr: 'CustomEquality' özniteliği, 'NoComparison' veya 'CustomComparison' öznitelikleri ile bağlantılı kullanılmalıdır
zh_hans: "CustomEquality" 特性必须与 "NoComparison" 或 "CustomComparison" 特性结合使用
zh_hant: 'CustomEquality' 屬性必須搭配 'NoComparison' 或 'CustomComparison' 屬性一起使用

# forPositionalSpecifiersNotPermitted
source: Positional specifiers are not permitted in format strings
cs: Specifikátory pozice nejsou v řetězcích formátu povolené.
de: Positionsspezifizierer sind in Formatzeichenfolgen nicht zulässig.
es: No se permiten especificadores posicionales en cadenas de formato
fr: Les spécificateurs de position ne sont pas autorisés dans les chaînes de format
it: Identificatori di posizione non consentiti in stringhe di formato
ja: 位置指定子は書式指定文字列で許可されていません
ko: 위치 지정자는 서식 문자열에 허용되지 않습니다.
pl: Specyfikatory pozycyjne są niedozwolone w ciągach formatu
pt_br: Não são permitidos especificadores posicionais em cadeias de caracteres de formato
ru: Использование позиционных спецификаторов в строках формата не допускается
tr: Biçim dizelerinde konum tanımlayıcılara izin verilmiyor
zh_hans: 格式字符串中不得有位置说明符
zh_hant: 格式字串中不允許使用位置規範

# forMissingFormatSpecifier
source: Missing format specifier
cs: Chybí specifikátor formátu.
de: Der Formatbezeichner fehlt.
es: Falta un especificador de formato.
fr: Spécificateur de format manquant
it: Identificatore di formato mancante
ja: 書式指定子がありません
ko: 서식 지정자가 없습니다.
pl: Brak specyfikatora formatu
pt_br: Especificador de formato ausente
ru: Отсутствует указатель формата
tr: Biçim belirticisi eksik
zh_hans: 缺少格式说明符
zh_hant: 遺漏格式修飾詞

# forFlagSetTwice
source: '{0}' flag set twice
cs: Příznak {0} je nastavený dvakrát.
de: {0}-Flag doppelt festgelegt.
es: Marca '{0}' establecida dos veces.
fr: Indicateur '{0}' défini à deux reprises
it: Flag '{0}' impostato due volte
ja: '{0}' フラグが 2 回設定されました
ko: '{0}' 플래그를 두 번 설정했습니다.
pl: Dwukrotnie ustawiono flagę „{0}”
pt_br: O sinalizador '{0}' foi definido duas vezes
ru: флаг "{0}" установлен дважды
tr: '{0}' bayrağı iki kez ayarlandı
zh_hans: “{0}”标志设置了两次
zh_hant: '{0}' 旗標設定兩次

# forPrefixFlagSpacePlusSetTwice
source: Prefix flag (' ' or '+') set twice
cs: Příznak předpony (mezera nebo znaménko plus) je nastavený dvakrát.
de: Präfixflag (" " oder "+") doppelt festgelegt.
es: Marca de prefijo (' ' o '+') establecida dos veces
fr: Indicateur de préfixe (' ' ou '+') défini à deux reprises
it: Flag di prefisso (' ' o '+') impostato due volte
ja: プレフィックスのフラグ (' ' または '+') が 2 回設定されました
ko: 접두사 플래그(' ' 또는 '+')를 두 번 설정했습니다.
pl: Dwukrotnie ustawiono flagę prefiksu („ ” lub „+”)
pt_br: Sinalizador de prefixo (' ' ou '+') definido duas vezes
ru: Флаг префикса (" " или "+") установлен дважды
tr: Ön ek bayrağı (' ' veya '+') iki kez ayarlandı
zh_hans: 前缀标志(" " 或 "+")设置了两次
zh_hant: 前置詞旗標 (' ' 或 '+') 設定兩次

# forHashSpecifierIsInvalid
source: The # formatting modifier is invalid in F#
cs: Modifikátor formátu # je v jazyce F# neplatný.
de: Der #-Formatierungsmodifizierer ist in F# ungültig.
es: El modificador de formato # no es válido en F#.
fr: Le modificateur de mise en forme # n'est pas valide en F#
it: Il modificatore di formattazione # non è valido in F#
ja: # 書式修飾子は F# では無効です
ko: F#에서는 # 서식 지정 한정자를 사용할 수 없습니다.
pl: Modyfikator formatu # jest nieprawidłowy w języku F#
pt_br: O modificador de formatação # é inválido em F#
ru: Модификатор форматирования # в F# недопустим.
tr: # biçimlendirme değiştiricisi F# içinde geçersizdir
zh_hans: # 格式修饰符在 F# 中无效
zh_hant: # 格式修飾詞在 F# 中無效

# forBadPrecision
source: Bad precision in format specifier
cs: Chybná přesnost ve specifikátoru formátu
de: Unzulässige Genauigkeitsangaben in Formatbezeichner.
es: Precisión incorrecta en especificador de formato.
fr: Précision incorrecte du spécificateur de format
it: Precisione non valida in identificatore di formato
ja: 書式指定子の精度に誤りがあります
ko: 서식 지정자의 정밀도가 잘못되었습니다.
pl: Zła dokładność w specyfikatorze formatu
pt_br: Especificador de formato com pouca precisão
ru: Недопустимая точность спецификатора формата
tr: Biçim tanımlayıcıda hatalı duyarlık
zh_hans: 格式说明符中的精度错误
zh_hant: 格式規範中精確度不正確

# forBadWidth
source: Bad width in format specifier
cs: Chybná šířka ve specifikátoru formátu
de: Unzulässige Breite in Formatbezeichner.
es: Ancho incorrecto en especificador de formato.
fr: Largeur incorrecte du spécificateur de format
it: Larghezza non valida in identificatore di formato
ja: 書式指定子の幅に誤りがあります
ko: 서식 지정자의 너비가 잘못되었습니다.
pl: Zła szerokość w specyfikatorze formatu
pt_br: Especificador de formato com largura ruim
ru: Недопустимая ширина спецификатора формата
tr: Biçim tanımlayıcıda hatalı genişlik
zh_hans: 格式说明符中的宽度错误
zh_hant: 格式規範中寬度不正確

# forDoesNotSupportZeroFlag
source: '{0}' format does not support '0' flag
cs: Formát {0} nepodporuje příznak 0.
de: Das Format "{0}" unterstützt kein 0-Flag.
es: El formato '{0}' no admite la marca '0'.
fr: Le format '{0}' ne prend pas en charge l'indicateur '0'
it: Il formato '{0}' non supporta il flag '0'
ja: '{0}' 形式は '0' フラグをサポートしていません
ko: '{0}' 형식은 '0' 플래그를 지원하지 않습니다.
pl: Format „{0}” nie obsługuje flagi „0”
pt_br: O formato '{0}' não suporta sinalizador '0'
ru: {0} не поддерживает флаг "0"
tr: '{0}' biçimi '0' bayrağını desteklemiyor
zh_hans: “{0}”格式不支持“0”标志
zh_hant: '{0}' 格式不支援 '0' 旗標

# forPrecisionMissingAfterDot
source: Precision missing after the '.'
cs: Za tečkou chybí určení přesnosti.
de: Genauigkeitsangaben nach dem "." fehlen.
es: Falta una precisión después de '.'
fr: Précision manquante après le '.'
it: Precisione mancante dopo '.'
ja: '.' の後に精度がありません
ko: '.' 뒤에 정밀도가 없습니다.
pl: Brak dokładności po znaku „.”
pt_br: Precisão após o '.' ausente
ru: Отсутствует точность после "."
tr: '.' karakterinden sonra duyarlık eksik
zh_hans: "." 后缺少精度
zh_hant: 在 '.' 後遺漏精確度

# forFormatDoesntSupportPrecision
source: '{0}' format does not support precision
cs: Formát {0} nepodporuje přesnost.
de: Das Format "{0}" unterstützt keine Genauigkeitsangaben.
es: El formato '{0}' no admite precisión.
fr: Le format '{0}' ne prend pas en charge la précision
it: Il formato '{0}' non supporta la precisione
ja: '{0}' 形式は精度をサポートしていません
ko: '{0}' 형식은 정밀도를 지원하지 않습니다.
pl: Format „{0}” nie obsługuje dokładności
pt_br: O sinalizador '{0}' não suporta precisão
ru: формат "{0}" не поддерживает точность
tr: '{0}' biçimi duyarlığı desteklemiyor
zh_hans: “{0}”格式不支持精度
zh_hant: '{0}' 格式不支援精確度

# forBadFormatSpecifier
source: Bad format specifier (after l or L): Expected ld,li,lo,lu,lx or lX. In F# code you can use %d, %x, %o or %u instead, which are overloaded to work with all basic integer types.
cs: Špatný specifikátor formátu (po l nebo L): Očekávaný specifikátor je ld, li, lo, lu, lx nebo lX. V kódu F# můžete místo toho použít %d, %x, %o nebo %u: tyto specifikátory formátu jsou přetěžované, takže fungují se všemi základními celočíselnými typy.
de: Ungültiger Formatbezeichner (nach l oder L): Erwartet wurde ld, li, lo, lu, lx oder lX. In F#-Code können Sie stattdessen %d, %x, %o oder %u verwenden; diese Bezeichner sind überladen und funktionieren mit allen grundlegenden Integer-Typen.
es: Especificador de formato incorrecto (después de l o L): se esperaba ld, li, lo, lu, lx o lX. En el código de F#, puede usar %d, %x, %o o %u, que se sobrecargan para funcionar con todos los tipos de entero básicos.
fr: Spécificateur de format incorrect (après l ou L) : ld,li,lo,lu,lx ou lX attendu. En F#, vous pouvez utiliser %d, %x, %o ou %u à la place, qui sont surchargés pour fonctionner avec tous les types entiers de base.
it: Identificatore di formato non valido (dopo l o L): è previsto ld,li,lo,lu,lx o lX. Nel codice F# è invece possibile usare %d, %x, %o o %u, di cui viene eseguito l'overload affinché funzionino con tutti i tipi di Integer di base.
ja: (l または L の後の) 書式指定子に誤りがあります。ld、li、lo、lu、lx、または lX を指定してください。F# コードでは、代わりに %d、%x、%o、または %u を使用できます。これらは、すべての基本的な整数型を扱うためにオーバーロードされます。
ko: l 또는 L 뒤에서 서식 지정자가 잘못되었습니다. ld, li, lo, lu, lx 또는 lX가 필요합니다. F# 코드에서는 모든 기본 정수 형식과 함께 사용할 수 있도록 오버로드되는 %d, %x, %o 또는 %u을(를) 대신 사용할 수 있습니다.
pl: Zły specyfikator formatu (po l lub L): oczekiwano ld,li,lo,lu,lx lub lX. W kodzie języka F# można zamiast tego używać specyfikatorów %d, %x, %o lub %u, które są przeciążone w celu współpracy z wszystkimi podstawowymi typami liczb całkowitych.
pt_br: Especificador de formato inválido (após l ou L): esperado: ld,li,lo,lu,lx ou lX. No código F#, você pode usar %d, %x, %o ou %u no lugar, os quais estão sobrecarregados para trabalhar com todos os tipos básicos de inteiro.
ru: Недопустимый спецификатор формата (после l или L): требуется ld,li,lo,lu,lx или lX. В коде F# можно использовать %d, %x, %o или %u, которые перегружаются и поддерживают работу со всеми базовыми целочисленными типами.
tr: Hatalı biçim tanımlayıcı (l veya L'den sonra): ld,li,lo,lu,lx veya lX bekleniyordu. Bunun yerine F# kodunda, tüm temel tamsayı türleriyle çalışmak üzere aşırı yüklenmiş olan %d, %x, %o veya %u kullanabilirsiniz.
zh_hans: 错误的格式说明符(位于 l 或 L 之后): 应为 ld、li、lo、lu、lx 或 lX。在 F# 代码中，可以改用 %d、%x、%o 或 %u，这些项将被重载以用于所有基本整数类型。
zh_hant: 不正確的格式規範 (在 l 或 L 之後): 必須是 ld、li、lo、lu、lx 或 lX。在 F# 程式碼中，您可以改用 %d、%x、%o 或 %u，這些格式經過多載，可以搭配所有基本的整數類型使用。

# forLIsUnnecessary
source: The 'l' or 'L' in this format specifier is unnecessary. In F# code you can use %d, %x, %o or %u instead, which are overloaded to work with all basic integer types.
cs: Použití l nebo L je u tohoto specifikátoru formátu nadbytečné. V kódu F# můžete místo toho použít %d, %x, %o nebo %u: tyto specifikátory formátu jsou přetěžované, takže fungují se všemi základními celočíselnými typy.
de: Die Angabe von "l" oder "L" ist in diesem Formatbezeichner nicht erforderlich. In F#-Code können Sie stattdessen %d, %x, %o oder %u verwenden; diese Bezeichner sind überladen und funktionieren mit allen grundlegenden Integer-Typen.
es: La 'l' o 'L' en este especificador de formato es innecesaria. En el código de F#, puede usar %d, %x, %o o %u, que se sobrecargan para funcionar con todos los tipos de entero básicos.
fr: Le 'l' ou 'L' dans ce spécificateur de format est inutile. En F#, vous pouvez utiliser %d, %x, %o ou %u à la place, qui sont surchargés pour fonctionner avec tous les types entiers de base.
it: 'l' o 'L' non è necessario nell'identificatore di formato. Nel codice F# è invece possibile usare %d, %x, %o o %u, di cui viene eseguito l'overload affinché funzionino con tutti i tipi di Integer di base.
ja: この書式指定子に 'l' または 'L' は不要です。F# のコードでは、%d、%x、%o、または %u を使用できます。これらは、すべての基本的な整数型を扱うためにオーバーロードされます。
ko: 이 서식 지정자에서 'l' 또는 'L'은 불필요합니다. F# 코드에서는 모든 기본 정수 형식과 함께 사용할 수 있도록 오버로드되는 %d, %x, %o 또는 %u을(를) 대신 사용할 수 있습니다.
pl: Litera „l” lub „L” w tym specyfikatorze formatu jest niepotrzebna. W kodzie języka F# można zamiast tego używać specyfikatorów %d, %x, %o lub %u, które są przeciążone w celu współpracy z wszystkimi podstawowymi typami liczb całkowitych.
pt_br: O 'l' nem 'L' são necessários neste especificador de formato. No código F#, você pode usar %d, %x, %o ou %u no lugar, os quais estão sobrecarregados para trabalhar com todos os tipos básicos de inteiro.
ru: Использовать "l" или "L" в этом спецификаторе формата необязательно. В коде F# можно использовать %d, %x, %o или %u, которые перегружаются и поддерживают работу со всеми базовыми целочисленными типами.
tr: Bu biçim tanımlayıcıdaki 'l' veya 'L' gereksiz. Bunun yerine F# kodunda, tüm temel tamsayı türleriyle çalışmak üzere aşırı yüklenmiş olan %d, %x, %o veya %u kullanabilirsiniz.
zh_hans: 此格式说明符中不需要 "l" 或 "L"。在 F# 代码中，可以改用 %d、%x、%o 或 %u，这些项将被重载以用于所有基本整数类型。
zh_hant: 這個格式規範中的 'l' 或 'L' 是不必要的。在 F# 程式碼中，您可以改用 %d、%x、%o 或 %u，這些格式經過多載，可以搭配所有基本的整數類型使用。

# forHIsUnnecessary
source: The 'h' or 'H' in this format specifier is unnecessary. You can use %d, %x, %o or %u instead, which are overloaded to work with all basic integer types.
cs: U tohoto specifikátoru formátu není nutné používat h nebo H. Místo toho můžete použít %d, %x, %o nebo %u. Tyto specifikátory formátu se přetěžují, aby fungovaly se všemi základními celočíselnými typy.
de: Die Angabe von "h" oder "H" ist in diesem Formatbezeichner nicht erforderlich. Sie können stattdessen %d, %x, %o oder %u verwenden. Diese Bezeichner sind überladen und funktionieren mit allen grundlegenden Integertypen.
es: La 'h' o 'H' en este especificador de formato es innecesaria. Puede usar %d, %x, %o o %u, que se sobrecargan para funcionar con todos los tipos de entero básicos.
fr: Le 'h' ou 'H' dans ce spécificateur de format est inutile. Vous pouvez utiliser %d, %x, %o ou %u à la place, qui sont surchargés pour fonctionner avec tous les types entiers de base.
it: 'h' o 'H' non è necessario nell'identificatore di formato. È possibile usare %d, %x, %o o %u, di cui viene eseguito l'overload affinché funzionino con tutti i tipi di Integer di base.
ja: この書式指定子に 'h' または 'H' は不要です。代わりに %d、%x、%o、または %u を使用できます。これらは、すべての基本的な整数型を扱うためにオーバーロードされます。
ko: 이 서식 지정자에서 'h' 또는 'H'는 불필요합니다. 모든 기본 정수 형식과 함께 사용할 수 있도록 오버로드되는 %d, %x, %o 또는 %u을(를) 대신 사용할 수 있습니다.
pl: Litera „h” lub „H” w tym specyfikatorze formatu jest niepotrzebna. Można zamiast tego używać specyfikatora %d, %x, %o lub %u, które są przeciążone w celu współdziałania ze wszystkimi podstawowymi typami liczb całkowitych.
pt_br: O 'h' ou 'H' é desnecessário neste especificador de formato. Você pode usar %d, %x, %o ou %u em seu lugar, que estão sobrecarregados para trabalhar com todos os tipos básicos de inteiro.
ru: Использовать "h" или "H" в этом описателе формата необязательно. Вместо них можно использовать %d, %x, %o или %u, которые перегружаются и поддерживают работу со всеми базовыми целочисленными типами.
tr: Bu biçim tanımlayıcıdaki 'h' veya 'H' gereksiz. Bunun yerine, tüm temel tamsayı türleriyle çalışmak üzere aşırı yüklenmiş olan %d, %x, %o veya %u kullanabilirsiniz.
zh_hans: 此格式说明符中不需要 "h" 或 "H"。可以改用 %d、%x、%o 或 %u，这些项将被重载以用于所有基本整数类型。
zh_hant: 這個格式規範中的 'h' 或 'H' 為不必要。您可以改用 %d、%x、%o 或 %u，這些格式經過多載，可以搭配所有基本的整數類型使用。

# forDoesNotSupportPrefixFlag
source: '{0}' does not support prefix '{1}' flag
cs: {0} nepodporuje příznak předpony {1}.
de: "{0}" unterstützt kein {1}-Präfixflag.
es: "{0}" no admite la marca de prefijo "{1}"
fr: '{0}' ne prend pas en charge l'indicateur de préfixe '{1}'
it: '{0}' non supporta il flag '{1}' del prefisso
ja: {0}' はプレフィックスの '{1}' フラグをサポートしていません
ko: '{0}'은(는) 접두사 '{1}' 플래그를 지원하지 않습니다.
pl: Element „{0}” nie obsługuje flagi „{1}” prefiksu
pt_br: O '{0}' não dá suporte ao sinalizador '{1}' de prefixo
ru: "{0}" не поддерживает флаг префикса "{1}"
tr: '{0}', ön ek '{1}' bayrağını desteklemiyor
zh_hans: “{0}”不支持前缀“{1}”标志
zh_hant: {0}' 不支援前置詞 '{1}' 旗標

# forBadFormatSpecifierGeneral
source: Bad format specifier: '{0}'
cs: Špatný specifikátor formátu: {0}
de: Ungültiger Formatbezeichner: '{0}'
es: Especificador de formato incorrecto: '{0}'.
fr: Spécificateur de format incorrect : '{0}'
it: Identificatore di formato non valido: '{0}'
ja: 書式指定子に誤りがあります:'{0}'
ko: 서식 지정자가 잘못되었습니다. '{0}'
pl: Zły specyfikator formatu: „{0}”
pt_br: Especificador de formato incorreto: '{0}'
ru: Неправильный спецификатор формата: '{0}'
tr: Hatalı biçim tanımlayıcı: '{0}'
zh_hans: 错误的格式说明符: '{0}'
zh_hant: 不正確的格式規範: '{0}'

# elSysEnvExitDidntExit
source: System.Environment.Exit did not exit
cs: Metoda System.Environment.Exit neprovedla ukončení.
de: System.Environment.Exit war nicht vorhanden.
es: System.Environment.Exit no salió.
fr: System.Environment.Exit n'est pas sorti
it: System.Environment.Exit inesistente
ja: System.Environment.Exit が終了しませんでした
ko: System.Environment.Exit이 종료되지 않았습니다.
pl: Metoda System.Environment.Exit nie została zakończona
pt_br: System.Environment.Exit não foi finalizado
ru: System.Environment.Exit не был выполнен
tr: System.Environment.Exit yoktu
zh_hans: System.Environment.Exit 未退出
zh_hant: System.Environment.Exit 未結束

# elDeprecatedOperator
source: The treatment of this operator is now handled directly by the F# compiler and its meaning cannot be redefined
cs: Zpracování tohoto operátoru teď provádí přímo kompilátor F# a jeho význam se nedá předefinovat.
de: Die Behandlung dieses Operators erfolgt jetzt direkt durch den F#-Compiler; die Bedeutung kann nicht mehr geändert werden.
es: El tratamiento de este operador se controla ahora directamente con el compilador de F# y su significado no se puede redefinir.
fr: Le traitement de cet opérateur est désormais géré directement par le compilateur F# et il est impossible de redéfinir sa signification
it: La modalità di gestione di questo operatore dipende ora direttamente dal compilatore F# e non è possibile ridefinirne il significato
ja: この演算子は F# コンパイラが直接処理するようになったため、演算子の意味を再定義することはできません
ko: 이 연산자의 처리는 이제 F# 컴파일러에 의해 직접 수행되며 해당 의미를 다시 정의할 수 없습니다.
pl: Ten operator jest teraz obsługiwany bezpośrednio przez kompilator języka F# i nie można ponownie zdefiniować jego znaczenia
pt_br: O tratamento deste operador agora é manipulado diretamente pelo compilador F# e seu significado não pode ser redefinido
ru: Этот оператор обрабатывается непосредственно компилятором F#, в связи с чем его значение не может быть повторно определено
tr: Bu işlecin işlemleri artık doğrudan F# derleyicisi tarafından işlendiğinden anlamı yeniden tanımlanamaz
zh_hans: 此时将通过 F# 编译器直接操作对此运算符的处理，并且不能重新定义其含义
zh_hant: 這個運算子的處理方式現在是直接由 F# 編譯器處理，其意義無法重新定義
