Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# tcUnrecognizedAttributeTarget
source: Unrecognized attribute target. Valid attribute targets are 'assembly', 'module', 'type', 'method', 'property', 'return', 'param', 'field', 'event', 'constructor'.
cs: Nerozpoznaný cíl atributu. Platné cíle atributu jsou assembly, module, type, method, property, return, param, field, event a constructor.
de: Unbekanntes Attributziel. Gültige Attributziele sind "assembly", "module", "type", "method", "property", "return", "param", "field", "event", "constructor".
es: Destino de atributo no reconocido. Los destinos de atributo válidos son: 'assembly', 'module', 'type', 'method', 'property', 'return', 'param', 'field', 'event', 'constructor'.
fr: Cible d'attribut non reconnue. Les cibles d'attributs valides sont 'assembly', 'module', 'type', 'method', 'property', 'return', 'param', 'field', 'event', 'constructor'.
it: Destinazione attributo non riconosciuta. Le destinazioni valide sono 'assembly', 'module', 'type', 'method', 'property', 'return', 'param', 'field', 'event', 'constructor'.
ja: 認識されない属性のターゲットです。有効な属性のターゲットは、'assembly'、'module'、'type'、'method'、'property'、'return'、'param'、'field'、'event'、および 'constructor' です。
ko: 인식할 수 없는 특성 대상입니다. 올바른 특성 대상은 'assembly', 'module', 'type', 'method', 'property', 'return', 'param', 'field', 'event', 'constructor'입니다.
pl: Nierozpoznany element docelowy atrybutu. Prawidłowe elementy docelowe atrybutu: „assembly”, „module”, „type”, „method”, „property”, „return”, „param”, „field”, „event”, „constructor”.
pt_br: Destino de atributo não reconhecido. Os destinos de atributos válidos são 'assembly', 'module', 'type', 'method', 'property', 'return', 'param', 'field', 'event' e 'constructor'.
ru: Нераспознанная цель атрибута. Допустимыми целями атрибута являются "assembly", "module", "type", "method", "property", "return", "param", "field", "event", "constructor".
tr: Tanınmayan öznitelik hedefi. Geçerli öznitelik hedefleri şunlardır: 'assembly', 'module', 'type', 'method', 'property', 'return', 'param', 'field', 'event', 'constructor'.
zh_hans: 无法识别的特性目标。有效的特性目标为“assembly”、“module”、“type”、“method”、“property”、“return”、“param”、“field”、“event”、“constructor”。
zh_hant: 無法辨識的屬性目標。有效的屬性目標為 'assembly'、'module'、'type'、'method'、'property'、'return'、'param'、'field'、'event'、'constructor'。

# tcAttributeIsNotValidForLanguageElementUseDo
source: This attribute is not valid for use on this language element. Assembly attributes should be attached to a 'do ()' declaration, if necessary within an F# module.
cs: Tento atribut není platný pro použití u tohoto elementu jazyka. Atributy sestavení by měly být připojené k deklaraci do (), v případě potřeby v modulu F#.
de: Dieses Attribut ist für dieses Sprachelement nicht gültig. Assemblyattribute sollten an eine "do ()"-Deklaration angefügt werden, falls notwendig innerhalb eines F#-Moduls.
es: Este atributo no es válido para usarlo en este elemento de lenguaje. Los atributos de ensamblado deben asociarse a una declaración 'do ()', si es necesario en un módulo de F#.
fr: L'utilisation de cet attribut n'est pas valide sur cet élément de langage. Les attributs d'assembly doivent être attachés à une déclaration 'do ()', si nécessaire, dans un module F#.
it: Attributo non valido per l'utilizzo in questo elemento del linguaggio. Gli attributi degli assembly devono essere collegati a una dichiarazione 'do ()', se necessario all'interno di un modulo F#.
ja: この言語要素では、この属性を使用できません。アセンブリの属性は (必要に応じて F# モジュール内で) 'do ()' 宣言にアタッチする必要があります。
ko: 이 특성은 이 언어 요소에 사용할 수 없습니다. 어셈블리 특성은 필요한 경우 F# 모듈 내에서 'do ()' 선언에 연결해야 합니다.
pl: Ten atrybut jest nieprawidłowy do użycia w tym elemencie języka. Atrybuty zestawu powinny być dołączone do deklaracji „do ()” (w module języka F#, jeśli to konieczne).
pt_br: Este atributo não é válido para ser usado neste elemento de linguagem. Os atributos de assembly devem ser anexados a uma declaração 'do ()' e, se necessário, em um módulo F#.
ru: Не допускается использование этого атрибута для этого элемента языка. Атрибуты сборки необходимо присоединять к объявлению "do ()" (при необходимости внутри модуля F#).
tr: Bu öznitelik, bu dil öğesinde kullanılmak için geçerli değil. Bütünleştirilmiş kod öznitelikleri, bir 'do ()' bildirimine, gerekirse F# modülü içine iliştirilmelidir.
zh_hans: 对此语言元素使用此特性无效。如有需要，应将程序集特性附加到 F# 模块中的“do ()”声明。
zh_hant: 這個屬性不能用在這個語言項目上。組件屬性應該附加到 'do ()' 宣告 (如果 F# 模組中需要的話)。

# tcAttributeIsNotValidForLanguageElement
source: This attribute is not valid for use on this language element
cs: Tento atribut není platný pro použití u tohoto elementu jazyka.
de: Dieses Attribut ist für dieses Sprachelement nicht gültig.
es: Este atributo no es válido para usarlo en este elemento de lenguaje.
fr: L'utilisation de cet attribut n'est pas valide sur cet élément de langage
it: Attributo non valido per l'utilizzo in questo elemento del linguaggio
ja: この言語要素では、この属性を使用できません
ko: 이 특성은 이 언어 요소에 사용할 수 없습니다.
pl: Ten atrybut jest nieprawidłowy do użycia w tym elemencie języka
pt_br: Este atributo não é válido para ser usado neste elemento de linguagem
ru: Не допускается использование этого атрибута для этого элемента языка
tr: Bu öznitelik, bu dil öğesinde kullanılmak için geçerli değil
zh_hans: 对此语言元素使用此特性无效
zh_hant: 這個屬性不能用在這個語言項目上

# tcOptionalArgumentsCannotBeUsedInCustomAttribute
source: Optional arguments cannot be used in custom attributes
cs: Nepovinné argumenty se u vlastních atributů použít nedají.
de: Optionale Argumente dürfen nicht für benutzerdefinierte Attribute verwendet werden.
es: No se pueden usar argumentos opcionales en atributos personalizados.
fr: Impossible d'utiliser les arguments facultatifs dans les attributs personnalisés
it: Non è possibile usare argomenti facoltativi in attributi personalizzati
ja: カスタム属性にはオプションの引数を使用できません
ko: 선택적 인수는 사용자 지정 특성에 사용할 수 없습니다.
pl: Argumenty opcjonalne nie mogą być używane w atrybutach niestandardowych
pt_br: Argumentos opcionais não podem ser usados em atributos personalizados
ru: Необязательные аргументы не могут использоваться в пользовательских атрибутах
tr: İsteğe bağlı bağımsız değişkenler özel özniteliklerde kullanılamaz
zh_hans: 自定义特性中不能使用可选参数
zh_hant: 選擇性的引數不能用在自訂屬性中

# tcPropertyCannotBeSet0
source: This property cannot be set
cs: Tato vlastnost se nedá nastavit.
de: Diese Eigenschaft kann nicht festgelegt werden.
es: Esta propiedad no se puede establecer.
fr: Impossible de définir cette propriété
it: Non è possibile impostare questa proprietà
ja: このプロパティは設定できません
ko: 이 속성은 설정할 수 없습니다.
pl: Nie można ustawić tej właściwości
pt_br: Esta propriedade não pode ser definida
ru: Это свойство задать нельзя
tr: Bu özellik ayarlanamaz
zh_hans: 无法设置此属性
zh_hant: 無法設定這個屬性

# tcPropertyOrFieldNotFoundInAttribute
source: This property or field was not found on this custom attribute type
cs: Tato vlastnost nebo pole se u tohoto typu vlastního atributu nenašla.
de: Diese Eigenschaft bzw. dieses Feld wurde in diesem benutzerdefinierten Attributtyp nicht gefunden.
es: No se encontró esta propiedad o campo en este tipo de atributo personalizado.
fr: Impossible de trouver cette propriété ou ce champ dans ce type d'attribut personnalisé
it: La proprietà o il campo non è stato trovato in questo tipo di attributo personalizzato
ja: このカスタム属性型に、このプロパティまたはフィールドが見つかりませんでした
ko: 이 속성 또는 필드를 이 사용자 지정 특성 형식에서 찾을 수 없습니다.
pl: Nie odnaleziono tej właściwości pola w tym niestandardowym typie atrybutu
pt_br: Esta propriedade ou campo não foram encontrados neste tipo de atributo personalizado
ru: Данное свойство или поле не было найдено в этом пользовательском типе атрибута
tr: Bu özellik veya alan bu özel öznitelik türünde bulunamadı
zh_hans: 未在此自定义特性类型中找到此属性或字段
zh_hant: 在這個自訂屬性類型上找不到這個屬性或欄位

# tcCustomAttributeMustBeReferenceType
source: A custom attribute must be a reference type
cs: Vlastní atribut musí být odkazového typu.
de: Ein benutzerdefiniertes Attribut muss ein Verweistyp sein.
es: Un atributo personalizado debe ser un tipo de referencia.
fr: Un attribut personnalisé doit être un type référence
it: Un attributo personalizzato deve essere un tipo di riferimento
ja: カスタム属性は参照型にする必要があります
ko: 사용자 지정 특성은 참조 형식이어야 합니다.
pl: Atrybut niestandardowy musi mieć typ odwołania
pt_br: Um atributo personalizado deve ser um tipo de referência
ru: Пользовательский атрибут должен являться ссылочным типом
tr: Özel öznitelik başvuru türünde olmalıdır
zh_hans: 自定义特性必须是引用类型
zh_hant: 自訂屬性必須是參考類型

# tcCustomAttributeArgumentMismatch
source: The number of args for a custom attribute does not match the expected number of args for the attribute constructor
cs: Počet argumentů pro vlastní atribut neodpovídá očekávanému počtu argumentů pro konstruktor atributu.
de: Die Anzahl der Argumente für ein benutzerdefiniertes Attribut stimmt nicht mit der erwarteten Argumentzahl für den Attributkonstruktor überein.
es: El número de argumentos para un atributo personalizado no coincide con el número esperado de argumentos para el constructor de atributo.
fr: Le nombre d'arguments d'un attribut personnalisé ne correspond pas au nombre attendu d'arguments du constructeur d'attribut
it: Il numero di argomenti per un attributo personalizzato non corrisponde al numero di argomenti previsti per il costruttore di attributo
ja: カスタム属性の引数の数は、属性コンストラクターの引数に必要な数と一致しません
ko: 사용자 지정 특성에 대한 인수 수가 특성 생성자에 필요한 인수 수와 일치하지 않습니다.
pl: Liczba argumentów atrybutu niestandardowego nie jest zgodna z oczekiwaną liczbą argumentów konstruktora atrybutów
pt_br: O número de argumentos de um atributo personalizado não corresponde ao número de argumentos esperado para o construtor de atributos
ru: Количество аргументов пользовательского атрибута не совпадает с требуемым числом аргументов для конструктора атрибутов
tr: Özel bir özniteliğin bağımsız değişken sayısı öznitelik oluşturucusunun beklenen bağımsız değişken sayısı ile eşleşmiyor
zh_hans: 自定义特性的参数数目与特性构造函数所需的参数数目不匹配
zh_hant: 自訂屬性的引數數目不符合屬性建構函式預期的引數數目

# tcCustomAttributeMustInvokeConstructor
source: A custom attribute must invoke an object constructor
cs: Vlastní atribut musí vyvolat konstruktor objektu.
de: Ein benutzerdefiniertes Attribut muss einen Objektkonstruktor aufrufen.
es: Un atributo personalizado debe invocar a un constructor de objeto.
fr: Un attribut personnalisé doit appeler un constructeur d'objet
it: Un attributo personalizzato deve richiamare un costruttore di oggetto
ja: カスタム属性はオブジェクト コンストラクターを呼び出す必要があります
ko: 사용자 지정 특성은 개체 생성자를 호출해야 합니다.
pl: Atrybut niestandardowy musi wywoływać konstruktora obiektów
pt_br: Um atributo personalizado deve chamar um construtor de objeto
ru: Пользовательский атрибут должен вызывать конструктор объекта
tr: Özel öznitelik nesne oluşturucusunu çağırmalıdır
zh_hans: 自定义特性必须调用对象构造函数
zh_hant: 自訂屬性必須叫用物件建構函式

# tcAttributeExpressionsMustBeConstructorCalls
source: Attribute expressions must be calls to object constructors
cs: Výrazy atributu musí být volání konstruktorů objektů.
de: Attributausdrücke müssen Aufrufe von Objektkonstruktoren sein.
es: Las expresiones de atributo deben ser llamadas a constructores de objeto.
fr: Les expressions d'attribut doivent être des appels aux constructeurs d'objets
it: Le espressioni attributo devono costituire chiamate a costruttori di oggetto
ja: 属性式は、オブジェクト コンストラクターに対する呼び出しにしてください
ko: 특성 식은 개체 생성자에 대한 호출이어야 합니다.
pl: Wyrażenia atrybutów muszą być wywołaniami konstruktorów obiektów
pt_br: Expressões de atributo devem ser chamadas para construtores de objeto
ru: Выражения атрибутов должны вызывать конструкторы объектов
tr: Öznitelik ifadeleri nesne oluşturucu çağrısı olmalıdır
zh_hans: 特性表达式必须是对对象构造函数的调用
zh_hant: 屬性運算式必須是對物件建構函式的呼叫

# tcUnsupportedAttribute
source: This attribute cannot be used in this version of F#
cs: Tento atribut se v této verzi F# nedá použít.
de: Dieses Attribut kann in dieser Version von F# nicht verwendet werden.
es: Este atributo no se puede usar en esta versión de F#.
fr: Impossible d'utiliser cet attribut dans cette version de F#
it: Non è possibile usare questo attributo in questa versione di F#
ja: このバージョンの F# では、この属性を使用できません
ko: 이 특성은 이 버전의 F#에서 사용할 수 없습니다.
pl: Ten atrybut nie może być używany w tej wersji języka F#
pt_br: Este atributo não pode ser usado nesta versão de F#
ru: Данный атрибут не может быть использован в этой версии F#
tr: Bu öznitelik F# dilinin bu sürümünde kullanılamaz
zh_hans: 不能在此版本的 F# 中使用该特性
zh_hant: 這個屬性不能用在這個版本的 F# 中

# tcInvalidInlineSpecification
source: Invalid inline specification
cs: Neplatná vložená specifikace
de: Ungültige Inlinespezifikation
es: Especificación inline no válida.
fr: Spécification inline non valide
it: Specifica inline non valida
ja: インラインの指定が無効です
ko: 인라인 지정이 잘못되었습니다.
pl: Nieprawidłowa wbudowana specyfikacja
pt_br: Especificação embutida inválida
ru: Недопустимая встроенная спецификация
tr: Geçersiz satır içi belirtim
zh_hans: 内联规范无效
zh_hant: 無效的內嵌規格

# tcInvalidUseBinding
source: 'use' bindings must be of the form 'use <var> = <expr>'
cs: Vazby use musí být ve formátu use <proměnná> = <výraz>.
de: "use"-Bindungen müssen das Format "use <var> = <expr>" aufweisen.
es: Los enlaces de "use" deben tener el formato "use <var> = <expr>"
fr: Les liaisons 'use' doivent être de la forme 'use <var> = <expr>'
it: Il formato dei binding 'use' deve essere 'use <var> = <expr>'
ja: 'use' バインディングの形式は 'use <var> = <expr>' でなければなりません
ko: 'use' 바인딩은 'use <var> = <expr>' 형식이어야 합니다.
pl: Powiązania „use” muszą mieć postać „use <zmienna> = <wyrażenie>”
pt_br: as associações 'use' devem ser da forma 'use <var> = <expr>'
ru: Привязки 'use' должны иметь вид 'use <var> = <expr>'
tr: 'use' bağlamaları 'use <var> = <expr>' biçiminde olmalıdır
zh_hans: "use" 绑定必须采用 "use <var> = <expr>" 形式
zh_hant: 'use' 繫結的形式必須為 'use <var> = <expr>'

# tcAbstractMembersIllegalInAugmentation
source: Abstract members are not permitted in an augmentation - they must be defined as part of the type itself
cs: Abstraktní členové se v rozšíření nepovolují – musí se definovat v samotném typu.
de: Abstrakte Member sind in einer Augmentation nicht zulässig, sondern müssen als Teil des Typs selbst definiert werden.
es: No se permiten miembros abstractos en un aumento; deben definirse como parte del propio tipo.
fr: Les membres abstraits ne sont pas autorisés dans une augmentation. Ils doivent être définis dans le cadre du type lui-même
it: Membri astratti non consentiti in un aumento. È necessario definirli come parte del tipo stesso
ja: 拡張に抽象メンバーは使用できません。型の一部として定義する必要があります。
ko: 추상 멤버는 확대에서 허용되지 않으며 형식 자체의 일부로 정의해야 합니다.
pl: Abstrakcyjne elementy członkowskie nie są dozwolone w rozszerzeniu — muszą być zdefiniowane w ramach samego typu
pt_br: Membros abstratos não são permitidos em um aumento, eles devem ser definidos como parte do tipo por eles mesmos
ru: Использование абстрактных элементов в приращении не допускается; такие элементы должны быть определены непосредственно в самом типе
tr: Genişletmede soyut üyelere izin verilmez; bunlar türün kendi parçası olarak tanımlanmalıdır
zh_hans: 扩大中不允许使用抽象成员 - 必须将它们定义为类型本身的一部分
zh_hant: 不允許在增強指定中使用抽象成員，必須將它們定義為類型自身的一部分

# tcMethodOverridesIllegalHere
source: Method overrides and interface implementations are not permitted here
cs: Přepsání metod a implementace rozhraní tady nejsou povolené.
de: Methodenüberschreibungen und Schnittstellenimplementierungen sind an dieser Stelle nicht zulässig.
es: Aquí no se permiten invalidaciones de método ni implementaciones de interfaz.
fr: Les substitutions de méthodes et les implémentations d'interfaces ne sont pas autorisées ici
it: Override di metodo e implementazioni di interfaccia non consentiti in questa posizione
ja: ここでメソッドのオーバーライドおよびインターフェイスの実装は許可されていません
ko: 메서드 재정의 및 인터페이스 구현은 여기에 허용되지 않습니다.
pl: Przesłonięcia metod i implementacje interfejsów nie są tutaj dozwolone
pt_br: Substituições de método e implementações de interface não são permitidas aqui
ru: Переопределения методов и реализации интерфейсов здесь не разрешаются
tr: Burada metot geçersiz kılmalara ve arabirim uygulamalarına izin verilmez
zh_hans: 此处不允许使用方法重写和接口实现
zh_hant: 此處不允許方法覆寫和介面實作

# tcNoMemberFoundForOverride
source: No abstract or interface member was found that corresponds to this override
cs: Nenašel se žádný abstraktní člen nebo člen rozhraní, který by odpovídal tomuto přepsání.
de: Es wurde keine abstrakter Member und kein Schnittstellenmember gefunden, der dieser Überschreibung entspricht.
es: No se encontró ningún miembro abstracto o de interfaz que corresponda a esta invalidación.
fr: Impossible de trouver un membre abstrait ou membre d'interface qui corresponde à cette substitution
it: Nessun membro astratto o di interfaccia trovato corrispondente all'override
ja: このオーバーライドに対応する抽象メンバーまたはインターフェイス メンバーが見つかりませんでした
ko: 이 재정의에 해당하는 추상 또는 인터페이스 멤버를 찾을 수 없습니다.
pl: Nie odnaleziono abstrakcyjnych elementów członkowskich lub elementów członkowskich interfejsu odpowiadających temu przesłonięciu
pt_br: Nenhum membro abstrato ou de interface que corresponde a esta substituição foi localizado
ru: Не было найдено ни одного абстрактного элемента либо элемента интерфейса, соответствующего данному переопределению
tr: Bu geçersiz kılmaya karşılık gelen bir soyut üye veya arabirim üyesi bulunamadı
zh_hans: 未找到与此重写对应的抽象或接口成员
zh_hant: 找不到對應到這個覆寫的抽象或介面成員

# tcOverrideArityMismatch
source: This override takes a different number of arguments to the corresponding abstract member. The following abstract members were found:{0}
cs: Toto přepsání přebírá jiný počet argumentů vzhledem k odpovídajícímu abstraktnímu členovi. Našli se následující abstraktní členové: {0}
de: Diese Überschreibung akzeptiert eine andere Anzahl von Argumenten als der entsprechende abstrakte Member. Die folgenden abstrakten Members wurden gefunden: {0}
es: Esta invalidación toma un número diferente de argumentos para el miembro abstracto correspondiente. Se han encontrado los siguientes miembros abstractos: {0}
fr: Cette substitution n'accepte pas le même nombre d'arguments que le membre abstrait correspondant. Les membres abstraits suivants ont été trouvés : {0}
it: Questo override accetta un numero di argomenti diverso rispetto al membro astratto corrispondente. Sono stati trovati i membri astratti seguenti: {0}
ja: このオーバーライドでは、対応する抽象メンバーに対して異なる数の引数を使用しています。次の抽象メンバーが見つかりました: {0}
ko: 이 재정의는 해당하는 추상 멤버와 다른 수의 인수를 사용합니다. 다음 추상 멤버를 찾았습니다. {0}
pl: To przesłonięcie pobiera inną liczbę argumentów niż odpowiedni abstrakcyjny element członkowski. Znaleziono następujące abstrakcyjne elementy członkowskie: {0}
pt_br: Esta substituição obteve um número de argumentos diferente do membro abstrato correspondente. Os seguintes membros abstratos foram encontrados:{0}
ru: Это переопределение передает другое число аргументов соответствующему абстрактному элементу. Найдены следующие абстрактные элементы: {0}.
tr: Bu geçersiz kılma, karşılık gelen soyut üyeden farklı sayıda bağımsız değişken alıyor. Şu soyut üyeler bulundu: {0}
zh_hans: 此替代使用的参数数量与对应的抽象成员的数量不同。找到以下抽象成员: {0}
zh_hant: 這項覆寫會針對對應的抽象成員，採用不同數目的引數。找到下列抽象成員: {0}

# tcDefaultImplementationAlreadyExists
source: This method already has a default implementation
cs: Tato metoda už má výchozí implementaci.
de: Für diese Methode ist bereits eine Standardimplementierung vorhanden.
es: Este método ya tiene una implementación predeterminada.
fr: Cette méthode a déjà une implémentation par défaut
it: Questo metodo dispone già di un'implementazione predefinita
ja: このメソッドには既に既定の実装があります
ko: 이 메서드에 이미 기본 구현이 있습니다.
pl: Ta metoda ma już domyślną implementację
pt_br: Este método já tem uma implementação padrão
ru: Этот метод уже имеет реализацию по умолчанию
tr: Bu metodun zaten varsayılan uygulaması var
zh_hans: 此方法已具有默认实现
zh_hant: 這個方法已經有預設實作

# tcDefaultAmbiguous
source: The method implemented by this default is ambiguous
cs: Metoda implementovaná touto výchozí třídou je nejednoznačná.
de: Die von dieser Standardimplementierung implementierte Methode ist nicht eindeutig.
es: El método implementado por este valor predeterminado es ambiguo.
fr: La méthode implémentée par cette valeur par défaut est ambiguë
it: Il metodo implementato da questa implementazione predefinita è ambiguo
ja: この既定で実装されたメソッドはあいまいです
ko: 이 기본값으로 구현된 메서드가 모호합니다.
pl: Metoda zaimplementowana w tym elemencie jest niejednoznaczna
pt_br: O método implementado por este padrão é ambíguo
ru: Метод, реализованный этим вариантом по умолчанию, является неоднозначным
tr: Bu varsayılan tarafından uygulanan metot belirsiz
zh_hans: 此默认值实现的方法具有多义性
zh_hant: 這個預設所實作的方法模稜兩可

# tcNoPropertyFoundForOverride
source: No abstract property was found that corresponds to this override
cs: Nenašla se žádná abstraktní vlastnost, která by odpovídala tomuto přepsání.
de: Es wurde kein abstrakte Eigenschaft gefunden, die dieser Überschreibung entspricht.
es: No se encontró ninguna propiedad abstracta que corresponda a esta invalidación.
fr: Impossible de trouver une propriété abstraite qui corresponde à cette substitution
it: Nessuna proprietà astratta trovata corrispondente all'override
ja: このオーバーライドに対応する抽象プロパティが見つかりませんでした
ko: 이 재정의에 해당하는 추상 속성을 찾을 수 없습니다.
pl: Nie odnaleziono żadnej właściwości abstrakcyjnej odpowiadającej temu przesłonięciu
pt_br: Nenhuma propriedade abstrata que corresponde a esta substituição foi encontrada
ru: Не было найдено ни одного абстрактного свойства, соответствующего данному переопределению
tr: Bu geçersiz kılmaya karşılık gelen bir soyut özellik bulunamadı
zh_hans: 未找到与此重写对应的抽象属性
zh_hant: 找不到對應到這個覆寫的抽象屬性

# tcAbstractPropertyMissingGetOrSet
source: This property overrides or implements an abstract property but the abstract property doesn't have a corresponding {0}
cs: Tato hodnota přepisuje nebo implementuje abstraktní vlastnost, která ale nemá odpovídající metodu {0}.
de: Diese Eigenschaft überschreibt oder implementiert eine abstrakte Eigenschaft, aber für die abstrakte Eigenschaft ist kein(e) entsprechende(r/s) {0} vorhanden.
es: Esta propiedad invalida o implementa una propiedad abstracta que no tiene un {0} correspondiente.
fr: Cette propriété substitue ou implémente une propriété abstraite mais cette dernière n'a pas de {0} correspondant
it: Questa proprietà esegue l'override o l'implementazione di una proprietà astratta, tuttavia quest'ultima non dispone di un elemento {0} corrispondente
ja: このプロパティは、抽象プロパティをオーバーライドまたは実装しますが、抽象プロパティには対応する {0} がありません
ko: 이 속성은 추상 속성을 재정의하거나 구현하지만 추상 속성에 해당하는 {0}이(가) 없습니다.
pl: Ta właściwość przesłania właściwość abstrakcyjną lub zawiera jej implementację, ale właściwość abstrakcyjna nie ma odpowiedniego elementu {0}
pt_br: Esta propriedade substitui ou implementa uma propriedade abstrata, mas esta não possui uma correspondência {0}
ru: Это свойство переопределяет или реализует абстрактное свойство, однако абстрактное свойство не имеет соответствующего {0}
tr: Bu özellik, soyut bir özelliği geçersiz kılıyor veya uyguluyor ancak bu soyut özelliğe karşılık gelen bir {0} yok
zh_hans: 此属性会重写或实现一个抽象属性，但该抽象属性没有相应的 {0}
zh_hant: 這個屬性會覆寫或實作抽象屬性，但抽象屬性沒有對應的 {0}

# tcInvalidSignatureForSet
source: Invalid signature for set member
cs: Neplatná signatura pro člena sady
de: Ungültige Signatur für festgelegten Member.
es: Signatura no válida para un miembro set.
fr: Signature non valide pour le membre défini
it: Firma non valida per membro set
ja: set メンバーのシグネチャが無効です
ko: 집합 멤버의 시그니처가 잘못되었습니다.
pl: Nieprawidłowa sygnatura elementu członkowskiego ustawiania
pt_br: Assinatura para configuração de membro inválida
ru: Недопустимая сигнатура для элемента множества
tr: Küme üyesi için geçersiz imza
zh_hans: 集成员的签名无效
zh_hant: 無效的集合成員簽章
