Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# keywordDescriptionCast
source: Converts a type to type that is higher in the hierarchy.
cs: Převede daný typ na typ, který je výše v hierarchii.
de: Konvertiert einen Typ in einen Typen, der in der Hierarchie höher ist.
es: Convierte un tipo en otro de un nivel superior de la jerarquía.
fr: Convertit un type en type supérieur dans la hiérarchie.
it: Converte un tipo nel tipo che occupa una posizione più alta nella gerarchia.
ja: 型を階層の上位にある型に変換します。
ko: 계층 구조에서 더 높은 형식으로 형식을 변환합니다.
pl: Konwertuje typ na typ znajdujący się wyżej w hierarchii.
pt_br: Converte um tipo em um tipo em posição superior na hierarquia.
ru: Преобразует тип в тип, находящийся выше в иерархии.
tr: Bir türü hiyerarşide daha yukarıdaki bir türe dönüştürür.
zh_hans: 将某类型转换为较高层次结构中的类型。
zh_hant: 將類型轉換為階層中較高的類型。

# keywordDescriptionDynamicCast
source: Converts a type to a type that is lower in the hierarchy.
cs: Převede daný typ na typ, který je níže v hierarchii.
de: Konvertiert einen Typ in einen Typen, der in der Hierarchie niedriger ist.
es: Convierte un tipo en otro de un nivel inferior de la jerarquía.
fr: Convertit un type en type inférieur dans la hiérarchie.
it: Converte un tipo in un tipo che occupa una posizione più bassa nella gerarchia.
ja: 型を階層の下位にある型に変換します。
ko: 계층 구조에서 더 낮은 형식으로 형식을 변환합니다.
pl: Konwertuje typ na typ znajdujący się niżej w hierarchii.
pt_br: Converte um tipo em um tipo em posição inferior na hierarquia.
ru: Преобразует тип в тип, находящийся ниже в иерархии.
tr: Bir türü hiyerarşide daha aşağıdaki bir türe dönüştürür.
zh_hans: 将某类型转换为较低层次结构中的类型。
zh_hant: 將類型轉換為階層中較低的類型。

# keywordDescriptionTypedQuotation
source: Delimits a typed code quotation.
cs: Odděluje citaci typového kódu.
de: Begrenzt ein typisiertes Codezitat.
es: Delimita una expresión de código con tipo.
fr: Délimite une quotation de code typé.
it: Delimita una quotation di codice tipizzato.
ja: 型指定されたコード引用符を区切ります。
ko: 형식이 지정된 코드 인용을 구분합니다.
pl: Ogranicza typizowany cytat kodu.
pt_br: Delimita uma citação tipada do código.
ru: Отделяет типизированную цитату кода.
tr: Türü belirtilmiş kod alıntısını ayırır.
zh_hans: 分隔类型化代码引用。
zh_hant: 分隔具型別的程式碼引號。

# keywordDescriptionUntypedQuotation
source: Delimits a untyped code quotation.
cs: Odděluje citaci netypového kódu
de: Begrenzt ein nicht typisiertes Codezitat.
es: Delimita una expresión de código sin tipo.
fr: Délimite une quotation de code non typé.
it: Delimita una quotation di codice non tipizzato.
ja: 型指定のないコード引用符を区切ります。
ko: 형식이 지정되지 않은 코드 인용을 구분합니다.
pl: Ogranicza nietypizowany cytat kodu.
pt_br: Delimita uma citação não tipada do código.
ru: Отделяет нетипизированную цитату кода.
tr: Türü belirtilmemiş kod alıntısını ayırır.
zh_hans: 分隔非类型化代码引用。
zh_hant: 分隔不具型別的程式碼引號。

# itemNotFoundDuringDynamicCodeGen
source: {0} '{1}' not found in assembly '{2}'. A possible cause may be a version incompatibility. You may need to explicitly reference the correct version of this assembly to allow all referenced components to use the correct version.
cs: {0} {1} – nenašlo se v sestavení {2}. Možnou příčinou může být nekompatibilita verzí. Možná budete muset vytvořit explicitní odkaz na správnou verzi tohoto sestavení, abyste zajistili, že ji budou používat všechny odkazované součásti.
de: {0} "{1}" wurde in Assembly "{2}" nicht gefunden. Mögliche Ursache ist eine Versionsinkompatibilität. Möglicherweise müssen Sie die richtige Version dieser Assembly explizit referenzieren, damit alle referenzierten Komponenten die richtige Version benutzen können.
es: {0} "{1}" no se encuentra en el ensamblado "{2}". La razón puede ser una incompatibilidad de versiones. Es posible que tenga que hacer referencia explícitamente a la versión correcta de este ensamblado para permitir que todos los componentes a los que se hace referencia usen la versión correspondiente.
fr: {0} '{1}' introuvable dans l'assembly '{2}'. Cela est peut-être dû à une incompatibilité de version. Vous devrez peut-être référencer explicitement la version appropriée de cet assembly pour permettre à tous les composants référencés d'utiliser la version nécessaire.
it: L'elemento {0} '{1}' non è stato trovato nell'assembly '{2}'. Il problema potrebbe essere causato da versioni incompatibili. Per consentire a tutti i componenti di riferimento di usare la versione corretta, potrebbe essere necessario fare riferimento alla versione corretta.
ja: {0} '{1}' がアセンブリ '{2}' に見つかりません。バージョンの互換性がないことが原因の可能性があります。すべての参照コンポーネントが正しいバージョンを使用できるように、このアセンブリの正しいバージョンを明示的に参照しなければならない可能性があります。
ko: {2}' 어셈블리에서 {0} '{1}'을(를) 찾을 수 없습니다. 가능한 원인은 버전이 호환되지 않기 때문일 수 있습니다. 참조된 모든 구성 요소에서 올바른 버전을 사용할 수 있게 하려면 이 어셈블리의 올바른 버전을 명시적으로 참조해야 할 수 있습니다.
pl: Nie znaleziono elementu {0} „{1}” w zestawie „{2}”. Możliwa przyczyna to niezgodność wersji. Być może trzeba jawnie odwołać się do prawidłowej wersji tego zestawu, aby zezwolić wszystkim przywoływanym składnikom na użycie prawidłowej wersji.
pt_br: {0} '{1}' não encontrado no assembly '{2}'. Uma possível causa seria uma incompatibilidade de versão. Talvez seja necessário fazer uma referência explicitamente à versão correta deste assembly para permitir que todos os componentes referenciados possam utilizar a versão correta.
ru: {0} "{1}" не найден в сборке "{2}". Это может быть вызвано несовместимостью версий. Вам может потребоваться явно сослаться на правильную версию этой сборки, чтобы ее могли использовать все указанные в ссылке компоненты.
tr: {2}' bütünleştirilmiş kodunda {0} '{1}' bulunamadı. Bunun nedeni sürüm uyumsuzluğu olabilir. Başvurulan tüm bileşenlerin doğru sürümü kullanmasına izin vermek için bu bütünleştirilmiş kodun doğru sürümüne açıkça başvurmanız gerekebilir.
zh_hans: {0} 程序集“{2}”中找不到“{1}”。可能的原因或许是版本不兼容。可能需要显式引用此程序集的正确版本，以便所有引用的组件都能使用正确的版本。
zh_hant: 組件 '{2}' 中找不到 {0} '{1}'。可能的原因為版本不相容。您可能需要明確參考此組件的正確版本，以允許所有參考的元件使用正確的版本。

# itemNotFoundInTypeDuringDynamicCodeGen
source: {0} '{1}' not found in type '{2}' from assembly '{3}'. A possible cause may be a version incompatibility. You may need to explicitly reference the correct version of this assembly to allow all referenced components to use the correct version.
cs: {0} {1} – nenašlo se v typu {2} ze sestavení {3}. Možnou příčinou může být nekompatibilita verzí. Možná budete muset vytvořit explicitní odkaz na správnou verzi tohoto sestavení, abyste zajistili, že ji budou používat všechny odkazované součásti.
de: {0} "{1}" wurde in Typ "{2} von Assembly "{3}" nicht gefunden. Mögliche Ursache ist eine Versionsinkompatibilität. Möglicherweise müssen Sie die richtige Version dieser Assembly explizit referenzieren, damit alle referenzierten Komponenten die richtige Version benutzen können.
es: {0} "{1}" no se encuentra en el tipo "{2}" del ensamblado "{3}". La razón puede ser una incompatibilidad de versiones. Es posible que tenga que hacer referencia explícitamente a la versión correcta de este ensamblado para permitir que todos los componentes a los que se hace referencia usen la versión correspondiente.
fr: {0} '{1}' introuvable dans le type '{2}' de l'assembly '{3}'. Cela est peut-être dû à une incompatibilité de version. Vous devrez peut-être référencer explicitement la version appropriée de cet assembly pour permettre à tous les composants référencés d'utiliser la version nécessaire.
it: L'elemento {0} '{1}' non è stato trovato nel tipo '{2}' dell'assembly '{3}'. Il problema potrebbe essere causato da versioni incompatibili. Per consentire a tutti i componenti di riferimento di usare la versione corretta, potrebbe essere necessario fare riferimento alla versione corretta.
ja: {0} '{1}' がアセンブリ '{3}' の '{2}' 型に見つかりません。バージョンの互換性がないことが原因の可能性があります。すべての参照コンポーネントが正しいバージョンを使用できるように、このアセンブリの正しいバージョンを明示的に参照しなければならない可能性があります。
ko: {3}' 어셈블리의 '{2}' 형식에서 {0} '{1}'을(를) 찾을 수 없습니다. 가능한 원인은 버전이 호환되지 않기 때문일 수 있습니다. 참조된 모든 구성 요소에서 올바른 버전을 사용할 수 있게 하려면 이 어셈블리의 올바른 버전을 명시적으로 참조해야 할 수 있습니다.
pl: Nie znaleziono elementu {0} „{1}” w typie „{2}” z zestawu „{3}”. Możliwa przyczyna to niezgodność wersji. Być może trzeba jawnie odwołać się do prawidłowej wersji tego zestawu, aby zezwolić wszystkim przywoływanym składnikom na użycie prawidłowej wersji.
pt_br: {0} '{1}' não encontrado no tipo '{2}' do assembly '{3}'. Uma possível causa seria uma incompatibilidade de versão. Talvez seja necessário fazer uma referência explicitamente à versão correta deste assembly para permitir que todos os componentes referenciados utilizem a versão correta.
ru: {0} "{1}" не найден в типе "{2}" из сборки "{3}". Это может быть вызвано несовместимостью версий. Вам может потребоваться явно сослаться на правильную версию этой сборки, чтобы ее могли использовать все указанные в ссылке компоненты.
tr: {3}' bütünleştirilmiş kodundaki '{2}' türünde {0} '{1}' bulunamadı. Bunun nedeni sürüm uyumsuzluğu olabilir. Başvurulan tüm bileşenlerin doğru sürümü kullanmasına izin vermek için bu bütünleştirilmiş kodun doğru sürümüne açıkça başvurmanız gerekebilir.
zh_hans: {0} 从程序集“{3}”的类型“{2}”中找不到“{1}”。可能的原因或许是版本不兼容。可能需要显式引用此程序集的正确版本，以便所有引用的组件都能使用正确的版本。
zh_hant: 組件 '{3}' 的類型 '{2}' 中找不到 {0} '{1}'。可能的原因為版本不相容。您可能需要明確參考此組件的正確版本，以允許所有參考的元件使用正確的版本。

# descriptionWordIs
source: is
cs: je
de: ist
es: es
fr: est
it: è
ja: は
ko: 은(는)
pl: jest
ru: является
tr: olan
zh_hans: 是
zh_hant: 是

# notAFunction
source: This value is not a function and cannot be applied.
cs: Tato hodnota není funkcí a nedá se použít.
de: Dieser Wert ist keine Funktion und kann nicht angewendet werden.
es: Este valor no es una función y no se puede aplicar.
fr: Cette valeur n'est pas une fonction et ne peut pas être appliquée.
it: Questo valore non è una funzione e non può essere applicato.
ja: この値は関数ではないため、適用できません。
ko: 이 값은 함수가 아니며 적용할 수 없습니다.
pl: Ta wartość nie jest funkcją i nie można jej zastosować.
pt_br: Este valor não é uma função e não pode ser aplicado.
ru: Это значение не является функцией, и применить его невозможно.
tr: Bu değer, bir işlev değil ve uygulanamaz.
zh_hans: 此值不是一个函数，无法应用。
zh_hant: 此值不是函式，無法套用。

# notAFunctionButMaybeIndexerWithName
source: This value is not a function and cannot be applied. Did you intend to access the indexer via {0}.[index] instead?
cs: Tato hodnota není funkcí a nedá se použít. Nechtěli jste místo toho získat k indexeru přístup přes {0}.[index]?
de: Dieser Wert ist keine Funktion und kann nicht angewendet werden. Wollten Sie auf den Indexer stattdessen über "{0}.[index]" zugreifen?
es: Este valor no es una función y no se puede aplicar. ¿Pretendía tener acceso al indexador a través de {0}.[index] en su lugar?
fr: Cette valeur n'est pas une fonction et ne peut pas être appliquée. Souhaitiez-vous accéder à l'indexeur via {0}.[index] ?
it: Questo valore non è una funzione e non può essere applicato. Si intendeva accedere all'indicizzatore tramite la sintassi {0}.[indice]?
ja: この値は関数ではないため、適用できません。そうではなく、{0}.[index] によってインデクサーにアクセスしようとしましたか?
ko: 이 식은 함수가 아니며 적용할 수 없습니다. 대신 {0}.[index]를 통해 인덱서에 액세스하려고 했나요?
pl: Ta wartość nie jest funkcją i nie można jej zastosować. Czy zamiast tego zamierzano uzyskać dostęp do indeksatora przy użyciu formatu {0}.[indeks]?
pt_br: Este valor não é uma função e não pode ser aplicado. Você pretendia acessar o indexador por meio do {0}.[index] como alternativa?
ru: Это значение не является функцией, и применить его невозможно. Вы хотели обратиться к индексатору с помощью {0}.[индекс]?
tr: Bu değer, bir işlev değil ve uygulanamaz. Dizin oluşturucuya bunun yerine {0}.[index] üzerinden erişmeye mi çalışıyordunuz?
zh_hans: 此值不是一个函数，无法应用。是否曾打算改为通过 {0}.[index] 访问索引器?
zh_hant: 此值並非函式，因而無法套用。您要改用 {0}.[index] 來存取索引子嗎?

# notAFunctionButMaybeIndexer
source: This expression is not a function and cannot be applied. Did you intend to access the indexer via expr.[index] instead?
cs: Tento výraz není funkcí a nedá se použít. Nechtěli jste místo toho získat k indexeru přístup přes expr.[index]?
de: Dieser Ausdruck ist keine Funktion und kann nicht angewendet werden. Wollten Sie auf den Indexer stattdessen über "expr.[index]" zugreifen?
es: Esta expresión no es una función y no se puede aplicar. ¿Pretendía tener acceso al indexador a través de expr.[index] en su lugar?
fr: Cette expression n'est pas une fonction et ne peut pas être appliquée. Souhaitiez-vous accéder à l'indexeur via expr.[index] ?
it: Questa espressione non è una funzione e non può essere applicata. Si intendeva accedere all'indicizzatore tramite la sintassi espressione.[indice]?
ja: この式は関数ではないため、適用できません。そうではなく、expr.[index] によってインデクサーにアクセスしようとしましたか?
ko: 이 식은 함수가 아니며 적용할 수 없습니다. 대신 expr.[index]를 통해 인덱서에 액세스하려고 했나요?
pl: To wyrażenie nie jest funkcją i nie można go zastosować. Czy zamiast tego zamierzano uzyskać dostęp do indeksatora przy użyciu formatu wyrażenie.[indeks]?
pt_br: Esta expressão não é uma função e não pode ser aplicada. Você pretendia acessar o indexador por meio do expr.[index] como alternativa?
ru: Это выражение не является функцией, и применить его невозможно. Вы хотели обратиться к индексатору с помощью <выражение>.[индекс]?
tr: Bu ifade, bir işlev değil ve uygulanamaz. Dizin oluşturucuya bunun yerine expr.[index] üzerinden erişmeye mi çalışıyordunuz?
zh_hans: 此值不是一个函数，无法应用。是否曾打算改为通过 expr.[index] 访问索引器?
zh_hant: 此運算式並非函式，因而無法套用。您要改用 expr.[index] 來存取索引子嗎?

# notAFunctionButMaybeDeclaration
source: This value is not a function and cannot be applied. Did you forget to terminate a declaration?
cs: Tato hodnota není funkce a nedá se použít. Nezapomněli jste ukončit deklaraci?
de: Dieser Wert ist keine Funktion und kann nicht angewendet werden. Wurde möglicherweise eine Deklaration nicht abgeschlossen?
es: Este valor no es una función y no se puede aplicar. ¿Olvidó terminar una declaración?
fr: Cette valeur n'est pas une fonction et ne peut pas être appliquée. Avez-vous oublié de terminer une déclaration ?
it: Questo valore non è una funzione e non può essere applicato. Potrebbe essere presente una dichiarazione non terminata.
ja: この値は関数ではないため、適用できません。宣言を終結しましたか?
ko: 이 값은 함수가 아니며 적용할 수 없습니다. 선언을 종료해야 합니다.
pl: Ta wartość nie jest funkcją i nie można jej zastosować. Czy deklaracja została zakończona?
pt_br: Este valor não é uma função e não pode ser aplicado. Você esqueceu de finalizar a declaração?
ru: Данное значение не является функцией и не может быть применено. Забыли завершить объявление?
tr: Bu değer bir işlev değil ve uygulanamaz. Bir bildirimi sonlandırmayı mı unuttunuz?
zh_hans: 此值不是一个函数，无法应用。您是否忘记结束某个声明?
zh_hant: 這個值不是函式，無法套用。您是不是忘記終止宣告了?

# ArgumentsInSigAndImplMismatch
source: The argument names in the signature '{0}' and implementation '{1}' do not match. The argument name from the signature file will be used. This may cause problems when debugging or profiling.
cs: Názvy argumentů v signatuře {0} a implementaci {1} si neodpovídají. Použije se název argumentu ze souboru signatury. To může způsobit problémy při ladění nebo profilování.
de: Die Argumentnamen in Signatur "{0}" und Implementierung "{1}" stimmen nicht überein. Der Argumentname aus der Signaturdatei wird verwendet. Dadurch können Probleme beim Debuggen oder bei der Profilerstellung auftreten.
es: Los nombres de argumento en la firma "{0}" y la implementación "{1}" no coinciden. Se utilizará el nombre del argumento desde el archivo de firma. Esto puede causar problemas durante la depuración o la generación de perfiles.
fr: Les noms d'arguments dans la signature '{0}' et l'implémentation '{1}' ne correspondent pas. Le nom d'argument du fichier de signature va être utilisé. Cela peut entraîner des problèmes durant le débogage ou le profilage.
it: I nomi degli argomenti nella firma '{0}' e nell'implementazione '{1}' non corrispondono. Verrà usato il nome dell'argomento del file di firma. Questa situazione potrebbe causare problemi durante il debug o la profilatura.
ja: シグネチャ '{0}' と実装 '{1}' の引数の名前が一致しません。シグネチャ ファイルの引数の名前が使用されます。デバッグまたはプロファイルするときに問題が生じる原因となる可能性があります。
ko: 시그니처 '{0}'과(와) 구현 '{1}'의 인수 이름이 일치하지 않습니다. 시그니처 파일의 인수 이름이 사용됩니다. 이로 인해 디버깅 또는 프로파일링 시 문제가 발생할 수 있습니다.
pl: Nazwy argumentów w podpisie „{0}” i implementacji „{1}” nie są zgodne. Używana będzie nazwa argumentu z pliku podpisu. Może to spowodować problemy podczas debugowania lub profilowania.
pt_br: Os nomes de argumento na assinatura '{0}' e na implementação '{1}' não coincidem. O nome do argumento do arquivo da assinatura será usado. Isso pode causar problemas durante a depuração ou a criação de perfil.
ru: Имена аргументов в сигнатуре "{0}" и реализации "{1}" не совпадают. Будет использоваться имя аргумента из файла сигнатуры. Это может вызвать проблемы при отладке или профилировании.
tr: {0}' imzası ve '{1}' uygulaması içindeki bağımsız değişken adları eşleşmiyor. İmza dosyasındaki bağımsız değişken adı kullanılacak. Bu, hata ayıklama veya profil oluşturma sırasında sorunlara neden olabilir.
zh_hans: 签名“{0}”和实现“{1}”中的参数名称不匹配。将使用签名文件中的参数名称。在进行调试或分析时这可能会导致问题。
zh_hant: 特徵標記 '{0}' 和實作 '{1}' 中的引數名稱不相符。將會使用特徵標記檔案中的引數名稱。這可能會在偵錯或分析時造成問題。

# pickleUnexpectedNonZero
source: An error occurred while reading the F# metadata of assembly '{0}'. A reserved construct was utilized. You may need to upgrade your F# compiler or use an earlier version of the assembly that doesn't make use of a specific construct.
cs: Při čtení metadat jazyka F# sestavení {0} došlo k chybě. Byl použit rezervovaný konstruktor. Je možné, že budete muset upgradovat kompilátor jazyka F# nebo použít dřívější verzi sestavení, ve které se nevyužívá konkrétní konstruktor.
de: Fehler beim Lesen der F#-Metadaten der Assembly "{0}". Es wurde ein reserviertes Konstrukt verwendet. Möglicherweise müssen Sie Ihren F#-Compiler aktualisieren oder eine frühere Version der Assembly verwenden, die dieses spezielle Konstrukt nicht verwendet.
es: Se produjo un error al leer los metadatos de F# del ensamblado "{0}". Se utilizó una construcción reservada. Puede que deba actualizar su compilador de F# o usar una versión anterior del ensamblado que no haga uso de una construcción específica.
fr: Une erreur s'est produite durant la lecture des métadonnées F# de l'assembly '{0}'. Une construction réservée a été utilisée. Vous devrez peut-être mettre à niveau votre compilateur F# ou utiliser une version antérieure de l'assembly qui ne fait pas appel à une construction spécifique.
it: Si è verificato un errore durante la lettura dei metadati F# dell'assembly '{0}'. È stato utilizzato un costrutto riservato. Potrebbe essere necessario aggiornare il compilatore F# o usare una versione precedente dell'assembly che non usa un costrutto specifico.
ja: アセンブリ '{0}' の F# メタデータ の読み取り中にエラーが発生しました。予約済みのコンストラクトが使用されました。F# コンパイラをアップグレードするか、特定のコンストラクトを使用しない以前のバージョンのアセンブリを使用しなければならない場合があります。
ko: '{0}' 어셈블리의 F# 메타데이터를 읽는 동안 오류가 발생했습니다. 예약 구문이 활용되었습니다. F# 컴파일러를 업그레이드하거나 특정 구문을 사용하지 않는 이전 버전의 어셈블리를 사용해야 할 수 있습니다.
pl: Wystąpił błąd podczas odczytu metadanych języka F# z zestawu „{0}”. Została wykorzystana zarezerwowana konstrukcja. Może być konieczne uaktualnienie kompilatora języka F# lub użycie wcześniejszej wersji zestawu, która nie wykorzystuje określonej konstrukcji.
pt_br: Ocorreu um erro ao ler os metadados F# do assembly '{0}'. Foi utilizada um constructo reservado. Talvez seja necessário atualizar seu compilador F# ou usar uma versão anterior do assembly que não faça uso de um constructo específico.
ru: Произошла ошибка при чтении метаданных F# сборки "{0}". Использовалась зарезервированная конструкция. Попробуйте обновить компилятор F# или применить более раннюю версию сборки, где конкретная конструкция не используется.
tr: '{0}' bütünleştirilmiş kodunun F# meta verileri okunurken bir hata oluştu. Ayrılmış bir yapı kullanıldı. F# derleyicinizi yükseltmeniz veya bütünleştirilmiş kodun belirli bir yapıyı kullanmayan daha eski bir sürümünü kullanmanız gerekebilir.
zh_hans: 读取程序集“{0}”的 F# 元数据时出错。使用了保留的构造。可能需要升级 F# 编译器或使用不用特定构造的较早版本的程序集。
zh_hant: 讀取組件 '{0}' 的 F# 中繼資料時發生錯誤。已使用保留的建構。建議您升級 F# 編譯器，或使用不會用特定建構的舊版組件。

# tcTupleMemberNotNormallyUsed
source: This method or property is not normally used from F# code, use an explicit tuple pattern for deconstruction instead.
cs: Tato metoda nebo vlastnost se obvykle z kódu F# nepoužívá, použijte místo toho pro dekonstrukci explicitní vzor řazené kolekce členů.
de: Diese Methode oder Eigenschaft wird normalerweise nicht im F#-Code verwendet. Nutzen Sie stattdessen zur Dekonstruktion ein explizites Tupelmuster.
es: Este método o propiedad no se utiliza normalmente desde código F#, use un modelo de tupla explícito para la deconstrucción en su lugar.
fr: Normalement, cette méthode ou propriété n'est pas utilisée dans le code F#. Utilisez plutôt un modèle de tuple explicite pour la déconstruction.
it: Questo metodo o questa proprietà non è in genere usato dal codice F#. Per la decostruzione usare invece un criterio di tupla esplicito.
ja: このメソッドまたはプロパティは通常、F# コードから使用されません。代わりに、明示的なタプル パターンを分解に使用してください。
ko: 이 메서드 또는 속성은 일반적으로 F# 코드에서 사용되지 않습니다. 대신 분해에 대해 명시적 튜플 패턴을 사용하세요.
pl: Ta metoda lub właściwość nie jest zwykle używana z kodu języka F#. Zamiast tego do dekonstrukcji użyj jawnego wzorca krotki.
pt_br: Essa propriedade ou esse método normalmente não é usado no código F#. Use um padrão de tupla explícito para a desconstrução.
ru: Этот метод или свойство обычно не используется в коде F#. Вместо этого используйте явный шаблон кортежа для деконструкции.
tr: Bu metot veya özellik normalde F# kodundan kullanılmaz, bunun yerine ayrıştırma için açıkça bir demet deseni kullanın.
zh_hans: 通常不通过 F# 代码使用此方法或属性，而是改用显式元组模式进行析构。
zh_hant: F# 程式碼不常使用這個方法或屬性，請改用明確的元組模式進行解構。
