Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# abImplicitHeapAllocation
source: The mutable local '{0}' is implicitly allocated as a reference cell because it has been captured by a closure. This warning is for informational purposes only to indicate where implicit allocations are performed.
cs: Místní proměnná {0} se implicitně přiděluje jako odkazovaná buňka, protože ji zachytilo zavření. Toto upozornění slouží jenom k informativním účelům a ukazuje, kde k implicitním přidělením dochází.
de: Die änderbare lokale Variable "{0}" ist implizit als Verweiszelle zugewiesen, da sie von einem Abschluss erfasst wurde. Diese Warnung dient nur zur Information und soll auf die Ausführungsorte impliziter Zuweisungen hinweisen.
es: La variable local mutable "{0}" se asignó implícitamente como celda de referencia porque se capturó mediante una clausura. Esta advertencia solo tiene fines informativos e indica dónde se realizan las asignaciones implícitas.
fr: Le mutable local '{0}' est implicitement alloué en tant que cellule de référence, car il a été capturé par une clôture. Cet avertissement est fourni à titre d'information uniquement pour indiquer l'emplacement où les allocations implicites sont effectuées.
it: Il valore locale modificabile '{0}' è allocato implicitamente come cella di riferimento perché è stato acquisito da una chiusura. Questo avviso viene visualizzato a solo scopo informativo per indicare il punto in cui vengono eseguite allocazioni implicite.
ja: 変更可能なローカル '{0}' がクロージャでキャプチャされているため、参照セルとして暗黙的に割り当てられています。この警告は、情報提供のみの目的で、暗黙的な割り当てを実行する場所を示しています。
ko: 변경할 수 있는 로컬 '{0}'이(가) 암시적으로 참조 셀로 할당되었습니다. 닫기에서 캡처되었기 때문입니다. 이 경고는 정보 제공 목적으로만 발생하며 암시적 할당이 수행되는 위치에 나타납니다.
pl: Modyfikowalna wartość lokalna „{0}” jest niejawnie przydzielona jako komórka odwołania, ponieważ została przechwycona przez zamknięcie. To ostrzeżenie informuje tylko o miejscach, w których są wykonane niejawne operacje przydzielania.
pt_br: O local mutável '{0}' está alocado implicitamente como uma célula de referência porque foi capturado por um fechamento. Este aviso é somente para fins informativos para indicar onde alocações implícitas são executadas.
ru: Локальная изменяемая переменная "{0}" была неявно выделена в качестве ссылочной ячейки, поскольку она попала в замыкание. Это предупреждение отображается только в ознакомительных целях, чтобы указать на неявно определенные выделения.
tr: Değişebilir yerel '{0}' bir kapanış tarafından yakalandığından, örtülü bir biçimde bir başvuru hücresi olarak ayrıldı. Bu uyarı, yalnızca örtülü ayırma işlemlerinin gerçekleştirildiğine dair bilgilendirme amacı taşır.
zh_hans: 可变本地变量“{0}”隐式分配为引用单元格，因为它已由关闭事件捕获。此警告只是为了提供信息，用于指示执行了隐式分配的情况。
zh_hant: 可變動的本機 '{0}' 已隱含地配置為參考儲存格，因為關閉符號已將其擷取。此警告僅供參考，目的是要指出執行隱含配置的位置。

# estApplyStaticArgumentsForMethodNotImplemented
source: A type provider implemented GetStaticParametersForMethod, but ApplyStaticArgumentsForMethod was not implemented or invalid
cs: Zprostředkovatel typu implementuje metodu GetStaticParametersForMethod, ale metoda ApplyStaticArgumentsForMethod se neimplementovala nebo je neplatná.
de: Von einem Typanbieter wurde "GetStaticParametersForMethod" implementiert, aber "ApplyStaticArgumentsForMethod" wurde nicht implementiert oder war ungültig.
es: Un proveedor de tipos implementó GetStaticParametersForMethod, pero ApplyStaticArgumentsForMethod no se implementó o no es válido
fr: Un fournisseur de type a implémenté GetStaticParametersForMethod, mais ApplyStaticArgumentsForMethod n'a pas été implémenté ou est non valide
it: Un provider di tipi ha implementato GetStaticParametersForMethod, ma ApplyStaticArgumentsForMethod non è stato implementato oppure non è valido
ja: 型プロバイダーが GetStaticParametersForMethod を実装しましたが、ApplyStaticArgumentsForMethod は実装されなかったか、無効でした
ko: 형식 공급자는 GetStaticParametersForMethod를 구현하지만 ApplyStaticArgumentsForMethod는 구현되지 않거나 유효하지 않습니다.
pl: Dostawca typów zaimplementował funkcję GetStaticParametersForMethod, lecz funkcja ApplyStaticArgumentsForMethod nie jest zaimplementowana lub jest nieprawidłowa
pt_br: Um provedor de tipos implementado ObterParâmetrosEstáticosParaMétodo, mas AplicarArgumentosEstatísticasParaMétodo não foi implementado ou inválido
ru: Поставщик типов реализовал GetStaticParametersForMethod, но поддержка аргумента ApplyStaticArgumentsForMethod не была реализована или была реализована неправильно
tr: Bir tür sağlayıcısı tarafından GetStaticParametersForMethod uygulandı, ancak ApplyStaticArgumentsForMethod uygulanmadı veya geçersiz
zh_hans: 一个类型提供程序实现了 GetStaticParametersForMethod，但是 ApplyStaticArgumentsForMethod 未实现或无效
zh_hant: 型別提供者已實作 GetStaticParametersForMethod，但 ApplyStaticArgumentsForMethod 未實作或無效

# etErrorApplyingStaticArgumentsToMethod
source: An error occured applying the static arguments to a provided method
cs: Při použití statických argumentů u poskytnuté metody došlo k chybě.
de: Fehler beim Anwenden der statischen Argumente auf eine angegebene Methode.
es: Se produjo un error al aplicar los argumentos estáticos a un método proporcionado
fr: Une erreur s'est produite durant l'application des arguments statiques à une méthode fournie
it: Si è verificato un errore durante l'applicazione degli argomenti statici a un metodo fornito
ja: 静的な引数を指定されたメソッドに適用する際エラーが発生しました
ko: 제공된 메서드에 정적 인수를 적용하는 동안 오류가 발생했습니다.
pl: Wystąpił błąd podczas stosowania argumentów statycznych dla podanej metody
pt_br: Ocorreu um erro ao aplicar os argumentos estáticos para um método fornecido
ru: Произошла ошибка при применении статических аргументов к предоставленному методу
tr: Sağlanan metoda statik bağımsız değişkenler uygulanırken bir sorun oluştu
zh_hans: 将静态参数应用于提供的方法时发生错误
zh_hant: 將靜態引數套用至所提供的方法時，發生錯誤

# pplexUnexpectedChar
source: Unexpected character '{0}' in preprocessor expression
cs: Neočekávaný znak {0} ve výrazu preprocesoru
de: Unerwartetes Zeichen "{0}" im Präprozessorausdruck.
es: Carácter inesperado "{0}" en la expresión de preprocesador
fr: Caractère '{0}' inattendu dans l'expression de préprocesseur
it: Il carattere '{0}' non è previsto nell'espressione per il preprocessore
ja: プリプロセッサの式に予期しない文字 '{0}' があります
ko: 전처리기 식에 예기치 않은 문자 '{0}'이(가) 있습니다.
pl: Nieoczekiwany znak „{0}” w wyrażeniu preprocesora
pt_br: Caractere inesperado '{0}' na expressão do pré-processador
ru: Неожиданный символ "{0}" в выражении препроцессора
tr: Önişlemci ifadesinde beklenmeyen karakter: '{0}'
zh_hans: 预处理器表达式中意外的字符“{0}”
zh_hant: 前置處理器運算式包含未預期的字元 '{0}'

# ppparsUnexpectedToken
source: Unexpected token '{0}' in preprocessor expression
cs: Neočekávaný token {0} ve výrazu preprocesoru
de: Unerwartetes Token "{0}" im Präprozessorausdruck.
es: Token inesperado "{0}" en la expresión de preprocesador
fr: Jeton '{0}' inattendu dans l'expression de préprocesseur
it: Il token '{0}' non è previsto nell'espressione per il preprocessore
ja: プリプロセッサの式に予期しないトークン '{0}' があります
ko: 전처리기 식에 예기치 않은 토큰 '{0}'이(가) 있습니다.
pl: Nieoczekiwany token „{0}” w wyrażeniu preprocesora
pt_br: Token inesperado '{0}' na expressão do pré-processador
ru: Неожиданный токен "{0}" в выражении препроцессора
tr: Önişlemci ifadesinde beklenmeyen belirteç: '{0}'
zh_hans: 预处理器表达式中意外的标记“{0}”
zh_hant: 前置處理器運算式包含未預期的語彙基元 '{0}'

# ppparsIncompleteExpression
source: Incomplete preprocessor expression
cs: Neúplný výraz preprocesoru
de: Unvollständiger Präprozessorausdruck.
es: Expresión de preprocesador incompleta
fr: Expression de préprocesseur incomplète
it: L'espressione per il preprocessore non è valida
ja: 不完全なプリプロセッサの式です
ko: 전처리기 식이 불완전합니다.
pl: Niepełne wyrażenie preprocesora
pt_br: Expressão incompleta do pré-processador
ru: Неполное выражение препроцессора
tr: Eksik önişlemci ifadesi
zh_hans: 不完整的预处理器表达式
zh_hant: 前置處理器運算式不完整

# ppparsMissingToken
source: Missing token '{0}' in preprocessor expression
cs: Chybějící token {0} ve výrazu preprocesoru
de: Fehlendes Token "{0}" im Präprozessorausdruck.
es: Falta el token "{0}" en la expresión de preprocesador
fr: Jeton '{0}' manquant dans l'expression de préprocesseur
it: Nell'espressione per il preprocessore manca il token '{0}'
ja: プリプロセッサの式にトークン '{0}' がありません
ko: 전처리기 식에 토큰 '{0}'이(가) 없습니다.
pl: Brak tokenu „{0}” w wyrażeniu preprocesora
pt_br: Token ausente '{0}' na expressão do pré-processador
ru: Отсутствует токен "{0}" в выражении препроцессора
tr: Önişlemci ifadesinde eksik belirteç: '{0}'
zh_hans: 预处理器表达式中缺少的标记“{0}”
zh_hant: 前置處理器運算式缺少語彙基元 '{0}'

# pickleMissingDefinition
source: An error occurred while reading the F# metadata node at position {0} in table '{1}' of assembly '{2}'. The node had no matching declaration. Please report this warning. You may need to recompile the F# assembly you are using.
cs: Nastala chyba při čtení uzlu metadat F# na pozici {0} v tabulce {1} sestavení {2}. Tento uzel nemá žádnou odpovídající deklaraci. Předejte toto upozornění dál. Sestavení F#, které používáte, může být potřeba znovu kompilovat.
de: Beim Lesen des F#-Metadatenknotens an Position {0} in Tabelle "{1}" von Assembly "{2}" ist ein Fehler aufgetreten. Der Knoten besaß keine übereinstimmende Deklarierung. Melden Sie diese Warnung. Sie müssen die von Ihnen verwendete F#-Assembly möglicherweise neu kompilieren.
es: Error al leer el nodo de metadatos de F# en la posición {0} de la tabla "{1}" del ensamblado "{2}". El nodo no tiene ninguna declaración coincidente. Informe de esta advertencia. Es posible que necesite volver a compilar el ensamblado de F# que está usando.
fr: Une erreur s'est produite lors de la lecture du nœud de métadonnées F# à la position {0} dans la table '{1}' de l'assembly '{2}'. Le nœud n'avait pas de déclaration correspondante. Veuillez signaler cet avertissement. Vous devrez peut-être recompiler l'assembly F# que vous utilisez actuellement.
it: Si è verificato un errore durante la lettura del nodo dei metadati F# alla posizione {0} della tabella '{1}' dell'assembly '{2}'. Il nodo non include una dichiarazione corrispondente. Segnalare la visualizzazione di questo avviso. Potrebbe essere necessario ricompilare l'assembly F# in uso.
ja: F# メタデータ ノードをアセンブリ '{2}' のテーブル '{1}' の位置 {0} で読み取るときにエラーが発生しました。このノードには、一致する宣言がありませんでした。この警告を報告してください。使用している F# アセンブリの再コンパイルが必要になる場合があります。
ko: 어셈블리 '{2}' 테이블 '{1}'의 {0} 위치에서 F# 메타데이터 노드를 읽는 중 오류가 발생했습니다. 노드에 일치하는 선언이 없습니다. 이 경고를 보고해 주세요. 사용하고 있는 F# 어셈블리를 다시 컴파일해야 할 수 있습니다.
pl: Wystąpił błąd podczas odczytu węzła metadanych F# w pozycji {0} tabeli „{1}” zestawu „{2}”. Węzeł nie ma pasującej deklaracji. Zgłoś wystąpienie tego ostrzeżenia. Może być konieczne ponowne skompilowanie używanego zestawu F#.
pt_br: Ocorreu um erro ao ler o nó de metadados F# na posição {0} na tabela '{1}' do assembly '{2}'. O nó não tinha declaração correspondente. Reporte este aviso. Pode ser necessário recompilar o assembly F# que você está usando.
ru: Произошла ошибка при чтении узла метаданных F# в позиции {0} в таблице "{1}" сборки "{2}". В узле отсутствовало соответствующее объявление. Отправьте это предупреждение в отчете. Вам может потребоваться повторно скомпилировать сборку F#, которую вы используете.
tr: {2}' bütünleştirilmiş kodunun '{1}' tablosundaki {0} konumunda bulunan F# meta veri düğümü okunurken bir hata oluştu. Düğüm, eşleşen bildirim içermiyor. Lütfen bu uyarıyı bildirin. Kullandığınız F# bütünleştirilmiş kodunu yeniden derlemeniz gerekebilir.
zh_hans: 于程序集“{2}”的表“{1}”中的位置 {0} 处读取 F# 元数据节点时出错。该节点没有匹配的声明。请报告此警告。你可能需要重新编译正在使用的 F# 程序集。
zh_hant: 讀取組件 '{2}' 的資料表 '{1}' 中位置 {0} 上之 F# 中繼資料節點時發生錯誤。節點沒有相符的宣告。請回報此警告。您可能需要重新編譯正在使用的 F# 組件。

# checkNotSufficientlyGenericBecauseOfScope
source: Type inference caused the type variable {0} to escape its scope. Consider adding an explicit type parameter declaration or adjusting your code to be less generic.
cs: Odvození typu proměnné způsobilo, že se proměnná typu {0} dostala mimo svůj rozsah. Zvažte přidání explicitní deklarace parametru typu nebo upravení kódu, aby byl méně obecný.
de: Ein Typrückschluss hat bewirkt, dass die Typvariable '{0}' ihren Bereich verlassen hat. Fügen Sie ggf. eine explizite Typparameterdeklaration hinzu, oder passen Sie Ihren Code so an, dass er weniger generisch ist.
es: La inferencia de tipos provocó que la variable de tipo {0} saliera de su alcance. Considere agregar una declaración de parámetros de tipo explícitos o ajuste el código para que sea menos genérico.
fr: La variable de type {0} est sortie de sa portée à cause de l'inférence de type. Envisagez d'ajouter une déclaration de paramètre de type explicite ou d'ajuster votre code pour qu'il soit moins générique.
it: A seguito dell'inferenza del tipo, la variabile di tipo {0} non ha rispettato il proprio ambito. Provare ad aggiungere una dichiarazione di parametro di tipo esplicita oppure a modificare il codice in modo che sia meno generico.
ja: 型推論により型変数 {0} はスコープを回避しました。明示的な型パラメーター宣言を追加するか、コードの総称性が低くなるよう調整してください。
ko: 형식 유추로 인해 형식 변수 {0}이(가) 범위를 벗어났습니다. 명시적인 형식 매개 변수 선언을 추가하거나 덜 일반적인 코드로 조정해 보세요.
pl: Wnioskowanie typu spowodowało wyjście zmiennej {0} poza jej zakres. Rozważ dodanie jawnej deklaracji parametru typu lub skorygowanie kodu tak, aby był mniej ogólny.
pt_br: A inferência de tipos causou um escape no escopo da variável de tipo {0}. Considere adicionar uma declaração de parâmetro de tipo explícito ou ajustar seu código para ser menos genérico.
ru: Определение типа привело к выходу за пределы области переменной типа {0}. Попробуйте добавить явное объявление параметра типа или скорректировать код таким образом, чтобы он был менее универсальным.
tr: Tür çıkarımı, {0} tür değişkeninin kapsamından çıkmasına neden oldu. Açık bir tür parametresi bildirimi ekleyebilir ya da kodunuzu ayarlayarak daha az genel hale getirebilirsiniz.
zh_hans: 类型推理使类型变量 {0} 逸出其范围。请考虑添加显示类型参数声明或调整代码使其通用性降低。
zh_hant: 型別推斷會造成型別變數 {0} 溢出其範圍。請考慮加入明確的型別參數宣告，或將您的程式碼調整到低於一般程度。

# checkNotSufficientlyGenericBecauseOfScopeAnon
source: Type inference caused an inference type variable to escape its scope. Consider adding type annotations to make your code less generic.
cs: Odvození typu proměnné způsobilo, že se proměnná typu odvození dostala mimo svůj rozsah. Zvažte přidání anotací typu, aby byl kód méně obecný.
de: Ein Typrückschluss hat bewirkt, dass eine Variable vom Rückschlusstyp ihren Bereich verlassen hat. Fügen Sie ggf. Typanmerkungen hinzu, damit Ihr Code weniger generisch ist.
es: La inferencia de tipos provocó que una variable de tipo de inferencia saliera de su alcance. Considere agregar las anotaciones de tipo para que el código sea menos genérico.
fr: Une variable de type d'inférence est sortie de sa portée à cause de l'inférence de type. Envisagez d'ajouter des annotations de type pour que votre code soit moins générique.
it: A seguito dell'inferenza del tipo, una variabile di inferenza del tipo non ha rispettato il proprio ambito. Per rendere il codice meno generico, provare ad aggiungere annotazioni di tipo.
ja: 型推論により型変数はスコープを回避しました。型の注釈を追加して総称性が低くなるようにしてください。
ko: 형식 유추로 인해 유추 형식 변수가 범위를 벗어났습니다. 형식 주석을 추가하여 덜 일반적인 코드로 만들어 보세요.
pl: Wnioskowanie typu spowodowało wyjście zmiennej typu wnioskowania poza jej zakres. Rozważ dodanie adnotacji typu w celu uczynienia kodu mniej ogólnym.
pt_br: A inferência de tipos causou um escape no escopo de uma variável de tipo de inferência. Considere adicionar anotações de tipo para tornar seu código menos genérico.
ru: Определение типа привело к выходу за пределы области переменной типа определения. Попробуйте добавить аннотации типа, чтобы сделать код менее универсальным.
tr: Tür çıkarımı, bir tür değişkeninin kapsamından çıkmasına neden oldu. Tür açıklamaları ekleyerek kodunuzu daha az genel hale getirebilirsiniz.
zh_hans: 类型推理使推理类型变量逸出其范围。请考虑添加类型批注，使代码通用性降低。
zh_hant: 型別推斷會造成推斷型別變數溢出其範圍。請考慮加入型別附註，可讓您的程式碼低於一般程度。

# checkRaiseFamilyFunctionArgumentCount
source: Redundant arguments are being ignored in function '{0}'. Expected {1} but got {2} arguments.
cs: Redundantní argumenty se ve funkci {0} ignorují. Očekávalo se tolik argumentů: {1}, ale bylo jich {2}.
de: Redundante Argumente werden in der Funktion '{0}' ignoriert. Erwartet wurden {1} Argumente, abgerufen jedoch {2} Argumente.
es: Los argumentos redundantes se omiten en la función "{0}". Se esperaban {1} argumentos, pero se recibieron {2}.
fr: Les arguments redondants sont actuellement ignorés dans la fonction '{0}'. {1} attendu(s), mais {2} argument(s) obtenu(s).
it: Gli argomenti ridondanti verranno ignorati nella funzione '{0}'. Erano previsti {1} argomenti, ma ne sono stati ottenuti {2}.
ja: 冗長な引数は、関数 '{0}' で無視されます。{1} 個の引数が必要ですが、{2} 個の引数があります。
ko: 중복 인수는 함수 '{0}'에서 무시되고 있습니다. {1}(을)를 예상했으나 {2} 인수를 받았습니다.
pl: Nadmiarowe argumenty są ignorowane w funkcji „{0}”. Oczekiwana liczba argumentów: {1}, rzeczywista liczba argumentów: {2}.
pt_br: Argumentos redundantes estão sendo ignorados na função '{0}'. Era esperado {1} mas foi obtido {2} argumentos.
ru: Избыточные аргументы игнорируются в функции "{0}". Ожидался аргумент {1}, но получен аргумент {2}.
tr: {0}' işlevindeki gereksiz bağımsız değişkenler yoksayılıyor. {1} bekleniyordu, ancak {2} bağımsız değişken alındı.
zh_hans: 冗余参数在函数“{0}”中被忽略。期望 {1} 但获得 {2} 参数。
zh_hant: 正在忽略函式 '{0}' 中多餘的引數。預期為 {1} 個引數，但找到 {2} 個。

# checkLowercaseLiteralBindingInPattern
source: Lowercase literal '{0}' is being shadowed by a new pattern with the same name. Only uppercase and module-prefixed literals can be used as named patterns.
cs: Literál malými písmeny {0} je zastíněný novým vzorem se stejným názvem. Jako pojmenované vzory se dají používat literály velkými písmeny, kterým předchází modul.
de: Das Literal in Kleinbuchstaben '{0}' verursacht einen Konflikt mit einem neuen Muster mit dem gleichen Namen. Nur Literale in Großbuchstaben und Literale mit Modulpräfix können als benannte Muster verwendet werden.
es: Un patrón nuevo con el mismo nombre oculta el literal en minúsculas "{0}". Solo los literales en mayúsculas y con prefijo de módulo se pueden utilizar como patrones con nombre.
fr: Le littéral en minuscule '{0}' est actuellement caché par un nouveau modèle du même nom. Seuls les littéraux en majuscule préfixés avec un module peuvent être utilisés comme modèles nommés.
it: Il valore letterale '{0}' verrà nascosto da un nuovo criterio con lo stesso nome. Come criteri denominati è possibile usare solo valori letterali in maiuscolo e che includono un modulo come prefisso.
ja: 小文字のリテラル '{0}' は、同じ名前の新しいパターンによりシャドウされています。大文字かモジュール プレフィックスのリテラルのみ名前付きパターンとして使用できます。
ko: 소문자 리터럴 '{0}'이(가) 이름이 같은 새 패턴에서 섀도 처리되고 있습니다. 모듈이 접두사로 붙은 대문자 리터럴만 명명된 패턴으로 사용될 수 있습니다.
pl: Literał pisany małymi literami „{0}” jest zasłaniany przez nowy wzorzec o tej samej nazwie. Tylko literały pisane wielkimi literami i literały z prefiksem modułu mogą być używane jako wzorce nazwane.
pt_br: O literal em minúsculas '{0}' está sendo ocultado por um novo padrão com o mesmo nome. Somente literais com prefixo de módulo e em maiúsculas podem ser usados como padrões de nomes.
ru: Литерал в нижнем регистре "{0}" скрыт новым шаблоном с тем же именем. Только литералы в верхнем регистре и литералы с модулем в качестве префикса можно использовать в качестве именованного шаблона.
tr: Küçük harf '{0}' değişmez değeri aynı ada sahip yeni bir desen tarafından engelleniyor. Adlandırılmış desenler olarak yalnızca büyük harf ve module ön eki almış değişmez değerler kullanılabilir.
zh_hans: 小写文字“{0}”被具有相同名称的新模式隐藏。只有大写文字和模块作为前缀的文字可以用作命名模式。
zh_hant: 小寫常值 '{0}' 正由名稱相同的新模式所遮蔽。只有大寫及模組前置的常值可做為具名的模式使用。

# tcLiteralDoesNotTakeArguments
source: This literal pattern does not take arguments
cs: V tomto vzoru literálu se nedají zadat argumenty.
de: Dieses Literalmuster nimmt keine Argumente an.
es: Este patrón de literal no toma argumentos.
fr: Ce modèle de littéral n'accepte pas d'arguments
it: Questo criterio di valore letterale non accetta argomenti
ja: このリテラル パターンは引数を使用しません
ko: 이 리터럴 패턴은 인수를 사용하지 않습니다.
pl: Ten wzorzec literału nie przyjmuje argumentów
pt_br: Esse padrão literal não tem argumentos
ru: Этот шаблон литерала не включает аргументы.
tr: Bu sabit değer deseninde bağımsız değişken kullanılamaz
zh_hans: 此文本模式不带有参数
zh_hant: 此常值模式不接受引數

# tcConstructorsIllegalInAugmentation
source: Constructors are not permitted as extension members - they must be defined as part of the original definition of the type
cs: Konstruktory nejsou povolené jako členy rozšíření – musí být definované v rámci původní definice typu.
de: Konstruktoren sind als Erweiterungsmember unzulässig. Sie müssen als Teil der ursprünglichen Definition des Typs definiert werden.
es: No se permiten constructores como miembros de extensión. Deben definirse como parte de la definición original del tipo.
fr: Les constructeurs ne sont pas autorisés en tant que membres d'extension. Ils doivent être définis dans le cadre de la définition d'origine du type
it: I costruttori non sono consentiti come membri di estensione. Devono essere definiti come parte della definizione originale del tipo
ja: コンストラクターは拡張メンバーとして許可されていません - その型の元の定義の一部として定義する必要があります
ko: 생성자는 확장 멤버로 사용할 수 없으며 원래 형식 정의의 일부로 정의되어야 합니다.
pl: Używanie konstruktorów jako elementów członkowskich rozszerzenia jest niedozwolone — należy je zdefiniować w ramach oryginalnej definicji typu
pt_br: Os construtores não são permitidos como membros de extensão - eles devem ser definidos como parte da definição original do tipo
ru: Не допускается использование конструкторов в качестве элементов расширений — они должны быть определены в рамках исходного определения типа.
tr: Oluşturucuların, uzantı üyesi olarak kullanılmalarına izin verilmez. Türün özgün tanımının bir parçası olarak tanımlanmaları gerekir.
zh_hans: 不允许将构造函数作为扩展成员 - 必须将它们定义为类型原始定义的一部分
zh_hant: 建構函式不得是擴充成員 - 其必須在類型的原始定義中定義

# optsInvalidResponseFile
source: Invalid response file '{0}' ( '{1}' )
cs: Neplatný soubor odpovědi {0} ({1})
de: Ungültige Antwortdatei "{0}" ("{1}").
es: Archivo de respuesta no válido: '{0}' ('{1}').
fr: Fichier réponse non valide '{0}' ('{1}')
it: File di risposta '{0}' ('{1}') non valido
ja: 正しくない応答ファイル '{0}' ( '{1}' )
ko: 잘못된 지시 파일 '{0}'('{1}')
pl: Nieprawidłowy plik odpowiedzi „{0}” („{1}”)
pt_br: Arquivo de resposta '{0}' inválido ( '{1}' )
ru: Недопустимый файл ответов "{0}" ("{1}")
tr: Geçersiz yanıt dosyası '{0}' ( '{1}' )
zh_hans: 无效的响应文件“{0}”(“{1}”)
zh_hant: 回應檔 '{0}' ( '{1}' ) 無效

# optsResponseFileNotFound
source: Response file '{0}' not found in '{1}'
cs: Soubor odpovědi {0} se nenašel v {1}.
de: Die Antwortdatei "{0}" wurde in "{1}" nicht gefunden.
es: No se encuentra el archivo de respuesta '{0}' en '{1}'.
fr: Le fichier réponse '{0}' est introuvable dans '{1}'
it: Il file di risposta '{0}' non è stato trovato in '{1}'
ja: 応答ファイル '{0}' が '{1}' にありません
ko: {1}'에서 지시 파일 '{0}'을(를) 찾을 수 없습니다.
pl: Nie można znaleźć pliku odpowiedzi „{0}” w lokalizacji „{1}”
pt_br: Arquivo de resposta '{0}' não encontrado em '{1}'
ru: Файл ответа "{0}" не найден в "{1}".
tr: Yanıt dosyası '{0}', '{1}' içinde bulunamadı
zh_hans: 在“{1}”中找不到响应文件“{0}”
zh_hant: 在 '{1}' 中找不到回應檔 '{0}'
