Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# csIndexArgumentMismatch
source: This indexer expects {0} arguments but is here given {1}
cs: Počet argumentů, které tento indexer očekává, je {0}, ale počet těch, které se mu tady předávají, je {1}.
de: Dieser Indexer erwartet {0} Argumente, erhält hier aber {1}.
es: Este indizador espera {0} argumentos pero aquí se le proporcionan {1}.
fr: Cet indexeur attend {0} arguments mais en reçoit ici {1}
it: L'indicizzatore prevede {0} argomenti, tuttavia ne è stato rilevato un numero pari a {1}
ja: このインデクサーには {0} 個の引数が必要ですが、存在するのは {1} 個です
ko: 이 인덱서에 {0}개의 인수가 필요하지만 여기에서는 {1}개가 지정되었습니다.
pl: Ten indeksator oczekuje argumentów w liczbie {0}, ale podano tutaj argumenty w liczbie {1}
pt_br: Este indexador espera argumentos {0}, mas aqui é dado {1}
ru: Для индексатора требуется аргумент {0}, однако задан аргумент {1}
tr: Bu dizin erişimcisi {0} bağımsız değişkenlerini bekliyor ancak burada {1} verilmiş
zh_hans: 此索引器需要 {0} 个参数，而此处给定了 {1} 个参数
zh_hant: 這個索引子需要 {0} 個引數，但此處指定了 {1} 個

# csExpectTypeWithOperatorButGivenFunction
source: Expecting a type supporting the operator '{0}' but given a function type. You may be missing an argument to a function.
cs: Očekává se typ podporující operátor {0}, ale předává se typ funkce. Možná, že u funkce chybí argument.
de: Ein unterstützender Typ für den Operator "{0}" wurde erwartet, aber ein Funktionstyp wurde empfangen. Möglicherweise fehlt ein Argument für eine Funktion.
es: Se espera un tipo que admita el operador '{0}', pero se ha proporcionado un tipo de función. Quizá falta un argumento en una función.
fr: Un type prenant en charge l'opérateur '{0}' est attendu mais un type de fonction a été reçu. Il manque peut-être un argument à une fonction.
it: È previsto un tipo che supporti l'operatore '{0}', tuttavia è specificato un tipo di funzione. Probabilmente manca un argomento in una funzione.
ja: 演算子 '{0}' をサポートし、特定の関数型である型が必要です。関数に対する引数が足りない可能性があります。
ko: '{0}' 연산자를 지원하는 형식이 필요하지만 함수 형식이 지정되었습니다. 함수에 대한 인수가 없을 수 있습니다.
pl: Oczekiwany jest typ obsługujący operator „{0}”, ale podano typ funkcji. Być może brakuje argumentu funkcji.
pt_br: Um tipo que suporte o operador '{0}' era esperado, mas um tipo de função foi recebido. Pode estar faltando um argumento para alguma função.
ru: Требуется тип, поддерживающий оператор "{0}", однако задан тип функции. Возможно, отсутствует аргумент функции.
tr: '{0}' işlecini destekleyen bir tür bekleniyor ancak bir işlev türü verildi. Bir işlevde bağımsız değişkeniniz eksik olabilir.
zh_hans: 应为支持运算符“{0}”的类型，但给定的是函数类型。可能缺少函数的参数。
zh_hant: 必須是支援運算子 '{0}' 的類型，但提供的卻是函式類型。您可能遺漏函式的引數。

# csExpectTypeWithOperatorButGivenTuple
source: Expecting a type supporting the operator '{0}' but given a tuple type
cs: Očekává se typ podporující operátor {0}, ale předává se typ řazené kolekce členů.
de: Ein unterstützender Typ für den Operator '{0}' wurde erwartet, aber ein Tupeltyp wurde empfangen
es: Se espera un tipo que admita el operador '{0}', pero se ha proporcionado un tipo de tupla.
fr: Un type prenant en charge l'opérateur '{0}' est attendu, mais un type tuple a été reçu
it: È previsto un tipo che supporti l'operatore '{0}', tuttavia è specificato un tipo di tuple
ja: 演算子 '{0}' をサポートする型が必要ですが、タプル型が指定されました
ko: '{0}' 연산자를 지원하는 형식이 필요한데 튜플 형식을 지정했습니다.
pl: Oczekiwany jest typ obsługujący operator „{0}”, ale podano typ krotki
pt_br: Um tipo que suporte o operador '{0}' era esperado, mas um tipo de tupla foi recebido.
ru: Ожидался тип, поддерживающий оператор "{0}", однако указан кортежный тип
tr: '{0}' işlecini destekleyen bir tür bekleniyor ancak bir demet türü verildi.
zh_hans: 需要一个支持运算符“{0}”的类型，但提供的是元组类型
zh_hant: 必須是支援運算子 '{0}' 的型別，但指定的是元組型別

# csTypesDoNotSupportOperator
source: None of the types '{0}' support the operator '{1}'
cs: Žádný z typů {0} nepodporuje operátor {1}.
de: Der Operator '{1}' wird von keinem der Typen '{0}' unterstützt
es: Ninguno de los tipos '{0}' admite el operador '{1}'
fr: Aucun des types '{0}' ne prend en charge l'opérateur '{1}'
it: Nessuno dei tipi '{0}' supporta l'operatore '{1}'
ja: 型 '{0}' はいずれも演算子 '{1}' をサポートしていません
ko: {0}' 형식에서 '{1}' 연산자를 지원하지 않습니다.
pl: Żaden z typów „{0}” nie obsługuje operatora „{1}”
pt_br: Nenhum dos tipos '{0}' oferece suporte ao operador '{1}'
ru: Ни один из типов "{0}" не поддерживает оператор "{1}"
tr: {0}' türlerinin hiçbiri '{1}' işlecini desteklemez
zh_hans: 任何类型“{0}”都不支持运算符“{1}”
zh_hant: 類型 '{0}' 都不支援運算子 '{1}'

# csTypeDoesNotSupportOperator
source: The type '{0}' does not support the operator '{1}'
cs: Typ {0} nepodporuje operátor {1}.
de: Der Operator '{1}' wird vom Typ '{0}' nicht unterstützt
es: El tipo '{0}' no admite el operador '{1}'.
fr: Le type '{0}' ne prend pas en charge l'opérateur '{1}'
it: Il tipo '{0}' non supporta l'operatore '{1}'
ja: 型 '{0}' は演算子 '{1}' をサポートしていません
ko: {0}' 형식은 '{1}' 연산자를 지원하지 않습니다.
pl: Typ „{0}” nie obsługuje operatora „{1}”
pt_br: O tipo '{0}' não oferece suporte ao operador '{1}'
ru: Тип "{0}" не поддерживает оператор "{1}"
tr: {0}' türü '{1}' işlecini desteklemez
zh_hans: 类型“{0}”不支持运算符“{1}”
zh_hant: 類型 '{0}' 不支援運算子 '{1}'

# csTypesDoNotSupportOperatorNullable
source: None of the types '{0}' support the operator '{1}'. Consider opening the module 'Microsoft.FSharp.Linq.NullableOperators'.
cs: Žádný z typů {0} nepodporuje operátor {1}. Zvažte otevření modulu Microsoft.FSharp.Linq.NullableOperators.
de: Der Operator '{1}' wird von keinem der Typen '{0}' unterstützt. Möglicherweise sollte das Modul 'Microsoft.FSharp.Linq.NullableOperators' geöffnet werden.
es: Ninguno de los tipos '{0}' admite el operador '{1}'. Considere abrir el módulo 'Microsoft.FSharp.Linq.NullableOperators'.
fr: Aucun des types '{0}' ne prend en charge l'opérateur '{1}'. Envisagez d'ouvrir le module 'Microsoft.FSharp.Linq.NullableOperators'.
it: Nessun tipo '{0}' supporta l'operatore '{1}'. Provare ad aprire il modulo 'Microsoft.FSharp.Linq.NullableOperators'.
ja: 型 '{0}' はいずれも演算子 '{1}' をサポートしていません。'Microsoft.FSharp.Linq.NullableOperators' モジュールを開いてください。
ko: {0}' 형식에서 '{1}' 연산자를 지원하지 않습니다. 'Microsoft.FSharp.Linq.NullableOperators' 모듈을 열어 보세요.
pl: Żaden z typów „{0}” nie obsługuje operatora „{1}”. Rozważ otwarcie modułu „Microsoft.FSharp.Linq.NullableOperators”.
pt_br: Nenhum dos tipos '{0}' oferece suporte ao operador '{1}'. Considere abrir o módulo 'Microsoft.FSharp.Linq.NullableOperators'.
ru: Ни один из типов "{0}" не поддерживает оператор "{1}". Попробуйте открыть модуль Microsoft.FSharp.Linq.NullableOperators.
tr: {0}' türlerinin hiçbiri '{1}' işlecini desteklemez. 'Microsoft.FSharp.Linq.NullableOperators' modülünü açmayı düşünün.
zh_hans: 任何类型“{0}”都不支持运算符“{1}”。请考虑打开模块“Microsoft.FSharp.Linq.NullableOperators”。
zh_hant: 類型 '{0}' 都不支援運算子 '{1}'。請考慮開啟模組 'Microsoft.FSharp.Linq.NullableOperators'。

# csTypeDoesNotSupportOperatorNullable
source: The type '{0}' does not support the operator '{1}'. Consider opening the module 'Microsoft.FSharp.Linq.NullableOperators'.
cs: Typ {0} nepodporuje operátor {1}. Zvažte otevření modulu Microsoft.FSharp.Linq.NullableOperators.
de: Der Operator '{1}' wird vom Typ '{0}' nicht unterstützt. Möglicherweise sollte das Modul 'Microsoft.FSharp.Linq.NullableOperators' geöffnet werden.
es: El tipo '{0}' no admite el operador '{1}'. Considere abrir el módulo 'Microsoft.FSharp.Linq.NullableOperators'.
fr: Le type '{0}' ne prend pas en charge l'opérateur '{1}'. Ouvrez le module 'Microsoft.FSharp.Linq.NullableOperators'.
it: Il tipo '{0}' non supporta l'operatore '{1}'. Provare ad aprire il modulo 'Microsoft.FSharp.Linq.NullableOperators'.
ja: 型 '{0}' は演算子 '{1}' をサポートしていません。'Microsoft.FSharp.Linq.NullableOperators' モジュールを開いてください。
ko: {0}' 형식은 '{1}' 연산자를 지원하지 않습니다. 'Microsoft.FSharp.Linq.NullableOperators' 모듈을 열어 보세요.
pl: Typ „{0}” nie obsługuje operatora „{1}”. Rozważ otwarcie modułu „Microsoft.FSharp.Linq.NullableOperators”.
pt_br: O tipo '{0}' não oferece suporte ao operador '{1}'. Considere abrir o módulo 'Microsoft.FSharp.Linq.NullableOperators'.
ru: Тип "{0}" не поддерживает оператор "{1}". Попробуйте открыть модуль Microsoft.FSharp.Linq.NullableOperators.
tr: {0}' türü '{1}' işlecini desteklemez. 'Microsoft.FSharp.Linq.NullableOperators' modülünü açmayı düşünün.
zh_hans: 类型“{0}”不支持运算符“{1}”。请考虑打开模块“Microsoft.FSharp.Linq.NullableOperators”。
zh_hant: 類型 '{0}' 不支援運算子 '{1}'。請考慮開啟模組 'Microsoft.FSharp.Linq.NullableOperators'。

# csTypeDoesNotSupportConversion
source: The type '{0}' does not support a conversion to the type '{1}'
cs: Typ {0} nepodporuje převod na typ {1}.
de: Der Typ "{0}" unterstützt die Konvertierung in den Typ "{1}" nicht.
es: El tipo '{0}' no admite una conversión al tipo '{1}'.
fr: Le type '{0}' ne prend pas en charge une conversion vers le type '{1}'
it: Il tipo '{0}' non supporta una conversione nel tipo '{1}'
ja: 型 '{0}' は型 '{1}' への変換をサポートしていません
ko: {0}' 형식은 '{1}' 형식으로의 변환을 지원하지 않습니다.
pl: Typ „{0}” nie obsługuje konwersji do typu „{1}”
pt_br: O tipo '{0}' não suporta conversão para o tipo '{1}'
ru: Тип "{0}" не поддерживает преобразование в тип "{1}"
tr: {0}' türü '{1}' türüne dönüşümü desteklemez
zh_hans: 类型“{0}”不支持转换为类型“{1}”
zh_hant: 類型 '{0}' 不支援轉換成類型 '{1}'

# csMethodFoundButIsStatic
source: The type '{0}' has a method '{1}' (full name '{2}'), but the method is static
cs: Typ {0} má metodu {1} (celý název je {2}), ale ta je statická.
de: Der Typ "{0}" enthält die {1}-Methode (vollständiger Name "{2}"), die Methode ist aber statisch.
es: El tipo '{0}' tiene un método '{1}' (nombre completo '{2}'), pero el método es estático.
fr: Le type '{0}' a une méthode '{1}' (nom complet '{2}'), mais la méthode est statique
it: Il tipo '{0}' ha un metodo '{1}' (nome completo '{2}'), tuttavia il metodo è statico
ja: 型 '{0}' にメソッド '{1}' (フル ネームは '{2}') がありますが、メソッドは静的です
ko: {0}' 형식에 '{1}' 메서드(전체 이름: '{2}')가 있지만 정적 메서드입니다.
pl: Typ „{0}” ma metodę „{1}” (pełna nazwa „{2}”), ale metoda jest statyczna
pt_br: O tipo '{0}' possui um método '{1}' (nome completo '{2}'), mas o método é estático
ru: Тип "{0}" содержит метод "{1}" (полное имя "{2}"), являющийся статическим
tr: {0}' türünün '{1}' metodu var (tam adı '{2}'), ancak bu metot statik
zh_hans: 类型“{0}”具有方法“{1}”(全名为“{2}”)，但此方法是静态的
zh_hant: 類型 '{0}' 有方法 '{1}' (完整名稱 '{2}')，但這個方法是靜態的

# csMethodFoundButIsNotStatic
source: The type '{0}' has a method '{1}' (full name '{2}'), but the method is not static
cs: Typ {0} má metodu {1} (celý název je {2}), ale ta není statická.
de: Der Typ "{0}" enthält die {1}-Methode (vollständiger Name "{2}"), die Methode ist aber nicht statisch.
es: El tipo '{0}' tiene un método '{1}' (nombre completo '{2}'), pero el método no es estático.
fr: Le type '{0}' a une méthode '{1}' (nom complet '{2}'), mais la méthode n'est pas statique
it: Il tipo '{0}' ha un metodo '{1}' (nome completo '{2}'), tuttavia il metodo non è statico
ja: 型 '{0}' にメソッド '{1}' (フル ネームは '{2}') がありますが、メソッドは静的ではありません
ko: {0}' 형식에 '{1}' 메서드(전체 이름: '{2}')가 있지만 정적 메서드가 아닙니다.
pl: Typ „{0}” ma metodę „{1}” (pełna nazwa „{2}”), ale metoda nie jest statyczna
pt_br: O tipo '{0}' possui um método '{1}' (nome completo '{2}'), mas o método não é estático
ru: Тип "{0}" содержит метод "{1}" (полное имя "{2}"), не являющийся статическим
tr: {0}' türünün '{1}' metodu var (tam adı '{2}'), ancak bu metot statik değil
zh_hans: 类型“{0}”具有方法“{1}”(全名为“{2}”)，但此方法不是静态的
zh_hant: 類型 '{0}' 有方法 '{1}' (完整名稱 '{2}')，但這個方法不是靜態的

# csStructConstraintInconsistent
source: The constraints 'struct' and 'not struct' are inconsistent
cs: Omezení struct a not struct jsou nekonzistentní.
de: Die Einschränkungen "struct" und "not struct" sind nicht konsistent.
es: Las restricciones 'struct' y 'not struct' son incoherentes.
fr: Les contraintes 'struct' et 'not struct' ne sont pas cohérentes
it: I vincoli 'struct' e 'not struct' sono incoerenti
ja: 'struct' および 'not struct' という制約は矛盾しています
ko: 제약 조건 'struct'와 'not struct'는 서로 일관되지 않습니다.
pl: Ograniczenia „struct” i „not struct” nie są spójne
pt_br: As restrições 'struct' e 'not struct' são inconsistentes
ru: Противоречивые ограничения "struct" и "not struct"
tr: 'struct' ve 'not struct' kısıtlamaları tutarsız
zh_hans: 约束“struct”和“not struct”不一致
zh_hant: 條件約束 'struct' 與 'not struct' 不一致

# csTypeDoesNotHaveNull
source: The type '{0}' does not have 'null' as a proper value
cs: Typ {0} nemá null jako správnou hodnotu.
de: Der Typ "{0}" weist nicht NULL als eigenen Wert auf.
es: El tipo '{0}' no tiene 'null' como un valor apropiado.
fr: Le type '{0}' n'a pas la valeur 'null' comme valeur appropriée
it: Il tipo '{0}' non prevede 'null' come valore valido
ja: 型 '{0}' に 'null' は使用できません
ko: '{0}' 형식은 적절한 값으로 'null'을 가지지 않습니다.
pl: Typ „{0}” nie ma wartości „null” jako właściwej wartości
pt_br: O tipo '{0}' não possui 'null' como valor adequado
ru: Тип "{0}" не содержит собственное значение "null"
tr: '{0}' türünde uygun değer olarak 'null' yoktur
zh_hans: 类型“{0}”未将“null”用作适当的值
zh_hant: 類型 '{0}' 不是用 'null' 做為適當的值

# csNullableTypeDoesNotHaveNull
source: The type '{0}' does not have 'null' as a proper value. To create a null value for a Nullable type use 'System.Nullable()'.
cs: Typ {0} nemá null jako správnou hodnotu. Pokud chcete u typu s možnou hodnotou null vytvořit hodnotu null, použijte System.Nullable().
de: Der Typ '{0}' weist nicht NULL als eigenen Wert auf. Zum Erstellen eines NULL-Werts für einen Typ, der NULL-Werte zulässt, 'System.Nullable()' verwenden.
es: El tipo '{0}' no tiene 'null' como un valor apropiado. Para crear un valor NULL para un tipo que acepta valores NULL, use 'System.Nullable()'.
fr: Le type '{0}' n'a pas la valeur 'null' comme valeur appropriée. Pour créer une valeur null pour un type Nullable, utilisez 'System.Nullable()'.
it: Il tipo '{0}' non prevede 'null' come valore valido. Per creare un valore null per un tipo Nullable utilizzare 'System.Nullable()'.
ja: 型 '{0}' に 'null' は使用できません。Null 許容型に対して null 値を作成するには、'System.Nullable()' を使用します。
ko: '{0}' 형식은 적절한 값으로 'null'을 가지지 않습니다. Nullable 형식에 null 값을 만들려면 'System.Nullable()'을 사용하세요.
pl: Typ „{0}” nie ma wartości „null” jako właściwej wartości. Aby utworzyć wartość null dla typu Nullable, użyj wartości „System.Nullable()”.
pt_br: O tipo '{0}' não possui 'null' como valor adequado. Para criar um valor nulo para um tipo Nullable, use 'System.Nullable()'.
ru: NULL не является собственным значением типа "{0}". Чтобы создать значение NULL для типа, допускающего это значение, используйте структуру System.Nullable().
tr: '{0}' türünün uygun değer olarak bir 'null' değeri yok. Boş değer atanabilir türe bir boş değer atamak için 'System.Nullable()' kullanın.
zh_hans: 类型“{0}”未将“null”用作适当的值。若要为可以为 null 的类型创建 null 值，请使用“System.Nullable()”。
zh_hant: 類型 '{0}' 不是用 'null' 做為適當的值。若要替可為 Null 的類型建立 null 值，請使用 'System.Nullable()'。

# csTypeDoesNotSupportComparison1
source: The type '{0}' does not support the 'comparison' constraint because it has the 'NoComparison' attribute
cs: Typ {0} nepodporuje omezení comparison, protože má atribut NoComparison.
de: Der Typ "{0}" unterstützt die comparison-Einschränkung nicht, weil er das NoComparison-Attribut aufweist.
es: El tipo '{0}' no admite la restricción 'comparison' porque tiene el atributo 'NoComparison'.
fr: Le type '{0}' ne prend pas en charge la contrainte 'comparison', car il a l'attribut 'NoComparison'
it: Il tipo '{0}' non supporta il vincolo 'comparison' perché contiene l'attributo 'NoComparison'
ja: 型 '{0}' は 'NoComparison' 属性があるため、'comparison' 制約をサポートしません
ko: '{0}' 형식은 'NoComparison' 특성을 가지므로 'comparison' 제약 조건을 지원하지 않습니다.
pl: Typ „{0}” nie obsługuje ograniczenia „comparison”, ponieważ ma on atrybut „NoComparison”
pt_br: O tipo '{0}' não suporta a restrição 'comparison' porque ela não possui o atributo 'NoComparison'
ru: Тип "{0}" не поддерживает ограничение "comparison", поскольку содержит атрибут "NoComparison"
tr: '{0}' türünün 'NoComparison' özniteliği olduğu için 'comparison' kısıtlamasını desteklemez
zh_hans: 类型“{0}”不支持“comparison”约束，因为它具有“NoComparison”特性
zh_hant: 類型 '{0}' 不支援 'comparison' 條件約束，因為它有 'NoComparison' 屬性

# csTypeDoesNotSupportComparison2
source: The type '{0}' does not support the 'comparison' constraint. For example, it does not support the 'System.IComparable' interface
cs: Typ {0} nepodporuje omezení comparison. Nepodporuje třeba rozhraní System.IComparable.
de: Der Typ "{0}" unterstützt die comparison-Einschränkung nicht. Beispielsweise unterstützt er die System.IComparable-Schnittstelle nicht.
es: El tipo '{0}' no admite la restricción 'comparison'. Por ejemplo, no admite la interfaz 'System.IComparable'.
fr: Le type '{0}' ne prend pas en charge la contrainte 'comparison'. Par exemple, il ne prend pas en charge l'interface 'System.IComparable'
it: Il tipo '{0}' non supporta il vincolo 'comparison'. Non supporta ad esempio l'interfaccia 'System.IComparable'
ja: 型 '{0}' は 'comparison' 制約をサポートしません。たとえば、'System.IComparable' インターフェイスをサポートしません。
ko: '{0}' 형식은 'comparison' 제약 조건을 지원하지 않습니다. 예를 들어, 이 형식은 'System.IComparable' 인터페이스를 지원하지 않습니다.
pl: Typ „{0}” nie obsługuje ograniczenia „comparison”. Na przykład typ nie obsługuje interfejsu „System.IComparable”
pt_br: O tipo '{0}' não suporta a restrição 'comparison'. Por exemplo, ele não suporta a interface 'System.IComparable'
ru: Тип "{0}" не поддерживает ограничение "comparison". Например, он не поддерживает интерфейс "System.IComparable"
tr: '{0}' türü 'comparison' kısıtlamasını desteklemez. Örneğin, 'System.IComparable' arabirimini desteklemez
zh_hans: 类型“{0}”不支持“comparison”约束。例如，它不支持“System.IComparable”接口
zh_hant: 類型 '{0}' 不支援 'comparison' 條件約束。例如，它不支援 'System.IComparable' 介面

# csTypeDoesNotSupportComparison3
source: The type '{0}' does not support the 'comparison' constraint because it is a record, union or struct with one or more structural element types which do not support the 'comparison' constraint. Either avoid the use of comparison with this type, or add the 'StructuralComparison' attribute to the type to determine which field type does not support comparison
cs: Typ {0} nepodporuje omezení comparison, protože je to záznam, sjednocení nebo struktura aspoň s jedním strukturálním typem prvků, který nepodporuje omezení comparison. Buď se u tohoto typu vyhněte použití comparison, nebo k němu přidejte atribut StructuralComparison a s jeho pomocí určete, který typ pole nepodporuje comparison.
de: Der Typ "{0}" unterstützt die comparison-Einschränkung nicht, weil es sich um einen Datensatz, eine Union oder Struktur mit mindestens einem Strukturelementtyp handelt, der die comparison-Einschränkung nicht unterstützt. Verwenden Sie entweder keinen Vergleich in Verbindung mit diesem Typ, oder fügen Sie dem Typ das StructuralComparison-Attribut hinzu, um festzustellen, von welchem Feldtyp der Vergleich nicht unterstützt wird.
es: El tipo '{0}' no admite la restricción 'comparison' porque es un registro, una unión o un struct con uno o varios tipos de elemento estructural que no admiten la restricción 'comparison'. Evite el uso de la comparación con este tipo o agregue el atributo 'StructuralComparison' al tipo para determinar el tipo de campo que no admite comparación.
fr: Le type '{0}' ne prend pas en charge la contrainte 'comparison', car il s'agit d'un enregistrement, d'une union ou d'une structure avec un ou plusieurs types d'éléments structurels qui ne prennent pas en charge la contrainte 'comparison'. Vous devez soit éviter d'utiliser la comparaison avec ce type, soit ajouter l'attribut 'StructuralComparison' au type pour identifier le type de champ qui ne prend pas en charge la comparaison
it: Il tipo '{0}' non supporta il vincolo 'comparison' perché è un record, un'unione o uno struct con uno o più tipi di elementi strutturali che non supportano il vincolo 'comparison'. Evitare l'uso del confronto con questo tipo oppure aggiungere l'attributo 'StructuralComparison' al tipo per determinare quale tipo di campo non supporta il confronto
ja: 型 '{0}' は、'comparison' 制約をサポートしない 1 個または複数の構造体の要素型を持つレコード、共用体、または構造体なので、'comparison' 制約をサポートしません。この型では comparison を使用しないようにするか、または、comparison をサポートしないフィールド型を決定するために、'StructuralComparison' 属性を型に追加してください。
ko: '{0}' 형식은 'comparison' 제약 조건을 지원하지 않는 하나 이상의 구조적 요소 형식을 포함하는 레코드, 공용 구조체 또는 구조체이므로 'comparison' 제약 조건을 지원하지 않습니다. 이 형식의 경우 비교를 사용하지 말거나 형식에 'StructuralComparison' 특성을 추가하여 비교를 지원하지 않는 필드 형식을 확인하세요.
pl: Typ „{0}” nie obsługuje ograniczenia „comparison”, ponieważ jest rekordem, unią lub strukturą z co najmniej jednym typem elementu strukturalnego, który nie obsługuje ograniczenia „comparison”. Unikaj używania porównania z tym typem lub dodaj atrybut „StructuralComparison” do typu w celu ustalenia, jaki typ pola nie obsługuje porównania
pt_br: O tipo '{0}' não suporta a restrição 'comparison' porque é um registro, união ou struct com um ou mais tipos de elementos estruturais que não suportam a restrição 'comparison'. Evite usar comparação com este tipo, a não ser que você adicione o atributo 'StructuralComparison' ao tipo para determinar qual tipo de campo não suporta comparação
ru: Тип "{0}" не поддерживает ограничение "comparison", поскольку он является записью, объединением или структурой с одним или несколькими типами структурных элементов, которые не поддерживают ограничение "comparison". Исключите ограничение "comparison" из типа или добавьте в него атрибут "StructuralComparison", определяющий типы полей, которые не поддерживают ограничение "comparison"
tr: '{0}' türü, 'comparison' kısıtlamasını desteklemeyen bir veya daha fazla yapısal öğe türünün olduğu bir record, union veya struct olduğu için 'comparison' kısıtlamasını desteklemez. Bu türde karşılaştırma kullanmayın veya hangi alan türünün karşılaştırmayı desteklemediğini belirlemek için 'StructuralComparison' özniteliğini türe ekleyin
zh_hans: 类型“{0}”不支持“comparison”约束，因为它是一个记录、联合或结构，其中的一个或多个结构化元素类型不支持“comparison”约束。请避免对此类型使用比较，或将“StructuralComparison”特性添加到此类型以确定哪些字段类型不支持比较
zh_hant: 類型 '{0}' 不支援 'comparison' 條件約束，因為它是記錄、等位或結構，且具有一個或多個不支援 'comparison' 條件約束的結構化項目類型。請避免使用這種類型的比較，或將 'StructuralComparison' 屬性加入類型，以判斷哪個欄位類型不支援比較

# csTypeDoesNotSupportEquality1
source: The type '{0}' does not support the 'equality' constraint because it has the 'NoEquality' attribute
cs: Typ {0} nepodporuje omezení equality, protože má atribut NoEquality.
de: Der Typ "{0}" unterstützt die equality-Einschränkung nicht, weil er das NoEquality-Attribut aufweist.
es: El tipo '{0}' no admite la restricción 'equality' porque tiene el atributo 'NoEquality'.
fr: Le type '{0}' ne prend pas en charge la contrainte 'equality', car il a l'attribut 'NoEquality'
it: Il tipo '{0}' non supporta il vincolo 'equality' perché contiene l'attributo 'NoEquality'
ja: 型 '{0}' は 'NoEquality' 属性があるため、'equality' 制約をサポートしません
ko: '{0}' 형식은 'NoEquality' 특성을 가지므로 'equality' 제약 조건을 지원하지 않습니다.
pl: Typ „{0}” nie obsługuje ograniczenia „equality”, ponieważ ma on atrybut „NoEquality”
pt_br: O tipo '{0}' não suporta a restrição 'equality' porque possui o atributo 'NoEquality'
ru: Тип "{0}" не поддерживает ограничение "equality", поскольку содержит атрибут "NoEquality"
tr: '{0}' türünün 'NoEquality' özniteliği olduğu için 'equality' kısıtlamasını desteklemez
zh_hans: 类型“{0}”不支持“equality”约束，因为它具有“NoEquality”特性
zh_hant: 類型 '{0}' 不支援 'equality' 條件約束，因為它有 'NoEquality' 屬性
