Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# optsUnrecognizedLanguageVersion
source: Unrecognized value '{0}' for --langversion use --langversion:? for complete list
cs: Nerozpoznaná hodnota {0} pro parametr --langversion; seznam možností zobrazíte zadáním --langversion:?
de: Unbekannter Wert "{0}" für "--langversion". Verwenden Sie "--langversion:?", um die vollständige Liste anzuzeigen.
es: Valor no reconocido "{0}" para --langversion, use --langversion:? para una lista completa
fr: Valeur non reconnue '{0}' pour --langversion use --langversion:? pour la liste complète
it: Valore '{0}' non riconosciuto per --langversion. Per l'elenco completo usare --langversion:?
ko: 전체 목록에 대한 --langversion use --langversion:?의 인식할 수 없는 값 '{0}'입니다.
pl: Nierozpoznana wartość „{0}” dla parametru –langversion; podaj parametr –langversion:?, aby uzyskać pełną listę
pt_br: Valor não reconhecido '{0}' para --langversion use --langversion:? para a lista completa
ru: Не удалось распознать значение "{0}" для параметра --langversion. Для получения полного списка допустимых значений выполните команду use --langversion:?
tr: --langversion için '{0}' değeri tanınmıyor. Tam liste için --langversion:? kullanın
zh_hans: --langversion 的值“{0}”无法识别，使用 --langversion:? 获取完整列表。
zh_hant: 對 --langversion 為無法識別的值 '{0}'，對完整清單使用 --langversion:?

# packageManagementRequiresVFive
source: The package management feature requires language version 5.0 use /langversion:preview
cs: Funkce správy balíčků vyžaduje jazykovou verzi 5.0, použijte /langversion:preview.
de: Für das Paketverwaltungsfeature ist Sprachversion 5.0 erforderlich. Verwenden Sie /langversion:preview.
es: La característica de administración de paquetes requiere la versión de lenguaje 5.0; use /langversion:preview
fr: La fonctionnalité de gestion des packages nécessite la version 5.0 du langage. Utilisez /langversion:preview
it: Con la funzionalità di gestione pacchetti è richiesta la versione 5.0 del linguaggio. Usare /langversion:preview
ja: パッケージ管理機能では、言語バージョン 5.0 で /langversion:preview を使用する必要があります
ko: 패키지 관리 기능을 사용하려면 언어 버전 5.0이 필요합니다. /langversion:preview를 사용하세요.
pl: Funkcja zarządzania pakietami wymaga języka w wersji 5.0, użyj parametru /langversion:preview
pt_br: O recurso de gerenciamento de pacotes requer a versão de idioma 5.0. Use /langversion:preview
ru: Для функции управления пакетами требуется версия языка 5.0, используйте параметр /langversion:preview
tr: Paket yönetimi özelliği dil sürümü 5.0 gerektiriyor, /langversion:preview kullanın
zh_hans: 包管理功能需要语言版本 5.0，请使用 /langversion:preview
zh_hant: 套件管理功能需要語言版本 5.0，請使用 /langversion:preview

# parsEmptyFillInInterpolatedString
source: Invalid interpolated string. This interpolated string expression fill is empty, an expression was expected.
cs: Neplatný interpolovaný řetězec. Vyplnění výrazu interpolovaného řetězce je prázdné, očekával se výraz.
de: Ungültige interpolierte Zeichenfolge. Die Ausdrucksfüllung der interpolierten Zeichenfolge ist leer. Es wurde ein Ausdruck erwartet.
es: Cadena interpolada no válida. Este relleno de expresión de cadena interpolada está vacío; se esperaba una expresión.
fr: Chaîne interpolée non valide. Le remplissage de cette expression de chaîne interpolée est vide. Une expression est attendue.
it: La stringa interpolata non è valida. Il riempimento espressione di questa stringa interpolata è vuoto, mentre era prevista un'espressione.
ja: 補間された文字列が無効です。この補間された文字列式の塗りつぶしが空です。式が必要です。
ko: 보간된 문자열이 잘못되었습니다. 이 보간된 문자열 식 채우기가 비어 있는데, 식이 필요합니다.
pl: Nieprawidłowy ciąg interpolowany. Wyrażenie ciągu interpolowanego nie jest wypełnione, a jest oczekiwane.
pt_br: Cadeia de caracteres interpolada inválida. O preenchimento dessa expressão de cadeia de caracteres interpolada está vazio. Era esperada uma expressão.
ru: Недопустимая интерполированная строка. Выражение этой интерполированной строки является пустым. Ожидается выражение.
tr: Düz metin arasına kod eklenmiş dize geçersiz. Bu düz metin arasına kod eklenmiş dize ifade dolgusu boş. İfade bekleniyordu.
zh_hans: 内插字符串无效。此内插字符串表达式填充为空，应为表达式。
zh_hant: 插補字串無效。此插補字串運算式填滿為空白，必須有運算式。

# parsEofInInterpolatedString
source: Incomplete interpolated string begun at or before here
cs: Tady nebo před tímto místem začal neúplný interpolovaný řetězec.
de: Unvollständige interpolierte Zeichenfolge, die an oder vor dieser Stelle begonnen wurde
es: La cadena interpolada incompleta comenzaba aquí o antes.
fr: Chaîne interpolée incomplète ayant débuté à cet emplacement ou avant
it: La stringa interpolata incompleta inizia in questa posizione o prima di essa
ja: この位置以前に始まった補間された文字列が不完全です
ko: 불완전한 보간 문자열이 여기 또는 이전에서 시작되었습니다.
pl: Niekompletny ciąg interpolowany rozpoczęty w tym miejscu lub wcześniej
pt_br: A cadeia de caracteres interpolada incompleta foi iniciada aqui ou anteriormente
ru: Неполная интерполированная строка, начатая в этой позиции или до нее
tr: Tamamlanmamış düz metin arasına kod eklenmiş dize, burada veya daha önce başlıyordu
zh_hans: 在此处或之前开始的内插字符串不完整
zh_hant: 未完成的插補字串於此處或之前開始

# parsEofInInterpolatedStringFill
source: Incomplete interpolated string expression fill begun at or before here
cs: Tady nebo před tímto místem začalo vyplňování výrazu neúplného interpolovaného řetězce.
de: Unvollständige interpolierte Zeichenfolgen-Ausdrucksauffüllung, die an oder vor dieser Stelle begonnen wurde.
es: El relleno de expresión de la cadena interpolada incompleta comenzaba aquí o antes.
fr: Remplissage d'expression de chaîne interpolée incomplet ayant débuté à cet emplacement ou avant
it: Il riempimento espressione della stringa interpolata incompleta inizia in questa posizione o prima di essa
ja: この位置以前に始まった補間された文字列式の入力が不完全です
ko: 불완전한 보간 문자열 식 채우기가 여기 또는 이전에서 시작되었습니다.
pl: Niekompletne wypełnienie wyrażenia interpolowanego ciągu rozpoczęte w tym miejscu lub wcześniej
pt_br: O preenchimento da expressão de cadeia de caracteres interpolada incompleta foi iniciado aqui ou anteriormente
ru: Заполнение выражения неполной интерполированной строки, начатое в этой позиции или до нее
tr: Tamamlanmamış düz metin arasına kod eklenmiş dize ifadesi dolgusu, burada veya daha önce başlıyordu
zh_hans: 在此处或之前开始的内插字符串表达式不完整
zh_hant: 未完成的插補字串運算式填滿於此處或之前開始

# parsEofInInterpolatedTripleQuoteString
source: Incomplete interpolated triple-quote string begun at or before here
cs: Tady nebo před tímto místem začal neúplný interpolovaný řetězec s trojitými uvozovkami.
de: Unvollständige interpolierte Zeichenfolge mit dreifachen Anführungszeichen, die an oder vor dieser Stelle begonnen wurde.
es: La cadena de comillas triples interpolada incompleta comenzaba aquí o antes.
fr: Chaîne à guillemets triples interpolée incomplète ayant débuté à cet emplacement ou avant
it: La stringa interpolata incompleta tra virgolette triple inizia in questa posizione o prima di essa
ja: この位置以前に始まった補間された三重引用符文字列が不完全です
ko: 불완전한 보간 삼중 따옴표 문자열이 여기 또는 이전에서 시작되었습니다.
pl: Niekompletny interpolowany ciąg z potrójnym cudzysłowem rozpoczęty w tym miejscu lub wcześniej
pt_br: A cadeia de caracteres de aspas triplas interpolada incompleta foi iniciada aqui ou anteriormente
ru: Неполная интерполированная строка с тройными кавычками, начатая в этой позиции или до нее
tr: Tamamlanmamış düz metin arasına kod eklenmiş üç tırnaklı dize, burada veya daha önce başlıyordu
zh_hans: 在此处或之前开始的内插三重引号字符串不完整
zh_hant: 未完成的插補三引號字串於此處或之前開始

# parsEofInInterpolatedVerbatimString
source: Incomplete interpolated verbatim string begun at or before here
cs: Tady nebo před tímto místem začal neúplný interpolovaný doslovný řetězec.
de: Unvollständige interpolierte ausführliche Zeichenfolge, die an oder vor dieser Stelle begonnen wurde.
es: La cadena textual interpolada incompleta comenzaba aquí o antes.
fr: Chaîne verbatim interpolée incomplète ayant débuté à cet emplacement ou avant
it: La stringa verbatim interpolata incompleta inizia in questa posizione o prima di essa
ja: この位置以前に始まった補間された逐語的文字列が不完全です
ko: 불완전한 보간 축자 문자열이 여기 또는 이전에서 시작되었습니다.
pl: Niekompletny interpolowany dosłowny ciąg rozpoczęty w tym miejscu lub wcześniej
pt_br: A cadeia de caracteres verbatim interpolada incompleta foi iniciada aqui ou anteriormente
ru: Неполная интерполированная буквальная строка, начатая в этой позиции или до нее
tr: Tamamlanmamış düz metin arasına kod eklenmiş düz metin dizesi, burada veya daha önce başlıyordu
zh_hans: 在此处或之前开始的内插逐字字符串不完整
zh_hant: 未完成的插補逐字字串於此處或之前開始

# parsUnexpectedSymbolDot
source: Unexpected symbol '.' in member definition. Expected 'with', '=' or other token.
cs: Neočekávaný symbol . v definici členu. Očekávalo se with, = nebo jiný token.
de: Unerwartetes Symbol "." in der Memberdefinition. Erwartet wurde "with", "=" oder ein anderes Token.
es: Símbolo inesperado "." en la definición de miembro. Se esperaba "with", "=" u otro token.
fr: Symbole '.' inattendu dans la définition du membre. 'with','=' ou autre jeton attendu.
it: Simbolo '.' imprevisto nella definizione di membro. È previsto 'with', '=' o un altro token.
ja: メンバー定義に予期しない記号 '.' があります。'with'、'=' またはその他のトークンが必要です。
ko: 멤버 정의의 예기치 않은 기호 '.'입니다. 'with', '=' 또는 기타 토큰이 필요합니다.
pl: Nieoczekiwany symbol „.” w definicji składowej. Oczekiwano ciągu „with”, znaku „=” lub innego tokenu.
pt_br: Símbolo inesperado '.' na definição de membro. Esperado 'com', '=' ou outro token.
ru: Неожиданный символ "." в определении члена. Ожидаемые инструкции: "with", "=" или другие токены.
tr: Üye tanımında '.' sembolü beklenmiyordu. 'with', '=' veya başka bir belirteç bekleniyordu.
zh_hans: 成员定义中有意外的符号 "."。预期 "with"、"+" 或其他标记。
zh_hant: 成員定義中的非預期符號 '.'。預期為 'with'、'=' 或其他語彙基元。

# optsChecksumAlgorithm
source: Specify algorithm for calculating source file checksum stored in PDB. Supported values are: SHA1 or SHA256 (default)
cs: Zadejte algoritmus pro výpočet kontrolního součtu zdrojového souboru uloženého v PDB. Podporované hodnoty jsou: SHA1 nebo SHA256 (výchozí).
de: Geben Sie einen Algorithmus für die Berechnung der Quelldateiprüfsumme an, welcher in PDB gespeichert ist. Unterstützte Werte sind: SHA1 oder SHA256 (Standard)
es: Especifique el algoritmo para calcular la suma de comprobación del archivo de origen almacenada en PDB. Los valores admitidos son SHA1 o SHA256 (predeterminado)
fr: Spécifiez l'algorithme pour calculer la somme de contrôle du fichier source stocké au format PDB. Les valeurs prises en charge sont : SHA1 ou SHA256 (par défaut)
it: Consente di specificare l'algoritmo per calcolare il checksum del file di origine archiviato nel file PDB. I valori supportati sono SHA1 e SHA256 (predefinito).
ja: PDB に格納されているソース ファイル チェックサムを計算するためのアルゴリズムを指定します。サポートされる値は次のとおりです: SHA1 または SHA256 (既定)
ko: PDB에 저장된 소스 파일 체크섬을 계산하기 위한 알고리즘을 지정합니다. 지원되는 값은 SHA1 또는 SHA256(기본값)입니다.
pl: Określ algorytm obliczania sumy kontrolnej pliku źródłowego przechowywanej w pliku PDB. Obsługiwane wartości to SHA1 lub SHA256 (domyślnie)
pt_br: Especifique o algoritmo para calcular a soma de verificação do arquivo de origem armazenada no PDB. Os valores suportados são: SHA1 ou SHA256 (padrão)
ru: Укажите алгоритм для вычисления контрольной суммы исходного файла, хранящейся в файле PDB. Поддерживаемые значения: SHA1 или SHA256 (по умолчанию)
tr: PDB içinde depolanan kaynak dosyası sağlama toplamını hesaplama algoritmasını belirtin. Desteklenen değerler: SHA1 veya SHA256 (varsayılan)
zh_hans: 指定用于计算存储在 PDB 中的源文件校验的算法。支持的值是:SHA1 或 SHA256(默认)
zh_hant: 請指定用來計算 PDB 中所儲存來源檔案總和檢查碼的演算法。支援的值為: SHA1 或 SHA256 (預設)

# optsUnknownChecksumAlgorithm
source: Algorithm '{0}' is not supported
cs: Algoritmus {0} není podporovaný.
de: Algorithmus "{0}" wird nicht unterstützt
es: No se admite el algoritmo '{0}'
fr: Algorithme '{0}' non pris en charge
it: L'algoritmo '{0}' non è supportato
ja: アルゴリズム '{0}' はサポートされていません
ko: {0}' 알고리즘은 지원되지 않습니다.
pl: Algorytm „{0}” nie jest obsługiwany
pt_br: Algoritmo '{0}' sem suporte
ru: Алгоритм "{0}" не поддерживается
tr: {0}' algoritması desteklenmiyor
zh_hans: 不支持算法“{0}”
zh_hant: 不支援演算法 '{0}'

# poundiNotSupportedByRegisteredDependencyManagers
source: #i is not supported by the registered PackageManagers
cs: Registrovaní správci PackageManagers nepodporují #i.
de: #i wird von den registrierten PackageManagers nicht unterstützt.
es: Los elementos PackageManager registrados no admiten #i
fr: #i n'est pas pris en charge par les PackageManagers inscrits
it: #i non è supportato dagli elementi PackageManager registrati
ja: 登録された PackageManager によって、#i はサポートされていません
ko: #i는 등록된 PackageManagers에서 지원하지 않습니다.
pl: Element #i nie jest obsługiwany przez zarejestrowanych menedżerów pakietów
pt_br: O PackageManagers registrado não dá suporte a #i
ru: #i не поддерживается зарегистрированными диспетчерами пакетов
tr: #i, kayıtlı PackageManagers tarafından desteklenmiyor
zh_hans: 注册的 PackageManager 不支持 #i
zh_hant: 註冊的 PackageManagers 不支援 #i

# tcAndBangNotSupported
source: This feature is not supported in this version of F#. You may need to add /langversion:preview to use this feature.
cs: Tato funkce se v této verzi jazyka F# nepodporuje. Abyste mohli tuto funkci používat, možná bude nutné přidat /langversion:preview.
de: Dieses Feature wird in dieser Version von F# nicht unterstützt. Möglicherweise müssen Sie "/langversion:preview" hinzufügen, um dieses Feature zu verwenden.
es: Esta versión de F# no admite esta característica. Es posible que tenga que agregar /langversion:preview para usarla.
fr: Cette fonctionnalité n'est pas prise en charge dans cette version de F#. Vous devrez peut-être ajouter /langversion:preview pour pouvoir utiliser cette fonctionnalité.
it: Questa funzionalità non è supportata in questa versione di F#. Per usare questa funzionalità, potrebbe essere necessario aggiungere /langversion:preview.
ja: この機能は、このバージョンの F# ではサポートされていません。この機能を使用するには、/langversion:preview の追加が必要な場合があります。
ko: 이 기능은 이 F# 버전에서 지원되지 않습니다. 이 기능을 사용하기 위해 /langversion:preview를 추가해야 할 수도 있습니다.
pl: Ta funkcja nie jest obsługiwana w tej wersji języka F#. Aby korzystać z tej funkcji, może być konieczne dodanie parametru /langversion:preview.
pt_br: Este recurso não tem suporte nesta versão do F#. Talvez seja necessário adicionar /langversion:preview para usar este recurso.
ru: Эта функция не поддерживается в данной версии F#. Возможно, потребуется добавить/langversion:preview, чтобы использовать эту функцию.
tr: Bu özellik, bu F# sürümünde desteklenmiyor. Bu özelliği kullanabilmeniz için /langversion:preview eklemeniz gerekebilir.
zh_hans: 此版本的 F# 不支持此功能。你可能需要添加 /langversion:preview 才可使用此功能。
zh_hant: 此版本的 F# 不支援此功能。您可能需要新增 /langversion:preview 才能使用此功能。

# tcAnonRecdFieldNameDifferent
source: This is the wrong anonymous record. It should have the fields {0}.
cs: Toto je nesprávný anonymní záznam. Měl by mít pole {0}.
de: Dies ist der falsche anonyme Datensatz. Er muss folgende Felder umfassen: {0}.
es: Este es un registro anónimo incorrecto. Debe tener los campos {0}.
fr: Il s'agit de l'enregistrement anonyme incorrect. Il doit contenir les champs {0}.
it: Si tratta del record anonimo errato. Deve includere i campi {0}.
ja: この匿名レコードは正しくありません。フィールド {0} を含んでいる必要があります。
ko: 잘못된 익명 레코드입니다. {0} 필드가 있어야 합니다.
pl: To jest nieprawidłowy rekord anonimowy. Powinien zawierać pola {0}.
pt_br: Este é o registro anônimo errado. Ele deve ter os campos {0}.
ru: Неправильная анонимная запись. Она должна содержать поля {0}.
tr: Bu anonim kayıt yanlış. Kayıt, {0} alanlarını içermelidir.
zh_hans: 此匿名记录不正确。它应具有字段 {0}。
zh_hant: 此為錯誤的匿名記錄。其應有欄位 {0}。

# tcAnonRecdFieldNameSubset
source: This anonymous record does not have enough fields. Add the missing fields {0}.
cs: Tento anonymní záznam nemá dost polí. Přidejte chybějící pole {0}.
de: Dieser anonyme Datensatz weist nicht genügend Felder auf. Fügen Sie die fehlenden Felder ({0}) hinzu.
es: Este registro anónimo no tiene suficientes campos. Agregue los campos que faltan {0}.
fr: Cet enregistrement anonyme ne contient pas suffisamment de champs. Ajoutez les champs manquants {0}.
it: Questo record anonimo non contiene un numero sufficiente di campi. Aggiungere i campi mancanti {0}.
ja: この匿名レコードには十分なフィールドがありません。不足しているフィールド {0} を追加してください。
ko: 이 익명 레코드에 필드가 부족합니다. 누락된 필드 {0}을(를) 추가하세요.
pl: Ten rekord anonimowy nie ma wystarczającej liczby pól. Dodaj brakujące pola {0}.
pt_br: Este registro anônimo não tem campos suficientes. Adicione os campos ausentes {0}.
ru: В этой анонимной записи недостаточно полей. Добавьте недостающие поля {0}.
tr: Bu anonim kayıtta yeterli sayıda alan yok. Eksik {0} alanlarını ekleyin.
zh_hans: 此匿名记录没有足够的字段。请添加缺少的字段 {0}。
zh_hant: 此匿名記錄沒有足夠的欄位。請新增缺少的欄位 {0}。

# tcAnonRecdFieldNameSuperset
source: This anonymous record has too many fields. Remove the extra fields {0}.
cs: Tento anonymní záznam má příliš mnoho polí. Odeberte nadbytečná pole {0}.
de: Dieser anonyme Datensatz enthält zu viele Felder. Entfernen Sie die zusätzlichen Felder ({0}).
es: Este registro anónimo tiene demasiados campos. Quite los campos adicionales {0}.
fr: Cet enregistrement anonyme a trop de champs. Supprimez les champs supplémentaires {0}.
it: Questo record anonimo contiene troppi campi. Rimuovere i campi aggiuntivi {0}.
ja: この匿名レコードはフィールドが多すぎます。不要なフィールド {0} を削除してください。
ko: 이 익명 레코드에 필드가 너무 많습니다. 추가 필드 {0}을(를) 제거하세요.
pl: Ten rekord anonimowy ma za dużo pól. Usuń dodatkowe pola {0}.
pt_br: Este registro anônimo tem muitos campos. Remova os campos extras {0}.
ru: Эта анонимная запись содержит слишком много полей. Удалите лишние поля {0}.
tr: Bu anonim kayıtta çok fazla alan var. Ek {0} alanlarını kaldırın.
zh_hans: 此匿名记录的字段太多。请删除额外的字段 {0}。
zh_hant: 此匿名記錄有太多欄位。請移除額外的欄位 {0}。

# tcAnonRecdInvalid
source: Invalid Anonymous Record type declaration.
cs: Neplatná deklarace typu anonymního záznamu
de: Ungültige Deklaration für anonymen Datensatztyp.
es: Declaración de tipo de registro anónimo no válido.
fr: Déclaration de type d'enregistrement anonyme non valide.
it: La dichiarazione di tipo Record anonimo non è valida.
ja: 匿名レコードの型宣言が無効です。
ko: 익명 레코드 형식 선언이 잘못되었습니다.
pl: Nieprawidłowa deklaracja typu rekordu anonimowego.
pt_br: Declaração inválida de tipo de Registro Anônimo.
ru: Недопустимое объявление типа анонимной записи.
tr: Anonim Kayıt türü bildirimi geçersiz.
zh_hans: 匿名记录类型声明无效。
zh_hant: 匿名記錄型別宣告無效。

# tcAugmentationsCannotHaveAttributes
source: Attributes cannot be applied to type extensions.
cs: Atributy nejde použít pro rozšíření typů.
de: Attribute können nicht auf Typerweiterungen angewendet werden.
es: Los atributos no se pueden aplicar a las extensiones de tipo.
fr: Impossible d'appliquer des attributs aux extensions de type.
it: Gli attributi non possono essere applicati a estensioni di tipo.
ja: 属性を型拡張に適用することはできません。
ko: 형식 확장에 특성을 적용할 수 없습니다.
pl: Atrybutów nie można stosować do rozszerzeń typu.
pt_br: Os atributos não podem ser aplicados às extensões de tipo.
ru: Атрибуты не могут быть применены к расширениям типа.
tr: Öznitelikler tür uzantılarına uygulanamaz.
zh_hans: 属性不可应用于类型扩展。
zh_hant: 屬性無法套用到類型延伸模組。

# tcIllegalByrefsInOpenTypeDeclaration
source: Byref types are not allowed in an open type declaration.
cs: Typy Byref nejsou v deklaraci otevřeného typu povolené.
de: Byref-Typen sind in einer Deklaration für offene Typen nicht zulässig.
es: No se permiten tipos byref en una declaración de tipo abierto.
fr: Les types Byref ne sont pas autorisés dans une déclaration de type ouverte.
it: I tipi byref non sono consentiti in una dichiarazione di tipo aperto.
ja: Byref 型は、オープン型宣言では使用できません。
ko: Byref 형식은 개방형 형식 선언에서 허용되지 않습니다.
pl: Typy ByRef są niedozwolone w deklaracji typu otwartego.
pt_br: Os tipos Byref não são permitidos em uma declaração de tipo aberto.
ru: Типы ByRef запрещены в объявлении открытого типа.
tr: Açık tür bildiriminde Byref türlerine izin verilmez.
zh_hans: 在开放类型声明中不允许使用 Byref 类型。
zh_hant: 開放式類型宣告中不允許 Byref 類型。

# tcInterpolationMixedWithPercent
source: Mismatch in interpolated string. Interpolated strings may not use '%' format specifiers unless each is given an expression, e.g. '%d{{1+1}}'
cs: Neshoda v interpolovaném řetězci. Interpolované řetězce nemůžou používat specifikátory formátu %, pokud se každému z nich nezadá nějaký výraz, např. %d{{1+1}}.
de: Konflikt in interpolierter Zeichenfolge. Interpolierte Zeichenfolgen dürfen keine Formatbezeichner vom Typ "%" verwenden, es sei denn, jeder erhält einen Ausdruck, z. B. "%d{{1+1}}"
es: La cadena interpolada no coincide. Las cadenas interpoladas no pueden usar los especificadores de formato "%", a menos que se les proporcione una expresión individualmente; por ejemplo, "%d{{1+1}}".
fr: Incompatibilité dans la chaîne interpolée. Les chaînes interpolées ne peuvent pas utiliser les spécificateurs de format '%' à moins de recevoir une expression, par exemple '%d{{1+1}}'
it: Mancata corrispondenza nella stringa interpolata. Nelle stringhe interpolate non è possibile usare gli identificatori di formato '%' a meno che non si indichi un'espressione per ognuno di essi, ad esempio '%d{{1+1}}'
ja: 補間された文字列が一致しません。'%d{{1+1}}' などの式が指定されている場合を除き、補間された文字列では '%' 書式指定子を使用できません
ko: 보간 문자열의 불일치. 각 보간 문자열에 식(예: '%d{{1+1}}')이 지정되지 않는 한 '%' 형식 지정자를 사용할 수 없습니다.
pl: Niezgodność w interpolowanym ciągu. W interpolowanych ciągach nie można używać specyfikatorów formatu „%”, chyba że każdemu z nich odpowiada wyrażenie, na przykład „%d{{1+1}}”.
pt_br: Incompatibilidade na cadeia de caracteres interpolada. As cadeias de caracteres interpoladas não podem usar especificadores de formato '%', a menos que cada um receba uma expressão, por exemplo, '%d{{1+1}}'
ru: Несоответствие в интерполированной строке. В интерполированных строках запрещено использовать описатели формата "%", если только каждому из них не назначено выражение, например "'%d{{1+1}}".
tr: Düz metin arasına kod eklenmiş dizede uyuşmazlık. Düz metin arasına kod eklenmiş dizeler, her birine '%d{{1+1}}' gibi bir ifade verilmedikçe '%' biçim belirticilerini kullanamaz
zh_hans: 在内插字符串中不匹配。内插字符串不会使用 "%" 格式说明符，除非为每个字符串提供像 "'%d{{1+1}}" 这样的表达式
zh_hant: 插補字串不相符。除非每個插補字串都有一個運算式，否則不可使用 '%' 格式指定名稱，例如 '%d{{1+1}}'

# tcInvalidAlignmentInInterpolatedString
source: Invalid alignment in interpolated string
cs: Neplatné zarovnání v interpolovaném řetězci
de: Ungültige Ausrichtung in interpolierter Zeichenfolge.
es: Alineación no válida en la cadena interpolada
fr: Alignement non valide dans la chaîne interpolée
it: Allineamento non valido nella stringa interpolata
ja: 補間された文字列内の配置が無効です
ko: 보간 문자열의 잘못된 정렬
pl: Nieprawidłowe wyrównanie w ciągu interpolowanym
pt_br: Alinhamento inválido na cadeia de caracteres interpolada
ru: Недопустимое выравнивание в интерполированной строке
tr: Düz metin arasına kod eklenmiş dizede geçersiz hizalama
zh_hans: 内插字符串中的对齐无效
zh_hant: 插補字串中的對齊無效

# tcInvalidUseBangBindingNoAndBangs
source: use! may not be combined with and!
cs: use! se nedá kombinovat s and!.
de: "use!" darf nicht mit "and!" kombiniert werden.
es: No se puede combinar use! con and!
fr: use! ne peut pas être combiné avec and!
it: Non è possibile combinare use! con and!
ja: use! を and! と組み合わせて使用することはできません
ko: use!는 and!와 함께 사용할 수 없습니다.
pl: Elementu use! nie można łączyć z elementem and!
pt_br: use! não pode ser combinado com and!
ru: use! запрещено сочетать с and!
tr: use!, and! ile birleştirilemez
zh_hans: use! 不得与 and! 结合使用
zh_hant: use! 不可與 and! 合併
