Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# lexTabsNotAllowed
source: TABs are not allowed in F# code unless the #indent \"off\" option is used
cs: Výraz tabulátoru není v kódu F# povolený, pokud se nepoužije možnost #indent \"off\".
de: Tabulatorzeichen sind in F#-Code nur zulässig, wenn die Option "#indent \"off\"" verwendet wird.
es: No se permiten tabulaciones en código de F# a menos que se use la opción #indent \"off\".
fr: Les tabulations ne sont pas autorisées dans le code F# sauf si l'option #indent \"off\" est utilisée
it: I caratteri di tabulazione non sono consentiti nel codice F# a meno che non si utilizzi l'opzione #indent \"off\"
ja: F# コードにタブを使用するには、#indent \"off\" オプションを使用する必要があります
ko: #indent \"off\" 옵션을 사용하지 않는 한 TAB은 F# 코드에서 허용되지 않습니다.
pl: Znaki TAB są niedozwolone w kodzie języka F#, chyba że użyto opcji #indent \"off\"
pt_br: TABs não são permitidos em código F#, a menos que a opção #indent \"off\" seja usada
ru: В коде F# табуляция может использоваться только при использовании параметра #indent \"off\"
tr: #indent \"off\" seçeneği kullanılmadığı sürece F# kodunda SEKMELERE izin verilmez
zh_hans: F# 代码中不允许使用制表符，除非使用了 #indent \"off\" 选项
zh_hant: F# 程式碼中不允許使用 TAB，除非使用 #indent \"off\" 選項

# lexInvalidLineNumber
source: Invalid line number: '{0}'
cs: Neplatné číslo řádku: {0}
de: Ungültige Zeilennummer: '{0}'
es: Número de línea no válido: '{0}'.
fr: Numéro de ligne non valide : '{0}'
it: Numero di riga non valido: '{0}'
ja: 行番号: '{0}' は無効です
ko: 줄 번호가 잘못되었습니다. '{0}'
pl: Nieprawidłowy numer wiersza: „{0}”
pt_br: Número de linha inválido: '{0}'
ru: Недопустимый номер строки: '{0}'
tr: Geçersiz satır numarası '{0}'
zh_hans: 行号“{0}”无效
zh_hant: 無效的行號: '{0}'

# lexHashIfMustBeFirst
source: #if directive must appear as the first non-whitespace character on a line
cs: Direktiva #if musí být uvedená jako první neprázdný znak na řádku.
de: Die #if-Direktive muss das erste Zeichen in einer Zeile sein, das keine Leerstelle ist.
es: La directiva #if debe aparecer como el primer carácter que no es un espacio en blanco en una línea.
fr: La directive #if doit être le premier caractère (autre qu'un espace blanc) d'une ligne
it: La direttiva #if deve trovarsi all'inizio di una riga
ja: #if ディレクティブは、スペース以外の最初の文字として行頭に指定する必要があります
ko: #if 지시문은 줄에서 공백이 아닌 첫 번째 문자로 나타나야 합니다.
pl: Dyrektywa #if musi występować jako pierwszy znak wiersza, który nie jest odstępem
pt_br: A diretiva #if deve aparecer como o primeiro caractere diferente de um espaço em branco em uma linha
ru: Перед директивами #if могут находиться только знаки пробела
tr: #if yönergesi satırdaki ilk boşluk olmayan karakter olarak görünmelidir
zh_hans: #if 指令必须作为一行的第一个非空白字符出现
zh_hant: #if 指示詞必須顯示為一行的第一個非空白字元

# lexHashElseNoMatchingIf
source: #else has no matching #if
cs: Direktivě #else neodpovídá žádná direktiva #if.
de: Kein passendes #if für #else vorhanden.
es: #else no tiene el correspondiente #if.
fr: #else n'a aucun #if correspondant
it: #else senza #if corrispondente
ja: #else に対応する #if がありません
ko: #else와 짝이 맞는 #if가 없습니다.
pl: Dyrektywa #else nie jest zgodna z dyrektywą #if
pt_br: #else não tem nenhuma correspondência #if
ru: Отсутствует директива #if, соответствующая директиве #else
tr: #else ile eşleşen bir #if yok
zh_hans: #else 没有匹配的 #if
zh_hant: #else 沒有對應的 #if

# lexHashEndifRequiredForElse
source: #endif required for #else
cs: Pro direktivu #else se vyžaduje direktiva #endif.
de: #endif für #else erforderlich.
es: #endif requerido por #else.
fr: #endif requis pour #else
it: #endif necessario per #else
ja: #else には #endif が必要です
ko: #endif에 #else가 필요합니다.
pl: Dyrektywa #endif jest wymagana dla dyrektywy #else
pt_br: #endif requerido por #else
ru: Для директивы #else требуется директива #endif
tr: #else için #endif gerekli
zh_hans: #else 需要 #endif
zh_hant: #else 需要 #endif

# lexHashElseMustBeFirst
source: #else directive must appear as the first non-whitespace character on a line
cs: Direktiva #else musí být uvedená jako první neprázdný znak na řádku.
de: Die #else-Direktive muss das erste Zeichen in einer Zeile sein, das keine Leerstelle ist.
es: La directiva #else debe aparecer como el primer carácter que no es un espacio en blanco en una línea.
fr: La directive #else doit être le premier caractère (autre qu'un espace blanc) d'une ligne
it: La direttiva #else deve trovarsi all'inizio di una riga
ja: #else ディレクティブは、スペース以外の最初の文字として行頭に指定する必要があります
ko: #else 지시문은 줄에서 공백이 아닌 첫 번째 문자로 나타나야 합니다.
pl: Dyrektywa #else musi występować jako pierwszy znak wiersza, który nie jest odstępem
pt_br: A diretiva #else deve aparecer como o primeiro caractere diferente de um espaço em branco em uma linha
ru: Перед директивами #else могут находиться только знаки пробела
tr: #else yönergesi satırdaki ilk boşluk olmayan karakter olarak görünmelidir
zh_hans: #else 指令必须作为一行的第一个非空白字符出现
zh_hant: #else 指示詞必須顯示為一行的第一個非空白字元

# lexHashEndingNoMatchingIf
source: #endif has no matching #if
cs: Direktivě #endif neodpovídá žádná direktiva #if.
de: Kein passendes #if für #endif vorhanden.
es: #endif no tiene el correspondiente #if.
fr: #endif n'a aucun #if correspondant
it: #endif senza #if corrispondente
ja: #endif に対応する #if がありません
ko: #endif와 짝이 맞는 #if가 없습니다.
pl: Dyrektywa #endif nie ma zgodnej dyrektywy #if
pt_br: #endif não tem nenhuma correspondência #if
ru: Отсутствует директива #if, соответствующая директиве #endif
tr: #endif ile eşleşen bir #if yok
zh_hans: #endif 没有匹配的 #if
zh_hant: #endif 沒有對應的 #if

# lexHashEndifMustBeFirst
source: #endif directive must appear as the first non-whitespace character on a line
cs: Direktiva #endif musí být uvedená jako první neprázdný znak na řádku.
de: Die #endif-Direktive muss das erste Zeichen in einer Zeile sein, das keine Leerstelle ist.
es: La directiva #endif debe aparecer como el primer carácter que no es un espacio en blanco en una línea.
fr: La directive #endif doit être le premier caractère (autre qu'un espace blanc) d'une ligne
it: La direttiva #endif deve trovarsi all'inizio di una riga
ja: #endif ディレクティブは、スペース以外の最初の文字として行頭に指定する必要があります
ko: #endif 지시문은 줄에서 공백이 아닌 첫 번째 문자로 나타나야 합니다.
pl: Dyrektywa #endif musi występować jako pierwszy znak wiersza, który nie jest odstępem
pt_br: A diretiva #endif deve aparecer como o primeiro caractere diferente de um espaço em branco em uma linha
ru: Перед директивами #endif могут находиться только знаки пробела
tr: #endif yönergesi satırdaki ilk boşluk olmayan karakter olarak görünmelidir
zh_hans: #endif 指令必须作为一行的第一个非空白字符出现
zh_hant: #endif 指示詞必須顯示為一行的第一個非空白字元

# lexHashIfMustHaveIdent
source: #if directive should be immediately followed by an identifier
cs: Za direktivou #if by měl bezprostředně následovat identifikátor.
de: Auf die #if-Direktive sollte sofort ein Bezeichner folgen.
es: La directiva #if debe ir seguida inmediatamente por un identificador.
fr: La directive #if doit être immédiatement suivie d'un identificateur
it: La direttiva #if deve essere immediatamente seguita da un identificatore
ja: #if ディレクティブの直後に識別子を指定する必要があります
ko: #if 바로 다음에는 식별자가 있어야 합니다.
pl: Po dyrektywie #if powinien od razu następować identyfikator
pt_br: A diretiva #if deve ser seguida imediatamente por um identificador
ru: Сразу после директивы #if необходимо указать идентификатор
tr: #if yönergesinin hemen ardından tanımlayıcı gelmelidir
zh_hans: #if 指令后应紧跟标识符
zh_hant: #if 指示詞後面應該緊接識別碼

# lexWrongNestedHashEndif
source: Syntax error. Wrong nested #endif, unexpected tokens before it.
cs: Chyba syntaxe. Chybně vnořená direktiva #endif. Před výrazem it jsou neočekávané tokeny.
de: Syntaxfehler. Falsches geschachteltes #endif, unerwartete Token davor.
es: Error de sintaxis. #endif anidado incorrecto, se esperaban tokens delante de él.
fr: Erreur de syntaxe. Imbrication incorrecte de #endif, jetons inattendus devant.
it: Errore di sintassi. Direttiva #endif annidata non corretta, preceduta da token non previsti.
ja: 構文エラー。#endif の入れ子が不適切です。#endif の前に予期しないトークンがあります。
ko: 구문 오류입니다. 잘못된 중첩 #endif가 있으며 이 앞에 예기치 않은 토큰이 있습니다.
pl: Błąd składni. Niewłaściwie zagnieżdżona dyrektywa #endif, przed którą występują nieoczekiwane tokeny.
pt_br: Erro de sintaxe. #endif aninhado de forma errada, tokens não são esperados antes dele.
ru: Синтаксическая ошибка. Неправильный вложенный #endif; недопустимые лексемы перед ним.
tr: Sözdizimi hatası. Yanlış girintiye yerleştirilmiş #endif, önünde beklenmeyen belirteçler var.
zh_hans: 语法错误。嵌套的 #endif 出错，其前面存在意外的标记。
zh_hant: 語法錯誤。錯誤的巢狀 #endif，它前面必須有語彙基元。

# lexHashBangMustBeFirstInFile
source: #! may only appear as the first line at the start of a file.
cs: #! by se mělo objevit jenom jako první řádek na začátku souboru.
de: #! kann nur als erste Zeile zu Beginn einer Datei angezeigt werden.
es: #! solo puede aparecer como primera línea al principio de un archivo.
fr: #! ne peut se trouver que sur la première ligne au début d'un fichier.
it: #! è ammesso solo come prima riga all'inizio di un file.
ja: #! は、ファイル先頭の最初の行にのみ指定できます。
ko: #!는 파일 시작의 첫 번째 줄에만 나타날 수 있습니다.
pl: Element #! może występować tylko jako pierwszy wiersz na początku pliku.
pt_br: #! somente pode aparecer na primeira linha do início de um arquivo.
ru: #! может отображаться только в качестве первой строки в начале файла.
tr: #! yalnızca bir dosyanın başlangıcında ilk satırda geçebilir.
zh_hans: #!可能只在文件开头显示为第一行。
zh_hant: #! 只能出現在檔案開頭的第一行。

# pplexExpectedSingleLineComment
source: Expected single line comment or end of line
cs: Očekával se jednořádkový komentář nebo konec řádku.
de: Einzeiliger Kommentar oder Zeilenende erwartet.
es: Se esperaba un comentario de una sola línea o un final de línea
fr: Commentaire sur une seule ligne ou fin de ligne attendu
it: È previsto un commento a riga singola o la fine della riga
ja: 単一行のコメントまたは行の終わりが必要です
ko: 한 줄로 된 주석이나 줄 끝이 필요합니다.
pl: Oczekiwano jednowierszowego komentarza lub końca wiersza
pt_br: Linha de comando simples ou fim de linha esperado
ru: Ожидается однострочный комментарий или конец строки
tr: Tek satırlık açıklama veya satır sonu bekleniyordu
zh_hans: 应输入单行注释或行尾
zh_hant: 必須是單行註解或行結尾

# memberOperatorDefinitionWithNoArguments
source: Infix operator member '{0}' has no arguments. Expected a tuple of 2 arguments, e.g. static member (+) (x,y) = ...
cs: Člen operátoru vpony {0} nemá žádné argumenty. Očekávala se řazená kolekce členů se dvěma argumenty, třeba statický člen (+) (x,y) = ...
de: Infix-Operatormember "{0}" weist keine Argumente auf. Erwartet wurde ein Tupel mit 2 Argumenten, z.B. statischer Member (+) (x,y) = ...
es: El miembro de operador de infijo '{0}' no tiene argumentos. Se esperaba una tupla de 2 argumentos; por ejemplo, el miembro estático (+) (x,y) = ...
fr: Le membre opérateur infixe '{0}' n'a aucun argument. Tuple de 2 arguments attendu. Exemple : static member (+) (x,y) = ...
it: Il membro dell'operatore infisso '{0}' non ha argomenti. Prevista una tupla di 2 argomenti, ad esempio un membro statico (+) (x,y) = ...
ja: 挿入演算子メンバー '{0}' に引数がありません。静的メンバー (+) (x,y) = ... など、2 つの引数を持つタプルを指定してください。
ko: 중위 연산자 멤버 '{0}'에 인수가 없습니다. 2개 인수의 튜플이 필요합니다(예: 정적 멤버 (+) (x,y) = ...).
pl: Element członkowski operatora infiksu „{0}” nie ma argumentów. Oczekiwano krotka liczącej 2 argumenty, np. static member (+) (x,y) = ...
pt_br: O membro do operador infixo '{0}' não possui argumentos. Uma tupla de 2 argumentos é esperada, como por exemplo o membro estático (+) (x,y) = ...
ru: Элемент инфиксного оператора "{0}" не имеет аргументов. Требуется кортеж из 2 аргументов, например: static member (+) (x,y) = ...
tr: '{0}' Infix işleç üyesinde hiç bağımsız değişken yok. 2 bağımsız değişkenli bir demet bekleniyordu, ör. statik üye (+) (x,y) = ...
zh_hans: 中缀运算符成员“{0}”没有参数。需要一个由 2 个参数构成的元组，例如静态成员 (+) (x,y) = ...
zh_hant: 中置運算子成員 '{0}' 沒有引數。必須是 2 個引數的元組，例如，靜態成員 (+) (x,y) = ...

# memberOperatorDefinitionWithNonPairArgument
source: Infix operator member '{0}' has {1} initial argument(s). Expected a tuple of 2 arguments, e.g. static member (+) (x,y) = ...
cs: Člen operátoru vpony {0} má počáteční argumenty v počtu {1}. Očekávala se řazená kolekce členů se dvěma argumenty, třeba statický člen (+) (x,y) = ...
de: Infix-Operatormember "{0}" weist {1} anfängliche(s) Argument(e) auf. Erwartet wurde ein Tupel mit 2 Argumenten, z.B. statischer Member (+) (x,y) = ...
es: El miembro de operador de infijo '{0}' tiene {1} argumentos iniciales. Se esperaba una tupla de 2 argumentos; por ejemplo, el miembro estático (+) (x,y) = ...
fr: Le membre opérateur infixe '{0}' a 1 argument initial ou {1} arguments initiaux. Tuple de 2 arguments attendu. Exemple : static member (+) (x,y) = ...
it: Il membro dell'operatore infisso '{0}' ha {1} argomento/i iniziale/i. Prevista una tupla di 2 argomenti, ad esempio un membro statico (+) (x,y) = ...
ja: 挿入演算子メンバー '{0}' に {1} 個の初期引数があります。静的メンバー (+) (x,y) = ... など、2 つの引数を持つタプルを指定してください。
ko: 중위 연산자 멤버 '{0}'에 {1}개의 초기 인수가 있습니다. 2개 인수의 튜플이 필요합니다(예: 정적 멤버 (+) (x,y) = ...).
pl: Element członkowski operatora infiksu „{0}” ma następującą liczbę argumentów początkowych: {1}. Oczekiwano krotki liczącej 2 argumenty, np. static member (+) (x,y) = ...
pt_br: O membro do operador infixo '{0}' possui {1} argumentos iniciais. Uma tupla de 2 argumentos é esperada, como por exemplo o membro estático (+) (x,y) = ...
ru: Элемент инфиксного оператора "{0}" имеет {1} начальных аргументов. Требуется кортеж из 2 аргументов, например: static member (+) (x,y) = ...
tr: Infix işleç üyesi '{0}', {1} başlangıç bağımsız değişkenine sahip. 2 bağımsız değişkenli bir demet bekleniyordu, ör. statik üye (+) (x,y) = ...
zh_hans: 中缀运算符成员“{0}”具有 {1} 个初始参数。需要一个由 2 个参数构成的元组，例如静态成员 (+) (x,y) = ...
zh_hant: 中置運算子成員 '{0}' 有 {1} 個初始引數。必須是 2 個引數的元組，例如，靜態成員 (+) (x,y) = ...

# memberOperatorDefinitionWithCurriedArguments
source: Infix operator member '{0}' has extra curried arguments. Expected a tuple of 2 arguments, e.g. static member (+) (x,y) = ...
cs: Člen operátoru vpony {0} má curryfikované argumenty navíc. Očekávala se řazená kolekce členů se dvěma argumenty, třeba statický člen (+) (x,y) = ...
de: Infix-Operatormember "{0}" weist zusätzliche Curryargumente auf. Erwartet wurde ein Tupel mit 2 Argumenten, z.B. statischer Member (+) (x,y) = ...
es: El miembro de operador de infijo '{0}' tiene argumentos currificados extra. Se esperaba una tupla de 2 argumentos; por ejemplo, el miembro estático (+) (x,y) = ...
fr: Le membre opérateur infixe '{0}' a des arguments curryfiés supplémentaires. Tuple de 2 arguments attendu. Exemple : static member (+) (x,y) = ...
it: Il membro dell'operatore infisso '{0}' contiene argomenti sottoposti a currying aggiuntivi. Prevista una tupla di 2 argomenti, ad esempio un membro statico (+) (x,y) = ...
ja: 挿入演算子メンバー '{0}' に余分なカリー化された引数があります。静的メンバー (+) (x,y) = ... など、2 つの引数を持つタプルを指定してください。
ko: 중위 연산자 멤버 '{0}'에 커리된 추가 인수가 있습니다. 2개 인수의 튜플이 필요합니다(예: 정적 멤버 (+) (x,y) = ...).
pl: Element członkowski operatora infiksu „{0}” ma dodatkowe argumenty curried. Oczekiwano krotki liczącej 2 argumenty, np. static member (+) (x,y) = ...
pt_br: O membro do operador infixo '{0}' possui argumentos na forma curried adicionais. Uma tupla de 2 argumentos é esperada, como por exemplo o membro estático (+) (x,y) = ...
ru: Элемент инфиксного оператора "{0}" имеет лишние переданные аргументы. Требуется кортеж из 2 аргументов, например: static member (+) (x,y) = ...
tr: Infix işleç üyesi '{0}', fazladan eksiltimli bağımsız değişkenlere sahip. 2 bağımsız değişkenli bir demet bekleniyordu, ör. statik üye (+) (x,y) = ...
zh_hans: 中缀运算符成员“{0}”具有额外的扩充参数。需要一个由 2 个参数构成的元组，例如静态成员 (+) (x,y) = ...
zh_hant: 中置運算子成員 '{0}' 有額外的局部調用引數。必須是 2 個引數的元組，例如，靜態成員 (+) (x,y) = ...

# tcFSharpCoreRequiresExplicit
source: All record, union and struct types in FSharp.Core.dll must be explicitly labelled with 'StructuralComparison' or 'NoComparison'
cs: Všechny typy záznam, sjednocení a struktura v knihovně FSharp.Core.dll musí mít explicitní označení StructuralComparison nebo NoComparison.
de: Alle Datensatz-, Union- und Strukturtypen in "FSharp.Core.dll" müssen explizit mit "StructuralComparison" oder "NoComparison" bezeichnet werden.
es: Todos los tipos de registro, unión y struct de FSharp.Core.dll deben estar etiquetados de forma explícita con 'StructuralComparison' o 'NoComparison'.
fr: Tous les types enregistrement, union et struct dans FSharp.Core.dll doivent être étiquetés explicitement avec 'StructuralComparison' ou 'NoComparison'
it: A tutti i tipi di struct, record e unione in FSharp.Core.dll deve essere assegnata in modo esplicito l'etichetta 'StructuralComparison' o 'NoComparison'
ja: FSharp.Core.dll のすべてのレコード型、共用体型、および構造体型は、'StructuralComparison' または 'NoComparison' で明示的にラベル指定する必要があります
ko: FSharp.Core.dll의 레코드, 공용 구조체 및 구조체 형식에는 'StructuralComparison' 또는 'NoComparison'을 사용하여 명시적으로 레이블을 지정해야 합니다.
pl: Wszystkie typy rekordów, unii i struktur w pliku FSharp.Core.dll muszą mieć jawną etykietę „StructuralComparison” lub „NoComparison”
pt_br: Todos tipos de registro, união e struct em FSharp.Core.dll devem ser rotulados explicitamente com 'StructuralComparison' ou 'NoComparison'
ru: Все типы записи, объединений и структур в FSharp.Core.dll должны быть явно помечены "StructuralComparison" или "NoComparison"
tr: FSharp.Core.dll'sindeki tüm kayıt, birleşim ve yapı türleri 'StructuralComparison' veya 'NoComparison' ile açık olarak etiketlenmelidir
zh_hans: 必须使用“StructuralComparison”或“NoComparison”显式标记 FSharp.Core.dll 中的所有字段、联合和结构类型
zh_hant: FSharp.Core.dll 中的所有記錄、等位和結構類型都必須明確標示 'StructuralComparison' 或 'NoComparison'

# tcStructuralComparisonNotSatisfied1
source: The struct, record or union type '{0}' has the 'StructuralComparison' attribute but the type parameter '{1}' does not satisfy the 'comparison' constraint. Consider adding the 'comparison' constraint to the type parameter
cs: Typ struktura, záznam nebo sjednocení {0} má atribut StructuralComparison, ale parametr typu {1} nevyhovuje omezení comparison. Zvažte možnost přidat k parametru typu omezení comparison.
de: Der Struktur-, Datensatz- oder Union-Typ "{0}" ist mit dem StructuralComparison-Attribut versehen, aber der Typparameter "{1}" erfüllt die comparison-Einschränkung nicht. Fügen Sie dem Typparameter die comparison-Einschränkung hinzu.
es: El tipo de struct, registro o unión '{0}' tiene el atributo 'StructuralComparison', pero el parámetro de tipo '{1}' no satisface la restricción 'comparison'. Considere agregar la restricción 'comparison' al parámetro de tipo.
fr: Le type struct, enregistrement ou union '{0}' a l'attribut 'StructuralComparison' mais le paramètre de type '{1}' ne satisfait pas la contrainte 'comparison'. Ajoutez la contrainte 'comparison' au paramètre de type
it: Il tipo di unione, struct o record '{0}' contiene l'attributo 'StructuralComparison' ma il parametro di tipo '{1}' non soddisfa il vincolo 'comparison'. Provare ad aggiungere il vincolo 'comparison' al parametro di tipo
ja: 構造体型、レコード型、または共用体型 '{0}' に 'StructuralComparison' 属性がありますが、型パラメーター '{1}' は 'comparison' 制約を満たしていません。型パラメーターに 'comparison' 制約を追加してください。
ko: 구조체, 레코드 또는 공용 구조체 형식 '{0}'에 'StructuralComparison' 특성이 있지만 형식 매개 변수 '{1}'이(가) 'comparison' 제약 조건을 만족하지 않습니다. 형식 매개 변수에 'comparison' 제약 조건을 추가하세요.
pl: Typ struktury, rekordu lub unii „{0}” zawiera atrybut „StructuralComparison”, ale parametr typu „{1}” nie spełnia ograniczenia „comparison”. Rozważ dodanie ograniczenia „comparison” do parametru typu
pt_br: O tipo struct, registro ou união '{0}' tem o atributo 'StructuralComparison', mas o parâmetro de tipo '{1}' não satisfaz a restrição 'comparison'. Considere incluir a restrição 'comparison' ao parâmetro de tipo
ru: Тип структуры, записи или объединения "{0}" имеет атрибут "StructuralComparison", но параметр типа "{1}" не удовлетворяет ограничению "comparison". Рекомендуется добавить к параметру типа ограничение "comparison"
tr: Yapı, kayıt veya birleşim türü '{0}', 'StructuralComparison' özniteliğine sahip ancak tür parametresi '{1}' 'comparison' kısıtlamasını karşılamıyor. Tür parametresine 'comparison' kısıtlamasını eklemeyi düşünün
zh_hans: 结构、记录或联合类型“{0}”具有“StructuralComparison”特性，但类型参数“{1}”不符合“comparison”约束的要求。请考虑将“comparison”约束添加到该类型参数
zh_hant: 結構、記錄或等位型別 '{0}' 有 'StructuralComparison' 屬性，但型別參數 '{1}' 不滿足 'comparison' 條件約束。請考慮將 'comparison' 條件約束加入型別參數

# tcStructuralComparisonNotSatisfied2
source: The struct, record or union type '{0}' has the 'StructuralComparison' attribute but the component type '{1}' does not satisfy the 'comparison' constraint
cs: Typ struktura, záznam nebo sjednocení {0} má atribut StructuralComparison, ale typ komponenty {1} nevyhovuje omezení comparison.
de: Der Struktur-, Datensatz- oder Union-Typ "{0}" ist mit dem StructuralComparison-Attribut versehen, aber der Komponententyp "{1}" erfüllt die comparison-Einschränkung nicht.
es: El tipo de struct, registro o unión '{0}' tiene el atributo 'StructuralComparison', pero el tipo de componente '{1}' no satisface la restricción 'comparison'.
fr: Le type struct, enregistrement ou union '{0}' a l'attribut 'StructuralComparison' mais le type de composant '{1}' ne satisfait pas la contrainte 'comparison'
it: Il tipo di unione, struct o record '{0}' contiene l'attributo 'StructuralComparison' ma il tipo di componente '{1}' non soddisfa il vincolo 'comparison'
ja: 構造体型、レコード型、または共用体型 '{0}' に 'StructuralComparison' 属性がありますが、コンポーネント型 '{1}' は 'comparison' 制約を満たしていません。
ko: 구조체, 레코드 또는 공용 구조체 형식 '{0}'에 'StructuralComparison' 특성이 있지만 구성 요소 형식 '{1}'이(가) 'comparison' 제약 조건을 만족하지 않습니다.
pl: Typ struktury, rekordu lub unii „{0}” zawiera atrybut „StructuralComparison”, ale typ składnika „{1}” nie spełnia ograniczenia „comparison”
pt_br: O tipo struct, registro ou união '{0}' tem o atributo 'StructuralComparison', mas o tipo de componente '{1}' não satisfaz a restrição 'comparison'
ru: Тип структуры, записи или объединения "{0}" имеет атрибут "StructuralComparison", но тип компонента "{1}" не удовлетворяет ограничению "comparison"
tr: Yapı, kayıt veya birleşim türü '{0}', 'StructuralComparison' özniteliğine sahip ancak bileşen türü '{1}' 'comparison' kısıtlamasını karşılamıyor
zh_hans: 结构、记录或联合类型“{0}”具有“StructuralComparison”特性，但组件类型“{1}”不符合“comparison”约束的要求
zh_hant: 結構、記錄或等位型別 '{0}' 有 'StructuralComparison' 屬性，但元件型別 '{1}' 不滿足 'comparison' 條件約束
