Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# tcNamedArgumentDidNotMatch
source: The named argument '{0}' did not match any argument or mutable property
cs: Pojmenovaný argument {0} neodpovídá žádnému argumentu nebo měnitelné vlastnosti.
de: Das benannte Argument "{0}" stimmt mit keinem Argument und keiner änderbaren Eigenschaft überein.
es: El argumento con nombre '{0}' no coincidía con ningún argumento ni propiedad mutable.
fr: L'argument nommé '{0}' ne correspond à aucun argument, ni à aucune propriété mutable
it: L'argomento denominato '{0}' non corrisponde ad alcuna proprietà modificabile o argomento
ja: 名前付き引数 '{0}' と一致する引数または変更可能なプロパティがありませんでした
ko: 명명된 인수 '{0}'이(가) 어떠한 인수 또는 변경할 수 있는 속성과도 일치하지 않습니다.
pl: Nazwany argument „{0}” nie jest zgodny z żadnym argumentem ani z żadną właściwością modyfikowalną
pt_br: O argumento nomeado '{0}' não correspondeu ao argumento ou propriedade mutável
ru: Именованный аргумент "{0}" не совпал ни с одним аргументом или изменяемым свойством
tr: '{0}' adlandırılmış bağımsız değişkeni herhangi bir bağımsız değişkenle veya değişebilir özelliğiyle eşleşmedi
zh_hans: 命名参数“{0}”与任何参数或可变属性均不匹配
zh_hant: 具名引數 '{0}' 不符合任何引數或可變動的屬性

# tcOverloadsCannotHaveCurriedArguments
source: One or more of the overloads of this method has curried arguments. Consider redesigning these members to take arguments in tupled form.
cs: Minimálně jedno přetížení této metody má curryfikované argumenty. Zvažte úpravu návrhu těchto členů tak, aby přebíraly argumenty v podobě řazené kolekce členů.
de: Mindestens eine der Überladungen dieser Methode besitzt Curryargumente. Definieren Sie diese Member so um, dass sie Argumente als Tupel akzeptieren.
es: Una o varias sobrecargas de este método tienen argumentos currificados. Considere rediseñar estos miembros para que tomen argumentos con forma de tupla.
fr: Une ou plusieurs des surcharges de cette méthode comporte des arguments curryfiés. Recréez ces membres pour qu'ils acceptent des arguments basés sur des tuples.
it: Uno o più overload del metodo hanno argomenti sottoposti a currying. Provare a riprogettare i membri in modo che accettino argomenti in tupla.
ja: このメソッドのオーバーロードの 1 つまたは複数にカリー化された引数があります。タプル化された形式で引数を使用するようにこれらのメンバーを再設計してください。
ko: 이 메서드에 대한 하나 이상의 오버로드에 커리된 인수가 있습니다. 튜플된 형식의 인수를 사용하려면 이러한 멤버를 다시 디자인하세요.
pl: Co najmniej jedno przeciążenie tej metody ma argumenty curried. Rozważ zmodyfikowanie tych elementów członkowskich tak, aby akceptowały argumenty w postaci spójnej kolekcji.
pt_br: Uma ou mais das sobrecargas deste método possui argumentos na forma curried. Considere reformular esses membros para terem argumentos na forma de tupla.
ru: Одна или несколько перегрузок данного метода имеет переданные аргументы. Рекомендуется изменить эти элементы так, чтобы они принимали аргументы в форме кортежа
tr: Bu metodun bir veya daha fazla aşırı yüklemesinde eksiltimli bağımsız değişkenler var. Bu üyeleri grup olarak tanımlanmış biçimde bağımsız değişkenler alacak şekilde yeniden tasarlamayı düşünün.
zh_hans: 此方法的一个或多个重载具有扩充参数。请考虑将这些成员重新设计为采用元组格式的参数。
zh_hant: 這個方法的一個或多個多載有局部調用引數。請考慮重新設計這些成員，以接受 Tuple 形式的引數。

# tcUnnamedArgumentsDoNotFormPrefix
source: The unnamed arguments do not form a prefix of the arguments of the method called
cs: Nepojmenované argumenty netvoří předponu argumentů volané metody.
de: Die unbenannten Argumente bilden kein Präfix der Argumente der aufgerufenen Methode.
es: Los argumentos sin nombre no forman un prefijo de los argumentos del método llamado.
fr: Les arguments sans nom ne forment pas le préfixe des arguments de la méthode nommée
it: Gli argomenti non denominati non costituiscono un prefisso degli argomenti del metodo chiamato
ja: 名前なしの引数は、呼び出されるメソッドの引数のプレフィックスを形成できません
ko: 명명되지 않은 인수는 호출된 메서드의 인수에 대한 접두사를 형성하지 않습니다.
pl: Nienazwane argumenty nie tworzą prefiksu argumentów wywołanej metody
pt_br: Os argumentos sem nome não formam um prefixo dos argumentos de métodos chamados
ru: Аргументы без названий не образуют префикса аргументов вызываемого метода
tr: Adlandırılmamış bağımsız değişkenler çağrılan metodun bağımsız değişkenlerinin ön ekini oluşturmaz
zh_hans: 未命名的参数未形成已调用方法的参数的前缀
zh_hant: 未命名引數不會構成所呼叫方法的引數前置詞

# tcStaticOptimizationConditionalsOnlyForFSharpLibrary
source: Static optimization conditionals are only for use within the F# library
cs: Podmínky statické optimalizace se používají jenom v knihovně F#.
de: Statische bedingte Optimierungsausdrücke sind nur für die Verwendung innerhalb der F#-Bibliothek vorgesehen.
es: Los condicionales de optimización estáticos son solo para usarlos en la biblioteca de F#.
fr: Les conditions de l'optimisation statique sont uniquement utilisables dans la bibliothèque F#
it: Le istruzioni condizionali di ottimizzazione statiche sono solo per l'utilizzo all'interno della libreria F#
ja: 静的最適化の条件は、F# ライブラリ内でのみ使用できます
ko: 정적 최적화 조건은 F# 라이브러리 내에서만 사용해야 합니다.
pl: Statyczne wyrażenia warunkowe optymalizacji mogą być używane tylko w bibliotece języka F#
pt_br: Condicionais de otimização estáticas destinam-se apenas ao uso na biblioteca F#
ru: Условия статической оптимизации используются только в библиотеке F#
tr: Statik iyileştirme koşulları yalnızca F# kitaplığı içinde kullanım içindir
zh_hans: 只能在 F# 库中使用静态优化条件
zh_hant: 靜態最佳化條件式只用於 F# 程式庫內

# tcFormalArgumentIsNotOptional
source: The corresponding formal argument is not optional
cs: Odpovídající formální argument není nepovinný.
de: Das entsprechende Formalargument ist nicht optional.
es: El argumento de formato correspondiente no es opcional.
fr: L'argument formel correspondant n'est pas facultatif
it: L'argomento formale corrispondente non è facoltativo
ja: 対応する正式な引数はオプションではありません
ko: 해당하는 형식 인수는 필수입니다.
pl: Odpowiedni argument formalny nie jest opcjonalny
pt_br: O argumento formal correspondente não é opcional
ru: Соответствующий формат аргумента не является необязательным.
tr: Karşılık gelen biçimsel bağımsız değişken isteğe bağlı değil
zh_hans: 相应的形参不是可选的
zh_hant: 對應的正式引數不是選擇性的

# tcInvalidOptionalAssignmentToPropertyOrField
source: Invalid optional assignment to a property or field
cs: Neplatné nepovinné přiřazení k vlastnosti nebo poli
de: Ungültige optionale Zuweisung zu einer Eigenschaft oder einem Feld.
es: Asignación opcional a una propiedad o un campo no válida.
fr: Assignation facultative non valide pour une propriété ou un champ
it: Assegnazione facoltativa non valida a proprietà o campo
ja: プロパティまたはフィールドに対するオプションの割り当てが無効です
ko: 속성 또는 필드에 대한 선택적 할당이 잘못되었습니다.
pl: Nieprawidłowe opcjonalne przypisanie do właściwości lub pola
pt_br: Atribuição opcional inválida para uma propriedade ou um campo
ru: Недопустимое необязательное назначение свойству или полю
tr: Özelliğe veya alana geçersiz isteğe bağlı atama
zh_hans: 某个属性或字段的可选赋值无效
zh_hant: 無效的選擇性指派給屬性或欄位

# tcDelegateConstructorMustBePassed
source: A delegate constructor must be passed a single function value
cs: Konstruktoru delegáta se musí předávat jediná hodnota funkce.
de: Einem Delegatkonstruktor muss ein einzelner Funktionswert übergeben werden.
es: A un constructor delegado sólo debe pasársele un único valor de función.
fr: Une valeur de fonction unique doit être passée à un constructeur délégué
it: A un costruttore di delegato deve essere passato un singolo valore di funzione
ja: デリゲート コンストラクターには単一の関数値を渡す必要があります
ko: 대리 생성자에는 단일 함수 값을 전달해야 합니다.
pl: Do konstruktora delegatów musi zostać przekazana jedna wartość funkcji.
pt_br: Um construtor delegado deve ser transmitido como um valor de função único
ru: Конструктору делегата необходимо передать отдельное значение функции
tr: Temsilci oluşturucuya tek bir işlev değeri geçirilmesi gerekiyor
zh_hans: 必须向委托构造函数传递单个函数值
zh_hant: 必須傳遞單一函式值給委派建構函式

# tcBindingCannotBeUseAndRec
source: A binding cannot be marked both 'use' and 'rec'
cs: Vazba nemůže mít současně označení use i rec.
de: Eine Bindung kann nicht gleichzeitig als "use" und "rec" markiert werden.
es: Un enlace no se puede marcar como 'use' y 'rec' a la vez.
fr: Impossible de marquer une liaison à la fois 'use' et 'rec'
it: Un binding non può essere contrassegnato sia con 'use' che con 'rec'
ja: 束縛に 'use' と 'rec' の両方をマークすることはできません
ko: 바인딩을 'use'와 'rec' 모두로 표시할 수 없습니다.
pl: Powiązanie nie może być oznaczone zarówno jako „use”, jak i „rec”
pt_br: Uma associação não pode ser marcada com 'use' e 'rec' ao mesmo tempo
ru: Привязка не может быть одновременно отмечена как "use" и "rec"
tr: Bir bağlama hem 'use' hem de 'rec' olarak işaretlenemez
zh_hans: 不能将一个绑定同时标记为“use”和“rec”
zh_hant: 無法同時將繫結標記為 'use' 和 'rec'

# tcVolatileOnlyOnClassLetBindings
source: The 'VolatileField' attribute may only be used on 'let' bindings in classes
cs: Atribut VolatileField se dá v třídách použít jenom u vazeb let.
de: Das VolatileField-Attribut kann nur für let-Bindungen in Klassen verwendet werden.
es: El atributo 'VolatileField' se puede usar sólo en enlaces 'let' en clases.
fr: L'attribut 'VolatileField' ne peut être utilisé que sur les liaisons 'let' dans les classes
it: L'attributo 'VolatileField' può essere usato solo in binding 'let' nelle classi
ja: 'VolatileField' 属性を使用できるのは、クラス内の 'let' 束縛上のみです
ko: 'VolatileField' 특성은 클래스의 'let' 바인딩에 대해서만 사용할 수 있습니다.
pl: Atrybut „VolatileField” może być używany tylko w powiązaniach „let” w klasach
pt_br: O atributo 'VolatileField' só pode ser usado em associações 'let' nas classes
ru: Атрибут "VolatileField" может использоваться только в привязках "let" в классах
tr: 'VolatileField' özniteliği yalnızca sınıflardaki 'let' bağlamalarında kullanılabilir
zh_hans: 只能在类中的“let”绑定中使用“VolatileField”特性
zh_hant: 'VolatileField' 屬性只能用在類別的 'let' 繫結上

# tcAttributesAreNotPermittedOnLetBindings
source: Attributes are not permitted on 'let' bindings in expressions
cs: Atributy nejsou u vazeb Let ve výrazech povolené.
de: Attribute sind für let-Bindungen in Ausdrücken nicht zulässig.
es: No se permiten atributos en enlaces 'let' en expresiones.
fr: Les attributs ne sont pas autorisés sur les liaisons 'let' dans les expressions
it: Attributi non consentiti in binding 'let' nelle espressioni
ja: 式内の 'let' 束縛では、属性を使用できません
ko: 특성은 식의 'let' 바인딩에서 허용되지 않습니다.
pl: Atrybuty nie są dozwolone w powiązaniach „let” w wyrażeniach
pt_br: Atributos não são permitidos em associações 'let' das expressões
ru: Использование атрибутов для привязок "let" в выражениях не допускается
tr: İfadelerdeki 'let' bağlamalarında özniteliğe izin verilmez
zh_hans: 不允许对表达式中的“let”绑定使用特性
zh_hant: 不允許在運算式的 'let' 繫結上使用屬性

# tcDefaultValueAttributeRequiresVal
source: The 'DefaultValue' attribute may only be used on 'val' declarations
cs: Atribut DefaultValue se dá použít jenom u deklarací val.
de: Das DefaultValue-Attribut darf nur für val-Deklarationen verwendet werden.
es: El atributo 'DefaultValue' se puede usar sólo en declaraciones 'val'.
fr: L'attribut 'DefaultValue' ne peut être utilisé que sur les déclarations 'val'
it: L'attributo 'DefaultValue' può essere utilizzato solo in dichiarazioni 'val'
ja: 'DefaultValue' 属性は 'val' 宣言でのみ使用できます
ko: 'DefaultValue' 특성은 'val' 선언에 대해서만 사용할 수 있습니다.
pl: Atrybut „DefaultValue” może być używany tylko z deklaracjami „val”
pt_br: O atributo 'DefaultValue' só pode ser utilizado em declarações 'val'
ru: Атрибут "DefaultValue" может использоваться только в объявлениях "val"
tr: 'DefaultValue' özniteliği yalnızca 'val' bildirimlerinde kullanılabilir
zh_hans: “DefaultValue”特性只能用于“val”声明
zh_hant: 'DefaultValue' 屬性只能用在 'val' 宣告上

# tcConditionalAttributeRequiresMembers
source: The 'ConditionalAttribute' attribute may only be used on members
cs: Atribut ConditionalAttribute se dá použít jenom u členů.
de: Das ConditionalAttribute-Attribut darf nur für Member verwendet werden.
es: El atributo 'ConditionalAttribute' se puede usar sólo en miembros.
fr: L'attribut 'ConditionalAttribute' ne peut être utilisé que sur des membres
it: L'attributo 'ConditionalAttribute' può essere utilizzato solo nei membri
ja: 'ConditionalAttribute' 属性はメンバーでのみ使用できます
ko: 'ConditionalAttribute' 특성은 멤버에 대해서만 사용할 수 있습니다.
pl: Atrybut „ConditionalAttribute” może być używany tylko z elementami członkowskimi
pt_br: O atributo 'ConditionalAttribute' só pode ser usado em membros
ru: Атрибут "ConditionalAttribute" может использоваться только с элементами
tr: 'ConditionalAttribute' özniteliği yalnızca üyelerde kullanılabilir
zh_hans: “ConditionalAttribute”特性只能用于成员
zh_hant: 'ConditionalAttribute' 屬性只能用在成員上

# tcInvalidActivePatternName
source: This is not a valid name for an active pattern
cs: Toto není platný název aktivního vzoru.
de: Dies ist kein gültiger Name für ein aktives Muster.
es: Este no es un nombre válido para un patrón activo.
fr: Nom non valide pour un modèle actif
it: Questo non è un nome valido per un criterio attivo
ja: アクティブ パターンの有効な名前ではありません
ko: 활성 패턴에 대한 올바른 이름이 아닙니다.
pl: To nie jest prawidłowa nazwa aktywnego wzorca
pt_br: Este não é um nome válido para um padrão ativo
ru: Недопустимое имя для активного шаблона
tr: Etkin desen için bu geçerli bir ad değil
zh_hans: 对于活动模式来说，这不是有效的名称
zh_hant: 這不是現用模式的有效名稱

# tcEntryPointAttributeRequiresFunctionInModule
source: The 'EntryPointAttribute' attribute may only be used on function definitions in modules
cs: Atribut EntryPointAttribute se dá použít jenom u definic funkcí v modulech.
de: Das EntryPointAttribute-Attribut darf nur für Funktionsdefinitionen in Modulen verwendet werden.
es: El atributo 'EntryPointAttribute' se puede usar sólo en definiciones de función en módulos.
fr: L'attribut 'EntryPointAttribute' ne peut être utilisé que sur les définitions de fonctions dans les modules
it: L'attributo 'EntryPointAttribute' può essere utilizzato solo in definizioni di funzioni nei moduli
ja: 'EntryPointAttribute' 属性を使用できるのは、モジュールの関数定義のみです
ko: 'EntryPointAttribute' 특성은 모듈의 함수 정의에 대해서만 사용할 수 있습니다.
pl: Atrybut „EntryPointAttribute” może być używany tylko w definicjach funkcji w modułach
pt_br: O atributo 'EntryPointAttribute' só pode ser usado em definições de função em módulos
ru: Атрибут "EntryPointAttribute" может использоваться только в определениях функций в модулях
tr: 'EntryPointAttribute' özniteliği yalnızca modüllerdeki işlev tanımlarında kullanılabilir
zh_hans: “EntryPointAttribute”特性只能用于模块中的函数定义
zh_hant: 'EntryPointAttribute' 屬性不能用在模組的函式定義上

# tcMutableValuesCannotBeInline
source: Mutable values cannot be marked 'inline'
cs: Označení inline se u proměnlivých hodnot použít nedá.
de: Änderbare Werte können nicht als "inline" markiert werden.
es: Los valores mutables no se pueden marcar como 'inline'.
fr: Impossible de marquer des valeurs mutables 'inline'
it: Non è possibile contrassegnare valori modificabili come 'inline'
ja: 変更可能な値を 'inline' とマークすることはできません
ko: 변경할 수 있는 값은 'inline'으로 표시할 수 없습니다.
pl: Wartości modyfikowalne nie mogą być oznaczone jako „inline”
pt_br: Valores mutáveis não podem ser marcados como 'inline'
ru: Изменяемые значения не могут помечаться как "inline"
tr: Değişebilir değerler 'inline' olarak işaretlenemez
zh_hans: 不能将可变值标记为“inline”
zh_hant: 可變動的值不能標記為 'inline'

# tcMutableValuesMayNotHaveGenericParameters
source: Mutable values cannot have generic parameters
cs: Proměnlivé hodnoty nemůžou mít obecné parametry.
de: Änderbare Werte dürfen keine generischen Parameter aufweisen.
es: Los valores mutables no pueden tener parámetros genéricos.
fr: Les valeurs mutables ne peuvent pas avoir de paramètres génériques
it: I valori modificabili non possono avere parametri generici
ja: 変更可能な値にジェネリック パラメーターを指定することはできません
ko: 변경할 수 있는 값에는 제네릭 매개 변수를 지정할 수 없습니다.
pl: Wartości modyfikowalne nie mogą mieć parametrów ogólnych
pt_br: Valores mutáveis não podem ter parâmetros genéricos
ru: Изменяемые значения не могут иметь базовых параметров
tr: Değişebilir değerlerin genel parametreleri olamaz
zh_hans: 可变值不能具有泛型参数
zh_hant: 可變動的值不能有泛型參數

# tcMutableValuesSyntax
source: Mutable function values should be written 'let mutable f = (fun args -> ...)'
cs: Zápis proměnlivých hodnot funkcí by měl být let mutable f = (fun arg -> ...).
de: Änderbare Werte sollten im Format "let mutable f = (fun args -> ...)" geschrieben werden.
es: Los valores de función mutables deben escribirse "let mutable f = (fun args -> ...)"
fr: Les valeurs de fonction mutables doivent être écrites 'let mutable f = (fun args -> ...)'
it: I valori di funzione modificabili devono essere scritti come 'let mutable f = (fun args -> ...)'
ja: 関数値を変更可能にするには 'let mutable f = (fun args -> ...)' が必要です
ko: 변경할 수 있는 함수 값은 'let mutable f = (fun args -> ...)'로 작성해야 합니다.
pl: Modyfikowalne wartości funkcji powinny mieć postać „let mutable f = (fun argumenty -> ...)”
pt_br: Valores de função mutáveis devem ser escritos como 'let mutable f = (fun args -> ...)'
ru: Изменяемые значения функций должны быть доступны для записи: 'let mutable f = (fun args -> ...)'
tr: Değiştirilebilir işlev değerleri şu şekilde yazılmalıdır: 'let mutable f = (fun args -> ...)'
zh_hans: 应按照 "let mutable f = (fun args -> ...)" 格式编写可变函数值
zh_hant: 可變動的函式值應寫成 'let mutable f = (fun args -> ...)'

# tcOnlyFunctionsCanBeInline
source: Only functions may be marked 'inline'
cs: Označení inline můžou mít jenom funkce.
de: Nur Funktionen dürfen als "inline" markiert werden.
es: Solo las funciones se pueden marcar como 'inline'.
fr: Seules les fonctions peuvent être marquées comme 'inline'
it: Solo le funzioni possono essere contrassegnate come 'inline'
ja: 'inline' とマークできるのは関数のみです
ko: 함수만 'inline'으로 표시할 수 있습니다.
pl: Tylko funkcje mogą być oznaczone jako „inline”
pt_br: Apenas funções podem ser marcadas como 'inline'
ru: Только функции могут помечаться как "inline"
tr: Yalnızca işlevler 'inline' olarak işaretlenebilir
zh_hans: 只能将函数标记为“inline”
zh_hant: 只有函式可以標記為 'inline'

# tcIllegalAttributesForLiteral
source: A literal value cannot be given the [<ThreadStatic>] or [<ContextStatic>] attributes
cs: Literálové hodnotě nejde přiřadit atribut [<ThreadStatic>] nebo [<ContextStatic>].
de: Die Attribute [<ThreadStatic>] und [<ContextStatic>] können keinem Literalwert zugewiesen werden.
es: Un valor literal no puede recibir los atributos [<ThreadStatic>] o [<ContextStatic>]
fr: Une valeur littérale ne peut pas avoir les attributs [<ThreadStatic>] ou [<ContextStatic>]
it: Non è possibile assegnare l'attributo [<ThreadStatic>] o [<ContextStatic>] a un valore letterale
ja: リテラル値を [<ThreadStatic>] 属性または [<ContextStatic>] 属性に指定することはできません
ko: 리터럴 값에는 [<ThreadStatic>] 또는 [<ContextStatic>] 특성을 지정할 수 없습니다.
pl: Wartości literału nie można przypisać atrybutu [<ThreadStatic>] ani [<ContextStatic>]
pt_br: Não é possível atribuir um valor literal aos atributos [<ThreadStatic>] ou [<ContextStatic>]
ru: Атрибутам [<ThreadStatic>] и [<ContextStatic>] не может быть присвоено значение литерала
tr: Sabit bir değere [<ThreadStatic>] veya [<ContextStatic>] öznitelikleri verilemez
zh_hans: 无法向文本值赋予 [<ThreadStatic>] 或 [<ContextStatic>] 属性
zh_hant: 不得為常值指定 [<ThreadStatic>] 或 [<ContextStatic>] 屬性

# tcLiteralCannotBeMutable
source: A literal value cannot be marked 'mutable'
cs: Hodnota literálu nemůže mít označení mutable.
de: Ein Literalwert kann nicht als "mutable" markiert werden.
es: Un valor literal no se puede marcar como 'mutable'.
fr: Impossible de marquer une valeur littérale 'mutable'
it: Non è possibile contrassegnare un valore letterale come 'mutable'
ja: リテラル値に 'mutable' とマークすることはできません
ko: 리터럴 값은 'mutable'로 표시할 수 없습니다.
pl: Wartość literału nie może być oznaczona jako „mutable”
pt_br: Um valor literal não pode ser marcado como 'mutável'
ru: Значение литерала нельзя пометить как "mutable"
tr: Sabit değer 'mutable' olarak işaretlenemez
zh_hans: 不能将文本值标记为“mutable”
zh_hant: 常值不能標記為 'mutable'

# tcLiteralCannotBeInline
source: A literal value cannot be marked 'inline'
cs: Hodnota literálu nemůže mít označení inline.
de: Ein Literalwert kann nicht als "inline" markiert werden.
es: Un valor literal no se puede marcar como 'inline'.
fr: Impossible de marquer une valeur littérale 'inline'
it: Non è possibile contrassegnare un valore letterale come 'inline'
ja: リテラル値に 'inline' とマークすることはできません
ko: 리터럴 값은 'inline'으로 표시할 수 없습니다.
pl: Wartość literału nie może być oznaczona jako „inline”
pt_br: Um valor literal não pode ser marcado como 'inline'
ru: Значение литерала нельзя пометить как "inline"
tr: Sabit değer 'inline' olarak işaretlenemez
zh_hans: 不能将文本值标记为“inline”
zh_hant: 常值不能標記為 'inline'

# tcLiteralCannotHaveGenericParameters
source: Literal values cannot have generic parameters
cs: Hodnota literálu nemůže mít obecné parametry.
de: Literalwerte dürfen keine generischen Parameter aufweisen.
es: Los valores literales no pueden tener parámetros genéricos.
fr: Les valeurs littérales ne peuvent pas avoir de paramètres génériques
it: I valori letterali non possono avere parametri generici
ja: リテラル値にジェネリック パラメーターを指定することはできません
ko: 리터럴 값에는 제네릭 매개 변수를 지정할 수 없습니다.
pl: Wartości literałów nie mogą mieć parametrów ogólnych
pt_br: Valores literais não têm parâmetros genéricos
ru: Значения литералов не могут иметь базовых параметров
tr: Sabit değerlerin genel parametreleri olamaz
zh_hans: 文本值不能具有泛型参数
zh_hant: 常值不能有泛型參數

# tcInvalidConstantExpression
source: This is not a valid constant expression
cs: Toto není platný konstantní výraz.
de: Dies ist kein gültiger konstanter Ausdruck.
es: Esta no es una expresión de constante válida.
fr: Expression constante non valide
it: Espressione costante non valida
ja: これは有効な定数式ではありません
ko: 올바른 상수 식이 아닙니다.
pl: To nie jest prawidłowe wyrażenie stałej
pt_br: Esta não é uma expressão constante válida
ru: Это недопустимое постоянное выражение.
tr: Bu geçerli bir sabit ifade değil
zh_hans: 这不是有效的常数表达式
zh_hant: 這不是有效的常數運算式

# tcTypeIsInaccessible
source: This type is not accessible from this code location
cs: Tento typ není na tomto místě v kódu dostupný.
de: Auf diesen Typ kann von dieser Position im Code nicht zugegriffen werden.
es: Este tipo no es accesible desde este lugar del código.
fr: Ce type n'est pas accessible à partir de cet emplacement du code
it: Questo tipo non è accessibile da questa posizione di codice
ja: このコードの場所からこの型にアクセスすることはできません
ko: 이 형식은 이 코드 위치에서 액세스할 수 없습니다.
pl: Ten typ nie jest dostępny z tej lokalizacji kodu
pt_br: Este tipo não é acessível deste local de código
ru: Этот тип недоступен из данного расположения в коде
tr: Bu türe bu kod konumundan erişilemiyor
zh_hans: 无法从此代码位置访问此类型
zh_hant: 無法從這個程式碼位置存取這種類型

# tcUnexpectedConditionInImportedAssembly
source: Unexpected condition in imported assembly: failed to decode AttributeUsage attribute
cs: Neočekávaná podmínka v importovaném sestavení: nepovedlo se dekódovat atribut AttributeUsage.
de: Unerwartete Bedingung in importierter Assembly: Fehler beim Decodieren des AttributeUsage-Attributs.
es: Condición inesperada en ensamblado importado: no se pudo descodificar el atributo AttributeUsage.
fr: Condition inattendue dans l'assembly importé : impossible de décoder l'attribut AttributeUsage
it: Condizione imprevista in assembly importato: non è stato possibile decodificare l'attributo AttributeUsage
ja: インポートされたアセンブリに予期しない条件があります。AttributeUsage 属性のデコードに失敗しました:
ko: 가져온 어셈블리에 예기치 않은 상황이 발생했습니다. AttributeUsage 특성을 디코딩하지 못했습니다.
pl: Nieoczekiwany warunek w zaimportowanym zestawie: nie można zdekodować atrybutu AttributeUsage
pt_br: Condição inesperada no assembly importado: falha ao decodificar o atributo AttributeUsage
ru: Недопустимое условие в импортированной сборке: не удалось декодировать атрибут AttributeUsage
tr: İçeri aktarılan bütünleştirilmiş kodda beklenmeyen koşul: AttributeUsage özniteliğinin kodu çözülemedi
zh_hans: 导入的程序集中的意外条件: 未能对 AttributeUsage 特性进行解码
zh_hant: 匯入的組件中有未預期的條件: 無法解碼 AttributeUsage 屬性
