Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# tcOptionalArgsOnlyOnMembers
source: Optional arguments are only permitted on type members
cs: Nepovinné argumenty jsou povolené jenom u členů typu.
de: Optionale Argumente sind nur für Typmember zulässig.
es: Los argumentos opcionales se permiten únicamente en miembros de tipo.
fr: Les arguments facultatifs ne sont autorisés que sur les membres de type
it: Gli argomenti facoltativi sono consentiti solo in membri di tipo
ja: 型メンバーにはオプションの引数のみを使用できます
ko: 선택적 인수는 형식 멤버에 대해서만 허용됩니다.
pl: Argumenty opcjonalne są dozwolone tylko w przypadku elementów członkowskich typów
pt_br: Argumentos opcionais somente são permitidos em membros do tipo
ru: Необязательные аргументы разрешены только в элементах типов
tr: İsteğe bağlı bağımsız değişkenlere yalnızca tür üyelerinde izin verilir
zh_hans: 仅允许对类型成员使用可选参数
zh_hant: 只允許在類型成員上使用選擇性的引數

# tcNameNotBoundInPattern
source: Name '{0}' not bound in pattern context
cs: Název {0} nemá vazbu v kontextu vzoru.
de: Der Name "{0}" ist im Musterkontext nicht gebunden.
es: El nombre '{0}' no está enlazado en el contexto del patrón.
fr: Nom '{0}' non lié dans le contexte du modèle
it: Nome '{0}' non associato nel contesto dei criteri
ja: 名前 '{0}' がパターン コンテキストにバインドされていません
ko: 이름 '{0}'은(는) 패턴 컨텍스트에 바인딩되지 않았습니다.
pl: Nazwa „{0}” nie jest powiązana w kontekście wzorca
pt_br: Nome '{0}' não associado no contexto de padrão
ru: Имя "{0}" не привязано в контексте шаблона
tr: '{0}' adı desen bağlamında bağlanmamış
zh_hans: 模式上下文中未绑定名称“{0}”
zh_hant: 名稱 '{0}' 未在模式內容中繫結

# tcInvalidNonPrimitiveLiteralInPatternMatch
source: Non-primitive numeric literal constants cannot be used in pattern matches because they can be mapped to multiple different types through the use of a NumericLiteral module. Consider using replacing with a variable, and use 'when <variable> = <constant>' at the end of the match clause.
cs: Konstanty číselných literálů, které nejsou primitivní, se nedají použít u porovnání vzorů, protože můžou být během použití modulu NumericLiteral mapované na více různých typů. Zvažte možnost nahrazení proměnnou a na konci klauzule porovnání použijte when <proměnná> = <konstanta>.
de: Nicht primitive numerische Literalkonstanten können nicht für Mustervergleiche verwendet werden, weil sie mithilfe eines NumericLiteral-Moduls mehreren verschiedenen Typen zugeordnet werden können. Ersetzen Sie sie durch eine Variable, und verwenden Sie am Ende der Vergleichsklausel "when <Variable> = <Konstante>".
es: Las constantes literales numéricas no primitivas no se pueden usar en las coincidencias de patrones porque se pueden asignar a varios tipos diferentes mediante el uso de un módulo NumericLiteral. Considere la posibilidad de reemplazar por una variable, y usar "when <variable> = <constant>" al final de la cláusula de coincidencia.
fr: Les constantes littérales numériques non primitives ne peuvent pas être utilisées dans les correspondances de modèle, car elles ne peuvent pas être mappées à plusieurs types différents à l'aide d'un module NumericLiteral. Remplacez-les par une variable et utilisez 'when <variable> = <constante>' à la fin de la clause de correspondance.
it: Le costanti letterali numeriche non primitive non possono essere usate in criteri di ricerca perché è possibile mapparle a più tipi diversi tramite un modulo NumericLiteral. Provare a sostituire con una variabile e usare 'when <variabile> = <costante>' alla fine della clausola di ricerca.
ja: プリミティブではない数値リテラル定数は、NumericLiteral モジュールを介して複数の型にマップされる可能性があるため、パターン マッチには使用できません。変数で置き換え、match 句の末尾に 'when <variable> = <constant>' を使用してください。
ko: 기본 형식이 아닌 숫자 리터럴 상수는 NumericLiteral 모듈을 사용하여 다양한 형식에 매핑될 수 있으므로 패턴 일치에 사용할 수 없습니다. 변수로 바꾸고 일치 절의 끝에 'when <variable> = <constant>'를 사용하세요.
pl: Niepierwotne stałe literałów liczbowych nie mogą być używane w dopasowaniach wzorców, ponieważ mogą być mapowane na wiele różnych typów przez użycie modułu NumericLiteral. Zamiast tego rozważ użycie zmiennej i użyj konstrukcji „when <zmienna> = <stała>” na końcu klauzuli dopasowania.
pt_br: Constantes literais numéricas não-primitivas não podem ser usadas em correspondências de padrões porque elas podem ser mapeadas para vários tipos diferentes através do uso de um módulo NumericLiteral. Substitua por uma variável e use 'when <variable> = <constant>' no fim da cláusula de correspondência.
ru: Непримитивные числовые символьные константы не могут использоваться в выражениях сопоставления шаблонов, так как они могут быть сопоставлены различным типам с использованием модуля NumericLiteral. Замените эти константы на переменные, указав конструкцию 'when <переменная> = <константа>' в конце выражения сопоставления.
tr: Temel olmayan sayısal sabit değerler bir NumericLiteral kullanılarak birden çok farklı türle eşleştirilemediğinden desen eşleştirmelerinde kullanılamaz. Bunu bir değişkenle değiştirmeyi ve eşleşme yan tümcesinin sonunda 'when <variable> = <constant>' kullanmayı göz önünde bulundurun.
zh_hans: 非基元数值文本常量不能用于模式匹配，因为可以通过使用 NumericLiteral 模块将这些常量映射到多个不同类型。请考虑将其替换为一个变量，并在 match 子句的结尾使用 "when <variable> = <constant>"。
zh_hant: 因為非基本數值的常值常數可以透過使用 NumericLiteral 模組來對應到多個不同的類型，所以無法用於模式比對。請考慮以變數取代，並在比對子句的結尾使用 'when <variable> = <constant>'。

# tcInvalidTypeArgumentUsage
source: Type arguments cannot be specified here
cs: Argumenty typu tady nejde zadat.
de: Typargumente können an dieser Stelle nicht angegeben werden.
es: Aquí no se pueden especificar argumentos de tipo.
fr: Impossible de spécifier des arguments de type ici
it: Non è possibile specificare argomenti tipo in questa posizione
ja: ここで型引数は指定できません
ko: 형식 인수는 여기에 지정할 수 없습니다.
pl: Nie można tutaj określać argumentów typu
pt_br: Argumentos de tipos não podem ser especificados aqui
ru: Аргументы типа не могут быть здесь указаны
tr: Tür bağımsız değişkenleri burada belirtilemez
zh_hans: 无法在此处指定类型参数
zh_hant: 此處不能指定類型引數

# tcRequireActivePatternWithOneResult
source: Only active patterns returning exactly one result may accept arguments
cs: Argumenty můžou přebírat jenom aktivní vzory, které vracejí právě jeden výsledek.
de: Nur aktive Muster, die genau ein Ergebnis zurückgeben, dürfen Argumente akzeptieren.
es: Solo los patrones activos que devuelven exactamente un resultado pueden aceptar argumentos.
fr: Seuls les modèles actifs qui retournent un seul résultat peuvent accepter des arguments
it: Solo i criteri attivi che restituiscono esattamente un risultato possono accettare argomenti
ja: 結果を 1 つだけ返すアクティブ パターンのみが、引数を使用できます
ko: 하나의 결과를 반환하는 활성 패턴만 인수를 사용할 수 있습니다.
pl: Tylko aktywne wzorce zwracające dokładnie jeden wynik mogą akceptować argumenty
pt_br: Somente padrões ativos que retornam exatamente um resultado podem aceitar argumentos
ru: Только активные шаблоны, возвращающие ровно один результат, могут принимать аргументы
tr: Yalnızca tam olarak bir sonuç döndüren etkin desenler bağımsız değişken kabul edilebilir
zh_hans: 仅有正好返回一个结果的活动模式才可以接受参数
zh_hant: 只有剛好傳回一個結果的現用模式可以接受引數

# tcInvalidArgForParameterizedPattern
source: Invalid argument to parameterized pattern label
cs: Neplatný argument popisku parametrizovaného vzoru
de: Ungültiges Argument für parametrisierte Musterbezeichnung.
es: Argumento no válido para parametrizar una etiqueta de patrón.
fr: Argument non valide pour l'étiquette de modèle paramétrable
it: Argomento non valido per un'etichetta di criterio con parametri
ja: パラメーター化されたパターン ラベルに無効な引数が指定されました
ko: 매개 변수가 있는 패턴 레이블에 대한 인수가 잘못되었습니다.
pl: Nieprawidłowy argument etykiety wzorca z parametrami
pt_br: Argumento inválido para rótulo padrão parametrizado
ru: Недопустимый аргумент в параметризованной метке шаблона
tr: Parametreli desen etiketine geçersiz bağımsız değişken
zh_hans: 参数化模式标签的参数无效
zh_hant: 參數化模式標籤的引數無效

# tcInvalidIndexIntoActivePatternArray
source: Internal error. Invalid index into active pattern array
cs: Vnitřní chyba. Neplatný index pro pole aktivního vzoru
de: Interner Fehler. Ungültiger Index für aktives Musterarray.
es: Error interno. Índice no válido en una matriz de patrones activos.
fr: Erreur interne. Index non valide dans le tableau du modèle actif
it: Errore interno. Indice non valido nella matrice di criteri attivi
ja: 内部エラー。アクティブ パターン配列への無効なインデックスです。
ko: 내부 오류입니다. 활성 패턴 배열에 대한 인덱스가 잘못되었습니다.
pl: Błąd wewnętrzny. Nieprawidłowy indeks w tablicy aktywnego wzorca
pt_br: Erro interno. Indexação inválida em matriz de padrão ativa
ru: Внутренняя ошибка. Недопустимый индекс в массив активного шаблона
tr: İç hata. Etkin desen dizisi için geçersiz dizin
zh_hans: 内部错误。活动模式数组中的索引无效
zh_hant: 內部錯誤。現用模式陣列的索引無效

# tcUnionCaseDoesNotTakeArguments
source: This union case does not take arguments
cs: Tento případ typu union nepřebírá argumenty.
de: Dieser Union-Fall akzeptiert keine Argumente.
es: Este caso de unión no toma argumentos.
fr: Ce cas d'union n'accepte pas d'arguments
it: Questo case di unione non accetta argomenti
ja: この共用体ケースに引数は指定できません
ko: 이 공용 구조체 케이스는 인수를 사용하지 않습니다.
pl: Ten przypadek unii nie akceptuje argumentów
pt_br: Este caso união não obtém argumentos
ru: Данный случай объединения не принимает аргументов
tr: Bu birleşim durumu bağımsız değişken almaz
zh_hans: 此联合用例不采用参数
zh_hant: 這個聯集不接受引數

# tcUnionCaseRequiresOneArgument
source: This union case takes one argument
cs: Tento případ typu union přebírá jeden argument.
de: Dieser Union-Fall akzeptiert ein Argument.
es: Este caso de unión toma un argumento.
fr: Ce cas d'union accepte un argument
it: Questo case di unione accetta un argomento
ja: この共用体ケースには 1 つの引数を指定します
ko: 이 공용 구조체 케이스는 하나의 인수를 사용합니다.
pl: Ten przypadek unii akceptuje jeden argument
pt_br: Este caso união obtém um argumento
ru: Данный случай объединения принимает один аргумент
tr: Bu birleşim durumu bir bağımsız değişken alır
zh_hans: 此联合用例采用一个参数
zh_hant: 這個聯集接受一個引數

# tcUnionCaseExpectsTupledArguments
source: This union case expects {0} arguments in tupled form
cs: Tento případ typu union očekává argumenty v počtu {0} v podobě řazené kolekce členů.
de: Dieser Union-Fall erwartet {0} Argumente als Tupel.
es: Este caso de unión espera {0} argumentos en forma de tupla.
fr: Ce cas d'union attend {0} arguments basés sur des tuples
it: Questo case di unione prevede {0} argomenti sotto forma di tupla
ja: この共用体ケースにはタプル形式の引数を {0} 個指定してください
ko: 이 공용 구조체 케이스에는 튜플된 형식의 인수 {0}개가 필요합니다.
pl: Ten przypadek unii oczekuje {0} argumentów w postaci spójnej kolekcji
pt_br: Este caso união espera argumentos {0} na forma de tupla
ru: Для данного случая объединения требуется {0} аргументов в форме кортежа
tr: Bu birleşim durumu grup olarak tanımlanmış biçimde {0} bağımsız değişken bekliyor
zh_hans: 此联合用例需要 {0} 个元组格式的参数
zh_hant: 這個聯集需要 {0} 個 Tuple 形式的引數

# tcFieldIsNotStatic
source: Field '{0}' is not static
cs: Pole {0} není statické.
de: Das Feld "{0}" ist nicht statisch.
es: El campo '{0}' no es estático.
fr: Le champ '{0}' n'est pas statique
it: Il campo '{0}' non è statico
ja: フィールド '{0}' は静的ではありません
ko: '{0}'은(는) 정적 필드가 아닙니다.
pl: Pole „{0}” nie jest statyczne
pt_br: O campo '{0}' não é estático
ru: Поле "{0}" не является статическим
tr: '{0}' alanı statik değil
zh_hans: 字段“{0}”不是静态的
zh_hant: 欄位 '{0}' 不是靜態的

# tcFieldNotLiteralCannotBeUsedInPattern
source: This field is not a literal and cannot be used in a pattern
cs: Toto pole není literál a nedá se použít ve vzoru.
de: Dieses Feld ist kein Literal und kann nicht als Muster verwendet werden.
es: Este campo no es un literal y no se puede usar en un patrón.
fr: Ce champ n'est pas un littéral. Impossible de l'utiliser dans un modèle
it: Questo campo non è un valore letterale e non è possibile utilizzarlo in un criterio
ja: このフィールドはリテラルではないため、パターンに使用できません
ko: 이는 리터럴 필드가 아니며 패턴에 사용할 수 없습니다.
pl: To pole nie jest literałem i nie można go użyć we wzorcu
pt_br: Este campo não é um literal e não pode ser usado como um padrão
ru: Данное поле не является литералом и не может использоваться в шаблоне
tr: Bu alan sabit değer olmadığından desende kullanılamaz
zh_hans: 此字段不是文本，不能在模式中使用
zh_hant: 這個欄位不是常值，無法用在模式中

# tcRequireVarConstRecogOrLiteral
source: This is not a variable, constant, active recognizer or literal
cs: Toto není proměnná, konstanta, aktivní rozlišovač nebo literál.
de: Hierbei handelt es sich nicht um eine Variable, Konstante, eine aktive Erkennung oder ein Literal.
es: Este elemento no es una variable, una constante, un reconocedor activo ni un literal.
fr: Ceci n'est pas une variable, une constante, un module de reconnaissance actif ou un littéral
it: Questo elemento non è una variabile, una costante, un valore letterale o un riconoscimento attivo
ja: これは変数、定数、アクティブ レコグナイザー、またはリテラルではありません
ko: 변수, 상수, 활성 인식기 또는 리터럴이 아닙니다.
pl: To nie jest zmienna, stała, aktywny aparat rozpoznawania ani literał
pt_br: Isto não é uma variável, constante, reorganizador ativo ou literal
ru: Это не переменная, константа, активный распознаватель или литерал
tr: Bu bir değişkeni sabit, etkin tanıyıcı veya sabit değer değil
zh_hans: 这不是变量、常数、活动识别器或文本
zh_hant: 這不是變數、常數、現用辨識器或常值

# tcInvalidPattern
source: This is not a valid pattern
cs: Toto není platný vzor.
de: Dies ist kein gültiges Muster.
es: Este no es un patrón válido.
fr: Modèle non valide
it: Questo non è un criterio valido
ja: これは有効なパターンではありません
ko: 올바른 패턴이 아닙니다.
pl: To nie jest prawidłowy wzorzec
pt_br: Este não é um padrão válido
ru: Недопустимый шаблон.
tr: Bu geçerli bir desen değil
zh_hans: 这不是有效的模式
zh_hant: 這不是有效的模式

# tcUseWhenPatternGuard
source: Character range matches have been removed in F#. Consider using a 'when' pattern guard instead.
cs: Porovnání rozsahu znaků se už v F# nepoužívá. Zvažte možnost použít místo toho ochrannou vazbu vzoru when.
de: Der Abgleich von Zeichenbereichen wurde in F# entfernt. Verwenden Sie stattdessen einen when-Musterwächter.
es: Las coincidencias de intervalo de caracteres se han quitado en F#. Considere el uso de una restricción de patrón 'when' en su lugar.
fr: Les correspondances de plages de caractères ont été supprimées de F#. Utilisez une garde par modèle 'when' à la place.
it: Corrispondenze dell'intervallo di caratteri rimosse in F#. Provare a utilizzare invece un'espressione guard con criterio 'when'.
ja: F# では文字範囲の一致が削除されました。代わりに 'when' パターン ガードを使用してください。
ko: 문자 범위 일치는 F#에서 제거되었습니다. 대신 'when' 패턴 가드를 사용하세요.
pl: Dopasowania zakresu znaków zostały usunięte w języku F#. Zamiast tego rozważ użycie ograniczenia wzorca „when”.
pt_br: Correspondências de intervalo de caractere foram removidas em F#. Considere usar um 'when' na proteção padrão.
ru: Совпадения диапазона символов были убраны из F#. Вместо этого рекомендуется использовать шаблон условия "when".
tr: Karakter aralığı eşleştirmeler F# dilinde kaldırılmıştır. Onun yerine 'when' desen koruma kullanmayı düşünün.
zh_hans: 在 F# 中，已删除字符范围匹配。请考虑改用“when”模式保护。
zh_hant: 字元範圍比對已從 F# 中移除。請考慮改用 'when' 模式成立條件。

# tcIllegalPattern
source: Illegal pattern
cs: Neplatný vzor
de: Unzulässiges Muster.
es: Patrón no válido.
fr: Modèle non conforme
it: Criterio non valido
ja: パターンが正しくありません
ko: 패턴이 잘못되었습니다.
pl: Niedozwolony wzorzec
pt_br: Padrão inválido
ru: Недопустимый шаблон
tr: Geçersiz desen
zh_hans: 非法模式
zh_hant: 不合法的模式

# tcSyntaxErrorUnexpectedQMark
source: Syntax error - unexpected '?' symbol
cs: Chyba syntaxe: neočekávaný symbol ?
de: Syntaxfehler – unerwartetes Symbol "?".
es: Error de sintaxis: símbolo '?' inesperado
fr: Erreur de syntaxe - symbole '?' inattendu
it: Errore di sintassi: previsto simbolo '?'
ja: 構文エラー - 予期しない '?' 記号です
ko: 구문 오류 - 예기치 않은 '?' 기호입니다.
pl: Błąd składni — nieoczekiwany symbol „?”
pt_br: Erro de sintaxe - símbolo '?' inesperado
ru: Ошибка синтаксиса - недопустимый символ "?"
tr: Sözdizimi hatası - beklenmeyen '?' simgesi
zh_hans: 语法错误 - 意外的“?”符号
zh_hant: 語法錯誤 - 未預期的 '?' 符號

# tcExpressionCountMisMatch
source: Expected {0} expressions, got {1}
cs: Očekávaný počet výrazů je {0}. Počet předaných je {1}.
de: Es wurden {0} Ausdrücke erwartet, aber {1} empfangen.
es: Se esperaban {0} expresiones y se obtuvieron {1}.
fr: {0} expressions attendues, {1} obtenue(s)
it: Previste {0} espressioni, ottenute {1}
ja: {0} 式を指定する必要がありますが、{1} が指定されました
ko: {0}개의 식이 필요한데 {1}개를 받았습니다.
pl: Oczekiwano wyrażeń w liczbie {0}; otrzymano: {1}
pt_br: Expressões {0} esperadas, {1} obtidas
ru: Требуется {0} выражений, получено {1}
tr: {0} ifadeleri bekleniyordu, {1} alındı
zh_hans: 需要 {0} 个表达式，已获取 {1} 个
zh_hant: 必須是 {0} 運算式，卻得到 {1}

# tcExprUndelayed
source: TcExprUndelayed: delayed
cs: TcExprUndelayed: zpožděné
de: TcExprUndelayed: verzögert
es: TcExprUndelayed: retrasado
fr: TcExprUndelayed : différé
it: TcExprUndelayed: con ritardo
ja: TcExprUndelayed: 遅延しました
ko: TcExprUndelayed: 지연되었습니다.
pl: TcExprUndelayed: opóźnione
pt_br: TcExprUndelayed: atrasado
ru: TcExprUndelayed: инерционность
tr: TcExprUndelayed: gecikti
zh_hans: TcExprUndelayed: 已延迟
zh_hant: TcExprUndelayed: 已延遲

# tcExpressionRequiresSequence
source: This expression form may only be used in sequence and computation expressions
cs: Tato notace výrazu se dá použít jenom ve výrazech pořadí a výpočtu.
de: Dieses Ausdrucksformat darf nur in Sequenz- und Berechnungsausdrücken verwendet werden.
es: Este formato de expresión se puede usar sólo en expresiones de secuencia y cómputo.
fr: Cette forme d'expression ne peut être utilisée que dans des expressions de séquence et de calcul
it: Questo formato di espressione può essere utilizzato solo in espressioni sequenza e di calcolo
ja: この式の形式を使用できるのは、シーケンス式またはコンピュテーション式のみです
ko: 이 식 형식은 시퀀스 및 계산 식에만 사용할 수 있습니다.
pl: Ta postać wyrażenia może być używana tylko w wyrażeniach sekwencji i obliczeń
pt_br: Este forma de expressão só pode ser utilizada em expressões de computação e sequência
ru: Данная форма выражения может использоваться только в выражениях последовательности и вычислений.
tr: Bu ifade biçimi yalnızca dizi ve hesaplama ifadelerinde kullanılabilir
zh_hans: 此表达式格式只能用于序列和计算表达式
zh_hant: 這種運算式形式只能用在循序項運算式和計算運算式中

# tcInvalidObjectExpressionSyntaxForm
source: Invalid object expression. Objects without overrides or interfaces should use the expression form 'new Type(args)' without braces.
cs: Neplatný objektový výraz. U objektů bez přepsání nebo rozhraní by se měl výraz formulovat pomocí notace new Type(args) bez složených závorek.
de: Ungültiger Objektausdruck. Objekte ohne Überschreibungen oder Schnittstellen sollten das Ausdrucksformat "new Type(args)" ohne geschweifte Klammern verwenden.
es: Expresión de objeto no válida. Los objetos sin invalidaciones ni interfaces deben usar el formato de expresión 'new Type(args)' sin llaves.
fr: Expression d'objet non valide. Les objets sans substitutions ou interfaces doivent utiliser la forme d'expression 'new Type(args)' sans accolades.
it: Espressione oggetto non valida. Gli oggetti senza override o interfacce devono usare il formato di espressione 'new Type(args)' senza parentesi graffe.
ja: オブジェクト式が無効です。オーバーライドまたはインターフェイスがないオブジェクトには、かっこなしで 'new Type(args)' という形式の式を使用してください。
ko: 개체 식이 잘못되었습니다. 재정의 또는 인터페이스가 없는 개체는 중괄호 없이 식 형식 'new Type(args)'을 사용해야 합니다.
pl: Nieprawidłowe wyrażenie obiektu. Obiekty bez przesłonięć lub interfejsy powinny używać wyrażenia w postaci „new Typ(argumenty)” bez nawiasów.
pt_br: Expressão de objeto inválida. Objetos sem substituições ou interfaces devem usar o formato de expressão 'new Type(args)' sem as chaves.
ru: Недопустимое выражение объекта. Объекты без переопределений или интерфейсов должны использовать форму выражения "new Type(args)" без фигурных скобок.
tr: Geçersiz nesne ifadesi. Geçersiz kılmaların ve arabirimlerin olmadığı nesneler küme ayraçsız 'new Type(args)' ifade biçimini kullanmalıdır.
zh_hans: 对象表达式无效。没有重写或接口的对象应使用不带括号的表达式格式“new Type(args)”。
zh_hant: 無效的物件運算式。沒有覆寫或介面的物件應該使用不加大括號的運算式形式 'new Type(args)'。

# tcInvalidObjectSequenceOrRecordExpression
source: Invalid object, sequence or record expression
cs: Neplatný výraz objektu, pořadí nebo záznamu
de: Ungültiger Objekt-, Sequenz- oder Datensatzausdruck.
es: Expresión de objeto, secuencia o registro no válida.
fr: Expression d'objet, de séquence ou d'enregistrement non valide
it: Espressione record, sequenza o oggetto non valida
ja: オブジェクト式、シーケンス式、またはレコード式が無効です
ko: 개체, 시퀀스 또는 레코드 식이 잘못되었습니다.
pl: Nieprawidłowe wyrażenie obiektu, sekwencji lub rekordu
pt_br: Expressão de objeto, sequência ou registro inválida
ru: Недопустимое выражение объекта, последовательности или записи
tr: Geçersiz nesne, dizi veya kayıt ifadesi
zh_hans: 对象、序列或记录表达式无效
zh_hant: 無效的物件、順序或記錄運算式

# tcInvalidSequenceExpressionSyntaxForm
source: Invalid record, sequence or computation expression. Sequence expressions should be of the form 'seq {{ ... }}'
cs: Neplatný výraz záznamu, pořadí nebo výpočtu. Výrazy pořadí by měly mít notaci seq {{ ... }}.
de: Ungültiger Datensatz-, Sequenz- oder Berechnungsausdruck. Sequenzausdrücke müssen das Format "seq {{ ... }}" besitzen.
es: Expresión de registro, secuencia o cómputo no válida. Las expresiones de secuencia deben tener el formato 'seq {{ ... }}'.
fr: Expression d'enregistrement, de séquence ou de calcul non valide. Les expressions de séquence doivent avoir le format 'seq {{ ... }}'
it: Espressione di calcolo, sequenza o record non valida. Il formato delle espressioni sequenza deve essere 'seq {{ ... }}'
ja: 無効なレコード、シーケンス式、またはコンピュテーション式です。シーケンス式は 'seq {{ ... }}' という形式にしてください。
ko: 레코드, 시퀀스 또는 계산 식이 잘못되었습니다. 시퀀스 식의 형식은 'seq {{ ... }}'여야 합니다.
pl: Nieprawidłowe wyrażenie rekordu, sekwencji lub obliczenia. Wyrażenia sekwencji powinny mieć postać „seq {{ ... }}”
pt_br: Expressão de registro, sequência ou computação inválida. Expressões de sequência devem estar na forma 'seq {{ ... }}'
ru: Недопустимая запись, выражение последовательности или вычислительное выражение. Выражения последовательностей должны иметь форму "seq {{ ... }}'
tr: Geçersiz kayıt, dizi veya hesaplama ifadesi. Dizi ifadeleri 'seq {{ ... }}' biçiminde olmalıdır
zh_hans: 记录、序列或计算表达式无效。序列表达式的格式应为“seq {{ ... }}”}}'
zh_hant: 無效的記錄、循序項或計算運算式。循序項運算式應該是 'seq {{ ... }}' 形式。
