Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# typrelCannotResolveImplicitGenericInstantiation
source: The implicit instantiation of a generic construct at or near this point could not be resolved because it could resolve to multiple unrelated types, e.g. '{0}' and '{1}'. Consider using type annotations to resolve the ambiguity
cs: Nepovedlo se přeložit implicitní vytvoření instance obecného konstruktoru na této pozici nebo blízko ní, protože by se dala přeložit na víc nesouvisejících typů, třeba {0} a {1}. Tuto nejednoznačnost můžete vyřešit pomocí poznámek typu.
de: Die implizite Instanziierung eines generischen Konstrukts an diesem Punkt oder in dessen Umgebung konnte nicht aufgelöst werden, weil sie zu mehreren unzusammenhängenden Typen aufgelöst werden könnte, z.B. "{0}" und "{1}". Verwenden Sie Typanmerkungen, um die Mehrdeutigkeit aufzulösen.
es: No se pudo resolver la creación de instancia implícita de una construcción genérica en este punto o cerca de él porque se podía resolver en varios tipos no relacionados; por ejemplo, '{0}' y '{1}'. Considere el uso de anotaciones de tipo para resolver la ambigüedad.
fr: Impossible de résoudre l'instanciation implicite d'une construction générique à cet emplacement ou à proximité, car elle peut être résolue en plusieurs types non liés, par exemple '{0}' et '{1}'. Utilisez des annotations de type pour résoudre l'ambigüité
it: Non è stato possibile risolvere la creazione di istanza implicita di un costrutto generico in questo punto o in prossimità di esso perché la risoluzione potrebbe restituire più tipi non correlati, ad esempio '{0}' e '{1}'. Provare a usare annotazioni di tipo per risolvere l'ambiguità
ja: この場所またはその付近にあるジェネリック コンストラクトの暗黙的なインスタンス化を解決できませんでした。これは、関連性のない複数の型に解決される可能性があるためです (たとえば、'{0}' と '{1}')。あいまいさを解決するために、型の注釈を使用してください。
ko: 관련되지 않은 여러 형식(예: '{0}'과(와) '{1}')으로 확인될 수 있으므로 이 지점 또는 이 지점 근처에서 제네릭 구문의 암시적 인스턴스를 확인할 수 없습니다. 형식 주석을 사용하여 모호성을 해결하세요.
pl: Nie można rozpoznać niejawnego wystąpienia konstrukcji ogólnej w tym miejscu lub w jego pobliżu, ponieważ może to spowodować powstanie wielu niepowiązanych typów, na przykład „{0}” i „{1}”. Rozważ użycie adnotacji typu w celu rozwiązania niejednoznaczności
pt_br: A instanciação implícita do constructo genérico neste ponto ou próximo a ele não pode ser resolvida porque ele conseguiu resolver tipos não relacionados múltiplos, por exemplo '{0}' e '{1}'. Considere usar anotações de tipo para resolver a ambiguidade
ru: Неявное создание экземпляров базовой конструкции в данной точке или рядом с ней не может быть разрешено, так как тогда возможно разрешение в несколько несвязанных типов, напр. "{0}" и "{1}". Рекомендуется использовать аннотации типа для решения неоднозначности
tr: Genel yapının bu konumda veya yakınında örtük olarak örneklenmesi çözümlenemedi, çünkü ilişkisiz birden çok türe çözümlenebiliyordu, örn. '{0}' ve '{1}'. Belirsizliği çözümlemek için tür ek açıklamaları kullanmayı düşünün
zh_hans: 未能解析在此点或其附近进行的泛型构造的隐式实例化，因为它可以解析为多个不相关的类型，例如“{0}”和“{1}”。请考虑使用类型批注来解析此多义性
zh_hant: 無法解決在這個點或附近的泛型建構的隱含具現化，因為它可能解析成多個不相關的類型，例如 '{0}' 和 '{1}'。請考慮使用類型註釋來解決模稜兩可

# typrelCannotResolveAmbiguityInPrintf
source: Could not resolve the ambiguity inherent in the use of a 'printf'-style format string
cs: Nepovedlo se vyřešit nejednoznačnost vyplývající z použití formátovacího řetězce ve stylu printf.
de: Die inhärente Mehrdeutigkeit bei der Verwendung einer printf-Formatzeichenfolge konnte nicht aufgelöst werden.
es: No se pudo resolver la ambigüedad inherente en el uso de una cadena de formato de tipo 'printf'.
fr: Impossible de résoudre l'ambigüité inhérente à l'utilisation d'une chaîne de format de style 'printf'
it: Non è stato possibile risolvere l'ambiguità relativa all'uso della stringa di formato di stile 'printf'
ja: 'printf' 形式の書式指定文字列の使用に関して、あいまいな継承を解決できませんでした
ko: 'printf' 스타일의 서식 문자열 사용과 관련하여 본질적으로 발생하는 모호성을 해결할 수 없습니다.
pl: Nie można usunąć niejednoznaczności spowodowanej użyciem ciągu formatu „printf”
pt_br: Não foi possível resolver a ambiguidade inerente ao uso de uma cadeia de caracteres com formato de estilo 'printf'
ru: Не удалось разрешить неоднозначность, унаследованную в использовании строки формата вида "printf"
tr: 'printf' stilindeki biçim dizesinin kullanılmasına bulunan belirsizlik çözümlenemedi.
zh_hans: 未能解析使用 "printf" 样式的格式字符串所产生的固有多义性
zh_hant: 無法解決使用 'printf' 樣式的格式字串時固有的模稜兩可

# typrelCannotResolveAmbiguityInEnum
source: Could not resolve the ambiguity in the use of a generic construct with an 'enum' constraint at or near this position
cs: Nepovedlo se vyřešit nejednoznačnost v použití obecného konstruktoru s omezením enum na této pozici nebo blízko ní.
de: Die Mehrdeutigkeit bei der Verwendung eines generischen Konstrukts mit einer enum-Einschränkung an dieser Position oder in ihrer Umgebung konnte nicht aufgelöst werden.
es: No se pudo resolver la ambigüedad en el uso de una construcción genérica con una restricción 'enum' en esta posición o cerca de ella.
fr: Impossible de résoudre l'ambigüité liée à l'utilisation d'une construction générique avec une contrainte 'enum' à cette position ou à proximité
it: Non è stato possibile risolvere l'ambiguità relativa all'uso di un costrutto generico con un vincolo 'enum' in questa posizione o in prossimità di essa
ja: この位置、またはこの位置付近にある 'enum' 制約を含むジェネリック コンストラクトの使用に関して、あいまいさを解決できませんでした
ko: 이 위치 또는 이 위치 근처에서 'enum' 제약 조건을 사용하여 제네릭 구문 사용의 모호성을 해결할 수 없습니다.
pl: Nie można usunąć niejednoznaczności w przypadku użycia konstrukcji ogólnej z ograniczeniem „enum” w tym miejscu lub w jego pobliżu
pt_br: Não foi possível resolver a ambiguidade no uso de um construtor genérico com uma restrição 'enum' nesta posição ou próximo a ela
ru: Не удалось разрешить неоднозначность в использовании базовой конструкции с ограничением "enum" в этой позиции или рядом с ней
tr: Bu konumda veya yakınında 'enum' kısıtlaması olan bir genel yapının kullanımındaki belirsizlik çözümlenemedi
zh_hans: 未能解析在此位置或其附近使用带 "enum" 约束的泛型构造所产生的多义性
zh_hant: 無法解決在這個位置或附近使用具有 'enum' 條件約束的泛型建構時造成的模稜兩可

# typrelCannotResolveAmbiguityInDelegate
source: Could not resolve the ambiguity in the use of a generic construct with a 'delegate' constraint at or near this position
cs: Nepovedlo se vyřešit nejednoznačnost v použití obecného konstruktoru s omezením delegate na této pozici nebo blízko ní.
de: Die Mehrdeutigkeit bei der Verwendung eines generischen Konstrukts mit einer delegate-Einschränkung an dieser Position oder in ihrer Umgebung konnte nicht aufgelöst werden.
es: No se pudo resolver la ambigüedad en el uso de una construcción genérica con una restricción 'delegate' en esta posición o cerca de ella.
fr: Impossible de résoudre l'ambigüité liée à l'utilisation d'une construction générique avec une contrainte 'delegate' à cette position ou à proximité
it: Non è stato possibile risolvere l'ambiguità relativa all'uso di un costrutto generico con un vincolo 'delegate' in questa posizione o in prossimità di essa
ja: この位置、またはこの位置付近にある 'delegate' 制約を含むジェネリック コンストラクトの使用に関して、あいまいさを解決できませんでした
ko: 이 위치 또는 이 위치 근처에서 'delegate' 제약 조건을 사용하여 제네릭 구문 사용의 모호성을 해결할 수 없습니다.
pl: Nie można usunąć niejednoznaczności w przypadku użycia konstrukcji ogólnej z ograniczeniem „delegate” w tym miejscu lub w jego pobliżu.
pt_br: Não foi possível resolver a ambiguidade no uso de um construtor genérico com uma restrição 'delegate' nesta posição ou próximo a ela
ru: Не удалось разрешить неоднозначность в использовании базовой конструкции с ограничением "delegate" в этой позиции или рядом с ней
tr: Bu konumda veya yakınında 'delegate' kısıtlaması olan bir genel yapının kullanımındaki belirsizlik çözümlenemedi
zh_hans: 未能解析在此位置或其附近使用带 "delegate" 约束的泛型构造所产生的多义性
zh_hant: 無法解決在這個位置或附近使用具有 'delegate' 條件約束的泛型建構時造成的模稜兩可

# typrelInvalidValue
source: Invalid value
cs: Neplatná hodnota
de: Ungültiger Wert.
es: Valor no válido
fr: Valeur non valide
it: Valore non valido
ja: 無効な値
ko: 잘못된 값
pl: Nieprawidłowa wartość
pt_br: Valor inválido
ru: Недопустимое значение
tr: Geçersiz değer
zh_hans: 无效值
zh_hant: 值無效

# typrelSigImplNotCompatibleParamCountsDiffer
source: The signature and implementation are not compatible because the respective type parameter counts differ
cs: Signatura a implementace nejsou kompatibilní, protože se liší počtem příslušných parametrů typu.
de: Die Signatur und die Implementierung sind nicht kompatibel, da die Anzahl der entsprechenden Typparameter unterschiedlich ist.
es: La signatura y la implementación no son compatibles porque los recuentos de parámetros de tipo respectivos difieren.
fr: La signature et l'implémentation ne sont pas compatibles, car le nombre de paramètres de type respectifs est différent
it: La firma e l'implementazione non sono compatibili perché i rispettivi conteggi di parametri di tipo sono diversi
ja: それぞれの型パラメーターの数が異なるため、シグネチャおよび実装は互換性がありません
ko: 각각의 형식 매개 변수 수가 서로 다르므로 시그니처와 구현이 호환되지 않습니다.
pl: Sygnatura i implementacja nie są zgodne z powodu różnej liczby odpowiednich parametrów typu
pt_br: A assinatura e implementação não são compatíveis porque as contagens de parâmetros de tipo respectivas são diferentes
ru: Сигнатура и реализация несовместимы, поскольку соответствующие количества параметров типов различаются
tr: İlgili tür parametresi sayıları farklı olduğu için imza ve uygulama uyumlu değil
zh_hans: 签名和实现不兼容，因为各自的类型参数数目不同
zh_hant: 簽章與實作不相容，因為個別的型別參數計數不同

# typrelSigImplNotCompatibleCompileTimeRequirementsDiffer
source: The signature and implementation are not compatible because the type parameter in the class/signature has a different compile-time requirement to the one in the member/implementation
cs: Signatura a implementace nejsou kompatibilní, protože parametr typu v třídě nebo signatuře má jiný požadavek za kompilace než parametr u člena nebo implementace.
de: Die Signatur und die Implementierung sind nicht kompatibel, da der Typparameter in der Klasse/Signatur eine andere Kompilierzeitanforderung stellt als der Member bzw. die Implementierung.
es: La signatura y la implementación no son compatibles porque el parámetro de tipo de la clase o signatura tiene un requisito en tiempo de compilación diferente al del miembro o implementación.
fr: La signature et l'implémentation ne sont pas compatibles, car le paramètre de type de la classe/signature n'a pas la même exigence au moment de la compilation que celui du membre/de l'implémentation
it: La firma e l'implementazione non sono compatibili perché il parametro di tipo nella classe/firma ha un requisito della fase di compilazione diverso rispetto a quello nel membro/implementazione
ja: クラス/シグネチャの型パラメーターには、メンバー/実装の型パラメーターとは異なるコンパイル時の要件があるため、シグネチャと実装には互換性がありません
ko: 클래스/시그니처에 있는 형식 매개 변수의 컴파일 시간 요구 사항이 멤버/구현에 있는 형식 매개 변수와 다르므로 시그니처와 구현이 호환되지 않습니다.
pl: Sygnatura i implementacja nie są zgodne, ponieważ parametr typu w klasie/sygnaturze ma inne wymaganie dotyczące czasu kompilacji niż parametr w elemencie członkowskim/implementacji
pt_br: A assinatura e implementação não são compatíveis porque o parâmetro de tipo na classe/assinatura tem um requisito em tempo de compilação diferente de um membro/implementação
ru: Сигнатура и реализация несовместимы, так как параметр типа в классе/сигнатуре имеет требования по времени компилирования, отличные от требований в элементе/реализации
tr: Sınıf/imzadaki tür parametresinin üye/uygulama içindekinden farklı bir derleme zamanı gereksinimi olduğu için imza ve uygulama uyumlu değil
zh_hans: 签名和实现不兼容，因为类/签名中的类型参数与成员/实现中的类型参数具有的编译时要求不同
zh_hant: 簽章與實作不相容，因為類別/簽章中的型別參數與成員/實作中的型別參數具有不同的編譯時間需求

# typrelSigImplNotCompatibleConstraintsDiffer
source: The signature and implementation are not compatible because the declaration of the type parameter '{0}' requires a constraint of the form {1}
cs: Signatura a implementace nejsou kompatibilní, protože deklarace parametru typu {0} vyžaduje omezení v podobě {1}.
de: Die Signatur und die Implementierung sind nicht kompatibel, da die Deklaration des Typparameters "{0}" eine Einschränkung im Format "{1}" erfordert.
es: La signatura y la implementación no son compatibles porque la declaración del parámetro de tipo '{0}' requiere una restricción con el formato {1}.
fr: La signature et l'implémentation ne sont pas compatibles, car la déclaration du paramètre de type '{0}' requiert une contrainte sous la forme {1}
it: La firma e l'implementazione non sono compatibili perché la dichiarazione del parametro di tipo '{0}' richiede un vincolo nel formato {1}
ja: 型パラメーター '{0}' の宣言には形式 {1} の制約が必要なため、シグネチャと実装には互換性がありません
ko: 형식 매개 변수 '{0}'의 선언을 사용하려면 {1} 형식의 제약 조건이 필요하므로 시그니처와 구현이 호환되지 않습니다.
pl: Sygnatura i implementacja nie są zgodne, ponieważ deklaracja parametru typu „{0}” wymaga ograniczenia w postaci {1}
pt_br: A assinatura e implementação não são compatíveis porque a declaração do parâmetro de tipo '{0}' requer uma restrição da forma {1}
ru: Сигнатура и реализация несовместимы, так как объявление параметра типа "{0}" требует ограничения формы {1}
tr: {0}' tür parametresinin bildirimi {1} biçiminin kısıtlamasını gerektirdiği için imza ve uygulama uyumlu değil
zh_hans: 签名和实现不兼容，因为类型参数“{0}”的声明需要 {1} 格式的约束
zh_hant: 簽章與實作不相容，因為型別參數 '{0}' 的宣告需要 {1} 形式的條件約束

# typrelSigImplNotCompatibleConstraintsDifferRemove
source: The signature and implementation are not compatible because the type parameter '{0}' has a constraint of the form {1} but the implementation does not. Either remove this constraint from the signature or add it to the implementation.
cs: Signatura a implementace nejsou kompatibilní, protože parametr typu {0} má omezení v podobě {1}, ale implementace ne. Buď toto omezení odeberte ze signatury, nebo ho přidejte do implementace.
de: Die Signatur und die Implementierung sind nicht kompatibel, da der Typparameter "{0}" eine Einschränkung im Format "{1}" aufweist, die Implementierung aber nicht. Entfernen Sie diese Einschränkung entweder aus der Signatur, oder fügen Sie sie der Implementierung hinzu.
es: La signatura y la implementación no son compatibles porque el parámetro de tipo '{0}' tiene una restricción con el formato {1}, pero la implementación no. Quite esta restricción de la signatura o agréguela en la implementación.
fr: La signature et l'implémentation ne sont pas compatibles, car le paramètre de type '{0}' a une contrainte sous la forme {1} mais l'implémentation n'en a pas. Vous devez soit supprimer cette contrainte de la signature, soit l'ajouter à l'implémentation.
it: La firma e l'implementazione non sono compatibili perché il parametro di tipo '{0}' ha un vincolo nel formato {1} non presente tuttavia nell'implementazione. Rimuovere il vincolo dalla firma oppure aggiungerlo all'implementazione.
ja: 型パラメーター '{0}' には形式 {1} の制約がありますが、実装にはないため、シグネチャと実装には互換性がありません。シグネチャからこの制約を削除するか、実装に制約を追加してください。
ko: 형식 매개 변수 '{0}'에 {1} 형식의 제약 조건이 있지만 구현에는 없으므로 시그니처와 구현이 호환되지 않습니다. 이 제약 조건을 시그니처에서 제거하거나 구현에 추가하세요.
pl: Sygnatura i implementacja nie są zgodne, ponieważ parametr typu „{0}” ma ograniczenie w postaci {1}, ale nie ma go implementacja. Usuń to ograniczenie z sygnatury lub dodaj je do implementacji.
pt_br: A assinatura e implementação não são compatíveis porque o parâmetro de tipo '{0}' possui uma restrição da forma {1}, mas a implementação não. Remova esta restrição da assinatura ou a adicione à implementação.
ru: Сигнатура и реализация несовместимы, поскольку параметр типа "{0}" имеет ограничение формы {1}, а реализация не имеет. Удалите это ограничение из сигнатуры либо добавьте его к реализации.
tr: {0}' tür parametresinde {1} biçiminde bir kısıtlama olmasına karşın uygulamada olmadığı için imza ve uygulama uyumlu değil. Bu kısıtlamayı ya imzadan kaldırın ya da uygulamaya ekleyin.
zh_hans: 签名和实现不兼容，因为类型参数“{0}”具有 {1} 格式的约束，而实现没有此约束。从签名中删除此约束，或将此约束添加到实现。
zh_hant: 簽章與實作不相容，因為型別參數 '{0}' 有 {1} 形式的條件約束，但實作沒有。請從簽章移除這個條件約束，或將它加入實作。

# typrelTypeImplementsIComparableShouldOverrideObjectEquals
source: The type '{0}' implements 'System.IComparable'. Consider also adding an explicit override for 'Object.Equals'
cs: Typ {0} implementuje rozhraní System.IComparable. Zvažte možnost přidat taky explicitní přepsání Object.Equals.
de: Der Typ "{0}" implementiert "System.IComparable". Sie sollten ebenfalls eine explizite Überschreibung für "Object.Equals" hinzufügen.
es: El tipo '{0}' implementa 'System.IComparable'. Considere también agregar una invalidación explícita para 'Object.Equals'.
fr: Le type '{0}' implémente 'System.IComparable'. Ajoutez également une substitution explicite pour 'Object.Equals'
it: Il tipo '{0}' implementa 'System.IComparable'. Provare inoltre ad aggiungere un override esplicito per 'Object.Equals'
ja: 型 '{0}' は 'System.IComparable' を実装しています。'Object.Equals' の明示的なオーバーライドも追加してください。
ko: '{0}' 형식이 'System.IComparable'을 구현합니다. 'Object.Equals'에 대한 명시적 재정의도 추가하세요.
pl: Typ „{0}” zawiera implementację elementu „System.IComparable”. Rozważ również dodanie jawnego przesłonięcia elementu „Object.Equals”
pt_br: O tipo '{0}' implementa o 'System.IComparable'. Considere também adicionar uma substituição explícita para 'Object.Equals'
ru: Тип "{0}" реализует "System.IComparable". Рекомендуется также добавить явное переопределение для "Object.Equals"
tr: '{0}' türü 'System.IComparable' metodunu uyguluyor. Ayrıca 'Object.Equals' için açık bir geçersiz kılma eklemeyi düşünün
zh_hans: 类型“{0}”实现 "System.IComparable"。请考虑同时添加 "Object.Equals" 的显式重写
zh_hant: 類型 '{0}' 實作了 'System.IComparable'。請考慮也加入 'Object.Equals' 的明確覆寫

# typrelTypeImplementsIComparableDefaultObjectEqualsProvided
source: The type '{0}' implements 'System.IComparable' explicitly but provides no corresponding override for 'Object.Equals'. An implementation of 'Object.Equals' has been automatically provided, implemented via 'System.IComparable'. Consider implementing the override 'Object.Equals' explicitly
cs: Typ {0} má explicitní implementaci rozhraní System.IComparable, ale neposkytuje žádné odpovídající přepsání Object.Equals. Implementace Object.Equals se poskytla automaticky prostřednictvím rozhraní System.IComparable. Zvažte možnost implementovat přepsání Object.Equals explicitně.
de: Der Typ "{0}" implementiert "System.IComparable" explizit, stellt aber keine entsprechende Überschreibung für "Object.Equals" bereit. Eine Implementierung von "Object.Equals" wurde automatisch über "System.IComparable" bereitgestellt. Implementieren Sie die Überschreibung "Object.Equals" explizit.
es: El tipo '{0}' implementa 'System.IComparable' de forma explícita, pero no proporciona la correspondiente invalidación para 'Object.Equals'. Se ha proporcionado automáticamente una implementación de 'Object.Equals', implementado a través de 'System.IComparable'. Considere implementar la invalidación 'Object.Equals' de forma explícita.
fr: Le type '{0}' implémente explicitement 'System.IComparable' mais ne fournit aucune substitution correspondante pour 'Object.Equals'. Une implémentation de 'Object.Equals' a été fournie automatiquement, implémentée via 'System.IComparable'. Implémentez explicitement la substitution 'Object.Equals'
it: Il tipo '{0}' implementa 'System.IComparable' in modo esplicito, tuttavia non fornisce l'override corrispondente per 'Object.Equals'. È stata specificata automaticamente un'implementazione di 'Object.Equals', eseguita tramite 'System.IComparable'. Provare a implementare l'override di 'Object.Equals' in modo esplicito
ja: 型 '{0}' は 'System.IComparable' を明示的に実装していますが、'Object.Equals' に対応するオーバーライドを提供していません。'Object.Equals' の実装は自動的に提供され、'System.IComparable' を介して実装されます。明示的にオーバーライド 'Object.Equals' を実装してください。
ko: '{0}' 형식이 'System.IComparable'을 명시적으로 구현하지만 'Object.Equals'에 해당하는 재정의를 제공하지 않습니다. 'System.IComparable'을 통해 구현된 'Object.Equals'의 구현이 자동으로 제공되었습니다. 재정의 'Object.Equals'를 명시적으로 구현하세요.
pl: Typ „{0}” zawiera jawną implementację elementu „System.IComparable”, ale nie dostarcza odpowiedniego przesłonięcia elementu „Object.Equals”. Implementacja elementu „Object.Equals” została automatycznie dostarczona (implementacja za pośrednictwem elementu „System.IComparable”). Rozważ jawne zaimplementowanie przesłonięcia elementu „Object.Equals”
pt_br: O tipo '{0}' implementa explicitamente o 'System.IComparable', mas não fornece nenhuma substituição correspondente para 'Object.Equals'. Uma implementação de 'Object.Equals' foi automaticamente fornecida e implementada via 'System.IComparable'. Considere implementar a substituição explícita 'Object.Equals'
ru: Тип "{0}" явно реализует "System.IComparable", но не предоставляет соответствующего переопределения для "Object.Equals". Была автоматически предоставлена реализация "Object.Equals"; реализация выполнена через "System.IComparable". Рекомендуется явно реализовывать переопределение "Object.Equals"
tr: '{0}' türü 'System.IComparable' metodunu açık olarak uyguluyor ancak 'Object.Equals' için buna karşılık gelen bir geçersiz kılma sağlamıyor. 'System.IComparable' aracılığıyla uygulanan 'Object.Equals' metodunun uygulaması otomatik olarak sağlandı. 'Object.Equals' geçersiz kılma işlemini açık olarak uygulamayı düşünün
zh_hans: 类型“{0}”显式实现 "System.IComparable"，但未提供相对应的 "Object.Equals" 的重写。已自动提供 "Object.Equals " 的实现(通过 "System.IComparable" 实现)。请考虑显式实现重写 "Object.Equals"
zh_hant: 類型 '{0}' 明確實作了 'System.IComparable'，但是未提供 'Object.Equals' 的對應覆寫。系統已自動提供透過 'System.IComparable' 實作的 'Object.Equals' 的實作。請考慮明確實作覆寫 'Object.Equals'

# typrelExplicitImplementationOfGetHashCodeOrEquals
source: The struct, record or union type '{0}' has an explicit implementation of 'Object.GetHashCode' or 'Object.Equals'. You must apply the 'CustomEquality' attribute to the type
cs: Typ struktura, záznam nebo sjednocení {0} explicitně implementuje Object.GetHashCode nebo Object.Equals. U tohoto typu musíte použít atribut CustomEquality.
de: Der Struktur-, Datensatz- oder Union-Typ "{0}" umfasst eine explizite Implementierung von "Object.GetHashCode" oder "Object.Equals". Sie müssen das CustomEquality-Attribut auf den Typ anwenden.
es: El tipo de struct, registro o unión '{0}' tiene una implementación explícita de 'Object.GetHashCode' u 'Object.Equals'. Debe aplicar el atributo 'CustomEquality' al tipo.
fr: Le type struct, enregistrement ou union '{0}' a une implémentation explicite de 'Object.GetHashCode' ou 'Object.Equals'. Vous devez appliquer l'attribut 'CustomEquality' au type
it: Il tipo di unione, struct o record '{0}' ha un'implementazione esplicita di 'Object.GetHashCode' o 'Object.Equals'. È necessario applicare l'attributo 'CustomEquality' al tipo
ja: 構造体型、レコード型、または共用体型 '{0}' には 'Object.GetHashCode' または 'Object.Equals' の明示的な実装があります。この型には 'CustomEquality' 属性を適用してください。
ko: 구조체, 레코드 또는 공용 구조체 형식 '{0}'에 'Object.GetHashCode' 또는 'Object.Equals'의 명시적 구현이 있습니다. 형식에 'CustomEquality' 특성을 적용해야 합니다.
pl: Typ struktury, rekordu lub unii „{0}” ma jawną implementację elementu „Object.GetHashCode” lub „Object.Equals”. Musisz zastosować atrybut „CustomEquality” do typu
pt_br: O tipo struct, registro ou união '{0}' tem uma implementação explícita de 'Object.GetHashCode' ou 'Object.Equals'. Você deve aplicar o atributo 'CustomEquality' ao tipo
ru: Тип структуры, записи или объединения "{0}" содержит явную реализацию "Object.GetHashCode" или "Object.Equals". Необходимо применить к типу атрибут "CustomEquality"
tr: '{0}' yapı, kayıt veya birleşim türünde açık 'Object.GetHashCode' veya 'Object.Equals' uygulaması var. Türe 'CustomEquality' özniteliğini uygulamanız gerekiyor
zh_hans: 结构、记录或联合类型“{0}”具有 "Object.GetHashCode" 或 "Object.Equals" 的显式实现。您必须将 "CustomEquality" 特性应用于该类型
zh_hant: 結構、記錄或等位型別 '{0}' 有 'Object.GetHashCode' 或 'Object.Equals' 的明確實作。您必須將 'CustomEquality' 屬性套用到該型別
