Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# keywordDescriptionNamespace
source: Used to associate a name with a group of related types and modules, to logically separate it from other code.
cs: Slouží k přidružení názvu ke skupině souvisejících typů a modulů a jeho logickému oddělení od jiného kódu.
de: Wird verwendet, um einen Namen einer Gruppe zugehöriger Typen und Module zuzuordnen, um ihn logisch von anderem Code zu trennen.
es: Se usa para asociar un nombre a un grupo de módulos y tipos relacionados, a fin de separarlo de forma lógica del resto del código.
fr: Permet d'associer un nom à un groupe de types et de modules connexes, pour le séparer de manière logique du reste du code.
it: Usata per associare un nome a un gruppo di moduli e tipi correlati allo scopo di separare il gruppo in modo logico da altro codice.
ja: 関連する型とモジュールのグループに名前を関連付け、その他のコードと論理的に分離するために使用します。
ko: 관련 형식 및 모듈 그룹과 이름을 연결하기 위해 사용되며, 다른 코드와 논리적으로 구별하기 위해 사용됩니다.
pl: Używane do kojarzenia nazwy z grupą powiązanych typów i modułów w celu jej logicznego oddzielenia od innego kodu.
pt_br: Usado para associar um nome com um grupo de tipos e módulos relacionados, para separá-lo logicamente de outro código.
ru: Используется для связывания имени с группой соответствующих типов и модулей для логического отделения их от других частей кода.
tr: Bir adı diğer kodlardan mantıksal olarak ayırmak amacıyla, birbiriyle ilişkili bir tür ve modül grubuyla ilişkilendirmek için kullanılır.
zh_hans: 用于将名称与一组相关类型和模块关联，从逻辑上将其与其他代码分开。
zh_hant: 用以在名稱與相關類型及模組的群組之間建立關聯，以邏輯方式從其他程式碼分隔出名稱。

# keywordDescriptionNew
source: Used to declare, define, or invoke a constructor that creates or that can create an object. Also used in generic parameter constraints to indicate that a type must have a certain constructor.
cs: Slouží k deklaraci, definici nebo vyvolání konstruktoru, který vytvoří nebo dokáže vytvořit objekt. V omezeních obecných parametrů označuje, že nějaký typ musí mít určitý konstruktor.
de: Wird verwendet, um einen Konstruktor zu deklarieren, definieren oder aufzurufen, der ein Objekt erstellt oder erstellen kann. Wird auch in generischen Parameterbeschränkungen verwendet, um anzugeben, dass ein Typ über einen bestimmten Konstruktor verfügen muss.
es: Se usa para declarar, definir o invocar un constructor que crea o que puede crear un objeto. También se usa en las restricciones de parámetro genérico para indicar que un tipo debe tener un constructor determinado.
fr: Permet de déclarer, de définir ou d'appeler un constructeur qui crée ou peut créer un objet. Également utilisé dans les contraintes de paramètre générique pour indiquer qu'un type doit avoir un certain constructeur.
it: Usata per dichiarare, definire o richiamare un costruttore che crea o che è in grado di creare un oggetto. Usata anche nei vincoli di parametri generici per indicare che un tipo deve contenere un determinato costruttore.
ja: オブジェクトを作成または作成可能なコンストラクターの宣言、定義、起動に使用します。ジェネリック パラメーターの制約でも、型が特定のコンストラクターを持つ必要があることを示すために使用します。
ko: 개체를 생성하거나 생성할 수 있는 생성자를 선언하거나 정의하거나 호출하는 데 사용됩니다. 형식에 특정 생성자가 있어야 함을 나타내기 위해 제네릭 매개 변수 제약 조건에서도 사용됩니다.
pl: Używane do deklarowania, definiowania lub wywoływania konstruktora, który tworzy lub może utworzyć obiekt. Używane również w ograniczeniach parametrów ogólnych do wskazywania, że typ musi mieć określonego konstruktora.
pt_br: Usado para declarar, definir ou invocar um construtor que cria ou que pode criar um objeto. Também usado em restrições de parâmetro genérico para indicar que um tipo deve ter um certo construtor.
ru: Используется для объявления, определения или вызова конструктора, который создает или может создать объект. Также используется в ограничениях универсальных параметров, чтобы указать, что тип должен иметь определенный конструктор.
tr: Nesne oluşturan veya oluşturabilen bir oluşturucuyu bildirmek, tanımlamak veya çağırmak için kullanılır. Ayrıca bir türün belirli bir oluşturucusu olması gerektiğini belirtmek için genel parametre kısıtlamalarında kullanılır.
zh_hans: 用于声明、定义或调用创建或可创建对象的构造函数。另外，也用于泛型参数约束，以表示类型必需包含某构造函数。
zh_hant: 用以宣告、定義或叫用會建立或可建立物件的建構函式。也用於泛型參數條件約束，以指出類型必須有特定建構函式。

# keywordDescriptionNot
source: Not actually a keyword. However, not struct in combination is used as a generic parameter constraint.
cs: Ve skutečnosti nejde o klíčové slovo. Kombinace not struct se ale používá jako omezení obecného parametru.
de: Kein tatsächliches Schlüsselwort. "not struct" wird in Kombination als generische Parametereinschränkung verwendet.
es: No es una palabra clave propiamente dicha. Sin embargo, se usa la combinación not struct como restricción de parámetro genérico.
fr: Il ne s'agit pas vraiment d'un mot clé. Toutefois, dans le cadre d'une combinaison, not struct est utilisé comme une contrainte de paramètre générique.
it: Non è una vera e propria parola chiave. In combinazione con not struct viene tuttavia usata come vincolo di parametro generico.
ja: 実際にはキーワードではありませんが、not struct という組み合わせでジェネリック パラメーターの制約として使用します。
ko: 실제로 키워드가 아니지만, 조합의 not struct는 제네릭 매개 변수 제약 조건으로 사용됩니다.
pl: To nie jest naprawdę słowo kluczowe. Struktura not w kombinacji jest jednak używana w ograniczeniach parametrów ogólnych.
pt_br: Não é uma palavra-chave real. No entanto, o "not struct" em combinação é usado como uma restrição de parâmetro genérico.
ru: Не является ключевым словом. Тем не менее структура not в сочетаниях используется как ограничение универсальных параметров.
tr: Aslında bir anahtar sözcük değildir. Ancak not yapısı, bir genel parametre kısıtlaması olarak kombine şekilde kullanılır.
zh_hans: 实际上不是关键字。但是，组合中的结构不会用作泛型参数约束。
zh_hant: 實際上不是關鍵字。不過，組合的 not struct 可用作泛型參數條件約束。

# keywordDescriptionNull
source: Indicates the absence of an object. Also used in generic parameter constraints.
cs: Označuje absenci objektu. Používá se také v omezeních obecných parametrů.
de: Gibt die Abwesenheit eines Objekts an. Wird auch in generischen Parameterbeschränkungen verwendet.
es: Indica la ausencia de un objeto. También se usa en las restricciones de parámetro genérico.
fr: Indique l'absence d'un objet. Utilisé également dans les contraintes de paramètre générique.
it: Indica l'assenza di un oggetto. Usata anche nei vincoli di parametri generici.
ja: オブジェクトがないことを示します。ジェネリック パラメーターの制約にも使用します。
ko: 개체가 없음을 나타냅니다. 제네릭 매개 변수 제약 조건에서도 사용됩니다.
pl: Wskazuje brak obiektu. Używane również w ograniczeniach parametrów ogólnych.
pt_br: Indica a ausência de um objeto. Também usado em restrições de parâmetros genéricos.
ru: Указывает на отсутствие объекта. Также используется в ограничениях универсальных параметров.
tr: Bir nesnenin olmadığını belirtir. Ayrıca genel parametre kısıtlamalarında kullanılır.
zh_hans: 表示缺少对象。另外，还用于泛型参数约束。
zh_hant: 指出物件的缺少情形。也會用在泛型參數條件約束中。

# keywordDescriptionOf
source: Used in discriminated unions to indicate the type of categories of values, and in delegate and exception declarations.
cs: Slouží k označení typu kategorií hodnot v rozlišených sjednoceních a v deklaracích delegování a výjimek.
de: Wird in Unterscheidungs-Unions verwenden, um den Typ der Wertekategorien anzugeben, sowie in Delegaten und Ausnahmedeklarationen.
es: Se usa en las uniones discriminadas para indicar el tipo de las categorías de valores, así como en declaraciones de delegado y de excepción.
fr: Utilisé dans les unions discriminées pour indiquer le type des catégories de valeurs, ainsi que dans les déclarations de délégué et d'exception.
it: Usata nelle unioni discriminate per indicare il tipo di categorie di valori, nonché nelle dichiarazioni di delegati ed eccezioni.
ja: 判別共同体で値のカテゴリの種類を示し、デリゲート宣言と例外宣言でも使用します。
ko: 구분된 공용 구조체에 사용되어 값 범주의 형식을 나타내고, 대리자 및 예외 선언에 사용됩니다.
pl: Używane w uniach rozłącznych do wskazywania typów kategorii wartości oraz w deklaracjach delegowania i wyjątków.
pt_br: Usado em uniões discriminadas para indicar o tipo de categorias de valores e nas declarações de delegado e exceção.
ru: Используется в размеченных объединениях для обозначения типа категорий значений, а также в объявлениях делегатов и исключений.
tr: Değer kategorilerinin türünü belirtmek için ayırt edici birleşimlerde, temsilci ve özel durum bildirimlerinde kullanılır.
zh_hans: 在可区分的联合中用于表示值类别的类型，并用于委托和异常声明。
zh_hant: 用於差別聯集以指出值分類的類型，並用於委派和例外狀況宣告。

# keywordDescriptionOpen
source: Used to make the contents of a namespace or module available without qualification.
cs: Slouží ke zpřístupnění obsahu oboru názvů nebo modulu bez kvalifikace.
de: Wird verwendet, um den Inhalt eines Namespace oder Moduls ohne Qualifizierung verfügbar zu machen.
es: Se usa para que el contenido de un espacio de nombres o de un módulo esté disponible sin tener que especificar el nombre completo.
fr: Permet de rendre disponible le contenu d'un espace de noms ou d'un module sans qualification.
it: Usata per rendere disponibile il contenuto di uno spazio dei nomi o di un modulo senza qualificazione.
ja: 修飾子を使用せずに名前空間またはモジュールのコンテンツを利用可能にするために使用します。
ko: 한정자 없이 사용할 수 있는 네임스페이스 또는 모듈의 콘텐츠를 만드는 데 사용됩니다.
pl: Używane do udostępniania zawartości przestrzeni nazw lub modułu bez kwalifikacji.
pt_br: Usado para disponibilizar o conteúdo de um namespace ou módulo sem qualificação.
ru: Используется для предоставления доступа к содержимому пространства имен или модуля без квалификации.
tr: Bir ad alanının veya modülün içeriğinin sınırlama olmaksızın kullanılabilmesini sağlamak için kullanılır.
zh_hans: 用于使命名空间或模块的内容无需限定即可使用。
zh_hant: 用以製作不需資格即可使用的命名空間或模組內容。

# keywordDescriptionOr
source: Used with Boolean conditions as a Boolean or operator. Equivalent to ||. Also used in member constraints.
cs: Používá se v logických podmínkách jako logický operátor or. Ekvivalent ||. Používá se také v omezeních členů.
de: Wird mit booleschen Bedingungen als boolescher Wert oder Operator verwendet. Entspricht ||. Wird auch in Memberbeschränkungen verwendet.
es: Se usa con las condiciones booleanas como operador booleano or. Equivale a ||. También se usa en las restricciones de miembro.
fr: Utilisé avec les conditions booléennes en tant qu'opérateur or booléen. Équivaut à ||. Utilisé également dans les contraintes de membre.
it: Usata con le condizioni booleane come operatore or booleano. Equivalente a ||. Usata anche nei vincoli di membro.
ja: ブール値の or 演算子としてブール条件で使用します。|| に相当します。メンバー制約でも使用します。
ko: 부울 또는 연산자로 부울 조건과 함께 사용됩니다. ||와 같습니다. 멤버 제약 조건에도 사용됩니다.
pl: Używane z warunkami wartości logicznej jako wartość logiczna lub operator. Odpowiednik symbolu ||. Używane również w ograniczeniach elementu członkowskiego.
pt_br: Usado com condições Boolianas como um Booliano ou operador. Equivalente a ||. Também usado em restrições de membro.
ru: Используется с логическими условиями в качестве логического значения или оператора. Эквивалентно ||. Также используется в ограничениях членов.
tr: Bir Boolean değeri veya işleci olarak Boolean koşullarıyla birlikte kullanılır. Eşdeğeri || simgesidir. Ayrıca üye kısıtlamalarında kullanılır.
zh_hans: 与布尔条件配合使用，作为布尔值或运算符。相当于 ||。另外，也用于成员约束。
zh_hant: 搭配布林值條件使用，作為布林值或運算子。相當於 ||。也用於成員條件約束。

# keywordDescriptionOverride
source: Used to implement a version of an abstract or virtual method that differs from the base version.
cs: Slouží k implementaci verze abstraktní nebo virtuální metody, která se odlišuje od základní verze.
de: Wird verwendet, um eine Version einer abstrakten oder virtuellen Methode zu implementieren, die sich von der Basisversion unterscheidet.
es: Se usa para implementar una versión de un método abstracto o virtual que se diferencia de la versión base.
fr: Permet d'implémenter une version d'une méthode abstraite ou virtuelle qui diffère de la version de base.
it: Usata per implementare una versione di un metodo astratto o virtuale diversa dalla versione di base.
ja: 基本バージョンと異なる抽象メソッドまたは仮想メソッドのバージョンの実装に使用します。
ko: 기본 버전과 다른, 추상 메서드 또는 가상 메서드의 버전을 구현하는 데 사용됩니다.
pl: Używane do implementowania wersji metody abstrakcyjnej lub wirtualnej, która różni się od wersji podstawowej.
pt_br: Usado para implantar uma versão de um resumo ou método virtual que difere da versão de base.
ru: Используется для реализации версии абстрактного или виртуального метода, который отличается от базовой версии.
tr: Soyut veya sanal metodun temel sürümden farklı olan bir sürümünü uygulamak için kullanılır.
zh_hans: 用于实现与基础版本不同的抽象或虚拟方法的版本。
zh_hant: 用以實作不同於基底版本的抽象或虛擬方法版本。

# keywordDescriptionPrivate
source: Restricts access to a member to code in the same type or module.
cs: Omezuje přístup k členovi na kód ve stejném typu nebo modulu.
de: Beschränkt den Zugriff eines Element auf Code im gleichen Typ oder Modul.
es: Restringe el acceso a un miembro a código del mismo tipo o módulo.
fr: Restreint l'accès à un membre au code situé dans le même type ou module.
it: Limita l'accesso al codice a un membro nello stesso tipo o modulo.
ja: メンバーに対して、同じ型やモジュールのコードへのアクセスを制限します。
ko: 동일한 형식 또는 모듈에서 코딩하기 위해 멤버에 대한 액세스를 제한합니다.
pl: Ogranicza dostęp do elementu członkowskiego kodu w tym samym typie lub module.
pt_br: Restringe o acesso a um membro para codificar no mesmo tipo ou módulo.
ru: Ограничивает доступ к члену для кода в том же типе или модуле.
tr: Üyeye erişimi aynı türdeki veya modüldeki kodla sınırlandırır.
zh_hans: 限制成员使用相同类型或模块编码的权限。
zh_hant: 將成員的存取限制為類型或模組相同的程式碼。

# keywordDescriptionPublic
source: Allows access to a member from outside the type.
cs: Umožňuje přístup ke členovi zvnějška typu.
de: Lässt von einer Position außerhalb des Typs den Zugriff auf ein Member zu.
es: Permite el acceso a un miembro desde fuera del tipo.
fr: Autorise l'accès à un membre en dehors du type.
it: Consente l'accesso a un membro dall'esterno del tipo.
ja: 型の外部からのメンバーに対して、アクセスを許可します。
ko: 형식 외부에서 멤버에 대한 액세스를 허용합니다.
pl: Umożliwia dostęp do elementu członkowskiego spoza typu.
pt_br: Permite acesso a um membro de fora do tipo.
ru: Разрешает доступ к члену из-за пределов типа.
tr: Türün dışından üyeye erişim sağlar.
zh_hans: 允许访问类型外的成员。
zh_hant: 允許存取來自類型外的成員。

# keywordDescriptionRec
source: Used to indicate that a function is recursive.
cs: Slouží k označení toho, že funkce je rekurzivní.
de: Wird verwendet, um anzugeben, dass eine Funktion rekursiv ist.
es: Se usa para indicar que una función es recursiva.
fr: Permet d'indiquer qu'une fonction est récursive.
it: Usata per indicare che una funzione è ricorsiva.
ja: 関数が再帰的であることを示すために使用します。
ko: 함수가 재귀적임을 나타내는 데 사용됩니다.
pl: Używane do wskazywania, że funkcja jest cykliczna.
pt_br: Usado para indicar que uma função é recursiva.
ru: Используется для обозначения того, что функция является рекурсивной.
tr: Bir işlevin özyinelemeli olduğunu belirtmek için kullanılır.
zh_hans: 用于表示某函数为递归函数。
zh_hant: 用以指出函式是遞迴的。

# keywordDescriptionReturn
source: Used to provide a value for the result of the containing computation expression.
cs: Používá se k poskytnutí hodnoty pro výsledek obsahujícího výrazu výpočtu.
de: Wird verwendet, um einen Wert für das Ergebnis des Berechnungsausdrucks anzugeben.
es: Utilizado para proporcionar un valor para el resultado de la expresión de cálculo que contiene.
fr: Utilisé pour fournir une valeur au résultat de l'expression de calcul conteneur.
it: Usata per specificare un valore per il risultato dell'espressione di calcolo contenitore.
ja: 含まれるコンピュテーション式の結果値を示すために使用します。
ko: 포함하는 계산 식의 결과에 대한 값을 제공하는 데 사용됩니다.
pl: Używane do udostępniania wartości dla wyniku zawierającego wyrażenia obliczenia.
pt_br: Usado para fornecer um valor para o resultado da expressão de computação que a contém.
ru: Используется для указания значения для результата, содержащего вычислительное выражение.
tr: Öğeyi içeren hesaplama ifadesinin sonucuna yönelik bir değer sağlanması için kullanılır.
zh_hans: 用于为包含计算表达式的结果提供一个值。
zh_hant: 用來為內含的計算運算式結果提供值。

# keywordDescriptionReturnBang
source: Used to provide a value for the result of the containing computation expression, where that value itself comes from the result another computation expression.
cs: Používá se k poskytnutí hodnoty pro výsledek obsahujícího výrazu výpočtu, když tato hodnota sama pochází z výsledku jiného výrazu výpočtu.
de: Wird verwendet, um einen Wert für das Ergebnis des Berechnungsausdrucks bereitzustellen. Hierbei stammt dieser Wert aus dem Ergebnis eines anderen Berechnungsausdrucks.
es: Se utiliza para proporcionar un valor para el resultado de la expresión de cálculo que contiene, donde ese propio valor procede del resultado de otra expresión de cálculo.
fr: Utilisé pour fournir une valeur au résultat de l'expression de calcul conteneur, où cette valeur provient du résultat d'une autre expression de calcul.
it: Usata per specificare un valore per il risultato dell'espressione di calcolo contenitore, in cui tale valore proviene dal risultato di un'altra espressione di calcolo.
ja: コンピュテーション式を含む結果の値を示すために使用されます。この値自体は、別のコンピュテーション式の結果です。
ko: 포함하는 계산 식의 결과에 대한 값을 제공하는 데 사용되지만, 값 자체는 다른 계산 식의 결과에서 가져온 것입니다.
pl: Używane do udostępniania wyniku zawierającego wyrażenia obliczenia, gdy ta wartość pochodzi z wyniku innego wyrażenia obliczenia.
pt_br: Usado para fornecer um valor para o resultado da expressão de computação contida, em que esse próprio valor vem do resultado da expressão de computação que a contém.
ru: Используется для указания значения результата вычислительного выражения, если это значение поступает из результата другого вычислительного выражения.
tr: Öğeyi içeren hesaplama ifadesinin sonucuna yönelik bir değer sağlanması için kullanılır ve bu değerin kendisi, başka bir hesaplama ifadesinin sonucundan gelir.
zh_hans: 用于为包含计算表达式的结果提供一个值，其中该值本身来自另一计算表达式的结果。
zh_hant: 用來為內含的計算運算式提供值，而該值本身來自另一個計算運算式的結果。

# keywordDescriptionSelect
source: Used in query expressions to specify what fields or columns to extract. Note that this is a contextual keyword, which means that it is not actually a reserved word and it only acts like a keyword in appropriate context.
cs: Používá se ve výrazech dotazu k určení, která pole nebo sloupce se mají extrahovat. Toto klíčové slovo je kontextové, což znamená, že se ve skutečnosti nejedná o rezervované slovo a jako klíčové slovo funguje jen v příslušném kontextu.
de: Wird in Abfrageausdrücken verwendet, um festzulegen, welche Felder oder Spalten extrahiert werden. Dies ist kontextabhängiges Schlüsselwort, d. h. es ist kein reserviertes Wort und funktioniert nur im entsprechenden Kontext als Schlüsselwort.
es: Se usa en las expresiones de consulta para especificar los campos o columnas que se van a extraer. Tenga en cuenta que es una palabra clave contextual, es decir, no es una palabra reservada en realidad y actúa solo como palabra clave en el contexto adecuado.
fr: Utilisé dans les expressions de requête pour spécifier les champs ou colonnes à extraire. Notez qu'il s'agit d'un mot clé contextuel, ce qui signifie qu'il ne s'agit pas réellement d'un mot réservé et qu'il se comporte uniquement comme un mot clé dans le contexte approprié.
it: Usata nelle espressioni di query per specificare i campi o le colonne da estrarre. Si noti che questa è una parola chiave contestuale, pertanto non è in realtà una parola riservata e funge solo da parola chiave nel contesto appropriato.
ja: クエリ式でどのフィールドまたは列を抽出するかを指定するために使用します。これはコンテキスト キーワードであり、実際には予約語ではなく、適切なコンテキストでキーワードとしてのみ動作します。
ko: 추출할 필드 또는 열을 지정하기 위해 쿼리 식에 사용됩니다. 이것은 상황별 키워드입니다. 즉 실제로 예약어가 아니며, 적절한 컨텍스트에서 키워드처럼만 작동합니다.
pl: Używane w wyrażeniach zapytania do określania, które pola lub kolumny będą wyodrębniane. Należy pamiętać, że jest to kontekstowe słowo kluczowe, co oznacza, że nie jest to naprawdę słowo zastrzeżone i działa jako słowo kluczowe tylko w odpowiednim kontekście.
pt_br: Usado em expressões de consulta para especificar quais campos ou colunas extrair. Observe que isso é uma palavra-chave contextual, o que significa que não é realmente uma palavra reservada e age apenas como uma palavra-chave no contexto apropriado.
ru: Используется в выражениях запроса для указания полей или столбцов для извлечения. Обратите внимание, что это контекстно-зависимое ключевое слово, то есть фактически оно не является зарезервированным словом и функционирует как ключевое слово только в соответствующем контексте.
tr: Hangi alanların veya sütunların ayıklanacağını belirtmek için sorgu ifadelerinde kullanılır. Bunun bağlamsal bir anahtar sözcük olduğuna dikkat edin, yani aslında bir ayrılmış anahtar sözcük değildir ve yalnızca uygun bağlamda anahtar sözcük gibi davranır.
zh_hans: 在查询表达式中用于指定要提取的字段或列。注意，这是上下文关键字，意味着它实际上并不是保留字，而只会充当相应上下文中的关键字。
zh_hant: 用於查詢運算式，以指定要擷取的欄位或資料行。請注意這是內容關鍵字，表示這實際上不是保留字，而只會在適當內容中以關鍵字形式運作。

# keywordDescriptionStatic
source: Used to indicate a method or property that can be called without an instance of a type, or a value member that is shared among all instances of a type.
cs: Slouží k označení metody nebo vlastnosti, kterou lze volat bez instance typu, nebo člena hodnoty, který se sdílí mezi všemi instancemi typu.
de: Wird verwendet, um eine Methode oder Eigenschaft anzugeben, die ohne eine Instanz eines Typs aufgerufen werden kann, oder einen Wertemember, der für alle Instanzen eines Typs freigegeben wird.
es: Se usa para indicar un método o una propiedad que se puede llamar sin ninguna instancia de un tipo, o un miembro de valor que comparten todas las instancias de un tipo.
fr: Permet d'indiquer une méthode ou une propriété qui peut être appelée sans instance d'un type, ou un membre de valeur partagé entre toutes les instances d'un type.
it: Usata per indicare un metodo o una proprietà che è possibile chiamare senza un'istanza di un tipo oppure un membro valore condiviso tra tutte le istanze di un tipo.
ja: 型のインスタンスなしで呼び出すことのできるメソッドまたはプロパティ、または型のすべてのインスタンスで共有される値メンバーを示すために使用します。
ko: 형식의 인스턴스 없이 호출될 수 있는 메서드나 속성, 또는 모든 형식의 인스턴스 간 공유되는 값 멤버를 나타내는 데 사용됩니다.
pl: Używane do wskazywania metody lub właściwości, którą można wywołać bez wystąpienia typu, lub elementu członkowskiego wartości, który jest udostępniany wszystkich wystąpieniom typu.
pt_br: Usado para indicar um método ou propriedade que podem ser chamados sem uma instância de um tipo ou um membro de valor que é compartilhado entre todas as instâncias de um tipo.
ru: Используется для обозначения метода или свойства, которые могут вызываться без экземпляра типа, или члена значения, общего для всех экземпляров типа.
tr: Bir türün örneği olmadan veya türün tüm örnekleri arasında paylaşılan bir değer üyesi olmadan çağrılabilecek bir metodu veya özelliği belirtmek için kullanılır.
zh_hans: 用于表示可在没有类型实例的情况下调用的方法或属性，或者在某类型的所有实例中共享的值成员。
zh_hant: 用以指出不需要類型執行個體即可呼叫的方法或屬性，或在所有類型執行個體間共用的值成員。
