Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# optFailedToInlineValue
source: Failed to inline the value '{0}' marked 'inline', perhaps because a recursive value was marked 'inline'
cs: Nepovedlo se vložit hodnotu {0} s označením inline: možná proto, že jste jako inline označili rekurzivní hodnotu.
de: Der als "inline" markierte Wert "{0}" konnte nicht inline gestellt werden, möglicherweise, weil ein rekursiver Wert als "inline" markiert war.
es: No se pudo insertar el valor '{0}' marcado como 'inline', quizá porque un valor recursivo estaba marcado como 'inline'.
fr: Impossible d'effectuer l'incorporation (inlining) de la valeur '{0}' marquée comme 'inline', peut-être en raison d'une valeur récursive marquée comme 'inline'
it: Non è stato possibile incorporare il valore '{0}' contrassegnato come 'inline', probabilmente a causa di un valore ricorsivo contrassegnato come 'inline'
ja: 'inline' とマークされた値 '{0}' をインライン化できませんでした。再帰的な値が 'inline' とマークされた可能性があります。
ko: 'inline'으로 표시된 값 '{0}'을(를) 인라인하지 못했습니다. 재귀 값이 'inline'으로 표시된 것 같습니다.
pl: Nie powiodło się użycie śródwierszowej wartości „{0}” oznaczonej jako „inline” prawdopodobnie z powodu oznaczenia wartości cyklicznej jako „inline”
pt_br: Falha ao embutir o valor '{0}' marcado como 'inline', talvez porque um valor recursivo tenha sido marcado como 'inline'
ru: Не удалось встроить значение "{0}", отмеченное как "inline", возможно, в связи с отметкой рекурсивного значения как "inline"
tr: Muhtemelen özyinelemeli bir değer 'inline' olarak işaretlendiği için 'inline' olarak işaretlenmiş '{0}' değeri satır içine alınamadı
zh_hans: 未能内联标记为“inline”的值“{0}”，可能是因为已将某个递归值标记为“inline”
zh_hant: 無法內嵌標記為 'inline' 的值 '{0}'，可能是因為遞迴值標記了 'inline'

# optRecursiveValValue
source: Recursive ValValue {0}
cs: Rekurzivní hodnota ValValue {0}
de: Rekursiver ValValue "{0}"
es: ValValue {0} recursivo
fr: ValValue {0} récursive
it: ValValue ricorsivo {0}
ja: 再帰的な ValValue {0}
ko: 재귀 ValValue {0}입니다.
pl: Cykliczny element ValValue {0}
pt_br: ValValue {0} recursivo
ru: Рекурсивное значение ValValue {0}
tr: Özyinelemeli ValValue {0}
zh_hans: 递归的 ValValue {0}
zh_hant: 遞迴的 ValValue {0}

# lexfltIncorrentIndentationOfIn
source: The indentation of this 'in' token is incorrect with respect to the corresponding 'let'
cs: Odsazení tohoto tokenu in není ve vztahu k odpovídající klauzuli let správné.
de: Der Einzug dieses in-Tokens ist im Hinblick auf das entsprechende "let" fehlerhaft.
es: La sangría de este token 'in' es incorrecta con respecto al 'let' correspondiente.
fr: La mise en retrait de ce jeton 'in' est incorrecte par rapport au 'let' correspondant
it: Il rientro di questo token 'in' non è corretto rispetto al 'let' corrispondente
ja: この 'in' トークンのインデントは、対応する 'let' に対して正しくありません
ko: 이 'in' 토큰의 들여쓰기가 해당하는 'let'과 관련하여 올바르지 않습니다.
pl: Wcięcie tego tokenu „in” jest niepoprawne w odniesieniu do odpowiadającego tokenu „let”
pt_br: O recuo deste token 'in' é incorreto em relação ao 'let' correspondente
ru: Недопустимый отступ токена "in" по отношению к соответствующему токену "let"
tr: Bu 'in' belirtecinin girintisi kendisine karşılık gelen 'let''e göre hatalı
zh_hans: 相对于相应的“let”，此“in”标记的缩进不正确
zh_hant: 這個 'in' 語彙基元的縮排就對應的 'let' 而言並不正確

# lexfltTokenIsOffsideOfContextStartedEarlier
source: Possible incorrect indentation: this token is offside of context started at position {0}. Try indenting this token further or using standard formatting conventions.
cs: Je možné, že máte nesprávné odsazení: tento token leží mimo odsazení kontextu, který začíná na pozici {0}. Zkuste tento token odsadit víc nebo použijte standardní konvence formátování.
de: Möglicherweise falscher Einzug: Dieses Token ist gegenüber dem bei Position {0} beginnenden Kontext verschoben. Erhöhen Sie den Einzug für dieses Token, oder verwenden Sie die standardmäßigen Formatierungskonventionen.
es: Posible sangría incorrecta: este token está fuera del contexto iniciado en la posición {0}. Pruebe aplicando más sangría a este token o usando convenciones de formato estándar.
fr: Mise en retrait éventuellement incorrecte : ce jeton est situé hors du contexte qui débute à la position {0}. Essayez d'effectuer une mise en retrait supplémentaire de ce jeton ou d'utiliser des conventions de mise en forme standard.
it: Possibile rientro non corretto: il token si trova oltre il limite del contesto iniziato alla posizione {0}. Provare ad applicare un ulteriore rientro al token oppure a utilizzare convenzioni di formattazione standard.
ja: インデントが正しくない可能性があります。このトークンは位置 {0} から開始されるコンテキストのオフサイドになります。このトークンのインデントを増やすか、標準的な書式規則を使用してください。
ko: 들여쓰기가 잘못되었을 수 있습니다. 이 토큰은 {0} 위치에서 시작된 컨텍스트를 벗어납니다. 이 토큰을 더 들여쓰거나 표준 서식 규칙을 사용하세요.
pl: Możliwe niepoprawne wcięcie: ten token jest poza kontekstem rozpoczynającym się w pozycji {0}. Spróbuj użyć dodatkowego wcięcia dla tego tokenu lub standardowych konwencji formatowania.
pt_br: Recuo possivelmente incorreto: este token está fora do contexto iniciado na posição {0}. Tente recuar mais este token ou use conversões de formatação padrão.
ru: Возможно, неправильные отступы: этот токен находится вне контекста, начиная с позиции {0}. Попробуйте увеличить отступ токена или использовать стандартные соглашения о форматировании.
tr: Olası hatalı girinti: {0} konumundan başlatılan bu belirteç bağlam dışıdır. Bu belirteci daha fazla girintilemeyi veya standart biçimlendirme kurallarını kullanmayı deneyin.
zh_hans: 缩进可能不正确: 此标记位于从位置 {0} 开始的上下文的右侧。请尝试进一步缩进此标记，或使用标准格式设置约定。
zh_hant: 縮排可能不正確: 這個語彙基元於內容的位置 {0} 處開始越位。請嘗試進一步縮排這個語彙基元，或使用標準的格式設定慣例。

# lexfltSeparatorTokensOfPatternMatchMisaligned
source: The '|' tokens separating rules of this pattern match are misaligned by one column. Consider realigning your code or using further indentation.
cs: Tokeny | oddělující pravidla tohoto porovnávacího vzoru nejsou zarovnané o jeden sloupec. Zvažte úpravu zarovnání kódu nebo použití většího odsazení.
de: Die Trennregeln des |-Tokens für diesen Mustervergleich sind um eine Spalte verschoben. Richten Sie den Code neu aus, oder verwenden Sie weitere Einzüge.
es: Los tokens '|' que separan reglas de esta detección de patrones están desalineados en una columna. Considere realinear el código o usar más sangría.
fr: Les jetons '|' qui séparent les règles de ce critère spécial sont décalés d'une colonne. Réalignez votre code ou effectuez une mise en retrait supplémentaire.
it: Le regole di separazione dei token '|' di questi criteri di ricerca sono disallineate di una colonna. Provare a riallineare il codice o a utilizzare ulteriore rientro.
ja: ある列で、このパターン マッチの規則を区切る '|' トークンが正しく配置されていません。コードの配置を変更するか、インデントを増やしてください。
ko: 이 패턴 일치의 규칙을 구분하는 '|' 토큰의 한 열이 잘못 맞춤되어 있습니다. 코드를 다시 맞추거나 들여쓰기를 더 사용하세요.
pl: Reguły oddzielające tokeny „|” tego dopasowania wzorca są niewłaściwie wyrównane o jedną kolumnę. Rozważ ponowne wyrównanie kodu lub użycie dodatkowego wcięcia.
pt_br: Os tokens '|' que separam regras desta correspondência de padrão estão desalinhados em uma coluna. Considere realinhar seu código ou usar mais recuo.
ru: Токены "|", разделяющие правила этого сопоставления шаблону, неправильно выровнены по одному столбцу. Рекомендуется выровнять код или увеличить отступ.
tr: Bu desen eşleşmesinin ayırma kurallarındaki '|' belirteçleri bir sütun kadar yanlış hizalı. Kodunuzu yeniden hizalamayı veya daha fazla girinti kullanmayı düşünün.
zh_hans: 用于分离此模式匹配规则的“|”标记错开了一列。请考虑重新对齐代码或使用进一步的缩进。
zh_hant: 用以分隔這個模式比對之規則的 '|' 語彙基元有一欄未對齊。請考慮重新對齊程式碼或使用進一步的縮排。

# nrInvalidModuleExprType
source: Invalid module/expression/type
cs: Neplatný modul/výraz/typ
de: Ungültiges Modul bzw. ungültiger Ausdruck/Typ.
es: Módulo, expresión o tipo no válidos.
fr: Module/expression/type non valide
it: Modulo/espressione/tipo non valido
ja: モジュール/式/型が無効です
ko: 모듈/식/형식이 잘못되었습니다.
pl: Nieprawidłowy moduł/wyrażenie/typ
pt_br: Módulo/expressão/tipo inválido
ru: Недопустимый модуль, выражение или тип
tr: Geçersiz modül/ifade/tür
zh_hans: 模块/表达式/类型无效
zh_hant: 無效的模組/運算式/類型

# nrTypeInstantiationNeededToDisambiguateTypesWithSameName
source: Multiple types exist called '{0}', taking different numbers of generic parameters. Provide a type instantiation to disambiguate the type resolution, e.g. '{1}'.
cs: Existuje víc typů s názvem {0}, které přebírají různý počet obecných parametrů. Pro jednoznačné rozlišení typu vytvořte instanci typu, třeba {1}.
de: Es sind mehrere Typen mit dem Namen "{0}" vorhanden, die eine unterschiedliche Anzahl von generischen Parametern akzeptieren. Stellen Sie eine Typinstanziierung bereit, um eine eindeutige Typauflösung zu ermöglichen, z.B. "{1}".
es: Existen varios tipos con el nombre '{0}' que toman números diferentes de parámetros genéricos. Proporcione una creación de instancia de tipo para eliminar la ambigüedad de la resolución de tipos; por ejemplo, '{1}'.
fr: Il existe plusieurs types nommés '{0}' qui acceptent divers nombres de paramètres génériques. Fournissez une instanciation de type pour lever l'ambiguïté de la résolution de type. Exemple : '{1}'.
it: Sono presenti più tipi chiamati '{0}', i quali utilizzano numeri diversi di parametri generici. Fornire una creazione dell'istanza del tipo per evitare ambiguità nella risoluzione del tipo, ad esempio '{1}'.
ja: 異なる数のジェネリック パラメーターを使用する '{0}' という複数の型が存在します。厳密に型を解決できるように、型のインスタンス化を指定してください (たとえば、'{1}')。
ko: {0}'(이)라는 형식이 여러 개 있으며 이러한 형식에 서로 다른 수의 제네릭 매개 변수가 사용되고 있습니다. 형식 확인을 구분하기 위한 형식 인스턴스를 제공하십시오(예: '{1}').
pl: Istnieje wiele typów o nazwie „{0}”, które pobierają różne liczby parametrów ogólnych. Udostępnij wystąpienie typu w celu odróżnienia rozpoznawania typu (np. „{1}”).
pt_br: Existem tipos múltiplos chamados '{0}', que pegam diferentes números de parâmetros genéricos. Forneça uma instanciação de tipo para desfazer a ambiguidade da resolução de tipo, por exemplo '{1}'.
ru: Существует несколько типов, вызываемых "{0}" и принимающих различное число универсальных параметров. Предоставьте создание экземпляра типа, чтобы однозначно определить разрешение типа, например, "{1}".
tr: Farklı sayıda genel parametreler alan '{0}' adlı birden çok tür var. Tür çözümleme belirsizliğini gidermek için bir tür örneği sağlayın, örn. '{1}'.
zh_hans: 存在多个名为“{0}”的类型，这些类型采用的泛型参数的数目各不相同。请提供一个类型实例化以区分类型解析，例如“{1}”。
zh_hant: 有多個名稱為 '{0}' 的類型，各接受不同數目的泛型參數。請提供類型具現化，使類型解析意義清楚，例如 '{1}'。

# nrTypeInstantiationIsMissingAndCouldNotBeInferred
source: The instantiation of the generic type '{0}' is missing and can't be inferred from the arguments or return type of this member. Consider providing a type instantiation when accessing this type, e.g. '{1}'.
cs: Instance obecného typu {0} chybí a nedá se ani odvodit od argumentů nebo návratového typu tohoto člena. Zvažte vytvoření instance typu při přístupu k tomuto typu, třeba {1}.
de: Die Instanziierung des generischen Typs "{0}" fehlt und kann nicht per Rückschluss von den Argumenten oder dem Rückgabetyp dieses Members abgeleitet werden. Stellen Sie beim Zugriff auf diesen Typ eine Typinstanziierung bereit, z.B. "{1}".
es: Falta la creación de instancia del tipo genérico '{0}' y no se puede inferir de los argumentos o del tipo de valor devuelto de este miembro. Considere proporcionar una creación de instancia de tipo al obtener acceso a este tipo; por ejemplo, '{1}'.
fr: L'instanciation du type générique '{0}' est manquante. Impossible de la déduire à partir des arguments ou du type de retour de ce membre. Fournissez une instanciation de type lors de l'accès à ce type. Exemple : '{1}'.
it: La creazione dell'istanza del tipo generico '{0}' non è presente e non può essere dedotta dagli argomenti o dal tipo restituito di questo membro. Provare a fornire una creazione dell'istanza del tipo all'accesso al tipo, ad esempio '{1}'.
ja: ジェネリック型 '{0}' のインスタンス化がありません。また、このメンバーの引数または戻り値の型から推論できません。この型にアクセスするときは型のインスタンス化を指定してください (たとえば、'{1}')。
ko: 제네릭 형식 '{0}'의 인스턴스가 없으며 이 멤버의 반환 형식 또는 인수로부터 해당 인스턴스를 유추할 수 없습니다. 이 형식에 액세스할 때 형식 인스턴스를 제공하십시오(예: '{1}').
pl: Brak wystąpienia typu ogólnego „{0}” i nie można wywnioskować wystąpienia przy użyciu argumentów lub zwracanego typu tego elementu członkowskiego. Rozważ udostępnienie wystąpienia typu podczas uzyskiwania dostępu do tego typu (np. „{1}”).
pt_br: Está faltando a instanciação do tipo genérico '{0}', a qual não pode ser inferida a partir de argumentos ou tipo de retorno deste membro. Considere providenciar uma instanciação de tipo quando acessar este tipo, por exemplo '{1}'.
ru: Создание экземпляра универсального типа "{0}" отсутствует и не может быть выведено из типа аргументов или возвращаемого значения этого элемента. Рекомендуется предоставить создание экземпляра типа при доступе к типу, например, "{1}".
tr: {0}' genel türünün örneklenmesi eksik ve bu üyenin bağımsız değişkenlerinden ya da dönüş türünden çıkartılamıyor. Bu türe erişirken bir tür örneği sağlamayı düşünün, örn. '{1}'.
zh_hans: 缺少泛型类型“{0}”的实例化，并且不能从该成员的参数或返回类型推理此实例化。请考虑在访问此类型时提供一个类型实例化，例如“{1}”。
zh_hant: 遺漏泛型型別 '{0}' 的具現化，而且無法從這個成員的引數或傳回型別推斷。存取這種型別時，請考慮提供具現化，例如 '{1}'。

# nrGlobalUsedOnlyAsFirstName
source: 'global' may only be used as the first name in a qualified path
cs: Výraz global se dá použít jenom jako první název v kvalifikované cestě.
de: global darf nur als erster Name in einem qualifizierten Pfad verwendet werden.
es: 'global' se puede usar sólo como el primer nombre en una ruta de acceso completa.
fr: 'global' ne peut être utilisé que comme premier nom dans un chemin d'accès qualifié
it: 'global' può essere utilizzato solo come primo nome in un percorso completo
ja: 'global' は、修飾パスの最初の名前としてのみ使用できます
ko: 'global'은 정규화된 경로에서 첫 번째 이름으로만 사용할 수 있습니다.
pl: Elementu „global” można używać tylko jako pierwszej nazwy w kwalifikowanej ścieżce
pt_br: 'global' só pode ser usado com primeiro nome em um caminho qualificado
ru: Параметр "global" может использоваться только в качестве первого имени в полном пути
tr: 'global' yalnızca tam yoldaki ilk ad olarak kullanılabilir
zh_hans: “global”只能用作限定路径中的第一个名称
zh_hant: 'global' 只能做為完整路徑的第一個名稱使用

# nrIsNotConstructorOrLiteral
source: This is not a constructor or literal, or a constructor is being used incorrectly
cs: Toto není konstruktor nebo literál, anebo se konstruktor používá nesprávně.
de: Dies ist kein Konstruktor oder Literal, oder ein Konstruktor wird nicht ordnungsgemäß verwendet.
es: Este no es un constructor o un literal, o se está usando un constructor de forma incorrecta.
fr: Soit il ne s'agit pas d'un constructeur ou d'un littéral, soit un constructeur est utilisé de manière incorrecte
it: Questo elemento non è un costruttore o un valore letterale oppure un costruttore è utilizzato in modo non corretto
ja: これはコンストラクターまたはリテラルではありません。またはコンストラクターの使用方法に誤りがあります。
ko: 생성자 또는 리터럴이 아니거나 생성자가 잘못된 방식으로 사용되고 있습니다.
pl: Nie jest to konstruktor ani literał albo konstruktor jest niepoprawnie używany
pt_br: Este não é um construtor ou literal, ou então um construtor está sendo usado de forma incorreta
ru: Объект не является конструктором или литералом, либо конструктор используется неправильно
tr: Bu bir oluşturucu veya sabit değer değil ya da bir oluşturucu hatalı kullanılıyor
zh_hans: 这不是一个构造函数或文本，或未正确使用某个构造函数
zh_hant: 這不是建構函式或常值，或者是建構函式的使用方式錯誤

# nrUnexpectedEmptyLongId
source: Unexpected empty long identifier
cs: Neočekávaný prázdný dlouhý identifikátor
de: Unerwarteter leerer langer Bezeichner.
es: Identificador largo vacío inesperado.
fr: Identificateur long vide inattendu
it: Identificatore lungo vuoto imprevisto
ja: 予期しない空の長識別子:
ko: 예기치 않은 빈 긴 식별자입니다.
pl: Nieoczekiwany pusty długi identyfikator
pt_br: Identificador de long vazio inesperado
ru: Недопустимый пустой длинный идентификатор
tr: Beklenmeyen boş long tanımlayıcısı
zh_hans: 意外的空白长标识符
zh_hant: 未預期的空白長識別碼

# nrRecordDoesNotContainSuchLabel
source: The record type '{0}' does not contain a label '{1}'.
cs: Typ záznamu {0} neobsahuje popisek {1}.
de: Der Datensatztyp "{0}" enthält keine Bezeichnung "{1}".
es: El tipo de registro '{0}' no contiene una etiqueta '{1}'.
fr: Le type d'enregistrement '{0}' ne contient pas d'étiquette '{1}'.
it: Il tipo di record '{0}' non contiene un'etichetta '{1}'.
ja: レコードの種類 '{0}' にラベル '{1}' が含まれていません。
ko: 레코드 종류 '{0}'에 '{1}' 레이블이 포함되어 있지 않습니다.
pl: Typ rekordu „{0}” nie zawiera etykiety „{1}”.
pt_br: O tipo de registro '{0}' não contém um rótulo '{1}'.
ru: Тип записи "{0}" не содержит метку "{1}".
tr: {0}' kayıt türü bir '{1}' etiketi içermiyor.
zh_hans: 记录类型“{0}”不包含标签“{1}”。
zh_hant: 記錄類型 '{0}' 未包含標籤 '{1}'。

# nrInvalidFieldLabel
source: Invalid field label
cs: Neplatný popisek pole
de: Ungültige Feldbezeichnung.
es: Etiqueta de campo no válida.
fr: Étiquette de champ non valide
it: Etichetta di campo non valida
ja: フィールド ラベルが無効です
ko: 필드 레이블이 잘못되었습니다.
pl: Nieprawidłowa etykieta pola
pt_br: Rótulo de campo inválido
ru: Недопустимая метка поля
tr: Geçersiz alan etiketi
zh_hans: 字段标签无效
zh_hant: 無效的欄位標籤

# nrInvalidExpression
source: Invalid expression '{0}'
cs: Neplatný výraz {0}
de: Ungültiger Ausdruck "{0}".
es: Expresión '{0}' no válida.
fr: Expression non valide '{0}'
it: Espressione '{0}' non valida
ja: 式 '{0}' は無効です
ko: '{0}' 식이 잘못되었습니다.
pl: Nieprawidłowe wyrażenie „{0}”
pt_br: Expressão '{0}' inválida
ru: Недопустимое выражение "{0}"
tr: Geçersiz ifade: '{0}'
zh_hans: 表达式“{0}”无效
zh_hant: 無效的運算式 '{0}'

# nrNoConstructorsAvailableForType
source: No constructors are available for the type '{0}'
cs: Pro typ {0} nejsou k dispozici žádné konstruktory.
de: Für den Typ "{0}" sind keine Konstruktoren verfügbar.
es: No hay constructores disponibles para el tipo '{0}'.
fr: Aucun constructeur n'est disponible pour le type '{0}'
it: Nessun costruttore disponibile per il tipo '{0}'
ja: 型 '{0}' に使用できるコンストラクターがありません
ko: '{0}' 형식에 대해 사용할 수 있는 생성자가 없습니다.
pl: Brak konstruktorów dostępnych dla typu „{0}”
pt_br: Nenhum construtor está disponível para o tipo '{0}'
ru: Недоступны конструкторы для типа "{0}"
tr: '{0}' türü için kullanılabilir bir oluşturucu yok
zh_hans: 没有对类型“{0}”可用的构造函数
zh_hant: 沒有可供類型 '{0}' 使用的建構函式

# nrUnionTypeNeedsQualifiedAccess
source: The union type for union case '{0}' was defined with the RequireQualifiedAccessAttribute. Include the name of the union type ('{1}') in the name you are using.
cs: Typ sjednocení pro případ sjednocení {0} se definoval pomocí atributu RequireQualifiedAccessAttribute. Do jména, které používáte, přidejte název typu sjednocení ({1}).
de: Der Union-Typ für Union-Fall "{0}" wurde mit RequireQualifiedAccessAttribute definiert. Fügen Sie den Union-Typnamen ("{1}") in den verwendeten Namen ein.
es: El tipo de unión del caso de unión "{0}" se definió con el atributo RequireQualifiedAccessAttribute. Incluya el nombre del tipo de unión ("{1}") en el nombre que esté usando.
fr: Le type union du cas d'union '{0}' a été défini avec RequireQualifiedAccessAttribute. Incluez le nom du type union ('{1}') dans le nom que vous utilisez.
it: Il tipo di unione per il case di unione '{0}' è stato definito con RequireQualifiedAccessAttribute. Includere il nome del tipo di unione ('{1}') nel nome da usare.
ja: 共用体ケース '{0}' の共用体型が RequireQualifiedAccessAttribute によって定義されました。使用中の名前に共用体型 ('{1}') の名前を含めてください。
ko: 공용 구조체 케이스 '{0}'에 대한 공용 구조체 형식은 RequireQualifiedAccessAttribute로 정의됩니다. 사용 중인 이름에 공용 구조체 형식('{1}') 이름을 포함하세요.
pl: Typ unii dla przypadku unii „{0}” został zdefiniowany z użyciem wartości RequireQualifiedAccessAttribute. Uwzględnij nazwę typu unii („{1}”) w używanej nazwie.
pt_br: O tipo de união para o caso de união '{0}' foi definido com o RequireQualifiedAccessAttribute. Inclua o nome do tipo de união ('{1}') no nome que você está usando.
ru: Тип объединения для ветви объединения "{0}" определен с RequireQualifiedAccessAttribute. Включите имя типа объединения ("{1}") в используемое имя.
tr: {0}' birleşim durumunun birleşim türü RequireQualifiedAccessAttribute ile tanımlanmış. Kullandığınız ada birleşim türünün adını ('{1}') dahil edin.
zh_hans: 使用 RequireQualifiedAccessAttribute 定义联合用例“{0}”的联合类型。包括所使用的名称中联合类型 ('{1}') 的名称。
zh_hant: 聯集 '{0}' 的等位型別由 RequireQualifiedAccessAttribute 定義。請在您使用的名稱中，加入等位型別 '{1}' 的名稱。

# nrRecordTypeNeedsQualifiedAccess
source: The record type for the record field '{0}' was defined with the RequireQualifiedAccessAttribute. Include the name of the record type ('{1}') in the name you are using.
cs: Typ záznamu pro pole záznamu {0} se definoval pomocí atributu RequireQualifiedAccessAttribute. Do jména, které používáte, přidejte název typu záznamu ({1}).
de: Der Datensatztyp für das Feld "{0}" wurde mit RequireQualifiedAccessAttribute definiert. Fügen Sie den Namen des Datensatztyps ("{1}") in den verwendeten Namen ein.
es: El tipo de registro del campo de registro "{0}" se definió con el atributo RequireQualifiedAccessAttribute. Incluya el nombre del tipo de registro ("{1}") en el nombre que esté usando.
fr: Le type d'enregistrement du champ d'enregistrement '{0}' a été défini avec RequireQualifiedAccessAttribute. Incluez le nom du type d'enregistrement ('{1}') dans le nom que vous utilisez.
it: Il tipo di record per il campo di record '{0}' è stato definito con RequireQualifiedAccessAttribute. Includere il nome del tipo di record ('{1}') nel nome da usare.
ja: レコード フィールド '{0}' のレコード型が RequireQualifiedAccessAttribute によって定義されました。使用中の名前にレコード型 ('{1}') の名前を含めてください。
ko: 레코드 필드 '{0}'에 대한 레코드 타입은 RequireQualifiedAccessAttribute로 정의됩니다. 사용 중인 이름에 레코드 타입('{1}') 이름을 포함하세요.
pl: Typ rekordu dla pola rekordu „{0}” został zdefiniowany z użyciem wartości RequireQualifiedAccessAttribute. Uwzględnij nazwę typu rekordu („{1}”) w używanej nazwie.
pt_br: O tipo de registro para o campo de registro '{0}' foi definido com o RequireQualifiedAccessAttribute. Inclua o nome do tipo de registro ('{1}') no nome que você está usando.
ru: Тип записи для поля записи "{0}" определен с RequireQualifiedAccessAttribute. Включите имя типа записи ("{1}") в используемое имя.
tr: {0}' kayıt alanının kayıt türü RequireQualifiedAccessAttribute ile tanımlanmış. Kullandığınız ada kayıt türünün adını ('{1}') dahil edin.
zh_hans: 使用 RequireQualifiedAccessAttribute 定义记录字段“{0}”的记录类型。包括所使用的名称中记录类型 ('{1}') 的名称。
zh_hant: 記錄欄位 '{0}' 的記錄類型定義有 RequireQualifiedAccessAttribute。請在您使用的名稱中，加入記錄類型 ('{1}') 的名稱。

# ilwriteErrorCreatingPdb
source: Unexpected error creating debug information file '{0}'
cs: Při vytváření souboru ladicích informací {0} došlo k neočekávané chybě.
de: Unerwarteter Fehler beim Erstellen der Debuginformationsdatei "{0}".
es: Error inesperado al crear el archivo de información de depuración '{0}'.
fr: Erreur inattendue lors de la création du fichier des informations de débogage '{0}'
it: Errore imprevisto durante la creazione del file di informazioni di debug '{0}'
ja: デバッグ情報ファイル '{0}' の作成中に予期しないエラーが発生しました:
ko: 디버그 정보 파일 '{0}'을(를) 만드는 동안 예기치 않은 오류가 발생했습니다.
pl: Nieoczekiwany błąd podczas tworzenia pliku informacji o debugowaniu „{0}”
pt_br: Erro inesperado ao criar o arquivo de informação de depuração '{0}'
ru: Непредвиденная ошибка при создании файла отладочной информации "{0}"
tr: Hata ayıklama bilgileri dosyası '{0}' oluşturulurken beklenmeyen hata
zh_hans: 创建调试信息文件“{0}”时出错
zh_hant: 建立偵錯資訊檔 '{0}' 時發生未預期的錯誤

# lexOutsideIntegerRange
source: This number is outside the allowable range for this integer type
cs: Toto číslo je mimo povolený rozsah pro tento celočíselný typ.
de: Diese Zahl liegt außerhalb des zulässigen Bereichs für diesen Integer-Typ.
es: Este número está fuera del intervalo permitido para este tipo de entero.
fr: Ce nombre se trouve en dehors de la plage autorisée pour ce type d'entier
it: Questo numero non è compreso nell'intervallo consentito per questo tipo di Integer
ja: この数値は、この整数型に使用できる範囲から外れています
ko: 이 숫자는 이 정수 형식에 대해 허용 가능한 범위를 벗어납니다.
pl: Ta liczba jest poza dozwolonym zakresem tego typu liczb całkowitych
pt_br: Este número está fora do intervalo permitido para este tipo de inteiro
ru: Это число находится вне допустимого диапазона для целого типа
tr: Bu sayı, bu tamsayı türü için izin verilen aralığın dışında
zh_hans: 此数字在允许的此整数类型范围之外
zh_hant: 這個數字已經超出這個整數類型允許的範圍
