Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# tcLiteralFieldAssignmentNoArg
source: Cannot assign a value to another value marked literal
cs: Hodnota se nedá přiřadit k jiné hodnotě, která je označená jako literál.
de: Ein Wert kann keinem anderen als Literal markierten Wert zugewiesen werden.
es: No se puede asignar un valor a otro marcado como literal
fr: Impossible d'affecter une valeur à une autre valeur marquée comme littérale
it: Non è possibile assegnare un valore a un altro valore contrassegnato come letterale
ja: リテラルとしてマークされた別の値に値を割り当てることはできません
ko: 리터럴로 표시된 다른 값에 값을 할당할 수 없습니다.
pl: Nie można przypisać wartości do innej wartości oznaczonej jako literał
pt_br: Não é possível atribuir um valor a outro valor marcado como literal
ru: Невозможно присвоить значение другому значению, помеченному как литерал
tr: Sabit değer olarak işaretlenen bir değere başka bir değer atanamaz
zh_hans: 无法将值分配给标记为文本的其他值
zh_hant: 無法將值指派給標記為常值的其他值

# tcLiteralFieldAssignmentWithArg
source: Cannot assign '{0}' to a value marked literal
cs: K hodnotě označené jako literál se {0} nedá přiřadit.
de: "{0}" kann keinem als Literal markierten Wert zugewiesen werden.
es: No se puede asignar "{0}" a un valor marcado como literal
fr: Impossible d'affecter '{0}' à une valeur marquée comme littérale
it: Non è possibile assegnare '{0}' a un valore contrassegnato come letterale
ja: リテラルとしてマークされた値に '{0}' を割り当てることはできません
ko: 리터럴로 표시된 값에 '{0}'을(를) 할당할 수 없습니다.
pl: Nie można przypisać elementu „{0}” do wartości oznaczonej jako literał
pt_br: Não é possível atribuir '{0}' a um valor marcado como literal
ru: Невозможно присвоить "{0}" значению, помеченному как литерал
tr: Sabit değer olarak işaretlenen bir değere '{0}' atanamaz
zh_hans: 无法将“{0}”分配给标记为文本的值
zh_hant: 無法將 '{0}' 指派給標記為常值的值

# tcRequireMergeSourcesOrBindN
source: The 'let! ... and! ...' construct may only be used if the computation expression builder defines either a '{0}' method or appropriate 'MergeSource' and 'Bind' methods
cs: Konstrukt let! ... and! ... se dá použít jen v případě, že tvůrce výpočetních výrazů definuje buď metodu {0}, nebo vhodné metody MergeSource a Bind.
de: Das Konstrukt "let! ... and! ..." kann nur verwendet werden, wenn der Berechnungsausdrucks-Generator entweder eine {0}-Methode oder geeignete MergeSource- und Bind-Methoden definiert.
es: La construcción "let! ... and! ..." solo se puede usar si el generador de expresiones de cálculo define un método "{0}" o bien los métodos "MergeSource" y "Bind" adecuados.
fr: La construction 'let! ... and! ...' peut uniquement être utilisée si le générateur d'expressions de calcul définit une méthode '{0}' ou les méthodes 'MergeSource' et 'Bind' appropriées
it: È possibile usare il costrutto 'let! ... and! ...' solo se il generatore di espressioni di calcolo definisce un metodo '{0}' o metodi 'MergeSource' e 'Bind' appropriati
ja: 'let! ... and! ...' コンストラクトは、コンピュテーション式ビルダーが '{0}' メソッドまたは適切な 'MergeSource' および 'Bind' メソッドのいずれかを定義している場合にのみ使用できます
ko: 'let! ... and! ...' 구문은 계산 식 작성기에서 '{0}' 메서드 또는 적절한 'MergeSource' 및 'Bind' 메서드를 정의한 경우에만 사용할 수 있습니다.
pl: Konstrukcji „let! ... and! ...” można użyć tylko wtedy, gdy konstruktor wyrażeń obliczeniowych definiuje metodę „{0}” lub odpowiednie metody „MergeSource” i „Bind”
pt_br: O constructo 'let! ... and! ...' só pode ser usado se o construtor de expressões de computação definir um método '{0}' ou um método 'MergeSource' ou 'Bind' apropriado
ru: Конструкцию "let! ... and! ..." можно использовать только в том случае, если построитель выражений с вычислениями определяет либо метод "{0}", либо соответствующие методы "MergeSource" и "Bind"
tr: 'let! ... and! ...' yapısı, yalnızca hesaplama ifadesi oluşturucu bir '{0}' metodunu ya da uygun 'MergeSource' ve 'Bind' metotlarını tanımlarsa kullanılabilir
zh_hans: 仅当计算表达式生成器定义了 "{0}" 方法或适当的 "MergeSource" 和 "Bind" 方法时，才可以使用 "let! ... and! ..." 构造
zh_hant: 只有在計算運算式產生器定義 '{0}' 方法或正確的 'MergeSource' 和 'Bind' 方法時，才可使用 'let! ... and! ...' 建構

# tcUnableToParseInterpolatedString
source: Invalid interpolated string. {0}
cs: Neplatný interpolovaný řetězec. {0}
de: Ungültige interpolierte Zeichenfolge. {0}
es: Cadena interpolada no válida. {0}
fr: Chaîne interpolée non valide. {0}
it: La stringa interpolata non è valida. {0}
ja: 補間された文字列が無効です。{0}
ko: 잘못된 보간 문자열. {0}
pl: Nieprawidłowy ciąg interpolowany. {0}
pt_br: Cadeia de caracteres interpolada inválida. {0}
ru: Недопустимая интерполированная строка. {0}
tr: Geçersiz düz metin arasına kod eklenmiş dize. {0}
zh_hans: 内插字符串无效。{0}
zh_hant: 插補字串無效。{0}

# typrelInterfaceMemberNoMostSpecificImplementation
source: Interface member '{0}' does not have a most specific implementation.
cs: Člen rozhraní {0} nemá nejvíce specifickou implementaci.
de: Der Schnittstellenmember "{0}" weist keine spezifischste Implementierung auf.
es: El miembro de interfaz "{0}" no tiene una implementación más específica.
fr: Le membre d'interface '{0}' n'a pas l'implémentation la plus spécifique.
it: Il membro di interfaccia '{0}' non contiene un'implementazione più specifica.
ja: インターフェイス メンバー '{0}' には最も固有な実装がありません。
ko: 인터페이스 멤버 '{0}'에 가장 한정적인 구현이 없습니다.
pl: Składowa interfejsu „{0}” nie ma najbardziej specyficznej implementacji.
pt_br: O membro de interface '{0}' não tem uma implementação mais específica.
ru: Элемент интерфейса "{0}" не имеет наиболее конкретной реализации.
tr: '{0}' arabirim üyesinin en belirgin uygulaması yok.
zh_hans: 接口成员“{0}”没有最具体的实现。
zh_hant: 介面成員 '{0}' 沒有最具體的實作。

# typrelInterfaceWithConcreteAndVariable
source: '{0}' cannot implement the interface '{1}' with the two instantiations '{2}' and '{3}' because they may unify.
cs: {0} nemůže implementovat rozhraní {1} se dvěma instancemi {2} a {3}, protože by se mohly sjednotit.
de: "{0}" kann die Schnittstelle "{1}" mit den beiden Instanziierungen "{2}" und "{3}" nicht implementieren, weil sie möglicherweise zusammengeführt werden.
es: "{0}" no puede implementar la interfaz "{1}" con ambas creaciones de instancias, "{2}" y "{3}", porque pueden unificarse.
fr: '{0}' ne peut pas implémenter l'interface '{1}' avec les deux instanciations '{2}' et '{3}', car elles peuvent s'unifier.
it: '{0}' non può implementare l'interfaccia '{1}' con le due creazioni di istanze '{2}' e '{3}' perché possono essere unificate.
ja: 統合している可能性があるため、'{0}' は、'{2}' と '{3}' の 2 つのインスタンス化を含むインターフェイス '{1}' を実装できません。
ko: '{0}'이(가) '{2}' 및 '{3}' 인스턴스화가 포함된 '{1}' 인터페이스를 구현할 수 없습니다. 이 두 인스턴스화가 통합될 수 있기 때문입니다.
pl: Element „{0}” nie może implementować interfejsu „{1}” z dwoma wystąpieniami „{2}” i „{3}”, ponieważ mogą one się ujednolicić.
pt_br: '{0}' não pode implementar a interface '{1}' com as duas instanciações '{2}' e '{3}' porque talvez elas sejam unificadas.
ru: "{0}" не может реализовать интерфейс "{1}" с двумя созданиями экземпляра "{2}" и "{3}", так как они могут быть объединены.
tr: '{0}', '{2}' ve '{3}' örnek oluşturmaları birleşebileceğinden '{1}' arabirimini bunlarla birlikte uygulayamaz.
zh_hans: “{0}”无法实现具有两个实例化“{2}”和“{3}”的接口“{1}”，因为它们可能会统一。
zh_hant: 因為 '{2}' 和 '{3}' 兩者的具現化可能整合，所以 '{0}' 無法將其用於實作介面 '{1}'。

# typrelInterfaceWithConcreteAndVariableObjectExpression
source: You cannot implement the interface '{0}' with the two instantiations '{1}' and '{2}' because they may unify.
cs: Rozhraní {0} nemůžete implementovat se dvěma instancemi {1} a {2}, protože by se mohly sjednotit.
de: Sie können die Schnittstelle "{0}" mit den beiden Instanziierungen "{1}" und "{2}" nicht implementieren, weil sie möglicherweise zusammengeführt werden.
es: No se puede implementar la interfaz "{0}" con ambas creaciones de instancias, "{1}" y "{2}", porque pueden unificarse.
fr: Vous ne pouvez pas implémenter l'interface '{0}' avec les deux instanciations '{1}' et '{2}', car elles peuvent s'unifier.
it: Non è possibile implementare l'interfaccia '{0}' con le due creazioni di istanze '{1}' e '{2}' perché possono essere unificate.
ja: 統合している可能性があるため、'{1}' と '{2}' の 2 つのインスタンス化を含むインターフェイス '{0}' を実装することはできません。
ko: '{1}' 및 '{2}' 인스턴스화가 포함된 '{0}' 인터페이스를 구현할 수 없습니다. 이 두 인스턴스화가 통합될 수 있기 때문입니다.
pl: Nie możesz zaimplementować interfejsu „{0}” przy użyciu dwóch wystąpień „{1}” i „{2}”, ponieważ mogą one się ujednolicić.
pt_br: Não é possível implementar a interface '{0}' com as duas instanciações '{1}' e '{2}' porque talvez elas sejam unificadas.
ru: Невозможно реализовать интерфейс "{0}" с двумя созданиями экземпляра "{1}" и "{2}", так как они могут быть объединены.
tr: '{1}' ve '{2}' örnek oluşturmaları birleşebileceğinden '{0}' arabirimini bunlarla birlikte uygulayamazsınız.
zh_hans: 你无法实现具有两个实例化“{1}”和“{2}”的接口“{0}”，因为它们可能会统一。
zh_hant: 因為 '{1}' 和 '{2}' 兩者的具現化可能整合，所以無法將其用於實作介面 '{0}'。

# undefinedNameFieldConstructorOrMemberWhenTypeIsKnown
source: The type '{0}' does not define the field, constructor or member '{1}'.
cs: Typ {0} nedefinuje pole, konstruktor ani člen {1}.
de: Der Typ "{0}" definiert nicht das Feld, den Konstruktor oder den Member "{1}".
es: El tipo "{0}" no define el campo, constructor o miembro "{1}".
fr: Le type '{0}' ne définit pas le champ, le constructeur ou le membre '{1}'.
it: Il tipo '{0}' non definisce il campo, il costruttore o il membro '{1}'.
ja: 型 '{0}' は、フィールド、コンストラクター、またはメンバー '{1}' を定義していません。
ko: '{0}' 형식은 '{1}' 필드, 생성자 또는 멤버를 정의하지 않습니다.
pl: Typ „{0}” nie definiuje pola, konstruktora lub składowej „{1}”.
pt_br: O tipo '{0}' não define o campo, o construtor ou o membro '{1}'.
ru: Тип "{0}" не определяет поле, конструктор или член "{1}".
tr: '{0}' türü; alanı, oluşturucuyu veya '{1}' üyesini tanımlamıyor.
zh_hans: 类型“{0}”未定义字段、构造函数或成员“{1}”。
zh_hant: 類型 '{0}' 未定義欄位、建構函式或成員 '{1}'。

# undefinedNameNamespace
source: The namespace '{0}' is not defined.
cs: Není definovaný obor názvů {0}.
de: Der Namespace "{0}" ist nicht definiert.
es: El espacio de nombres "{0}" no está definido.
fr: L'espace de noms '{0}' n'est pas défini.
it: Lo spazio dei nomi '{0}' non è definito.
ja: 名前空間 '{0}' が定義されていません。
ko: '{0}' 네임스페이스가 정의되지 않았습니다.
pl: Nie zdefiniowano przestrzeni nazw „{0}”.
pt_br: O namespace '{0}' não está definido.
ru: Пространство имен "{0}" не определено.
tr: '{0}' ad alanı tanımlı değil.
zh_hans: 未定义命名空间“{0}”。
zh_hant: 未定義命名空間 '{0}'。

# undefinedNameNamespaceOrModule
source: The namespace or module '{0}' is not defined.
cs: Není definovaný obor názvů nebo modul {0}.
de: Der Namespace oder das Modul "{0}" ist nicht definiert.
es: El espacio de nombres o módulo "{0}" no está definido.
fr: L'espace de noms ou le module '{0}' n'est pas défini.
it: Lo spazio dei nomi o il modulo '{0}' non è definito.
ja: 名前空間またはモジュール '{0}' が定義されていません。
ko: '{0}' 네임스페이스 또는 모듈이 정의되지 않았습니다.
pl: Nie zdefiniowano przestrzeni nazw lub modułu „{0}”.
pt_br: O namespace ou o módulo '{0}' não está definido.
ru: Пространство имен или модуль "{0}" не определены.
tr: '{0}' ad alanı veya modülü tanımlı değil.
zh_hans: 未定义命名空间或模块“{0}”。
zh_hant: 未定義命名空間或模組 '{0}'。

# undefinedNameFieldConstructorOrMember
source: The field, constructor or member '{0}' is not defined.
cs: Není definované pole, konstruktor nebo člen {0}.
de: Das Feld, der Konstruktor oder der Member "{0}" ist nicht definiert.
es: El campo, constructor o miembro "{0}" no está definido.
fr: Le champ, le constructeur ou le membre '{0}' n'est pas défini.
it: Il campo, il costruttore o il membro '{0}' non è definito.
ja: フィールド、コンストラクター、またはメンバー '{0}' が定義されていません。
ko: '{0}' 필드, 생성자 또는 멤버가 정의되지 않았습니다.
pl: Nie zdefiniowano pola, konstruktora lub elementu członkowskiego „{0}”.
pt_br: O campo, o construtor ou o membro '{0}' não está definido.
ru: Поле, конструктор или элемент "{0}" не определены.
tr: '{0}' alanı, oluşturucusu veya üyesi tanımlı değil.
zh_hans: 未定义字段、构造函数或成员“{0}”。
zh_hant: 未定義欄位、建構函式或成員 '{0}'。

# undefinedNameValueConstructorNamespaceOrType
source: The value, constructor, namespace or type '{0}' is not defined.
cs: Není definovaný konstruktor, hodnota, obor názvů nebo typ {0}.
de: Der Wert, Konstruktor, Namespace oder Typ "{0}" ist nicht definiert.
es: El valor, constructor, espacio de nombres o tipo "{0}" no está definido.
fr: La valeur, le constructeur, l'espace de noms ou le type '{0}' n'est pas défini.
it: Il valore, il costruttore, lo spazio dei nomi o il tipo '{0}' non è definito.
ja: 値、コンストラクター、名前空間、または型 '{0}' が定義されていません。
ko: '{0}' 값, 생성자, 네임스페이스 또는 형식이 정의되지 않았습니다.
pl: Nie zdefiniowano wartości, konstruktora, przestrzeni nazw lub typu „{0}”.
pt_br: O valor, o construtor, o namespace ou o tipo '{0}' não está definido.
ru: Значение, конструктор, пространство имен или тип "{0}" не определены.
tr: '{0}' değeri, oluşturucusu, ad alanı veya türü tanımlı değil.
zh_hans: 未定义值、构造函数、命名空间或类型“{0}”。
zh_hant: 未定義值、建構函式、命名空間或類型 '{0}'。

# undefinedNameValueOfConstructor
source: The value or constructor '{0}' is not defined.
cs: Není definovaná hodnota nebo konstruktor {0}.
de: Der Wert oder Konstruktor "{0}" ist nicht definiert.
es: El valor o constructor "{0}" no está definido.
fr: La valeur ou le constructeur '{0}' n'est pas défini.
it: Il valore o il costruttore '{0}' non è definito.
ja: 値またはコンストラクター '{0}' が定義されていません。
ko: '{0}' 값 또는 생성자가 정의되지 않았습니다.
pl: Nie zdefiniowano wartości lub konstruktora „{0}”.
pt_br: O valor ou o construtor '{0}' não está definido.
ru: Значение или конструктор "{0}" не определены.
tr: '{0}' değer veya oluşturucusu tanımlı değil.
zh_hans: 未定义值或构造函数“{0}”。
zh_hant: 未定義值或建構函式 '{0}'。

# undefinedNameValueNamespaceTypeOrModule
source: The value, namespace, type or module '{0}' is not defined.
cs: Není definovaný obor názvů, hodnota, typ nebo modul {0}.
de: Der Wert, Namespace, Typ oder das Modul "{0}" ist nicht definiert.
es: El valor, espacio de nombres, tipo o módulo "{0}" no está definido.
fr: La valeur, l'espace de noms, le type ou le module '{0}' n'est pas défini.
it: Il valore, lo spazio dei nomi, il tipo o il modulo '{0}' non è definito.
ja: 値、名前空間、型、またはモジュール '{0}' が定義されていません。
ko: '{0}' 값, 네임스페이스, 형식 또는 모듈이 정의되지 않았습니다.
pl: Nie zdefiniowano wartości, przestrzeni nazw, typu lub modułu „{0}”.
pt_br: O valor, o namespace, o tipo ou o módulo '{0}' não está definido.
ru: Значение, пространство имен, тип или модуль "{0}" не определены.
tr: '{0}' değeri, ad alanı, türü veya modülü tanımlı değil.
zh_hans: 未定义值、命名空间、类型或模块“{0}”。
zh_hant: 未定義值、命名空間、類型或模組 '{0}'。

# undefinedNameConstructorModuleOrNamespace
source: The constructor, module or namespace '{0}' is not defined.
cs: Není definovaný konstruktor, modul nebo obor názvů {0}.
de: Der Konstruktor, das Modul oder der Namespace "{0}" ist nicht definiert.
es: El constructor, módulo o espacio de nombres "{0}" no está definido.
fr: Le constructeur, le module ou l'espace de noms '{0}' n'est pas défini.
it: Il costruttore, il modulo o lo spazio dei nomi '{0}' non è definito.
ja: コンストラクター、モジュール、または名前空間 '{0}' が定義されていません。
ko: '{0}' 생성자, 모듈 또는 네임스페이스가 정의되지 않았습니다.
pl: Nie zdefiniowano konstruktora, modułu lub przestrzeni nazw „{0}”.
pt_br: O construtor, o módulo ou o namespace '{0}' não está definido.
ru: Конструктор, модуль или пространство имен "{0}" не определены.
tr: '{0}' oluşturucusu, modülü veya ad alanı tanımlı değil.
zh_hans: 未定义构造函数、模块或命名空间“{0}”。
zh_hant: 未定義建構函式、模組或命名空間 '{0}'。

# undefinedNameType
source: The type '{0}' is not defined.
cs: Není definovaný typ {0}.
de: Der Typ "{0}" ist nicht definiert.
es: El tipo "{0}" no está definido.
fr: Le type '{0}' n'est pas défini.
it: Il tipo '{0}' non è definito.
ja: 型 '{0}' が定義されていません。
ko: '{0}' 형식이 정의되지 않았습니다.
pl: Nie zdefiniowano typu „{0}”.
pt_br: O tipo '{0}' não está definido.
ru: Тип "{0}" не определен.
tr: '{0}' türü tanımlı değil.
zh_hans: 未定义类型“{0}”。
zh_hant: 未定義類型 '{0}'。

# undefinedNameTypeIn
source: The type '{0}' is not defined in '{1}'.
cs: Typ {0} není definovaný v {1}.
de: Der Typ "{0}" ist nicht in "{1}" definiert.
es: El tipo '{0}' no está definido en '{1}'.
fr: Le type '{0}' n'est pas défini dans '{1}'.
it: Il tipo '{0}' non è definito in '{1}'.
ja: {1}' で型 '{0}' が定義されていません。
ko: {0}' 형식이 '{1}'에 정의되어 있지 않습니다.
pl: Typ „{0}” nie jest zdefiniowany w elemencie „{1}”.
pt_br: O tipo '{0}' não está definido em '{1}'.
ru: Тип "{0}" не определен в "{1}".
tr: {0}' türü '{1}' içinde tanımlı değil.
zh_hans: 类型“{0}”未在“{1}”中定义。
zh_hant: {1}' 中未定義類型 '{0}'。

# undefinedNameRecordLabelOrNamespace
source: The record label or namespace '{0}' is not defined.
cs: Není definovaný popisek záznamů nebo obor názvů {0}.
de: Die Datensatzbezeichnung oder der Namespace "{0}" ist nicht definiert.
es: La etiqueta de registro o el espacio de nombres "{0}" no está definido.
fr: L'étiquette d'enregistrement ou l'espace de noms '{0}' n'est pas défini.
it: L'etichetta record o lo spazio dei nomi '{0}' non è definito.
ja: レコード ラベルまたは名前空間 '{0}' が定義されていません。
ko: 레코드 레이블 또는 네임스페이스 '{0}'이(가) 정의되지 않았습니다.
pl: Nie zdefiniowano etykiety rekordu lub przestrzeni nazw „{0}”.
pt_br: O rótulo de registro ou o namespace '{0}' não está definido.
ru: Метка записи или пространство имен "{0}" не определены.
tr: '{0}' kayıt etiketi veya ad alanı tanımlı değil.
zh_hans: 未定义记录标签或命名空间“{0}”。
zh_hant: 未定義記錄標籤或命名空間 '{0}'。

# undefinedNameRecordLabel
source: The record label '{0}' is not defined.
cs: Nemáte definovaný popisek záznamů {0}.
de: Die Datensatzbezeichnung "{0}" ist nicht definiert.
es: La etiqueta de registro '{0}' no está definida.
fr: L'étiquette d'enregistrement '{0}' n'est pas définie.
it: L'etichetta del record '{0}' non è definita.
ja: レコード ラベル '{0}' が定義されていません。
ko: 레코드 레이블 '{0}'이(가) 정의되지 않았습니다.
pl: Nie zdefiniowano etykiety rekordu „{0}”.
pt_br: O rótulo do registro '{0}' não está definido.
ru: Метка записи "{0}" не определена.
tr: '{0}' kayıt etiketi tanımlı değil.
zh_hans: 记录标签“{0}”未定义。
zh_hant: 未定義記錄標籤 '{0}'。

# undefinedNameSuggestionsIntro
source: Maybe you want one of the following:
cs: Možná budete potřebovat něco z tohoto:
de: Vielleicht möchten Sie eine der folgenden Bezeichnungen verwenden:
es: Puede elegir una de las opciones siguientes:
fr: Peut-être souhaitez-vous l'une des options suivantes :
it: Si può specificare uno dei nomi seguenti:
ja: 次のいずれかの可能性はありませんか:
ko: 다음 중 하나가 필요할 수 있습니다.
pl: Możliwe, że chcesz wykonać jedną z następujących czynności:
pt_br: Talvez você queira um dos seguintes:
ru: Возможно, требуется одно из следующих:
tr: Aşağıdakilerden birini arıyor olabilirsiniz:
zh_hans: 你可能需要以下之一:
zh_hant: 您可能需要下列其中一項:

# undefinedNameTypeParameter
source: The type parameter {0} is not defined.
cs: Není definovaný parametr typu {0}.
de: Der Typparameter "{0}" ist nicht definiert.
es: El parámetro de tipo "{0}" no está definido.
fr: Le paramètre de type '{0}' n'est pas défini.
it: Il parametro di tipo '{0}' non è definito.
ja: 型パラメーター {0} が定義されていません。
ko: 형식 매개 변수 '{0}'이(가) 정의되지 않았습니다.
pl: Nie zdefiniowano parametru typu „{0}”.
pt_br: O parâmetro de tipo '{0}' não está definido.
ru: Параметр типа {0} не определен.
tr: '{0}' tür parametresi tanımlı değil.
zh_hans: 未定义类型参数 {0}。
zh_hant: 未定義類型參數 {0}。

# undefinedNamePatternDiscriminator
source: The pattern discriminator '{0}' is not defined.
cs: Není definovaný rozlišovací prvek vzorů {0}.
de: Der Musterdiskriminator "{0}" ist nicht definiert.
es: El discriminador de patrones "{0}" no está definido.
fr: Le discriminateur de modèle '{0}' n'est pas défini.
it: Il discriminatore di criteri '{0}' non è definito.
ja: パターン識別子 '{0}' が定義されていません。
ko: 패턴 판별자 '{0}'이(가) 정의되지 않았습니다.
pl: Nie zdefiniowano rozróżniacza wzorców „{0}”.
pt_br: O discriminador de padrão '{0}' não está definido.
ru: Дискриминатор шаблона "{0}" не определен.
tr: '{0}' desen ayrıştırıcısı tanımlı değil.
zh_hans: 未定义模式鉴别器“{0}”。
zh_hant: 未定義模式鑑別子 '{0}'。

# replaceWithSuggestion
source: Replace with '{0}'
cs: Nahradit návrhem: {0}
de: Durch "{0}" ersetzen
es: Reemplazar por "{0}"
fr: Remplacer par '{0}'
it: Sostituisci con '{0}'
ja: '{0}' で置換
ko: '{0}'(으)로 바꾸기
pl: Zamień na element „{0}”
pt_br: Substituir por '{0}'
ru: Заменить на "{0}"
tr: '{0}' ile değiştir
zh_hans: 替换为“{0}”
zh_hant: 取代為 '{0}'

# addIndexerDot
source: Add . for indexer access.
cs: Přidejte . pro přístup indexeru.
de: Fügen Sie . für Indexerzugriff hinzu.
es: Agregar . para el acceso de indizador.
fr: Ajoutez un . pour l'accès à l'indexeur.
it: Aggiunge . per l'accesso all'indicizzatore.
ja: インデクサーにアクセスするには . を追加します。
ko: 인덱서 액세스의 경우 . 추가
pl: Dodaj znak . na potrzeby dostępu indeksatora.
pt_br: Adicione um . para obter acesso ao indexador.
ru: Добавьте "." для доступа к индексатору.
tr: Dizin oluşturucu erişimi için . ekleyin.
zh_hans: 添加 . 进行索引器访问。
zh_hant: 為索引子存取新增 .。

# listElementHasWrongType
source: All elements of a list must be of the same type as the first element, which here is '{0}'. This element has type '{1}'.
cs: Všechny elementy výrazu konstruktoru seznamu musí mít stejný typ. Očekávalo se, že tento výraz bude mít typ {0}, ale tady je typu {1}.
de: Alle Elemente eines Listenkonstruktorausdrucks müssen den gleichen Typ aufweisen. Es wurde erwartet, dass dieser Ausdruck den Typ "{0}" aufweist, hier liegt aber der Typ "{1}" vor.
es: Todas las ramas de una expresión de constructor de lista deben tener el mismo tipo. Se esperaba que esta expresión tuviera el tipo "{0}", pero aquí tiene el tipo "{1}".
fr: Tous les éléments d'une expression comportant un constructeur de liste doivent avoir le même type. Cette expression était censée avoir le type '{0}', mais elle a ici le type '{1}'.
it: Il tipo di tutti gli elementi di un'espressione di costruttore di elenco deve essere lo stesso. Il tipo previsto di questa espressione è '{0}', ma quello effettivo è '{1}'.
ja: リスト コンストラクター式のすべての要素は同じ型である必要があります。この式に必要な型は '{0}' ですが、ここでは型 '{1}' になっています。
ko: 목록 생성자의 모든 요소는 동일한 형식이어야 합니다. 이 식에는 '{0}' 형식이 필요하지만 여기에서는 '{1}' 형식이 지정되었습니다.
pl: Wszystkie elementy wyrażenia konstruktora listy muszą mieć ten sam typ. Oczekiwano, że to wyrażenie będzie miało typ „{0}”, ale tutaj ma typ „{1}”.
pt_br: Todos os elementos de uma expressão do construtor de lista devem ter o mesmo tipo. Essa expressão deveria ter o tipo '{0}', mas aqui tem o tipo '{1}'.
ru: Все элементы выражения конструктора списка должны иметь один и тот же тип. В этом выражении ожидалось использование типа "{0}", но используется тип "{1}".
tr: Bir list constructor ifadesinin tüm öğeleri aynı türe sahip olmalıdır. Bu ifadenin '{0}' türünde olması bekleniyordu ancak burada '{1}' türünde.
zh_hans: 列表构造函数表达式的所有元素必须具有同一类型。此表达式的类型应为“{0}”，但此处类型为“{1}”。
zh_hant: 清單建構函式運算式的所有分支都必須是同一種類型。此運算式應具備類型 '{0}'，但卻為類型 '{1}'。
