Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# csMemberSignatureMismatchArityType
source: The member or object constructor '{0}' takes {1} type argument(s) but is here given {2}. The required signature is '{3}'.
cs: Počet argumentů typu, které konstruktor členu nebo objektu {0} přebírá, je {1}, ale počet těch, které se mu tady předávají, je {2}. Požadovaná signatura je {3}.
de: Der Member oder Objektkonstruktor "{0}" akzeptiert {1} Typargument(e), erhält hier aber {2}. Die erforderliche Signatur lautet "{3}".
es: El constructor de objeto o miembro '{0}' toma {1} argumentos de tipo, pero aquí se le proporcionan {2}. La signatura necesaria es '{3}'.
fr: Le membre ou le constructeur d'objet '{0}' accepte {1} argument(s) de type mais en reçoit ici {2}. La signature requise est '{3}'.
it: Il costruttore di oggetti o membro '{0}' utilizza {1} argomento/i di tipo, tuttavia il numero di argomenti specificati è pari a {2}. La firma necessaria è '{3}'.
ja: メンバーまたはオブジェクト コンストラクター '{0}' には {1} 個の型引数が必要ですが、存在するのは {2} 個です。必要なシグネチャは '{3}' です。
ko: 멤버 또는 개체 생성자 '{0}'은(는) {1}개의 형식 인수를 사용하지만 여기에서는 {2}개가 지정되었습니다. 필요한 시그니처는 '{3}'입니다.
pl: Element członkowski lub konstruktor obiektów „{0}” pobiera argumenty typu w liczbie {1}, ale podano tutaj {2}. Wymagana sygnatura to „{3}”.
pt_br: O construtor de membro ou objeto '{0}' obtém argumentos de tipo {1}, mas aqui é dado {2}. A assinatura requerida é '{3}'.
ru: Для конструктора элемента или объекта "{0}" требуется следующее число аргументов типа: {1}, однако здесь задано следующее число аргументов: {2}. Необходимая сигнатура: "{3}".
tr: Üye veya nesne oluşturucu '{0}' {1} tür bağımsız değişkeni alır ancak burada {2} bağımsız değişken verilmiş. Gereken imza: '{3}'.
zh_hans: 成员或对象构造函数“{0}”需要 {1} 个类型参数，而此处给定了 {2} 个类型参数。所需签名为“{3}”。
zh_hant: 成員或物件建構函式 '{0}' 接受 {1} 個型別引數，但此處指定了 {2} 個。需要的簽章是 '{3}'。

# csMemberNotAccessible
source: A member or object constructor '{0}' taking {1} arguments is not accessible from this code location. All accessible versions of method '{2}' take {3} arguments.
cs: Konstruktor členu nebo objektu {0}, který přebírá argumenty ({1}), není na tomto místě v kódu dostupný. Počet argumentů přebíraných všemi přístupnými verzemi metody {2} je {3}.
de: Auf einen Member oder Objektkonstruktor "{0}", der {1} Argumente akzeptiert, kann von dieser Position im Code nicht zugegriffen werden. Alle zugreifbaren Versionen der {2}-Methode nehmen {3} Argumente an.
es: Un constructor de objeto o miembro '{0}' que toma {1} argumentos no es accesible desde este lugar del código. Todas las versiones accesibles del método '{2}' toman {3} argumentos.
fr: Le constructeur de membre ou d'objet '{0}' acceptant {1} arguments n'est pas accessible à partir de cet emplacement du code. Toutes les versions accessibles de la méthode '{2}' acceptent {3} arguments.
it: Da questa posizione del codice non è possibile accedere a un costruttore di oggetti o membri '{0}' che accetta {1} argomenti. Tutte le versioni accessibili del metodo '{2}' accettano {3} argomenti.
ja: {1} 個の引数を使用するメンバーまたはオブジェクト コンストラクター '{0}' は、このコードの場所からはアクセスできません。メソッド '{2}' のすべてのアクセス可能なバージョンは {3} 個の引数を使用します。
ko: {1}개의 인수를 사용하는 멤버 또는 개체 생성자 '{0}'은(는) 이 코드 위치에서 액세스할 수 없습니다. '{2}' 메서드의 액세스할 수 있는 모든 버전은 {3}개의 인수를 사용합니다.
pl: Konstruktor elementu członkowskiego lub obiektu „{0}” pobiera argumenty, których liczba to {1} i które są niedostępne w tej lokalizacji kodu. Wszystkie dostępne wersje metody „{2}” pobierają argumenty o następującej liczbie: {3}.
pt_br: O construtor de objeto ou de membro '{0}' que obtém {1} argumentos não é acessível por meio desta localização do código. Todas as versões acessíveis do método '{2}' obtêm {3} argumentos.
ru: Конструктор элементов или объектов "{0}", принимающий следующее число аргументов: {1}, недоступен из этой точки кода. Все доступные версии метода "{2}" принимают следующее число аргументов: {3}.
tr: {1} bağımsız değişken alan '{0}' adlı üyeye veya nesne oluşturucusuna bu kod konumundan erişilemiyor. '{2}' metodunun erişilebilen tüm sürümleri {3} bağımsız değişken alır.
zh_hans: 无法从此代码位置访问采用 {1} 个参数的成员或对象构造函数“{0}”。方法“{2}”的所有可访问版本都采用了 {3} 个参数。
zh_hant: 無法從這個程式碼位置存取接受 {1} 個引數的成員或物件建構函式 '{0}'。方法 '{2}' 的所有可存取版本都接受 {3} 個引數。

# csIncorrectGenericInstantiation
source: Incorrect generic instantiation. No {0} member named '{1}' takes {2} generic arguments.
cs: Nesprávná obecná instance. Žádný člen {0} s názvem {1} nepřebírá obecné argumenty v počtu {2}.
de: Fehlerhafte generische Instanziierung. Kein {0}-Member namens "{1}" akzeptiert {2} generische Argumente.
es: Creación de instancia genérica incorrecta. Ningún miembro de {0} con el nombre '{1}' toma {2} argumentos genéricos.
fr: Instanciation générique incorrecte. Aucun membre {0} nommé '{1}' n'accepte {2} arguments génériques.
it: Creazione di istanza generica non corretta. Nessun membro {0} denominato '{1}' utilizza {2} argomenti generici.
ja: ジェネリックのインスタンス化が正しくありません。{2} のジェネリック引数を使用する '{1}' という {0} メンバーはありません。
ko: 제네릭 인스턴스가 잘못되었습니다. 이름이 '{1}'인 {0} 멤버 중 {2}개의 제네릭 인수를 사용하는 멤버가 없습니다.
pl: Niepoprawne ogólne tworzenie wystąpienia. Żaden element członkowski {0} o nazwie „{1}” nie pobiera {2} argumentów ogólnych.
pt_br: Instanciação genérica incorreta. Nenhum membro {0} chamado '{1}' obtém argumentos genéricos {2}.
ru: Недопустимое создание универсального экземпляра. Отсутствует элемент "{0}" с именем "{1}", принимающий универсальные аргументы {2}.
tr: Yanlış genel örnekleme. '{1}' adlı hiçbir {0} üyesi {2} genel bağımsız değişkenlerini almıyor.
zh_hans: 泛型实例化不正确。没有名为“{1}”的 {0} 成员采用 {2} 个泛型参数。
zh_hant: 泛型具現化錯誤。沒有名稱為 '{1}' 的 {0} 成員接受 {2} 個泛型引數。

# csMemberOverloadArityMismatch
source: The member or object constructor '{0}' does not take {1} argument(s). An overload was found taking {2} arguments.
cs: Konstruktor členu nebo objektu {0} nepřebírá argumenty ({1}). Zjistilo se, že počet argumentů přebíraných přetížením je {2}.
de: Der Member oder Objektkonstruktor "{0}" akzeptiert {1} Argument(e) nicht. Eine Überladung wurde gefunden, die {2} Argumente akzeptiert.
es: El constructor de objeto o miembro '{0}' no toma {1} argumentos. Se encontró una sobrecarga que toma {2} argumentos.
fr: Le membre ou le constructeur d'objet '{0}' n'accepte pas {1} argument(s). Une surcharge acceptant {2} arguments a été trouvée.
it: Il costruttore di oggetti o membro '{0}' non utilizza {1} argomento/i. Trovato overload con {2} argomenti.
ja: メンバーまたはオブジェクト コンストラクター '{0}' は {1} 個の引数ではありません。{2} 個の引数を使用するオーバーロードが見つかりました。
ko: 멤버 또는 개체 생성자 '{0}'은(는) {1}개의 인수를 사용하지 않습니다. {2}개의 인수를 사용하는 오버로드를 찾았습니다.
pl: Konstruktor elementu członkowskiego lub obiektu „{0}” nie pobiera argumentów w liczbie {1}. Znaleziono przeciążenie pobierające argumenty o następującej liczbie: {2}.
pt_br: O construtor de membro ou objeto '{0}' não obtém argumentos {1}. Uma sobrecarga foi encontrada ao obter argumentos {2}.
ru: Конструктор элемента или объекта "{0}" не принимает следующее число аргументов: {1}. Обнаружена перегрузка, принимающая следующее число аргументов: {2}.
tr: Üye veya nesne oluşturucu '{0}', {1} bağımsız değişkenlerini almaz. {2} bağımsız değişkenler alınırken aşırı yükleme bulundu.
zh_hans: 成员或对象构造函数“{0}”不采用 {1} 个参数。发现某个重载采用 {2} 个参数。
zh_hant: 成員或物件建構函式 '{0}' 不接受 {1} 個引數。找到接受 {2} 個引數的多載。

# csNoMemberTakesTheseArguments
source: No {0} member or object constructor named '{1}' takes {2} arguments
cs: Žádný konstruktor členu nebo objektu {0} s názvem {1} nepřebírá argumenty v počtu {2}.
de: Kein {0}-Member oder -Objektkonstruktor namens "{1}" akzeptiert {2} Argumente.
es: Ningún miembro o constructor de objeto de {0} con el nombre '{1}' toma {2} argumentos.
fr: Aucun membre ou constructeur d'objet {0} nommé '{1}' n'accepte {2} arguments
it: Nessun costruttore di oggetti o membro {0} denominato '{1}' utilizza {2} argomenti
ja: {2} 個の引数を使用する {0} メンバーまたはオブジェクト コンストラクター '{1}' がありません
ko: 이름이 '{1}'인 {0} 멤버 또는 개체 생성자 중 {2}개의 인수를 사용하는 요소가 없습니다.
pl: Żaden element członkowski {0} lub konstruktor obiektu o nazwie „{1}” nie pobiera następującej liczby argumentów: {2}
pt_br: Nenhum membro {0} ou construtor de objeto com nome '{1}' obtém argumentos {2}
ru: Отсутствуют конструкторы элемента или объекта {0} с именем "{1}", принимающие следующее число аргументов: {2}
tr: Hiçbir {0} üyesi veya '{1}' adlı nesne oluşturucusu {2} bağımsız değişken almaz
zh_hans: 没有名为“{1}”的 {0} 成员或对象构造函数采用 {2} 个参数
zh_hant: 沒有名稱為 '{1}' 的 {0} 成員或物件建構函式接受 {2} 個引數

# csNoMemberTakesTheseArguments2
source: No {0} member or object constructor named '{1}' takes {2} arguments. Note the call to this member also provides {3} named arguments.
cs: Žádný konstruktor členu nebo objektu {0} s názvem {1} nepřebírá argumenty v počtu {2}. Kromě toho poskytuje volání tohoto členu taky pojmenované argumenty ({3}).
de: Kein {0}-Member oder -Objektkonstruktor namens "{1}" akzeptiert {2} Argumente. Beachten Sie, dass ein Aufruf dieses Members ebenfalls {3} benannte Argumente bereitstellt.
es: Ningún miembro o constructor de objeto de {0} con el nombre '{1}' toma {2} argumentos. Tenga en cuenta que la llamada a este miembro proporciona también {3} argumentos con nombre.
fr: Aucun membre ou constructeur d'objet {0} nommé '{1}' n'accepte {2} arguments. Notez que l'appel de ce membre fournit également {3} arguments nommés.
it: Nessun costruttore di oggetti o membro {0} denominato '{1}' accetta {2} argomenti. Si noti che la chiamata a questo membro fornisce inoltre {3} argomenti denominati.
ja: {2} 個の引数を使用する {0} メンバーまたはオブジェクト コンストラクター '{1}' がありません。このメンバーの呼び出しには、{3} 個の名前付き引数も必要です。
ko: 이름이 '{1}'인 {0} 멤버 또는 개체 생성자 중 {2}개의 인수를 사용하는 요소가 없습니다. 이 멤버를 호출하면 {3}개의 명명된 인수도 제공됩니다.
pl: Żaden element członkowski {0} lub konstruktor obiektu o nazwie „{1}” nie pobiera następującej liczby argumentów: {2}. Zauważ, że wywołanie tego elementu członkowskiego udostępnia również argumenty nazwane o następującej liczbie: {3}.
pt_br: Nenhum membro {0} ou construtor de objeto com nome '{1}' obtém argumentos {2}. Observe que a chamada para este membro também fornece argumentos com nome {3}.
ru: Отсутствуют конструкторы элемента или объекта {0} с именем "{1}", принимающие следующее число аргументов: {2}. Обратите внимание, что при вызове этого члена также предоставляется следующее число именованных аргументов: {3}.
tr: Hiçbir {0} üyesi veya '{1}' adlı nesne oluşturucusu {2} bağımsız değişken almaz. Bu üyeye çağrı yapılmasının {3} adlandırılmış bağımsız değişken sağladığına ayrıca dikkat edin.
zh_hans: 没有名为“{1}”的 {0} 成员或对象构造函数采用 {2} 个参数。注意，调用此成员也会提供 {3} 个已命名参数。
zh_hant: 沒有名稱為 '{1}' 的 {0} 成員或物件建構函式接受 {2} 個引數。注意，呼叫這個成員也會提供 {3} 個具名引數。

# csNoMemberTakesTheseArguments3
source: No {0} member or object constructor named '{1}' takes {2} arguments. The named argument '{3}' doesn't correspond to any argument or settable return property for any overload.
cs: Žádný konstruktor členu nebo objektu {0} s názvem {1} nepřebírá argumenty v počtu {2}. Pojmenovaný argument {3} neodpovídá žádnému argumentu ani nastavitelné návratové vlastnosti u žádného přetížení.
de: Kein {0}-Member oder -Objektkonstruktor namens "{1}" akzeptiert {2} Argumente. Das benannte Argument "{3}" entspricht keinem Argument und keiner festlegbaren Rückgabeeigenschaft für eine Überladung.
es: Ningún miembro o constructor de objeto de {0} con el nombre '{1}' toma {2} argumentos. El argumento con nombre '{3}' no corresponde a ningún argumento o propiedad de valor devuelto que se pueda establecer para ninguna sobrecarga.
fr: Aucun membre ou constructeur d'objet {0} nommé '{1}' n'accepte {2} arguments. L'argument nommé '{3}' ne correspond pas à un argument ou une propriété de retour définissable pour une surcharge.
it: Nessun costruttore di oggetti o membro {0} denominato '{1}' utilizza {2} argomenti. L'argomento denominato '{3}' non corrisponde ad alcun argomento o proprietà restituita impostabile per alcun overload.
ja: {2} 個の引数を使用する {0} メンバーまたはオブジェクト コンストラクター '{1}' がありません。名前付き引数 '{3}' に対応する、オーバーロードに合致した任意の引数、または設定可能な戻り値のプロパティはありません。
ko: 이름이 '{1}'인 {0} 멤버 또는 개체 생성자 중 {2}개의 인수를 사용하는 요소가 없습니다. 명명된 인수 '{3}'은(는) 오버로드에 대한 어떠한 인수 또는 설정 가능한 반환 속성에도 해당하지 않습니다.
pl: Żaden element członkowski {0} lub konstruktor obiektów o nazwie „{1}” nie pobiera następującej liczby argumentów: {2}. Argument nazwany „{3}” nie odpowiada żadnemu argumentowi lub ustawialnej właściwości zwracanej w żadnym przeciążeniu.
pt_br: Nenhum membro {0} ou construtor de objeto com nome '{1}' obtém argumentos {2}. O argumento nomeado '{3}' não corresponde a nenhum argumento ou propriedade de retorno configurável para qualquer sobrecarga.
ru: Отсутствуют конструкторы элемента или объекта {0} с именем "{1}", принимающие следующее число аргументов: {2}. Именованный аргумент "{3}" не соответствует какому-либо аргументу или задаваемому возвращаемому свойству для какой-либо перегрузки.
tr: Hiçbir {0} üyesi veya '{1}' adlı nesne oluşturucusu {2} bağımsız değişken almaz. '{3}' adlandırılmış bağımsız değişkeni, herhangi bir aşırı yüklemeye yönelik hiçbir bağımsız değişkene veya ayarlanabilen dönüş özelliğine karşılık gelmiyor.
zh_hans: 没有名为“{1}”的 {0} 成员或对象构造函数采用 {2} 个参数。已命名参数“{3}”与针对任何重载的任何参数或可设置的返回属性均不对应。
zh_hant: 沒有名稱為 '{1}' 的 {0} 成員或物件建構函式接受 {2} 個引數。具名引數 '{3}' 未對應到任何引數或任何多載的可設定傳回屬性。

# csMethodNotFound
source: Method or object constructor '{0}' not found
cs: Konstruktor metody nebo objektu {0} se nenašel.
de: Methode oder Objektkonstruktor "{0}" wurde nicht gefunden.
es: No se encontró el constructor de objeto o método '{0}'.
fr: Méthode ou constructeur d'objet '{0}' introuvable
it: Costruttore di oggetti o metodo '{0}' non trovato
ja: メソッドまたはオブジェクト コンストラクター '{0}' が見つかりません
ko: 메서드 또는 개체 생성자 '{0}'을(를) 찾을 수 없습니다.
pl: Nie znaleziono metody lub konstruktora obiektów „{0}”
pt_br: O método ou construtor de objeto '{0}' não foi encontrado
ru: Не найден конструктор метода или объекта "{0}"
tr: Metot veya nesne oluşturucusu '{0}' bulunamadı
zh_hans: 未找到方法或对象构造函数“{0}”
zh_hant: 找不到方法或物件建構函式 '{0}'

# csNoOverloadsFound
source: No overloads match for method '{0}'.
cs: Metodě {0} neodpovídají žádná přetížení.
de: Keine passenden Überladungen für die Methode '{0}' vorhanden.
es: No hay ninguna coincidencia de sobrecarga para el método '{0}'.
fr: Aucune surcharge correspondante pour la méthode '{0}'.
it: Nessun overload corrispondente per il metodo '{0}'.
ja: メソッド '{0}' に一致するオーバーロードはありません。
ko: '{0}' 메서드와 일치하는 오버로드가 없습니다.
pl: Brak przeciążeń zgodnych z metodą „{0}”.
pt_br: Nenhuma sobrecarga corresponde ao método '{0}'.
ru: Отсутствуют перегрузки метода "{0}".
tr: Hiçbir aşırı yükleme '{0}' metodu ile eşleşmiyor.
zh_hans: 没有与方法“{0}”匹配的重载。
zh_hant: 沒有符合方法 '{0}' 的多載。

# csMethodIsOverloaded
source: A unique overload for method '{0}' could not be determined based on type information prior to this program point. A type annotation may be needed.
cs: Unikátní přetížení u metody {0} se nedalo určit podle informací o typu před tímto místem v programu. Možná bude potřeba doplnit k typu poznámku.
de: Eine eindeutige Überladung für Methode '{0}' konnte nicht auf Basis von Typinformationen vor diesem Programmpunkt bestimmt werden. Unter Umständen ist eine Typanmerkung erforderlich.
es: No se pudo determinar una sobrecarga única para el método '{0}' con la información de tipo anterior a este punto del programa. Puede ser necesaria una anotación de tipo.
fr: Impossible de déterminer une surcharge unique pour la méthode '{0}' basée sur des informations de type situées avant ce point du programme. Une annotation de type peut être ajoutée.
it: Non è stato possibile determinare un overload univoco per il metodo '{0}' in base alle informazioni sui tipi prima di questo punto del programma. Potrebbe essere necessaria un'annotazione di tipo.
ja: このプログラム ポイントよりも前の型情報に基づいて、メソッド '{0}' の固有のオーバーロードを決定することができませんでした。型の注釈が必要な場合があります。
ko: 이 프로그램 지점 전의 형식 정보를 기반으로 '{0}' 메서드에 대한 고유 오버로드를 결정할 수 없습니다. 형식 주석이 필요할 수 있습니다.
pl: Nie można określić unikatowego przeciążenia dla metody „{0}” na podstawie informacji o typach przed tym punktem programu. Może być wymagana adnotacja typu.
pt_br: Não foi possível determinar uma sobrecarga única para o método '{0}' com base nas informações de tipo anteriores a este ponto do programa. Uma anotação de tipo pode ser necessária.
ru: Невозможно определить уникальную перегрузку метода "{0}" на основе сведений о типе, заданных до данной точки программы. Возможно, требуется аннотация типа.
tr: Bu program noktasından önce, tür bilgilerine dayalı olarak '{0}' metodu için benzersiz bir aşırı yükleme belirlenemedi. Tür ek açıklaması gerekebilir.
zh_hans: 未能根据此程序点之前的类型信息确定方法“{0}”的唯一重载。可能需要类型批注。
zh_hant: 無法根據這個程式點之前的類型資訊，判斷方法 '{0}' 的唯一多載。可能需要有類型註釋。

# csCandidates
source: Candidates:\n{0}
cs: Kandidáti:\n{0}
de: Kandidaten:\n{0}
es: Candidatos:\n{0}
fr: Candidats :\n{0}
it: Candidati:\n{0}
ja: 候補:\n{0}
ko: 후보:\n{0}
pl: Kandydaci:\n{0}
pt_br: Candidatos:\n{0}
ru: Кандидаты:\n{0}
tr: Adaylar:\n{0}
zh_hans: 候选项:\n{0}
zh_hant: 候選:\n{0}

# parsDoCannotHaveVisibilityDeclarations
source: Accessibility modifiers are not permitted on 'do' bindings, but '{0}' was given.
cs: Modifikátory dostupnosti nejsou u vazeb do povolené, ale předal se modifikátor {0}.
de: Zugriffsmodifizierer sind für "do"-Bindungen nicht zulässig, "{0}" wurde jedoch angegeben.
es: No se permiten modificadores de accesibilidad en enlaces "do", pero se proporcionó "{0}".
fr: Les modificateurs d'accessibilité ne sont pas autorisés sur les liaisons 'do' mais '{0}' a été spécifié.
it: I modificatori di accessibilità non sono consentiti nei binding 'do', ma è stato specificato '{0}'.
ja: 'do' バインドにはアクセシビリティ修飾子を使用できませんが、'{0}' が指定されました。
ko: 액세스 가능성 한정자는 'do' 바인딩에서 허용되지 않지만, '{0}'이(가) 지정되었습니다.
pl: Modyfikatory dostępności są niedozwolone w powiązaniach „do”, ale podano element „{0}”.
pt_br: Os modificadores de acessibilidade não são permitidos em associações 'do', mas '{0}' foi fornecido.
ru: Использование модификаторов доступности в привязках "do" не допускается, но указан "{0}".
tr: Erişilebilirlik değiştiricilerine 'do' bağlamalarında izin verilmez, ancak '{0}' belirtildi.
zh_hans: 不允许对 "do" 绑定使用可访问性修饰符，但却给出了“{0}”。
zh_hant: 'do' 繫結不得包含存取範圍修飾詞，但卻提供了 '{0}'。

# parsEofInHashIf
source: End of file in #if section begun at or after here
cs: Konec souboru začal v oddílu #if na této pozici nebo za ní.
de: Dateiende in einem #if-Abschnitt, der an oder vor dieser Stelle begonnen wurde.
es: El final del archivo en la sección #if comenzaba aquí o después.
fr: Fin de fichier dans la section #if ayant débuté à cet emplacement ou après
it: La fine del file nella sezione #if inizia in questa posizione o dopo di essa
ja: この位置以前に始まった #if セクションの途中でファイルの終わりが見つかりました
ko: #if 섹션의 파일 끝이 여기에서 또는 여기 뒤에서 시작되었습니다.
pl: Koniec pliku w sekcji #if rozpoczętej w tym miejscu lub za nim
pt_br: Fim de arquivo na seção #if iniciada aqui ou anteriormente
ru: Конец файла в директиве #if начался в этой позиции или после нее
tr: #if bölümünde dosya sonu burada veya daha önce başlatıldı
zh_hans: 文件尾在此处或之后开始的 #if 节中
zh_hant: #if 區段中的檔案結尾於此處或之後開始

# parsEofInString
source: End of file in string begun at or before here
cs: Konec souboru začal v řetězci na této pozici nebo před ní.
de: Dateiende in einer Zeichenfolge, die an oder vor dieser Stelle begonnen wurde.
es: El final del archivo en la cadena comenzaba aquí o antes.
fr: Fin de fichier dans la chaîne ayant débuté à cet emplacement ou avant
it: La fine del file nella stringa inizia in questa posizione o prima di essa
ja: この位置以前に始まった文字列の途中でファイルの終わりが見つかりました
ko: 문자열의 파일 끝이 여기에서 또는 여기 앞에서 시작되었습니다.
pl: Koniec pliku w ciągu rozpoczętym w tym miejscu lub przed nim
pt_br: Fim de arquivo na cadeia de caracteres iniciada aqui ou anteriormente
ru: Конец файла в строке начался в этой позиции или до нее
tr: Dizede dosya sonu burada veya daha önce başlatıldı
zh_hans: 文件尾在此处或之前开始的字符串中
zh_hant: 字串中的檔案結尾於此處或之前開始

# parsEofInVerbatimString
source: End of file in verbatim string begun at or before here
cs: Konec souboru začal v doslovném řetězci na této pozici nebo před ní.
de: Dateiende in einer ausführlichen Zeichenfolge, die an oder vor dieser Stelle begonnen wurde.
es: El final del archivo en la cadena textual comenzaba aquí o antes.
fr: Fin de fichier dans la chaîne textuelle ayant débuté à cet emplacement ou avant
it: La fine del file nella stringa verbatim inizia in questa posizione o prima di essa
ja: この位置以前に始まった verbatim 文字列の途中でファイルの終わりが見つかりました
ko: 축자 문자열의 파일 끝이 여기에서 또는 여기 앞에서 시작되었습니다.
pl: Koniec pliku w ciągu dosłownego wyrażenia rozpoczętym w tym miejscu lub przed nim
pt_br: Fim de arquivo na cadeia de caracteres textual iniciada aqui ou anteriormente
ru: Конец файла в строке verbatim начался в этой позиции или до нее
tr: Tam dizede dosya sonu burada veya daha önce başlatıldı
zh_hans: 文件尾在此外或之前开始的原义字符串中
zh_hant: 逐字字串中的檔案結尾於此處或之前開始

# parsEofInComment
source: End of file in comment begun at or before here
cs: Konec souboru začal v komentáři na této pozici nebo před ní.
de: Dateiende in einem Kommentar, der an oder vor dieser Stelle begonnen wurde.
es: El final del archivo en el comentario comenzaba aquí o antes.
fr: Fin de fichier dans le commentaire ayant débuté à cet emplacement ou avant
it: La fine del file nel commento inizia in questa posizione o prima di essa
ja: この位置以前に始まったコメントの途中でファイルの終わりが見つかりました
ko: 주석의 파일 끝이 여기에서 또는 여기 앞에서 시작되었습니다.
pl: Koniec pliku w komentarzu rozpoczętym w tym miejscu lub przed nim
pt_br: Fim de arquivo no comentário iniciado aqui ou anteriormente
ru: Конец файла в комментарии начался в этой позиции или до нее
tr: Açıklamada dosya sonu burada veya daha önce başlatıldı
zh_hans: 文件尾在此处或之前开始的注释中
zh_hant: 註解中的檔案結尾於此處或之前開始

# parsEofInStringInComment
source: End of file in string embedded in comment begun at or before here
cs: Konec souboru začal v řetězci vloženém do komentáře na této pozici nebo před ní.
de: Dateiende in einer in den Kommentar eingebetteten Zeichenfolge, die an oder vor dieser Stelle begonnen wurde.
es: El final del archivo en la cadena incrustada en el comentario comenzaba aquí o antes.
fr: Fin de fichier dans la chaîne incorporée dans le commentaire ayant débuté à cet emplacement ou avant
it: La fine del file nella stringa incorporata nel commento inizia in questa posizione o prima di essa
ja: この位置以前に始まったコメントに埋め込まれた文字列の途中でファイルの終わりが見つかりました
ko: 주석에 포함된 문자열의 파일 끝이 여기에서 또는 여기 앞에서 시작되었습니다.
pl: Koniec pliku w ciągu osadzonym w komentarzu rozpoczętym w tym miejscu lub przed nim
pt_br: Fim de arquivo na cadeia de caracteres inserida no comentário iniciado aqui ou anteriormente
ru: Конец файла во встроенной в комментарий строке начался в этой позиции или до нее
tr: Açıklamaya gömülü dizede dosya sonu burada veya daha önce başlatıldı
zh_hans: 文件尾在此外或之前开始的注释中嵌入的字符串中
zh_hant: 內嵌在註解中的字串中的檔案結尾於此處或之前開始

# parsEofInVerbatimStringInComment
source: End of file in verbatim string embedded in comment begun at or before here
cs: Konec souboru začal v doslovném řetězci vloženém do komentáře na této pozici nebo před ní.
de: Dateiende in einer in den Kommentar eingebetteten ausführlichen Zeichenfolge, die an oder vor dieser Stelle begonnen wurde.
es: El final del archivo en la cadena textual incrustada en el comentario comenzaba aquí o antes.
fr: Fin de fichier dans la chaîne textuelle incorporée dans le commentaire ayant débuté à cet emplacement ou avant
it: La fine del file nella stringa verbatim incorporata nel commento inizia in questa posizione o prima di essa
ja: この位置以前に始まったコメントに埋め込まれた verbatim 文字列の途中でファイルの終わりが見つかりました
ko: 주석에 포함된 축자 문자열의 파일 끝이 여기에서 또는 여기 앞에서 시작되었습니다.
pl: Koniec pliku w ciągu dosłownego wyrażenia osadzonym w komentarzu rozpoczętym w tym miejscu lub przed nim
pt_br: Fim de arquivo na cadeia de caracteres textual inserida no comentário iniciado aqui ou anteriormente
ru: Конец файла во встроенной в комментарий строке verbatim начался в этой позиции или до нее
tr: Açıklamaya gömülü tam dizede dosya sonu burada veya daha önce başlatıldı
zh_hans: 文件尾在此处或之前开始的注释中嵌入的原义字符串中
zh_hant: 內嵌在註解中的逐字字串中的檔案結尾於此處或之前開始
