Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# tcUnexpectedPropertyInSyntaxTree
source: Unexpected source-level property specification in syntax tree
cs: Ve stromu syntaxe se neočekávala specifikace vlastnosti na úrovni zdroje.
de: Unerwartete Eigenschaftenspezifikation auf Quellcodeebene in der Syntaxstruktur.
es: Especificación de propiedad de nivel de código fuente inesperada en árbol de sintaxis.
fr: Spécification de propriété au niveau source inattendue dans l'arborescence de syntaxe
it: Specifica di proprietà a livello di origine non prevista nella struttura ad albero della sintassi
ja: 構文ツリーに予期しないソースレベルのプロパティの指定があります:
ko: 구문 트리에 예기치 않은 소스 수준 속성 지정이 있습니다.
pl: Nieoczekiwana specyfikacja właściwości poziomu źródła w drzewie składni
pt_br: Especificação de propriedade em nível de código inesperada na árvore de sintaxe
ru: Недопустимая спецификация свойства уровня источника в синтаксическом дереве
tr: Sözdizimi ağacında beklenmeyen kaynak düzeyli özellik belirtimi
zh_hans: 语法树中意外的源级别属性规范
zh_hant: 語法樹狀目錄中有未預期的來源層級屬性規格

# tcStaticInitializerRequiresArgument
source: A static initializer requires an argument
cs: Statický inicializátor vyžaduje argument.
de: Ein statischer Initialisierer erfordert ein Argument.
es: Un inicializador estático require un argumento.
fr: Un initialiseur statique requiert un argument
it: Un inizializzatore statico richiede un argomento
ja: 静的初期化子には引数が必要です
ko: 정적 이니셜라이저를 사용하려면 인수가 필요합니다.
pl: Inicjator statyczny wymaga argumentu
pt_br: Um inicializador estático requer um argumento
ru: Для статического инициализатора требуется аргумент
tr: Statik başlatıcı için bağımsız değişken gerekiyor
zh_hans: 静态初始化表达式需要参数
zh_hant: 靜態初始設定式需要引數

# tcObjectConstructorRequiresArgument
source: An object constructor requires an argument
cs: Konstruktor objektu vyžaduje argument.
de: Ein Objektkonstruktor erfordert ein Argument.
es: Un constructor de objeto requiere un argumento.
fr: Un constructeur d'objet requiert un argument
it: Un costruttore di oggetto richiede un argomento
ja: オブジェクト コンストラクターには引数が必要です
ko: 개체 생성자를 사용하려면 인수가 필요합니다.
pl: Konstruktor obiektów wymaga argumentu
pt_br: Um construtor de objeto requer um argumento
ru: Конструктор объекта требует аргумент
tr: Nesne oluşturucusu bağımsız değişken gerektiriyor
zh_hans: 对象构造函数需要参数
zh_hant: 物件建構函式需要引數

# tcStaticMemberShouldNotHaveThis
source: This static member should not have a 'this' parameter. Consider using the notation 'member Member(args) = ...'.
cs: Tento statický člen by neměl mít parametr this. Zvažte použití notace member Member(args) = ...
de: Dieser statische Member sollte keinen this-Parameter aufweisen. Verwenden Sie die Notation "member Member(args) = ...".
es: Este miembro estático no debería tener un parámetro 'this'. Considere el uso de la notación 'member Member(args) = ...'.
fr: Ce membre statique ne doit pas avoir de paramètre 'this'. Utilisez la notation 'member Member(args) = ...'.
it: Questo membro statico non deve contenere un parametro 'this'. Provare a utilizzare la notazione 'member Member(args) = ...'.
ja: この静的メンバーに 'this' パラメーターを指定することはできません。'member Member(args) = ...' という表記を使用してください。
ko: 이 정적 멤버에는 'this' 매개 변수가 있으면 안 됩니다. 'member Member(args) = ...' 표기법을 사용하세요.
pl: Ten statyczny element członkowski nie powinien mieć parametru „this”. Rozważ użycie notacji „member ElementCzłonkowski(argumenty) = ...”.
pt_br: Este membro estático não deve ter um parâmetro 'this'. Considere usar a notação 'member Member(args) = ...'.
ru: Данный статический элемент не должен иметь параметр "this". Рекомендуется использовать нотацию "member Member(args) = ...".
tr: Bu statik üyenin 'this' parametresi olmamalıdır. 'member Member(args) = ...' gösterimini kullanmayı düşünün.
zh_hans: 此静态成员不应具有“this”参数。请考虑使用表示法“member Member(args) = ...”。
zh_hant: 這個靜態成員不應該有 'this' 參數。請考慮使用 'member Member(args) = ...' 標記法。

# tcExplicitStaticInitializerSyntax
source: An explicit static initializer should use the syntax 'static new(args) = expr'
cs: Explicitní statický inicializátor by měl používat syntaxi static new(args) = expr.
de: Ein expliziter statischer Initialisierer sollte die Syntax "static new(args) = expr" verwenden.
es: Un inicializador estático explícito debe usar la sintaxis 'static new(args) = expr'.
fr: Un initialiseur statique explicite doit utiliser la syntaxe 'static new(args) = expr'
it: Un inizializzatore statico esplicito deve utilizzare la sintassi 'static new(args) = expr'
ja: 明示的な静的初期化子には 'static new(args) = expr' という構文を使用してください
ko: 명시적 정적 이니셜라이저는 'static new(args) = expr' 구문을 사용해야 합니다.
pl: Jawny inicjator statyczny powinien używać składni „static new(args) = expr”
pt_br: Um inicializador estático explícito deve usar a sintaxe 'static new(args) = expr'
ru: Явный статический инициализатор должен использовать синтаксис "new(args) = expr"
tr: Açık statik başlatıcı 'static new(args) = expr' sözdizimini kullanmalıdır
zh_hans: 显式静态初始化表达式应使用语法“static new(args) = expr”
zh_hant: 明確的靜態初始設定式應該使用 'static new(args) = expr' 語法

# tcExplicitObjectConstructorSyntax
source: An explicit object constructor should use the syntax 'new(args) = expr'
cs: Explicitní konstruktor objektu by měl používat syntaxi new(args) = expr.
de: Ein expliziter Objektkonstruktor sollte die Syntax "new(args) = expr" verwenden.
es: Un constructor de objeto explícito debe usar la sintaxis 'new(args) = expr'.
fr: Un constructeur d'objet explicite doit utiliser la syntaxe 'new(args) = expr'
it: Un costruttore di oggetto esplicito deve usare la sintassi 'new(args) = expr'
ja: 明示的なオブジェクト コンストラクターには 'new(args) = expr' という構文を使用してください
ko: 명시적 개체 생성자는 'new(args) = expr' 구문을 사용해야 합니다.
pl: Jawny konstruktor obiektów powinien używać składni „new(args) = expr”
pt_br: Um construtor de objeto explícito deve usar a sintaxe 'new(args) = expr'
ru: Конструктор явного объекта должен использовать синтаксис "new(args) = expr"
tr: Açık nesne oluşturucusu 'new(args) = expr' sözdizimini kullanmalıdır
zh_hans: 显式对象构造函数应使用语法“new(args) = expr”
zh_hant: 明確的物件建構函式應該使用 'new(args) = expr' 語法

# tcUnexpectedPropertySpec
source: Unexpected source-level property specification
cs: Neočekávaná specifikace vlastnosti na úrovni zdroje
de: Unerwartete Eigenschaftenspezifikation auf Quellcodeebene.
es: Especificación de propiedad de nivel de código fuente inesperada.
fr: Spécification de propriété au niveau source inattendue
it: Specifica di proprietà a livello di origine non prevista
ja: 予期しないソースレベルのプロパティの指定があります:
ko: 예기치 않은 소스 수준 속성 지정입니다.
pl: Nieoczekiwana specyfikacja właściwości poziomu źródła
pt_br: Especificação de propriedade no nível da origem inesperada
ru: Недопустимая спецификация свойства уровня источника
tr: Beklenmeyen kaynak düzeyli özellik belirtimi
zh_hans: 意外的源级别属性规范
zh_hant: 未預期的來源層級屬性規格

# tcObjectExpressionFormDeprecated
source: This form of object expression is not used in F#. Use 'member this.MemberName ... = ...' to define member implementations in object expressions.
cs: Tato notace objektového výrazu se v F# nepoužívá. K definování implementací členů v objektových výrazech použijte member this.MemberName ... = ...
de: Dieses Format eines Objektausdrucks wird in F# nicht verwendet. Verwenden Sie "member this.MemberName ... = ...", um Memberimplementierungen in Objektausdrücken zu definieren.
es: Este formato de expresión de objeto no se usa en F#. Use 'member this.MemberName ... = ...' para definir implementaciones de miembro en expresiones de objeto.
fr: Cette forme d'expression d'objet n'est pas utilisée en F#. Utilisez 'member this.MemberName ... = ...' pour définir des implémentations de membres dans les expressions d'objet.
it: Questo formato di espressione di oggetto non è utilizzato in F#. Utilizzare 'member this.MemberName... = ...' per definire implementazioni di membro in espressioni di oggetto.
ja: この形式のオブジェクト式は F# では使用されません。オブジェクト式でメンバーの実装を定義するには、'member this.MemberName ... = ...' を使用してください。
ko: 이러한 형식의 개체 식은 F#에서 사용되지 않습니다. 'member this.MemberName ... = ...'을 사용하여 개체 식에 멤버 구현을 정의하세요.
pl: Ta postać wyrażenia obiektu nie jest używana w języku F#. Aby zdefiniować implementacje elementów członkowskich w wyrażeniach obiektów, użyj konstrukcji „member this.MemberName ... = ...”.
pt_br: Esta forma de expressão de objeto não é usada em F#. Use 'member this.MemberName ... = ...' para definir implementações de membros em expressões de objetos.
ru: Эта форма выражения объекта не используется в F#. Используйте "member this.MemberName ... = ...' для определения реализации элемента в выражениях объекта.
tr: Nesne ifadesinin bu biçimi F# dilinde kullanılmaz. Nesne ifadelerinde üye uygulamalarını tanımlamak için 'member this.MemberName ... = ...' kullanın.
zh_hans: 此对象表达式格式不可用于 F#。请使用“member this.MemberName ... = ...”来定义对象表达式中的成员实现。
zh_hant: F# 中不使用這種形式的物件運算式。請使用 'member this.MemberName ... = ...' 來定義物件運算式中的成員實作。

# tcInvalidDeclaration
source: Invalid declaration
cs: Neplatná deklarace
de: Ungültige Deklaration.
es: Declaración no válida.
fr: Déclaration non valide
it: Dichiarazione non valida
ja: 宣言が無効です
ko: 선언이 잘못되었습니다.
pl: Nieprawidłowa deklaracja
pt_br: Declaração inválida
ru: Недопустимое объявление
tr: Geçersiz bildirim
zh_hans: 声明无效
zh_hant: 無效的宣告

# tcAttributesInvalidInPatterns
source: Attributes are not allowed within patterns
cs: Atributy nejsou ve vzorech se povolené.
de: Attribute sind innerhalb von Mustern nicht zulässig.
es: No se permiten atributos en patrones.
fr: Les attributs ne sont pas autorisés dans les modèles
it: Attributi non consentiti all'interno di criteri
ja: パターン内では属性を使用できません
ko: 특성은 패턴 내에서 허용되지 않습니다.
pl: Atrybuty nie są dozwolone we wzorcach
pt_br: Atributos não são permitidos em padrões
ru: Использование атрибутов внутри шаблонов не допускается
tr: Desen içinde özniteliğe izin verilmez
zh_hans: 模式中不允许使用特性
zh_hant: 不允許在模式內使用屬性

# tcFunctionRequiresExplicitTypeArguments
source: The generic function '{0}' must be given explicit type argument(s)
cs: Obecné funkci {0} se musí předávat explicitní argumenty typu.
de: Die generische Funktion "{0}" muss explizite Typargumente erhalten.
es: A la función genérica '{0}' se le deben proporcionar argumentos de tipo explícitos.
fr: La fonction générique '{0}' doit recevoir un ou plusieurs arguments de type explicite
it: Alla funzione generica '{0}' devono essere assegnati uno o più argomenti tipo espliciti
ja: ジェネリック関数 '{0}' に明示的な型引数を指定する必要があります
ko: 제네릭 함수 '{0}'에는 명시적 형식 인수를 지정해야 합니다.
pl: Ogólna funkcja „{0}” musi mieć jawne argumenty typów
pt_br: Argumentos de tipo explícito devem ser dados à função genérica '{0}'
ru: Базовой функции "{0}" должны быть даны явные аргументы типа.
tr: '{0}' genel işlevine açık tür bağımsız değişkenleri verilmesi gerekiyor
zh_hans: 必须为泛型函数“{0}”给定显式类型参数
zh_hant: 必須為泛型函式 '{0}' 指定明確的型別引數

# tcDoesNotAllowExplicitTypeArguments
source: The method or function '{0}' should not be given explicit type argument(s) because it does not declare its type parameters explicitly
cs: Metodě nebo funkci {0} by se neměly předávat argumenty explicitního typu, protože svoje parametry typu nedeklaruje explicitně.
de: Der Methode oder Funktion "{0}" sollten keine expliziten Typargumente zugewiesen werden, weil sie ihre Typparameter nicht explizit deklariert.
es: Al método o función '{0}' no se le deberían proporcionar argumentos de tipo explícitos porque no declara sus parámetros de tipo de forma explícita.
fr: La méthode ou fonction '{0}' ne doit pas recevoir d'arguments de type explicite, car elle ne déclare pas explicitement ses paramètres de type
it: Al metodo o funzione '{0}' non devono essere assegnati argomenti tipo espliciti perché i relativi parametri di tipo non vengono dichiarati in modo esplicito
ja: メソッドまたは関数 '{0}' は、型パラメーターを明示的に宣言していないため、明示的な型引数を指定しないでください
ko: '{0}' 메서드 또는 함수는 해당 형식 매개 변수를 명시적으로 선언하지 않으므로 이 함수에 명시적 형식 인수를 지정하면 안 됩니다.
pl: Dla metody lub funkcji „{0}” nie powinny być podawane jawne argumenty typu, ponieważ nie deklaruje ona jawnie swoich parametrów typu
pt_br: O método ou função '{0}' não deverá receber argumentos de tipo explícito porque eles não declaram explicitamente seus parâmetros de tipo
ru: метод или функция "{0}" не должна получать явные аргументы типа, так как она не объявляет свои параметры типа явно
tr: '{0}' metodu veya işlevi kendi tür parametrelerini açık olarak tanımlamadığı için açık tür bağımsız değişkenleri verilmemelidir
zh_hans: 不应为方法或函数“{0}”给定显式类型参数，因为它不显式声明其类型参数
zh_hant: 不應該為方法或函式 '{0}' 指定明確的型別引數，因為它未明確宣告其型別參數

# tcTypeParameterArityMismatch
source: This value, type or method expects {0} type parameter(s) but was given {1}
cs: Tato hodnota, typ nebo metoda očekává parametry typu v počtu {0}, ale počet předaných je {1}.
de: Dieser Wert, dieser Typ oder diese Methode erwartet {0} Typparameter, es wurde(n) aber {1} übergeben.
es: Este valor, tipo o método espera {0} parámetros de tipo, pero se le proporcionaron {1}.
fr: Cette valeur, ce type ou cette méthode attend {0} paramètre(s) de type mais en a reçu {1}
it: Questo valore, tipo o metodo prevede {0} parametro/i di tipo, tuttavia il numero di parametri specificati è pari a {1}
ja: この値、型、またはメソッドには {0} 型パラメーターを使用しますが、{1} が指定されました
ko: 이 값, 형식 또는 메서드에는 {0}개의 형식 매개 변수가 필요한데 {1}개를 받았습니다.
pl: Ta wartość, ten typ lub ta metoda oczekuje następującej liczby parametrów typów: {0}. Podana liczba parametrów: {1}
pt_br: Este valor, tipo ou método espera parâmetros de tipo {0}, mas foi dado {1}
ru: Для данного значения, типа или метода требуется {0} параметров типа, но получено {1}
tr: Bu değer, tür veya metot {0} tür parametrelerini bekliyor ancak {1} verilmiş
zh_hans: 此值、类型或方法需要 {0} 个类型参数，而给定了 {1} 个类型参数
zh_hant: 這個值、型別或方法需要 {0} 個型別參數，卻指定了 {1} 個

# tcDefaultStructConstructorCall
source: The default, zero-initializing constructor of a struct type may only be used if all the fields of the struct type admit default initialization
cs: Výchozí konstruktor s nulovou inicializací typu struktura se dá použít jenom v případě, že všechna pole typu struktura připouštějí výchozí inicializaci.
de: Der mit null initialisierte Standardkonstruktor eines Strukturtyps darf nur verwendet werden, wenn alle Felder des Strukturtyps die Standardinitialisierung zulassen.
es: El constructor de inicialización cero predeterminado de un tipo struct solo se puede usar si todos los campos del tipo struct admiten inicialización predeterminada.
fr: Le constructeur d'initialisation à zéro par défaut d'un type struct ne peut être utilisé que si tous les champs du type struct admettent l'initialisation par défaut
it: Il costruttore di inizializzazione zero predefinito di un tipo di struct può essere utilizzato solo se tutti i campi del tipo di struct accettano l'inizializzazione predefinita
ja: 構造体型のすべてのフィールドが既定の初期化を許可している場合のみ、既定である、ゼロで初期化した構造型のコンストラクターを使用できます。
ko: 구조체 형식의 기본 0 초기화 생성자는 구조체 형식의 모든 필드가 기본 초기화를 허용하는 경우에만 사용할 수 있습니다.
pl: Domyślny konstruktor typu struktury inicjujący wartość zero może być używany tylko wtedy, gdy wszystkie pola typu struktury akceptują domyślną inicjalizację
pt_br: O construtor padrão de um tipo struct iniciado com zero só pode ser usado se todos os campos do tipo struct admitirem inicialização padrão
ru: Конструктор нулевой инициализации типа структуры по умолчанию может использоваться только в случае, если все поля типа структуры допускают инициализацию по умолчанию.
tr: Varsayılan seçenek olan yapı türünün sıfır ile başlayan oluşturucusu yalnızca yapı türünün tüm alanları varsayılan başlatmayı kabul ediyorsa kullanılabilir
zh_hans: 结构类型的默认零初始化构造函数只能在结构类型的所有字段都承认默认初始化时使用
zh_hant: 結構類型的預設、零初始化建構函式只能用在結構類型的所有欄位都允許預設初始化時

# tcCouldNotFindIDisposable
source: Couldn't find Dispose on IDisposable, or it was overloaded
cs: V rozhraní IDisposable se nenašla metoda Dispose nebo je tato metoda přetížená.
de: Dispose für "IDisposable" wurde nicht gefunden oder war überladen.
es: No se encontró Dispose en IDisposable, o estaba sobrecargado.
fr: Impossible de trouver Dispose sur IDisposable, ou il a été surchargé
it: Dispose non è stato trovato in IDisposable oppure si è verificato un overload
ja: IDisposable に Dispose が見つからないか、Dispose がオーバーロードされました
ko: IDisposable에서 Dispose를 찾을 수 없거나 Dispose가 오버로드되었습니다.
pl: Nie można odnaleźć elementu Dispose w interfejsie IDisposable lub jest on przeciążony
pt_br: Não foi possível localizar Dispose em IDisposable, ou ele estava sobrecarregado
ru: Не удалось найти Dispose на IDisposable, возможно, оно перегружено.
tr: IDisposable üzerinde Dispose bulunamadı veya aşırı yüklenmişti
zh_hans: 未能找到 IDisposable 的 Dispose，或者它已被重载
zh_hant: 找不到 IDisposable 上的 Dispose，或已被多載

# tcNonLiteralCannotBeUsedInPattern
source: This value is not a literal and cannot be used in a pattern
cs: Tato hodnota není literálová a nedá se ve vzoru použít.
de: Dieser Wert ist kein Literal und kann nicht als Muster verwendet werden.
es: Este valor no es un literal y no se puede usar en un patrón.
fr: Cette valeur n'est pas un littéral. Impossible de l'utiliser dans un modèle
it: Questo valore non è un valore letterale e non è possibile utilizzarlo in un criterio
ja: この値はリテラルではないため、パターンに使用できません
ko: 이 값은 리터럴이 아니며 패턴에 사용할 수 없습니다.
pl: Ta wartość nie jest literałem i nie można jej użyć we wzorcu
pt_br: Este valor não é um literal e não pode ser usado em um padrão
ru: Данное значение не является литералом и не может использоваться в шаблоне
tr: Bu değer bir sabit değer olmadığından desende kullanılamaz
zh_hans: 此值不是文本，不能在模式中使用
zh_hant: 這個值不是常值，無法用在模式中

# tcFieldIsReadonly
source: This field is readonly
cs: Toto pole je jen pro čtení.
de: Dieses Feld ist schreibgeschützt.
es: Este campo es de solo lectura.
fr: Ce champ est en lecture seule
it: Il campo è di sola lettura
ja: このフィールドは読み取り専用です
ko: 이 필드는 읽기 전용입니다.
pl: To pole jest tylko do odczytu
pt_br: Este campo é somente leitura
ru: Это поле доступно только для чтения
tr: Bu alan salt okunur
zh_hans: 此字段是只读的
zh_hant: 這是唯讀欄位

# tcNameArgumentsMustAppearLast
source: Named arguments must appear after all other arguments
cs: Pojmenované argumenty musí být umístěné až za všemi ostatními argumenty.
de: Benannte Argumente müssen nach allen anderen Argumenten aufgeführt werden.
es: Los argumentos con nombre deben aparecer después de todos los demás argumentos.
fr: Les arguments nommés doivent apparaître après tous les autres arguments
it: Gli argomenti denominati devono essere aggiunti dopo tutti gli altri argomenti
ja: 名前付き引数は、その他の引数の後ろに指定してください
ko: 명명된 인수는 다른 모든 인수 뒤에 나타나야 합니다.
pl: Nazwane argumenty muszą występować po wszystkich pozostałych argumentach
pt_br: Argumentos nomeados devem aparecer depois de todos os argumentos
ru: Именованные аргументы должны появиться после всех остальных аргументов
tr: Adlandırılmış bağımsız değişkenler diğer tüm bağımsız değişkenlerden sonra görünmelidir
zh_hans: 命名参数必须出现在所有其他参数的后面
zh_hant: 具名引數必須出現在所有其他引數之後

# tcFunctionRequiresExplicitLambda
source: This function value is being used to construct a delegate type whose signature includes a byref argument. You must use an explicit lambda expression taking {0} arguments.
cs: Tato hodnota funkce se používá k vytvoření typu delegáta, jehož signatura obsahuje argument ByRef. Musíte použít explicitní výraz lambda, který přebírá argumenty v počtu {0}.
de: Dieser Funktionswert dient zum Erstellen eines Delegattyps, dessen Signatur ein Byref-Argument umfasst. Sie müssen einen expliziten lambda-Ausdruck mit {0} Argumenten verwenden.
es: Este valor de función se está usando para construir un tipo de delegado cuya signatura incluye un argumento byref. Debe usar una expresión lambda explícita que tome {0} argumentos.
fr: Cette valeur de fonction est utilisée pour construire un type délégué dont la signature comprend un argument byref. Vous devez utiliser une expression lambda explicite qui accepte {0} arguments.
it: Questo valore di funzione è utilizzato per costruire un tipo delegato la cui firma include un argomento byref. È necessario utilizzare un'espressione lambda esplicita con {0} argomenti.
ja: この関数値は、byref 引数を含むシグネチャのデリゲート型を構築するために使用されます。{0} 個の引数を使用する明示的なラムダ式を使用する必要があります。
ko: 이 함수 값은 시그니처에 byref 인수가 포함된 대리자 형식을 생성하는 데 사용되고 있습니다. {0}개의 인수를 사용하는 명시적 람다 식을 사용해야 합니다.
pl: Ta wartość funkcji jest używana do utworzenia typu delegata, którego sygnatura zawiera argument byref. Musisz użyć jawnego wyrażenia lambda pobierającego następującą liczbę argumentów: {0}.
pt_br: Este valor de função está sendo usado para construir um tipo delegado cuja assinatura inclui argumento byref. Você deve usar uma expressão lambda que obtenha argumentos {0}.
ru: Данное значение функции используется для конструирования типа делегата, подпись которого включает аргумент byref. Необходимо использовать явное лямбда выражение, принимающее {0} аргументов.
tr: Bu işlev değeri, imzası byref bağımsız değişkeni içeren bir temsilci türü oluşturmak için kullanılıyor. {0} bağımsız değişken alan açık lambda ifadesi kullanmanız gerekir.
zh_hans: 此函数值将用于构造其签名包含 byref 参数的委托类型。您必须使用一个采用 {0} 个参数的显式 lambda 表达式。
zh_hant: 這個函式值正用來建構簽章包含 ByRef 引數的委派類型。您必須使用接受 {0} 引數的明確 Lambda 運算式。

# tcTypeCannotBeEnumerated
source: The type '{0}' is not a type whose values can be enumerated with this syntax, i.e. is not compatible with either seq<_>, IEnumerable<_> or IEnumerable and does not have a GetEnumerator method
cs: Typ {0} není typem, u kterého by se dal pomocí této syntaxe vytvořit výčet hodnot, tj. není kompatibilní se seq<_>, IEnumerable<_> ani IEnumerable a nemá metodu GetEnumerator.
de: Die Werte des Typs "{0}" können nicht mit dieser Syntax enumeriert werden, d.h., er ist nicht mit "seq<_>, IEnumerable<_>" oder "IEnumerable" kompatibel und besitzt keine GetEnumerator-Methode.
es: El tipo "{0}" no es un tipo cuyos valores se puedan enumerar con esta sintaxis; es decir, no es compatible con seq<_>, IEnumerable<_> or IEnumerable y no tiene un método GetEnumerator
fr: Le type '{0}' n'est pas un type dont les valeurs peuvent être énumérées avec cette syntaxe, par ex. il n'est pas compatible avec seq<_>, IEnumerable<_> ou IEnumerable et n'a pas de méthode GetEnumerator
it: Il tipo '{0}' non è un tipo i cui valori possono essere enumerati con questa sintassi, ovvero non è compatibile con seq<_>, IEnumerable<_> o IEnumerable e non dispone di un metodo GetEnumerator
ja: 型 '{0}' は、この構文で列挙できる値の型ではありません。つまり、seq<_>, IEnumerable<_> とも IEnumerable とも互換性がなく、GetEnumerator メソッドがありません
ko: '{0}' 형식은 이 구문을 사용하여 열거할 수 있는 값을 포함하는 형식이 아닙니다. 즉, seq<_>, IEnumerable<_> 또는 IEnumerable과 호환되지 않으며 GetEnumerator 메서드를 가지지 않습니다.
pl: Typ „{0}” nie jest typem, którego wartości mogą być wyliczane przy użyciu tej składni. Oznacza to, że nie jest on zgodny z elementem seq<_>, IEnumerable<_> ani IEnumerable i nie ma metody GetEnumerator
pt_br: O tipo '{0}' não é um tipo cujos valores podem ser enumerados com esta sintaxe, ou seja, não é compatível com seq<_>, IEnumerable<_> nem IEnumerable e não tem um método GetEnumerator
ru: Значения типа "{0}" не могут быть перечислены с помощью этого синтаксиса, так как этот тип не совместим с seq<_>, IEnumerable<_> и IEnumerable и не содержит метода GetEnumerator
tr: '{0}' türü, değerleri bu söz dizimiyle numaralandırılabilecek bir tür değil, yani seq<_>, IEnumerable<_> veya IEnumerable ile uyumlu değil ve bir GetEnumerator metodu yok
zh_hans: 类型“{0}”的值不能通过此语法进行枚举，即该类型不与 seq<_>, IEnumerable<_> 和 IEnumerable 兼容且不具备 GetEnumerator 方法
zh_hant: 類型 '{0}' 不是可透過此語法來列舉其值的類型，也就是與 seq<_>、IEnumerable<_> 或 IEnumerable 不相容，而且沒有 GetEnumerator 方法
