Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# tcUnrecognizedQueryOperator
source: This is not a known query operator. Query operators are identifiers such as 'select', 'where', 'sortBy', 'thenBy', 'groupBy', 'groupValBy', 'join', 'groupJoin', 'sumBy' and 'averageBy', defined using corresponding methods on the 'QueryBuilder' type.
cs: Toto je neznámý operátor dotazu. Operátory dotazu jsou identifikátory jako třeba select, where, sortBy, thenBy, groupBy, groupValBy, join, groupJoin, sumBy nebo averageBy, které jsou definované pomocí odpovídajících metod v typu QueryBuilder.
de: Dies ist kein bekannter Abfrageoperator. Abfrageoperatoren sind Bezeichner wie z.B. 'select', 'where', 'sortBy', 'thenBy', 'groupBy', 'groupValBy', 'join', 'groupJoin', 'sumBy' und 'averageBy', die mithilfe der entsprechenden Methoden für den Typ 'QueryBuilder' definiert werden.
es: Este no es un operador de consulta conocido. Los operadores de consulta son identificadores, como 'select', 'where', 'sortBy', 'thenBy', 'groupBy', 'groupValBy', 'join', 'groupJoin', 'sumBy' y 'averageBy', que se definen usando los métodos correspondientes en el tipo 'QueryBuilder'.
fr: Cet opérateur de requête est inconnu. Les opérateurs de requête sont des identificateurs, tels que 'select', 'where', 'sortBy', 'thenBy', 'groupBy', 'groupValBy', 'join', 'groupJoin', 'sumBy' et 'averageBy', définis à l'aide de méthodes correspondantes sur le type 'QueryBuilder'.
it: Operatore di query sconosciuto. Gli operatori di query sono identificatori come 'select', 'where', 'sortBy', 'thenBy', 'groupBy', 'groupValBy', 'join', 'groupJoin', 'sumBy' e 'averageBy', definiti mediante i metodi corrispondenti nel tipo 'QueryBuilder'.
ja: これは既知のクエリ演算子ではありません。クエリ演算子は、'select'、'where'、'sortBy'、'thenBy'、'groupBy'、'groupValBy'、'join'、'groupJoin'、'sumBy'、および 'averageBy' などの識別子であり、'QueryBuilder' 型で対応するメソッドを使用して定義されます。
ko: 알려진 쿼리 연산자가 아닙니다. 쿼리 연산자는 'select', 'where', 'sortBy', 'thenBy', 'groupBy', 'groupValBy', 'join', 'groupJoin', 'sumBy' 및 'averageBy' 등의 식별자로, 'QueryBuilder' 형식에서 해당하는 메서드를 사용하여 정의됩니다.
pl: To nie jest znany operator zapytania. Do operatorów zapytań należą takie identyfikatory jak „select”, „where”, „sortBy”, „thenBy”, „groupBy”, „groupValBy”, „join”, „groupJoin”, „sumBy” i „averageBy” zdefiniowane przy użyciu odpowiednich metod typu „QueryBuilder”.
pt_br: Este não é um operador de consulta válido. Operadores de consulta são identificadores como 'select', 'where', 'sortBy', 'thenBy', 'groupBy', 'groupValBy', 'join', 'groupJoin', 'sumBy' e 'averageBy' definidos usando métodos correspondentes no tipo 'QueryBuilder'.
ru: Это неизвестный оператора запроса. Операторы запросов представляют собой идентификаторы, такие как select, where, sortBy, thenBy, groupBy, groupValBy, join, groupJoin,sumBy и averageBy, определяемые с помощью соответствующих методов типа QueryBuilder.
tr: Bu bilinen bir sorgu işleci değil. Sorgu işleçleri, 'QueryBuilder' türündeki ilgili metotlar kullanılarak tanımlanan 'select', 'where', 'sortBy', 'thenBy', 'groupBy', 'groupValBy', 'join', 'groupJoin', 'sumBy' ve 'averageBy' gibi tanımlayıcılardır.
zh_hans: 这不是已知的查询运算符。查询运算符是使用“QueryBuilder”类型的对应方法定义的标识符，如“select”、“where”、“sortBy”、“thenBy”、“groupBy”、“groupValBy”、“join”、“groupJoin”、“sumBy”和“averageBy”。
zh_hant: 這不是已知的查詢運算子。查詢運算子是 'QueryBuilder' 類型上使用對應方法定義的識別碼，例如 'select'、'where'、'sortBy'、'thenBy'、'groupBy'、'groupValBy'、'join'、'groupJoin'、'sumBy' 和 'averageBy'。

# tcTryWithMayNotBeUsedInQueries
source: 'try/with' expressions may not be used in queries
cs: Výrazy try/with se u dotazů použít nedají.
de: 'try/with'-Ausdrücke dürfen in Abfragen nicht verwendet werden.
es: Las expresiones 'try/with' no se pueden usar en las consultas.
fr: Les expressions 'try/with' ne peuvent pas être utilisées dans les requêtes
it: Le espressioni 'try/with' non possono essere utilizzate nelle query
ja: 'try/with' 式はクエリ内で使用できません
ko: 'try/with' 식은 쿼리에서 사용할 수 없습니다.
pl: Wyrażenia „try/with” nie mogą być używane w zapytaniach
pt_br: As expressões 'try/with' não podem ser usadas em consultas
ru: В запросах нельзя использовать выражения try/with
tr: 'try/with' ifadeleri sorgularda kullanılamaz
zh_hans: “try/with”表达式不能在查询中使用
zh_hant: 不可以在查詢中使用 'try/with' 運算式

# tcNonSimpleLetBindingInQuery
source: This 'let' definition may not be used in a query. Only simple value definitions may be used in queries.
cs: Tato definice let se v dotazu použít nedá. V dotazech je možné použít jenom definice jednoduchých hodnot.
de: Diese 'let'-Definition darf in einer Abfrage nicht verwendet werden. In Abfragen dürfen nur einfache Wertdefinitionen verwendet werden.
es: Esta definición 'let' no se puede usar en una consulta. En las consultas solo se pueden usar definiciones de valor simple.
fr: Cette définition 'let' ne peut pas être utilisée dans une requête. Seules les définitions de valeur simple peuvent être utilisées dans les requêtes.
it: La definizione 'let' non può essere utilizzata in una query. Nelle query è possibile utilizzare solo definizioni di valore semplici.
ja: この 'let' 定義は、クエリ内では使用できません。クエリで使用できるのは単純な値の定義のみです。
ko: 이 'let' 정의는 쿼리에서 사용할 수 없습니다. 단순 값 정의만 쿼리에서 사용할 수 있습니다.
pl: Nie można użyć tej definicji „let” w zapytaniu. W zapytaniach mogą być używane tylko proste definicje wartości.
pt_br: Esta definição 'let' não pode ser usada em uma consulta. Somente definições de valores simples podem ser usadas em consultas.
ru: Определение let нельзя использовать в запросе. В запросах можно использовать только простые определения значений.
tr: Bu 'let' tanımı sorguda kullanılamaz. Sorgularda yalnızca basit değer tanımları kullanılabilir.
zh_hans: 此“let”定义不能在查询中使用。查询中只能使用简单值定义。
zh_hant: 這個 'let' 定義不可用於查詢中。只有簡單值定義可用於查詢中。

# etTooManyStaticParameters
source: Too many static parameters. Expected at most {0} parameters, but got {1} unnamed and {2} named parameters.
cs: Příliš mnoho statických parametrů. Maximální očekávaný počet parametrů je {0}, ale počet přijatých parametrů je {1} (nepojmenované) a {2} (pojmenované).
de: Zu viele statische Parameter. Es wurden höchstens {0} Parameter erwartet, zurückgegeben wurden jedoch {1} unbenannte und {2} benannte Parameter.
es: Hay demasiados parámetros estáticos. Se esperaba un máximo de {0} parámetros, pero se obtuvieron {1} parámetros sin nombre y {2} con nombre.
fr: Paramètres statiques trop nombreux. {0} paramètres au maximum étaient attendus, mais {1} paramètres non nommés et {2} paramètres nommés ont été reçus.
it: Troppi parametri statici. Previsti al massimo {0} parametri, mentre sono stati ottenuti {1} parametri senza nome e {2} parametri denominati.
ja: 静的パラメーターが多すぎます。静的パラメーターの最大数は {0} 個ですが、名前のないパラメーターが {1} 個、名前付きパラメーターが {2} 個あります。
ko: 정적 매개 변수가 너무 많습니다. 최대 {0}개의 매개 변수가 필요한데 명명되지 않은 매개 변수 {1}개와 명명된 매개 변수 {2}개가 있습니다.
pl: Zbyt wiele parametrów statycznych. Oczekiwano co najwyżej następującej liczby parametrów: {0}, ale uzyskano następującą liczbę parametrów nienazwanych i nazwanych: {1} i {2}.
pt_br: Excesso de parâmetros estáticos. Eram esperados no máximo {0} parâmetros, mas {1} parâmetros não nomeados e {2} parâmetros nomeados foram recebidos.
ru: Слишком много статических параметров. Ожидалось не более {0} параметров, однако было получено {1} неименованных и {2} именованных параметров.
tr: Çok fazla statik parametre. En çok {0} parametre bekleniyordu, ancak {1} adlandırılmamış ve {2} adlandırılmış parametre alındı.
zh_hans: 静态参数太多。最多应为 {0} 个参数，但是获得了 {1} 个未命名参数和 {2} 个命名参数。
zh_hant: 靜態參數太多。最多必須有 {0} 個參數，但收到 {1} 個未命名參數及 {2} 個具名參數。

# infosInvalidProvidedLiteralValue
source: Invalid provided literal value '{0}'
cs: Neplatná hodnota poskytnutého literálu {0}
de: Ungültiger angegebener Literalwert '{0}'
es: Valor literal '{0}' proporcionado no válido.
fr: Valeur littérale fournie non valide '{0}'
it: Valore letterale fornito '{0}' non valido
ja: 指定されたリテラル値 '{0}' が無効です
ko: 제공된 '{0}' 리터럴 값이 잘못되었습니다.
pl: Nieprawidłowa udostępniona wartość literału „{0}”
pt_br: Valor literal fornecido '{0}' inválido
ru: Недопустимое предоставленное значение литерала "{0}"
tr: Sağlanan sabit değer '{0}' geçersiz
zh_hans: 所提供文本值“{0}”无效
zh_hant: 提供的常值 '{0}' 無效

# invalidPlatformTarget
source: The 'anycpu32bitpreferred' platform can only be used with EXE targets. You must use 'anycpu' instead.
cs: Platforma anycpu32bitpreferred se dá použít jenom s cíli EXE. Místo ní je potřeba použít anycpu.
de: Die Plattform 'anycpu32bitpreferred' kann nur mit EXE-Zielen verwendet werden. Stattdessen muss 'anycpu' verwendet werden.
es: La plataforma 'anycpu32bitpreferred' solo se puede usar con destinos EXE. Debe usar 'anycpu' en su lugar.
fr: La plateforme 'anycpu32bitpreferred' peut uniquement être utilisée avec des cibles EXE. Vous devez utiliser 'anycpu' à la place.
it: La piattaforma 'anycpu32bitpreferred' può essere utilizzata solo con destinazioni EXE. Utilizzare invece 'anycpu'.
ja: 'anycpu32bitpreferred' プラットフォームは、EXE ターゲットでのみ使用できます。代わりに、'anycpu' を使用してください。
ko: 'anycpu32bitpreferred' 플랫폼은 EXE 대상에만 사용할 수 있습니다. 대신 'anycpu'를 사용해야 합니다.
pl: Flaga platformy „anycpu32bitpreferred” może być używana tylko z obiektami docelowymi EXE. Należy zamiast tego użyć flagi „anycpu”.
pt_br: A plataforma 'anycpu32bitpreferred' só pode ser usada com destinos EXE. Em vez disso, use 'anycpu'.
ru: Платформу anycpu32bitpreferred можно использовать только с целевыми файлами EXE. Вместо этого необходимо использовать платформу anycpu.
tr: 'anycpu32bitpreferred' platformu yalnızca EXE hedefleriyle kullanılabilir. Onun yerine 'anycpu' kullanmalısınız.
zh_hans: “anycpu32bitpreferred”平台只能用于 EXE 目标。必须改用“anycpu”。
zh_hant: 'anycpu32bitpreferred' 平台只能與 EXE 目標搭配使用。您必須改用 'anycpu'。

# tcThisValueMayNotBeInlined
source: This member, function or value declaration may not be declared 'inline'
cs: Člen, funkce nebo hodnota se nedá deklarovat jako inline.
de: Diese Member-, Funktions- oder der Wertdeklaration darf nicht mit 'inline' deklariert werden.
es: Esta declaración de miembro, función o valor no se puede declarar como 'inline'.
fr: Cette déclaration de membre, de fonction ou de valeur ne peut pas être déclarée comme étant 'inline'
it: Questa dichiarazione di valore, funzione o membro non può essere dichiarata 'inline'
ja: このメンバー、関数、または値の宣言を 'inline' で宣言することはできません
ko: 이 멤버, 함수 또는 값 선언은 'inline'으로 선언할 수 없습니다.
pl: Ta deklaracja elementu członkowskiego, funkcji lub wartości nie może być zadeklarowana jako „inline”
pt_br: Esta declaração de membro, função ou valor não pode ser declarada 'inline'
ru: Этот элемент, функция или значение не могут быть объявлены как inline
tr: Bu üye, işlev veya değer bildirimi 'inline' olarak tanımlanamaz
zh_hans: 此成员、函数或值声明不能声明为“inline”
zh_hant: 這個成員、函式或值宣告不能宣告為 'inline'

# etErasedTypeUsedInGeneration
source: The provider '{0}' returned a non-generated type '{1}' in the context of a set of generated types. Consider adjusting the type provider to only return generated types.
cs: Poskytovatel {0} vrátil negenerovaný typ {1} v kontextu sady generovaných typů. Zvažte možnost upravit zprostředkovatele typu tak, aby vracel jenom generované typy.
de: Der Anbieter "{0}" hat einen nicht generierten Typ "{1}" im Kontext einer Reihe von generierten Typen zurückgegeben. Ziehen Sie eine Anpassung des Typanbieters in Betracht, damit dieser nur generierte Typen zurückgibt.
es: El proveedor '{0}' devolvió un tipo '{1}' no generado en el contexto de un conjunto de tipos generados. Considere ajustar el proveedor de tipos para que devuelva solamente tipos generados.
fr: Le fournisseur '{0}' a retourné un type non généré '{1}' dans le contexte d'un ensemble de type générés. Envisagez d'ajuster le fournisseur de type de manière à retourner uniquement les types générés.
it: Il provider '{0}' ha restituito un tipo non generato '{1}' nel contesto di un set di tipi generati. Provare a modificare il provider di tipi in modo che restituisca solo tipi generati.
ja: プロバイダー '{0}' は、一連の生成された型のコンテキスト内で、生成されていない型 '{1}' を返しました。型プロバイダーが生成された型のみを返すように調整することを検討してください。
ko: {0}' 공급자가 생성된 형식 컨텍스트에 생성되지 않은 형식 '{1}'을(를) 반환했습니다. 생성된 형식만 반환하도록 형식 공급자를 조정하세요.
pl: Dostawca „{0}” zwrócił niegenerowany typ „{1}” w kontekście zestawu wygenerowanych typów. Rozważ dostosowanie dostawcy typów tak, aby zwracał tylko wygenerowane typy.
pt_br: O provedor '{0}' retornou um tipo não gerado '{1}' no contexto de um conjunto de tipos gerados. Considere ajustar o provedor de tipos para retornar somente tipos gerados.
ru: Поставщик "{0}" вернул несоздаваемый тип "{1}" в контексте набора создаваемых типов. Попробуйте изменить поставщик типов, чтобы он возвращал только создаваемые типы.
tr: {0}' sağlayıcısı, oluşturulmuş türler kümesi bağlamında oluşturulmamış '{1}' türünü döndürdü. Tür sağlayıcısını yalnızca oluşturulmuş türleri döndürecek şekilde ayarlamayı düşünün.
zh_hans: 提供程序“{0}”在一组生成类型的上下文中返回了非生成类型“{1}”。请考虑调整类型提供程序以仅返回生成类型。
zh_hant: 提供者 '{0}' 在一組所產生型別的內容中，傳回非產生的型別 '{1}'。請考慮調整型別提供者以便僅傳回產生的型別。

# tcUnrecognizedQueryBinaryOperator
source: Arguments to query operators may require parentheses, e.g. 'where (x > y)' or 'groupBy (x.Length / 10)'
cs: Argumenty operátorů dotazu můžou vyžadovat použití závorek, třeba where (x > y) nebo groupBy (x.Length / 10).
de: Argumente für Abfrageoperatoren erfordern möglicherweise Klammern, z.B. "where (x > y)" oder "groupBy (x.Length / 10)".
es: Los argumentos de los operadores de consulta pueden requerir paréntesis, por ejemplo, "where (x > y)' or 'groupBy (x.Length / 10)"
fr: Les arguments des opérateurs de requête peuvent nécessiter des parenthèses, par ex. 'where (x > y)' ou 'groupBy (x.Length / 10)'
it: Gli argomenti negli operatori di query possono richiedere le parentesi, ad esempio 'where (x > y)' o 'groupBy (x.Length / 10)'
ja: クエリ演算子への引数にはかっこが必要な場合があります。例: 'where (x > y)' または 'groupBy (x.Length / 10)'
ko: 쿼리 연산자의 인수에는 'where (x > y)' 또는 'groupBy (x.Length / 10)'과 같이 괄호가 필요할 수 있습니다.
pl: Argumenty operatorów zapytań mogą wymagać nawiasów, np. „where (x > y)” lub „groupBy (x.Length / 10)”
pt_br: Argumentos para operadores de consulta podem exigir parênteses, ex.: 'where (x > y)' ou 'groupBy (x.Length / 10)'
ru: Аргументы в операторах запроса может потребоваться заключить в скобки, например, 'where (x > y)' или 'groupBy (x.Length / 10)'
tr: Sorgu işleçlerine yönelik bağımsız değişkenler parantez gerektirebilir, ör. 'where (x > y)' veya 'groupBy (x.Length / 10)'
zh_hans: 查询运算符的参数可能需要括号，例如 "where (x > y)" 或 "groupBy (x.Length / 10)"
zh_hant: 查詢運算子的引數可能需要括號，例如 'where (x > y)' 或 'groupBy (x.Length / 10)'

# crefNoSetOfHole
source: A quotation may not involve an assignment to or taking the address of a captured local variable
cs: Citace nemůže zahrnovat přiřazení k adrese zachycené lokální proměnné nebo její přebírání.
de: Eine Quotation darf keine Zuweisung zu einer erfassten lokalen Variable enthalten oder deren Adresse übernehmen
es: Una expresión de código delimitada no puede incluir una asignación a una variable local capturada ni tomar la dirección de esta.
fr: Une citation ne peut pas impliquer d'assignation à une variable locale capturée ou d'utilisation de l'adresse de cette dernière
it: Una quotation non può comportare un'assegnazione a una variabile locale acquisita o l'utilizzo dell'indirizzo di una variabile locale acquisita
ja: キャプチャされたローカル変数のアドレスの割り当てまたは取得は引用符で囲まれない場合があります
ko: 인용구에 할당을 포함하거나 캡처된 로컬 변수의 주소를 사용할 수 없습니다.
pl: Wyrażenie cytowane nie może obejmować przypisania lub pobrania adresu przechwyconej zmiennej lokalnej
pt_br: Uma cotação não pode incluir uma atribuição para ou assumir o endereço de uma variável local capturada
ru: Цитата может не включать присваивание полученной локальной переменной или получение ее адреса
tr: Bir alıntı, yakalanan yerel değişkenin adresine atama içeremez veya bu adresi alamaz
zh_hans: 引号可能不涉及对捕获的本地变量赋值或获取其地址
zh_hant: 引號可能與指派無關或與採用擷取之區域變數的位址無關

# nicePrintOtherOverloads1
source: + 1 overload
cs: + 1 přetížení
de: + 1 Überladung
es: + 1 sobrecarga
fr: + 1 surcharge
ja: + 1 オーバーロード
ko: +1개 오버로드
pl: + 1 przeciążenie
pt_br: + 1 sobrecarga
ru: + 1 перегрузка
tr: + 1 aşırı yükleme
zh_hans: + 1 重载
zh_hant: + 1 個多載

# nicePrintOtherOverloadsN
source: + {0} overloads
cs: + {0} přetížení
de: + {0} Überladungen
es: + {0} sobrecargas
fr: + {0} surcharges
it: + {0} overload
ja: + {0} オーバーロード
ko: + {0} 오버로드
pl: + przeciążenia ({0})
pt_br: + {0} sobrecargas
ru: + {0} перегрузок
tr: + {0} aşırı yükleme
zh_hans: + {0} 重载
zh_hant: + {0} 個多載

source: Erased to
cs: Vymazáno
de: Gelöscht zu
es: Borrado para
fr: Effacé de
it: Cancellato in
ja: 消去先
ko: 지운 시간
pl: Wymazano do postaci
pt_br: Apagado para
ru: Стерт до
tr: Silindiği öğe:
zh_hans: 已清除到的位置
zh_hant: 清除為

# parsUnfinishedExpression
source: Unexpected token '{0}' or incomplete expression
cs: Neočekávaný token {0} nebo neúplný výraz
de: Unerwartetes Token "{0}" oder unvollständiger Ausdruck
es: Token '{0}' inesperado o expresión incompleta
fr: Jeton inattendu '{0}' ou expression incomplète
it: Token imprevisto '{0}' o espressione incompleta
ja: 予期しないトークン '{0}' または不完全な式です
ko: 예기치 않은 토큰 '{0}' 또는 불완전한 식
pl: Nieoczekiwany token „{0}” lub niepełne wyrażenie
pt_br: Token '{0}' inesperado ou expressão incompleta
ru: Ожидался токен "{0}" или неполное выражение
tr: Beklenmeyen '{0}' belirteci veya eksik ifade
zh_hans: 意外的标记“{0}”或不完整的表达式
zh_hant: 未預期的語彙基元 '{0}' 或不完整的運算式

# parsAttributeOnIncompleteCode
source: Cannot find code target for this attribute, possibly because the code after the attribute is incomplete.
cs: Nedá se najít cíl kódu pro tento atribut. Možná je to proto, že kód za tímto atributem je neúplný.
de: Codeziel für dieses Attribut kann nicht gefunden werden. Möglicherweise ist der Code nach dem Attribut unvollständig.
es: No se encuentra el destino del código de este atributo, probablemente porque el código que aparece después del atributo está incompleto.
fr: La cible du code est introuvable pour cet attribut, peut-être parce que le code après l'attribut est incomplet.
it: La destinazione del codice per questo attributo non è stata trovata, probabilmente perché il codice dopo l'attributo è incompleto.
ja: この属性を対象にしたコードが見つかりません。属性の後のコードが完全ではない可能性があります。
ko: 이 특성에 대한 코드 대상을 찾을 수 없습니다. 특성 뒤의 코드가 완료되지 않았습니다.
pl: Nie można znaleźć celu kodu dla tego atrybutu, ponieważ kod po atrybucie jest niekompletny.
pt_br: Não é possível encontrar o destino de código para este atributo, possivelmente porque o código após o atributo está incompleto.
ru: Не удается найти целевой код для этого атрибута; возможно, это вызвано тем, что код после атрибута незавершен.
tr: Bu özniteliğin kod hedefi, muhtemelen öznitelikten sonraki kod eksik olduğu için bulunamıyor.
zh_hans: 无法找到此特性的代码目标，可能是因为此特性后面的代码不完整。
zh_hant: 找不到以此屬性為目標的程式碼，可能是因為屬性之後的程式碼不完整。

# parsTypeNameCannotBeEmpty
source: Type name cannot be empty.
cs: Název typu nemůže být prázdný.
de: Der Typname darf nicht leer sein.
es: El nombre de tipo no puede estar vacío.
fr: Le nom de type ne peut pas être vide.
it: Il nome del tipo non può essere vuoto.
ja: 型名を入力してください。
ko: 형식 이름은 비워 둘 수 없습니다.
pl: Nazwa typu nie może być pusta.
pt_br: O nome do tipo não pode ficar vazio.
ru: Имя типа не может быть пустым.
tr: Tür adı boş olamaz.
zh_hans: 类型名不能是空的。
zh_hant: 類型名稱不可為空白。

# buildProblemReadingAssembly
source: Problem reading assembly '{0}': {1}
cs: Problém při čtení sestavení {0}: {1}
de: Problem beim Lesen von Assembly "{0}": {1}
es: Problema al leer el ensamblado '{0}': {1}
fr: Problème lors de la lecture de l'assembly '{0}' : {1}
it: Problema durante la lettura dell'assembly '{0}': {1}
ja: アセンブリ '{0}' を読み取る際に問題が発生しました: {1}
ko: {0}' 어셈블리를 읽는 중 오류가 발생했습니다. {1}
pl: Problem z odczytem zestawu „{0}”: {1}
pt_br: Problema ao ler assembly '{0}': {1}
ru: Проблема при чтении сборки "{0}": {1}
tr: Bütünleştirilmiş kod okuma hatası: '{0}': {1}
zh_hans: 读取程序集“{0}”时出现问题: {1}
zh_hant: 讀取組件 '{0}' 時發生問題: {1}

# tcTPFieldMustBeLiteral
source: Invalid provided field. Provided fields of erased provided types must be literals.
cs: Neplatné poskytnuté pole. Poskytnutá pole vymazaných poskytnutých typů musí být literálová.
de: Ungültiges angegebenes Feld. Die angegebenen Felder von gelöschten angegebenen Typen müssen Literale sein.
es: Campo proporcionado no válido. Los campos proporcionados de los tipos proporcionados borrados deben ser literales.
fr: Champ fourni non valide. Les champs fournis de types fournis effacés doivent être des littéraux.
it: Campo specificato non valido. I campi specificati dei tipi forniti cancellati devono essere valori letterali.
ja: 指定されたフィールドが無効です。指定された型が消去されている場合、指定されたフィールドはリテラルである必要があります。
ko: 제공된 필드가 잘못되었습니다. 지워진 제공된 형식의 제공된 필드는 리터럴이어야 합니다.
pl: Nieprawidłowe podane pole. Podane pola wymazanych podanych typów muszą być literałami.
pt_br: Campo fornecido inválido. Os campos fornecidos de tipos fornecidos apagados devem ser literais.
ru: Недопустимое предоставляемое поле. Предоставляемые поля удаленных предоставляемых типов должны быть литералами.
tr: Geçersiz sağlanan alan. Silinmiş sağlanan türlerin sağlanan alanları sabit değerler olmalıdır.
zh_hans: 提供的字段无效。属于已清除的提供类型的提供字段必须为文本。
zh_hant: 提供的欄位無效。所清除之提供類型的提供欄位必須為常值。

source: (loading description...)
cs: (Načítá se popis...)
de: (Die Beschreibung wird geladen…)
es: (cargando descripción...)
fr: (chargement de la description...)
it: (caricamento descrizione...)
ja: (説明を読み込んでいます...)
ko: (설명 로드 중...)
pl: (trwa ładowanie opisu...)
pt_br: (carregando descrição...)
ru: (идет загрузка описания...)
tr: (açıklama yükleniyor...)
zh_hans: (正在加载说明...)
zh_hant: (正在載入描述...)

source: (description unavailable...)
cs: (popis není dostupný...)
de: (Die Beschreibung ist nicht verfügbar...)
es: (descripción no disponible...)
fr: (description non disponible...)
it: (descrizione non disponibile...)
ja: (説明はありません...)
ko: (설명 없음...)
pl: (niedostępny opis...)
pt_br: (descrição não disponível...)
ru: (описание недоступно...)
tr: (açıklama yok...)
zh_hans: (说明不可用...)
zh_hant: (無法使用描述...)

# chkTyparMultipleClassConstraints
source: A type variable has been constrained by multiple different class types. A type variable may only have one class constraint.
cs: Proměnná typu je omezená více různými typy tříd. Proměnná typu může mít jenom jedno omezení třídy.
de: Eine Typvariable wurde durch mehrere unterschiedliche Klassentypen eingeschränkt. Eine Typvariable weist möglicherweise nur eine Klasseneinschränkung auf.
es: Una variable de tipo está restringida por varios tipos de clase distintos. Una variable de tipo solamente puede tener una restricción de clase.
fr: Une variable de type a été contrainte par plusieurs types de classes différents. Une variable de type ne peut avoir qu'une contrainte de classe.
it: Una variabile di tipo è stata vincolata da più tipi di classe differenti. Una variabile di tipo può disporre di un solo vincolo di classe.
ja: 型変数が複数の異なるクラス型によって制約されています。型変数が持つことのできるクラス制約は 1 つだけです。
ko: 형식 변수가 여러 클래스 형식에 의해 제약을 받습니다. 형식 변수의 클래스 제약 조건은 하나여야 합니다.
pl: Zmienna typu została ograniczona przez wiele różnych typów klasy. Zmienna typu może mieć tylko jedno ograniczenie klasy.
pt_br: Uma variável de tipo foi restringida por vários tipos de classes diferentes. Uma variável de tipo só pode conter uma restrição de classe.
ru: Переменная типа ограничена несколькими различными типами классов. Переменная типа может иметь только одно ограничение класса.
tr: Bir tür değişkeni, birden çok farklı sınıf türü tarafından kısıtlanmış. Bir tür değişkeninin yalnızca bir sınıf kısıtlaması olabilir.
zh_hans: 一个类型变量已由多个不同的类类型进行约束。一个类型变量只能有一个类约束。
zh_hant: 類型變數受到多種不同類別類型約束。類型變數只能有一個類別條件約束。
