Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# tcAttributeAutoOpenWasIgnored
source: The attribute 'AutoOpen(\"{0}\")' in the assembly '{1}' did not refer to a valid module or namespace in that assembly and has been ignored
cs: Atribut AutoOpen(\"{0}\") v sestavení {1} neodkazoval na platný modul nebo obor názvů v tomto sestavení a ignoroval se.
de: Das AutoOpen(\"{0}\")-Attribut in der Assembly "{1}" verweist nicht auf ein gültiges Modul oder einen gültigen Namespace in der Assembly; es wird deshalb ignoriert.
es: El atributo 'AutoOpen(\"{0}\")' del ensamblado '{1}' no hacía referencia a un módulo o espacio de nombres válido en ese ensamblado y se ha omitido.
fr: L'attribut 'AutoOpen(\"{0}\")' de l'assembly '{1}' ne faisait pas référence à un module ou un espace de noms valide dans cet assembly et a été ignoré
it: L'attributo 'AutoOpen(\"{0}\")' nell'assembly '{1}' non fa riferimento a un modulo o a uno spazio dei nomi valido in tale assembly ed è stato pertanto ignorato
ja: アセンブリ '{1}' の属性 'AutoOpen(\"{0}\")' は、このアセンブリ内の有効なモジュールまたは名前空間を参照していないため、無視されました
ko: {1}' 어셈블리의 특성 'AutoOpen(\"{0}\")'이 해당 어셈블리의 올바른 모듈 또는 네임스페이스를 참조하지 않아 무시되었습니다.
pl: Atrybut „AutoOpen(\"{0}\")” w zestawie „{1}” nie odwołuje się do prawidłowego modułu lub prawidłowej przestrzeni nazw w tym zestawie i został zignorowany
pt_br: O atributo 'AutoOpen(\"{0}\")' no assembly '{1}' não referenciou um módulo ou namespace válido neste assembly e foi ignorado
ru: Атрибут "AutoOpen(\"{0}\")" в сборке "{1}" пропущен, поскольку он не ссылается на допустимые модуль или пространство имен в этой сборке
tr: {1}' bütünleştirilmiş kodundaki 'AutoOpen(\"{0}\")' özniteliği bu bütünleştirilmiş koddaki geçerli bir modüle veya ad alanına başvurmadığından yok sayıldı
zh_hans: 程序集“{1}”中的特性“AutoOpen(\"{0}\")”未引用该程序集中的有效模块或命名空间，已忽略此特性
zh_hant: 組件 '{1}' 中的 'AutoOpen(\"{0}\")' 屬性未參考該組件中有效的模組或命名空間，所以已予以忽略

# ilUndefinedValue
source: Undefined value '{0}'
cs: Nedefinovaná hodnota {0}
de: Nicht definierter Wert "{0}".
es: Valor no definido '{0}'.
fr: Valeur non définie '{0}'
it: Valore non definito '{0}'
ja: 未定義の値 '{0}'
ko: 정의되지 않은 값 '{0}'입니다.
pl: Niezdefiniowana wartość „{0}”
pt_br: Valor indefinido '{0}'
ru: Неопределенное значение "{0}"
tr: Tanımsız değer '{0}'
zh_hans: 未定义的值“{0}”
zh_hant: 未定義的值 '{0}'

# ilLabelNotFound
source: Label {0} not found
cs: Popisek {0} se nenašel.
de: Bezeichnung "{0}" nicht gefunden.
es: No se encontró la etiqueta {0}.
fr: Étiquette {0} introuvable
it: Etichetta {0} non trovata
ja: ラベル {0} が見つかりません
ko: {0} 레이블을 찾을 수 없습니다.
pl: Nie znaleziono etykiety {0}
pt_br: Rótulo {0} não encontrado
ru: Метка {0} не найдена
tr: {0} etiketi bulunamadı
zh_hans: 未找到标签 {0}
zh_hant: 找不到標籤 {0}

# ilIncorrectNumberOfTypeArguments
source: Incorrect number of type arguments to local call
cs: Nesprávný počet argumentů typu pro místní volání
de: Fehlerhafte Anzahl von Typargumenten für lokalen Aufruf.
es: Número incorrecto de argumentos de tipo para una llamada local.
fr: Nombre incorrect d'arguments de type dans l'appel local
it: Numero di argomenti tipo non corretto per la chiamata locale
ja: ローカルの呼び出しに対する型引数の数が正しくありません
ko: 로컬 호출에 대한 형식 인수 수가 잘못되었습니다.
pl: Niepoprawna liczba argumentów typu dla wywołania lokalnego
pt_br: Número incorreto de argumentos de tipo para chamadas locais
ru: Недопустимое число аргументов типа для локального вызова
tr: Yerel çağrı için hatalı sayıda tür bağımsız değişkeni
zh_hans: 本地调用的类型参数的数目不正确
zh_hant: 區域呼叫的類型引數數目不正確

# ilDynamicInvocationNotSupported
source: Dynamic invocation of {0} is not supported
cs: Dynamické vyvolání {0} se nepodporuje.
de: Der dynamische Aufruf von {0} wird nicht unterstützt.
es: No se admite la invocación dinámica de {0}.
fr: L'appel dynamique de {0} n'est pas pris en charge
it: Chiamata dinamica di {0} non supportata
ja: {0} の動的呼び出しはサポートされません
ko: {0}을(를) 동적으로 호출하는 작업은 지원되지 않습니다.
pl: Dynamiczne wywołanie {0} nie jest obsługiwane
pt_br: A chamada dinâmica de {0} não é suportada
ru: Динамический вызов {0} не поддерживается
tr: Dinamik {0} çağırma desteklenmiyor
zh_hans: 不支持动态调用 {0}
zh_hant: 不支援 {0} 的動態引動

# ilAddressOfLiteralFieldIsInvalid
source: Taking the address of a literal field is invalid
cs: Přebírání adresy pole literálu je neplatné.
de: Das Übernehmen der Adresse eines Literalfelds ist unzulässig.
es: No se permite tomar la dirección de un campo literal.
fr: L'acceptation de l'adresse d'un champ littéral n'est pas valide
it: L'utilizzo dell'indirizzo di un campo del valore letterale non è valido
ja: リテラル フィールドのアドレスは使用できません
ko: 리터럴 필드의 주소를 사용하는 것은 올바르지 않습니다.
pl: Pobieranie adresu pola literału jest nieprawidłowe
pt_br: Não é válido pegar o endereço de um campo literal
ru: Недопустимое получение адреса поля литерала
tr: Sabit değer alanının adresini almak geçersizdir
zh_hans: 采用文本字段的地址无效
zh_hant: 接受常值欄位的位址無效

# ilAddressOfValueHereIsInvalid
source: This operation involves taking the address of a value '{0}' represented using a local variable or other special representation. This is invalid.
cs: Tato operace zahrnuje převzetí adresy hodnoty {0} vyjádřené pomocí lokální proměnné nebo jiného speciálního způsobu vyjádření. Tato akce je neplatná.
de: Bei diesem Vorgang wird die Adresse eines Werts "{0}" übernommen, der durch eine lokale Variable oder eine andere Spezialdarstellung dargestellt wird. Dies ist unzulässig.
es: Esta operación implica tomar la dirección de un valor '{0}' representado con una variable local u otra representación especial. Esto no es válido.
fr: Cette opération implique l'acceptation de l'adresse d'une valeur '{0}' représentée à l'aide d'une variable locale ou de toute autre représentation spéciale. Ceci n'est pas valide.
it: Questa operazione prevede l'uso dell'indirizzo di un valore '{0}' rappresentato mediante una variabile locale o altra rappresentazione speciale. Questo comportamento non è valido.
ja: この操作には、ローカル変数または他の特殊な表現を使用して表された値 '{0}' のアドレスが使用されています。これは無効です。
ko: 이 작업을 수행하려면 지역 변수 또는 기타 특수 표현을 사용하여 표시된 값 '{0}'의 주소를 사용해야 합니다. 이는 올바르지 않습니다.
pl: Ta operacja obejmuje pobieranie adresu wartości „{0}” reprezentowanej przy użyciu zmiennej lokalnej lub innej specjalnej reprezentacji. Jest to nieprawidłowe.
pt_br: Esta operação envolve pegar o endereço de um valor representado '{0}' através do uso de variável local ou outra representação especial, o que é inválido.
ru: В этой операции осуществляется получение адреса значения "{0}", представленного с помощью локальной переменной или другого специального представления. Это не допускается.
tr: Bu işlem, yerel değişken kullanılarak veya başka bir özel gösterimle sunulan '{0}' değerinin adresini almayı içeriyor. Bu geçersizdir.
zh_hans: 此操作涉及到采用通过本地变量或其他特殊表示形式表示的值“{0}”的地址。这是无效的。
zh_hant: 這項作業涉及接受值 '{0}' 的位址，且這個值是使用區域變數或其他特殊表示方式表示。這種作法無效。

# ilCustomMarshallersCannotBeUsedInFSharp
source: Custom marshallers cannot be specified in F# code. Consider using a C# helper function.
cs: V kódu F# se nedají zadat vlastní marshallery. Zvažte použití pomocné funkce v C#.
de: Benutzerdefinierte Marshaller dürfen im F#-Code nicht angegeben werden. Verwenden Sie eine C#-Hilfsfunktion.
es: En código de F#, no se pueden especificar los contadores de referencias personalizados. Considere el uso de una función auxiliar de C#.
fr: Impossible de spécifier des marshaleurs personnalisés en F#. Utilisez une fonction d'assistance C#.
it: Non è possibile specificare gestori del marshalling personalizzati nel codice F#. Provare a usare una funzione helper C#.
ja: F# コードではカスタム マーシャラーを指定できません。C# ヘルパー関数を使用してください。
ko: 사용자 지정 마샬러는 F# 코드에 지정할 수 없습니다. C# 도우미 함수를 사용하세요.
pl: Nie można określać niestandardowych organizatorów w kodzie języka F#. Rozważ użycie pomocniczej funkcji języka C#.
pt_br: Marshallers personalizados não podem ser especificados em código F#. Considere usar uma função de ajuda de C#.
ru: Не допускается указание пользовательского маршаллера в коде F#. Рекомендуется использовать вспомогательную функцию C#.
tr: F# kodunda özel hazırlayıcılar belirtilemez. C# yardım işlevi kullanmayı düşünün.
zh_hans: 无法使用 F# 代码指定自定义封送处理程序。请考虑使用 C# Helper 函数。
zh_hant: 在 F# 程式碼中不能指定自訂封送處理器。請考慮使用 C# 協助程式函式。

# ilMarshalAsAttributeCannotBeDecoded
source: The MarshalAs attribute could not be decoded
cs: Atribut MarshalAs se nedal dekódovat.
de: Das MarshalAs-Attribut konnte nicht decodiert werden.
es: No se pudo descodificar el atributo MarshalAs.
fr: Impossible de décoder l'attribut MarshalAs
it: Non è stato possibile decodificare l'attributo MarshalAs
ja: MarshalAs 属性をデコードできませんでした
ko: MarshalAs 특성을 디코딩할 수 없습니다.
pl: Nie można zdekodować atrybutu MarshalAs
pt_br: Não foi possível decodificar o atributo MarshalAs
ru: Не удается декодировать атрибут MarshalAs
tr: MarshalAs özniteliğinin kodu çözülemedi
zh_hans: 未能对 MarshalAs 特性进行解码
zh_hant: 無法解碼 MarshalAs 屬性

# ilSignatureForExternalFunctionContainsTypeParameters
source: The signature for this external function contains type parameters. Constrain the argument and return types to indicate the types of the corresponding C function.
cs: Signatura pro tuto externí funkci obsahuje parametry typu. Omezte argument a návratové typy tak, aby zahrnovaly typy odpovídající funkce C.
de: Die Signatur für diese externe Funktion enthält Typparameter. Schränken Sie das Argument und die Rückgabetypen ein, und geben Sie die Typen der entsprechenden C-Funktion an.
es: La signatura de esta función externa contiene parámetros de tipo. Restrinja los tipos de argumento y valor devuelto para indicar los tipos de la función de C correspondiente.
fr: La signature de cette fonction externe contient des paramètres de type. Appliquez une contrainte à l'argument et aux types de retour pour indiquer les types de la fonction C correspondante.
it: La firma per la funzione esterna contiene parametri di tipo. Vincolare l'argomento e i tipi restituiti per indicare i tipi della funzione C corrispondente.
ja: この外部関数のシグネチャには型パラメーターが含まれます。引数を制限し、対応する C 関数の型を示す型を戻してください。
ko: 이 외부 함수의 시그니처에 형식 매개 변수가 포함되어 있습니다. 인수 및 반환 형식을 제한하여 해당하는 C 함수의 형식을 나타내세요.
pl: Sygnatura dla tej funkcji zewnętrznej zawiera parametry typu. Ogranicz typy argumentów i zwracane typy, tak aby wskazywały typy odpowiedniej funkcji języka C.
pt_br: A assinatura para esta função externa contém parâmetros de tipo. Restrinja o argumento e tipos de retorno para indicar os tipos de função C correspondente.
ru: Сигнатура этой внешней функции содержит параметры типа. Ограничьте типы аргументов и возвращаемых значений, чтобы обозначить типы соответствующих функций C.
tr: Bu dış işlevin imzası tür parametreleri içeriyor. Karşılık gelen C işlevi türlerini belirtmek için bağımsız değişkeni ve dönüş türlerini kısıtlayın.
zh_hans: 此外部函数的签名包含类型参数。请约束此参数和返回类型以指示相应的 C 函数的类型。
zh_hant: 這個外部函式的簽章包含型別參數。請限制引數和傳回型別，以指示對應 C 函式的類型。

# ilDllImportAttributeCouldNotBeDecoded
source: The DllImport attribute could not be decoded
cs: Atribut DllImport se nedal dekódovat.
de: Das DllImport-Attribut konnte nicht decodiert werden.
es: No se pudo descodificar el atributo DllImport.
fr: Impossible de décoder l'attribut DllImport
it: Non è stato possibile decodificare l'attributo DllImport
ja: DllImport 属性をデコードできませんでした
ko: DllImport 특성을 디코딩할 수 없습니다.
pl: Nie można zdekodować atrybutu DllImport
pt_br: Não foi possível decodificar o atributo DllImport
ru: Не удается декодировать атрибут DllImport
tr: DllImport özniteliğinin kodu çözülemedi
zh_hans: 未能对 DllImport 特性进行解码
zh_hant: 無法解碼 DllImport 屬性

# ilLiteralFieldsCannotBeSet
source: Literal fields cannot be set
cs: Pole literálů se nedají nastavit.
de: Literalfelder können nicht festgelegt werden.
es: No se pueden establecer campos de literal.
fr: Impossible de définir les champs littéral
it: Non è possibile impostare campi di valori letterali
ja: リテラル フィールドを設定できません
ko: 리터럴 필드를 설정할 수 없습니다.
pl: Nie można ustawić pól literału
pt_br: Não foi possível definir os campos literais
ru: Поля литералов нельзя задавать
tr: Sabit değer alanları ayarlanamaz
zh_hans: 无法设置文本字段
zh_hant: 無法設定常值欄位

# ilStaticMethodIsNotLambda
source: GenSetStorage: {0} was represented as a static method but was not an appropriate lambda expression
cs: GenSetStorage: metoda {0} byla vyjádřená jako statická, ale není to odpovídající výraz lambda.
de: GenSetStorage: {0} wurde als statische Methode dargestellt, war aber kein geeigneter lambda-Ausdruck.
es: GenSetStorage: {0} se representó como un método estático pero no era una expresión lambda apropiada.
fr: GenSetStorage : {0} a été représenté en tant que méthode statique mais n'était pas une expression lambda appropriée
it: GenSetStorage: {0} è rappresentato come metodo statico, ma non è un'espressione lambda appropriata
ja: GenSetStorage: {0} は静的メソッドとして表現されましたが、適切なラムダ式ではありません
ko: GenSetStorage: {0}이(가) 정적 메서드로 표시되었지만 적절한 람다 식이 아니었습니다.
pl: GenSetStorage: Element {0} był reprezentowany jako metoda statyczna, ale nie był odpowiednim wyrażeniem lambda
pt_br: GenSetStorage: {0} foi representado como método estático mas não foi uma expressão lambda apropriada
ru: GenSetStorage: {0} представлен как статический метод, однако не является допустимым лямбда-выражением
tr: GenSetStorage: {0} statik metot olarak gösterildi ancak bu uygun bir lambda ifadesi değildi
zh_hans: GenSetStorage: {0} 已表示为一个静态方法，而不是适当的 lambda 表达式
zh_hant: GenSetStorage: {0} 是以靜態方法表示，但它不是適當的 Lambda 運算式

# ilMutableVariablesCannotEscapeMethod
source: Mutable variables cannot escape their method
cs: Měnitelné proměnné nemůžou opustit svoji metodu.
de: Änderbare Variablen können ihre Methode nicht mit Escapevorgängen außer Kraft setzen.
es: Las variables mutables no pueden escapar de su método.
fr: Impossible d'utiliser les variables mutables en dehors de leur méthode
it: Le variabili modificabili non possono uscire dal relativo metodo
ja: 変更可能な変数ではメソッドをエスケープできません
ko: 변경할 수 있는 변수는 해당 메서드를 벗어날 수 없습니다.
pl: Zmienne modyfikowalne nie mogą opuścić swojej metody
pt_br: Variáveis mutáveis não podem escapar de seus métodos
ru: Изменяемые переменные не могут обходить собственные методы
tr: Değişebilir değişkenler metotlarından kaçamaz
zh_hans: 可变变量不能脱离其方法
zh_hant: 可變動的變數無法逸出其方法

# ilUnexpectedUnrealizedValue
source: Compiler error: unexpected unrealized value
cs: Chyba kompilátoru: neočekávaná nerealizovaná hodnota
de: Compilerfehler: unerwarteter nicht realisierter Wert.
es: Error del compilador: valor no realizado inesperado.
fr: Erreur du compilateur : valeur non réalisée inattendue
it: Errore compilatore: valore non realizzato imprevisto
ja: コンパイラ エラー: 予期しない認識されない値
ko: 컴파일러 오류: 예기치 않은 구현되지 않은 값이 있습니다.
pl: Błąd kompilatora: nieoczekiwana niezrealizowana wartość
pt_br: Erro de compilador: valor não realizado inesperado
ru: Ошибка компилятора: недопустимое нереализованное значение
tr: Derleyici hatası: Beklenmeyen gerçekleşmemiş değer
zh_hans: 编译器错误: 意外的未识别值
zh_hant: 編譯器錯誤: 非預期的未實現值

# ilMainModuleEmpty
source: Main module of program is empty: nothing will happen when it is run
cs: Hlavní modul programu je prázdný: při jeho spuštění se nic nestane.
de: Das Hauptmodul des Programms ist leer: Beim Ausführen erfolgt keinerlei Aktion.
es: El módulo principal del programa está vacío: no ocurrirá nada cuando se ejecute.
fr: Le module principal du programme est vide : rien ne se passera lors de son exécution
it: Il modulo principale del programma è vuoto. L'esecuzione non produrrà alcun effetto
ja: プログラムのメイン モジュールが空です。実行しても何も処理されません
ko: 프로그램의 주 모듈이 비어 있습니다. 프로그램 실행 시 아무 작업도 수행되지 않습니다.
pl: Główny moduł programu jest pusty: nic się nie wydarzy po jego uruchomieniu
pt_br: O módulo principal do programa está vazio: nada ocorrerá enquanto ele estiver em execução
ru: Основной модуль программы пуст: при запуске программы не будет выполнено никаких действий
tr: Ana program modülü boş: çalıştırıldığında hiçbir şey olmayacak
zh_hans: 程序的主模块为空: 运行此程序时将不会有任何反应
zh_hant: 程式的主要模組是空的: 執行時不會產生任何作用

# ilTypeCannotBeUsedForLiteralField
source: This type cannot be used for a literal field
cs: Tento typ se pro pole literálu použít nedá.
de: Dieser Typ kann nicht für ein Literalfeld verwendet werden.
es: Este tipo no se puede usar para un campo literal.
fr: Impossible d'utiliser ce type pour un champ littéral
it: Non è possibile usare questo tipo per un campo di valore letterale
ja: リテラル フィールドにこの型は使用できません
ko: 이 형식은 리터럴 필드에 사용할 수 없습니다.
pl: Ten typ nie może być używany dla pola literału
pt_br: Este tipo não pode ser usado para um campo literal
ru: Этот тип не может использоваться для поля литерала
tr: Bu tür, sabit değer alanı için kullanılamaz
zh_hans: 此类型不能用于文本字段
zh_hant: 這種類型不能做為常值欄位使用

# ilUnexpectedGetSetAnnotation
source: Unexpected GetSet annotation on a property
cs: Neočekávaná poznámka GetSet u vlastnosti
de: Unerwartete GetSet-Anmerkung für eine Eigenschaft.
es: Anotación GetSet inesperada en una propiedad.
fr: Annotation GetSet inattendue pour une propriété
it: Annotazione GetSet imprevista in una proprietà
ja: プロパティに予期しない GetSet 注釈がありました:
ko: 속성에 예기치 않은 GetSet 주석이 있습니다.
pl: Nieoczekiwana adnotacja GetSet dla właściwości
pt_br: Anotação GetSet inesperada em um propriedade
ru: Недопустимая аннотация GetSet для свойства
tr: Özellikte beklenmeyen GetSet ek açıklaması
zh_hans: 某个属性的意外的 GetSet 批注
zh_hant: 屬性有非預期的 GetSet 註釋

# ilFieldOffsetAttributeCouldNotBeDecoded
source: The FieldOffset attribute could not be decoded
cs: Atribut FieldOffset se nedal dekódovat.
de: Das FieldOffset-Attribut konnte nicht decodiert werden.
es: No se pudo descodificar el atributo FieldOffset.
fr: Impossible de décoder l'attribut FieldOffset
it: Non è stato possibile decodificare l'attributo FieldOffset
ja: FieldOffset 属性をデコードできませんでした
ko: FieldOffset 특성을 디코딩할 수 없습니다.
pl: Nie można zdekodować atrybutu FieldOffset
pt_br: Não foi possível decodificar o atributo FieldOffset
ru: Не удается декодировать атрибут FieldOffset
tr: FieldOffset özniteliğinin kodu çözülemedi
zh_hans: 未能对 FieldOffset 特性进行解码
zh_hant: 無法解碼 FieldOffset 屬性

# ilStructLayoutAttributeCouldNotBeDecoded
source: The StructLayout attribute could not be decoded
cs: Atribut StructLayout se nedal dekódovat.
de: Das StructLayout-Attribut konnte nicht decodiert werden.
es: No se pudo descodificar el atributo StructLayout.
fr: Impossible de décoder l'attribut StructLayout
it: Non è stato possibile decodificare l'attributo StructLayout
ja: StructLayout 属性をデコードできませんでした
ko: StructLayout 특성을 디코딩할 수 없습니다.
pl: Nie można zdekodować atrybutu StructLayout
pt_br: Não foi possível decodificar o atributo StructLayout
ru: Не удается декодировать атрибут StructLayout
tr: StructLayout özniteliğinin kodu çözülemedi
zh_hans: 未能对 StructLayout 特性进行解码
zh_hant: 無法解碼 StructLayout 屬性

# ilDefaultAugmentationAttributeCouldNotBeDecoded
source: The DefaultAugmentation attribute could not be decoded
cs: Atribut DefaultAugmentation se nedal dekódovat.
de: Das DefaultAugmentation-Attribut konnte nicht decodiert werden.
es: No se pudo descodificar el atributo DefaultAugmentation.
fr: Impossible de décoder l'attribut DefaultAugmentation
it: Non è stato possibile decodificare l'attributo DefaultAugmentation
ja: DefaultAugmentation 属性をデコードできませんでした
ko: DefaultAugmentation 특성을 디코딩할 수 없습니다.
pl: Nie można zdekodować atrybutu DefaultAugmentation
pt_br: Não foi possível decodificar o atributo DefaultAugmentation
ru: Не удается декодировать атрибут DefaultAugmentation
tr: DefaultAugmentation özniteliğinin kodu çözülemedi
zh_hans: 未能对 DefaultAugmentation 特性进行解码
zh_hant: 無法解碼 DefaultAugmentation 屬性

# ilReflectedDefinitionsCannotUseSliceOperator
source: Reflected definitions cannot contain uses of the prefix splice operator '%'
cs: Reflektované definice nemůžou obsahovat použití operátoru spojení předpon %.
de: Reflektierte Definitionen dürfen keinen Präfix-Splice-Operator "%" enthalten.
es: Las definiciones reflejadas no pueden contener usos del operador de inserción de prefijo '%'.
fr: Les définitions réfléchies ne peuvent pas contenir d'utilisations de l'opérateur d'ajout de préfixe '%'
it: Le definizioni riflesse non possono contenere utilizzi dell'operatore di splicing del prefisso '%'
ja: リフレクションされた定義には、プレフィックスのスプライス演算子 '%' を使用できません
ko: 반영된 정의에는 접두사 스플라이스 연산자 '%'을(를) 포함할 수 없습니다.
pl: Odbite definicje nie mogą używać operatora łączenia prefiksu „%”
pt_br: Definições refletidas não podem conter usos do operador união pré-fixo '%'
ru: Отраженные определения не могут включать использование оператора соединения префикса "%"
tr: Yansıtılmış tanımlar ön ek ekleme işleci '%' kullanımlarını içeremez
zh_hans: 反射的定义中不能使用前缀拼接运算符“%”
zh_hant: 反映的定義不能含有前置接合運算子 '%' 的用法

# optsProblemWithCodepage
source: Problem with codepage '{0}': {1}
cs: Problém se znakovou stránkou {0}: {1}
de: Problem mit Codepage "{0}": {1}
es: Problema con la página de códigos '{0}': {1}
fr: Problème avec la page de codes '{0}' : {1}
it: Problema con la tabella codici '{0}': {1}
ja: コードページ '{0}' に問題があります: {1}
ko: 코드 페이지 '{0}'에 문제가 있습니다. {1}
pl: Problem ze stroną kodową „{0}”: {1}
pt_br: Problema com o código de página '{0}': {1}
ru: Неполадка с кодовой страницей "{0}": {1}
tr: {0}' kod sayfasında sorun: {1}
zh_hans: 代码页“{0}”存在问题: {1}
zh_hant: 字碼頁 '{0}' 有問題: {1}

# optsCopyright
source: Copyright (c) Microsoft Corporation. All Rights Reserved.
cs: Copyright (C) Microsoft Corporation. Všechna práva vyhrazena.
de: Copyright (C) Microsoft Corporation. Alle Rechte vorbehalten.
es: Copyright (C) Microsoft Corporation. Todos los derechos reservados.
fr: Copyright (C) Microsoft Corporation. Tous droits réservés.
it: Copyright (C) Microsoft Corporation. Tutti i diritti sono riservati.
pl: Copyright (C) Microsoft Corporation. Wszelkie prawa zastrzeżone.
pt_br: Copyright (C) Microsoft Corporation. Todos os direitos reservados.
ru: © Корпорация Майкрософт (Microsoft Corporation). Все права защищены.
tr: Telif hakkı (C) Microsoft Corporation. Tüm hakları saklıdır.
zh_hans: 版权所有(C) Microsoft Corporation。保留所有权利。
zh_hant: Copyright (C) Microsoft Corporation. 著作權所有，並保留一切權利。

# optsCopyrightCommunity
source: Freely distributed under the MIT Open Source License. https://github.com/Microsoft/visualfsharp/blob/master/License.txt
cs: Volně distribuováno v rámci licence MIT Open Source. https://github.com/Microsoft/visualfsharp/blob/master/License.txt
de: Freie Verteilung unter der MIT-Open Source-Lizenz. https://github.com/Microsoft/visualfsharp/blob/master/License.txt
es: Distribuido libremente bajo licencia de código abierto de MIT. https://github.com/Microsoft/visualfsharp/blob/master/License.txt
fr: Distribué gratuitement sous licence Open Source du MIT. https://github.com/Microsoft/visualfsharp/blob/master/License.txt
it: Distribuito gratuitamente in conformità ai termini della licenza Open Source di MIT. https://github.com/Microsoft/visualfsharp/blob/master/License.txt
ja: MIT のオープン ソース ライセンスで無料配布されています。https://github.com/Microsoft/visualfsharp/blob/master/License.txt
ko: MIT 오픈 소스 라이선스에 따라 무료로 배포되었습니다. https://github.com/Microsoft/visualfsharp/blob/master/License.txt
pl: Udostępniane bezpłatnie w ramach licencji open source MIT. https://github.com/Microsoft/visualfsharp/blob/master/License.txt
pt_br: Distribuído gratuitamente sob a Licença de Software Livre do MIT. https://github.com/Microsoft/visualfsharp/blob/master/License.txt
ru: Распространяется бесплатно по лицензии MIT Open Source License. https://github.com/Microsoft/visualfsharp/blob/master/License.txt
tr: MIT Açık Kaynak Lisansı altında ücretsiz olarak dağıtılır. https://github.com/Microsoft/visualfsharp/blob/master/License.txt
zh_hans: 免费分发在 MIT 开源许可证下。https://github.com/Microsoft/visualfsharp/blob/master/License.txt
zh_hant: 依 MIT 開啟來源授權自由散發。https://github.com/Microsoft/visualfsharp/blob/master/License.txt
