Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# tcReservedSyntaxForAugmentation
source: The syntax 'type X with ...' is reserved for augmentations. Types whose representations are hidden but which have members are now declared in signatures using 'type X = ...'. You may also need to add the '[<Sealed>] attribute to the type definition in the signature
cs: Syntaxe type X with ... je vyhrazená pro rozšíření. Typy, které mají skrytou reprezentaci, ale mají členy, se teď v signaturách deklarují pomocí notace type X = ... Je možné, že k definici typu v signatuře bude potřeba přidat také atribut [<Sealed>].
de: Die Syntax "type X with ..." ist für Augmentationen reserviert. Typen, deren Darstellung verborgen ist, die aber Member aufweisen, werden jetzt mithilfe von " type X = ..." in Signaturen deklariert. Möglicherweise müssen Sie der Typdefinition in der Signatur auch das [<Sealed>]-Attribut hinzufügen.
es: La sintaxis "type X with ..." está reservada a las ampliaciones. Los tipos cuyas representaciones están ocultas pero que tienen miembros se declaran ahora en firmas utilizando "type X = ...". Puede que también necesite agregar el atributo "[<Sealed>]" a la definición del tipo de la firma
fr: La syntaxe 'type X with ...' est réservée aux augmentations. Les types dont les représentations sont masquées, mais qui ont des membres sont maintenant déclarés dans des signatures à l'aide de 'type X = ...'. Vous pouvez avoir besoin d'ajouter l'attribut '[<Sealed>] à la définition de type dans la signature
it: La sintassi 'type X with ...' è riservata agli aumenti. I tipi le cui rappresentazioni sono nascoste ma contenenti membri vengono ora dichiarati in firme mediante 'type X = ...'. Potrebbe essere inoltre necessario aggiungere l'attributo '[<Sealed>] alla definizione di tipo nella firma
ja: 構文 'type X with ...' は拡張用に予約されています。これらは非表示になっていますが、'type X = ...' を使用してシグネチャでメンバーが宣言されています。シグネチャの型定義に '[<Sealed>] 属性を追加しなければならない場合があります
ko: 구문은 확대를 위해 예약되었습니다. 표현이 숨겨져 있지만 멤버를 가지고 있는 형식은 이제 'type X = ...'를 사용하여 시그니처에 선언됩니다. 시그니처에 있는 형식 정의에 '[<Sealed>] 특성을 추가해야 할 수도 있습니다.
pl: Składnia „type X with ...” jest zarezerwowana dla rozszerzeń. Typy, które mają ukryte reprezentacje, ale zawierają składowe, są obecnie deklarowane w podpisach przy użyciu składni „type X = ...”. Może być też konieczne dodanie atrybutu [<Sealed>] do definicji typu w podpisie
pt_br: A sintaxe 'type X with ...' é reservada para aumentos. Os tipos cujas representações estão ocultas, mas que possuem membros, são agora declarados em assinaturas usando 'type X = ...'. Você também pode precisar adicionar o atributo '[<Sealed>] à definição de tipo na assinatura
ru: Синтаксис 'type X with ...' зарезервирован для дополнений. Типы, представления которых скрыт, но у которых есть участники, теперь объявляются в подписях с использованием синтаксиса 'type X = ...'. Также может потребоваться добавить атрибут '[<Sealed>] в определение типа в подписи
tr: 'type X with ...' söz dizimi genişletmelere ayrılmıştır. Temsilleri gizli olan ancak üyeleri olan türler artık imzada 'type X = ...' kullanılarak bildirilir. İmzada tür tanımına '[<Sealed>] özniteliğini de eklemeniz gerekebilir
zh_hans: 保留语法 "type X with ..." 供扩大使用。对于其表示形式已隐藏但具有成员的类型，现将在签名中使用 "type X = ..." 声明这些类型。你可能还需要向签名中的类型定义添加 [<Sealed>] 属性
zh_hant: 語法 'type X with ...' 已保留以用於擴增。已隱藏表示法但有成員的類型，現在會使用 'type X = ...' 在特徵標記中宣告。您也可能必須將 '[<Sealed>] 屬性新增到特徵標記中的類型定義

# tcMembersThatExtendInterfaceMustBePlacedInSeparateModule
source: Members that extend interface, delegate or enum types must be placed in a module separate to the definition of the type. This module must either have the AutoOpen attribute or be opened explicitly by client code to bring the extension members into scope.
cs: Členové, kteří rozšiřují typy rozhraní, delegáta nebo výčtu, musí být umístěné v modulu odděleně od definice typu. Tento modul musí mít buď atribut AutoOpen, nebo musí být otevřený explicitně klientským kódem, aby se člen rozšíření vložil do oboru.
de: Member, die Schnittstellen-, Delegat- oder Enumerationstypen erweitern, müssen in einem von der Typdefinition getrennten eigenen Modul platziert werden. Dieses Modul muss entweder mit dem AutoOpen-Attribut versehen oder vom Clientcode explizit geöffnet werden, um die Erweiterungsmember in den Bereich einzubinden.
es: Los miembros que extienden tipos de interfaz, delegado o enumeración deben ponerse en un módulo separado de la definición del tipo. Este módulo debe tener el atributo AutoOpen, o bien código de cliente debe abrirlo de forma explícita para traer los miembros de extensión dentro del ámbito.
fr: Les membres qui étendent les types interface, délégués ou enum doivent être placés dans un module distinct de la définition du type. Ce module doit avoir l'attribut AutoOpen ou être ouvert explicitement par le code client afin de placer les membres d'extension dans la portée.
it: I membri che estendono tipi delegati, interfaccia o enumerazione devono trovarsi in un modulo separato rispetto alla definizione del tipo. Il modulo deve avere l'attributo AutoOpen oppure essere aperto in modo esplicito dal codice client in modo da portare i membri di estensione nell'ambito.
ja: インターフェイス型、デリゲート型、または列挙型を拡張するメンバーは、型の定義とは別のモジュールに配置する必要があります。このモジュールに AutoOpen 属性を指定するか、クライアント コードで明示的にモジュールを開いて、拡張メンバーをスコープに含める必要があります。
ko: 인터페이스, 대리자 또는 열거형 형식을 확장하는 멤버는 형식의 정의와 별도로 모듈에 배치해야 합니다. 이 모듈은 확장 멤버를 범위 내로 가져오기 위해 AutoOpen 특성을 가지거나 클라이언트 코드를 통해 명시적으로 열어야 합니다.
pl: Elementy członkowskie stanowiące rozszerzenie typu interfejsu, delegata lub wyliczenia muszą znajdować się w innym module niż ten, w którym znajduje się definicja typu. Ten moduł musi mieć atrybut AutoOpen lub musi zostać jawnie otwarty przez kod klienta w celu uwzględnienia elementów członkowskich rozszerzeń w zakresie.
pt_br: Membros que estendem tipos de interface, delegado ou enum devem ser colocados em um módulo separado da definição do tipo. Este módulo deve ter o atributo AutoOpen ou ser aberto explicitamente por um código de cliente para trazer os membros de extensão para o escopo.
ru: Элементы, расширяющие типы интерфейса, делегатов или перечисления, должны помещаться в отдельном от определения типа модуле. Данный модуль должен либо иметь атрибут AutoOpen, либо открываться явно клиентским кодом для запуска элементов расширения в области.
tr: Arabirim, temsilci veya sabit listesi türlerini genişleten üyeler türün tanımından ayrı bir modüle yerleştirilmelidir. Bu modülün ya AutoOpen özniteliği olmalıdır ya da uzantı üyelerini kapsama çıkarmak için istemci kodu aracılığıyla açık olarak açılmalıdır.
zh_hans: 必须将扩展接口、委托或枚举类型的成员放置到与相应的类型定义分离的模块中。此模块必须具有 AutoOpen 特性或由客户端代码显式打开以将扩展成员纳入范围中。
zh_hant: 擴充介面、委派或列舉類型的成員必須放在模組中，與類型的定義分開。這個模組必須有 AutoOpen 屬性，或是由用戶端程式碼明確開啟，來將擴充成員帶入範圍內。

# tcDeclaredTypeParametersForExtensionDoNotMatchOriginal
source: One or more of the declared type parameters for this type extension have a missing or wrong type constraint not matching the original type constraints on '{0}'
cs: Minimálně jeden parametr deklarovaného typu u tohoto rozšíření typu neobsahuje omezení typu nebo má nesprávné omezení typu, které se neshoduje s původními omezeními typu na {0}.
de: Mindestens ein deklarierter Typparameter für diese Typerweiterung verfügt über keine oder eine falsche Typeinschränkung, die nicht mit der ursprünglichen Typeinschränkung "{0}" übereinstimmt.
es: Uno o varios parámetros de tipo declarados para esta extensión de tipo tienen una restricción de tipo ausente o errónea que no coincide con las restricciones de tipo original en "{0}"
fr: Un ou plusieurs des paramètres de type déclarés pour cette extension de type ont une contrainte de type manquante ou incorrecte qui ne correspond pas aux contraintes de type d'origine sur '{0}'
it: Uno o più parametri di tipo dichiarati per questa estensione del tipo contengono un vincolo di tipo mancante o errato non corrispondente ai vincoli di tipo originali in '{0}'
ja: この型の拡張の 1 つ以上の宣言された型パラメーターについて、型の制約が見つからないか、型の制約が '{0}' の元の型の制約に一致しないため正しくありません。
ko: 이 형식 확장에 대해 선언된 하나 이상의 형식 매개 변수에 형식 제약 조건이 없거나 잘못되어 '{0}'의 원본 형식 제약 조건과 일치하지 않습니다.
pl: Co najmniej jeden zadeklarowany parametr typu dla tego rozszerzenia typu nie ma ograniczenia typu lub ograniczenie typu jest nieprawidłowe i niezgodne z oryginalnymi ograniczeniami typu w elemencie „{0}”
pt_br: Um ou mais dos parâmetros de tipo declarados para esta extensão de tipo têm uma restrição ausente ou incorreta que não corresponde às restrições de tipo originais em '{0}'
ru: В одном объявленном параметре типа или нескольких для этого расширения типа отсутствует ограничение типа или содержится неверное ограничение типа, не совпадающее с исходными ограничениями типа для "{0}"
tr: Bu tür uzantısı için bildirilen tür parametrelerinden bir veya daha fazlası, '{0}' üzerindeki özgün tür tür kısıtlamaları ile eşleşmeyen eksik veya yanlış bir tür kısıtlaması içeriyor
zh_hans: 此类型扩展的一个或多个已声明类型参数具有缺失或错误的类型约束，与“{0}”上的原始类型约束不匹配
zh_hant: 此類型延伸模組所宣告的型別參數中，有一或多個缺少類型條件約束，或類型條件約束不正確，不符合 '{0}' 的原始類型條件約束

# tcTypeDefinitionsWithImplicitConstructionMustHaveOneInherit
source: Type definitions may only have one 'inherit' specification and it must be the first declaration
cs: Definice typu může mít jenom jednu specifikaci inherit a ta musí být první deklarací.
de: Typdefinitionen dürfen nur eine inherit-Angabe aufweisen, und diese muss die erste Deklaration sein.
es: Las definiciones de tipo pueden tener solo una especificación 'inherit' y debe ser la primera declaración.
fr: Les définitions de type ne peuvent avoir qu'une spécification 'inherit' et il doit s'agir de la première déclaration
it: Le definizioni di tipo possono avere solo una specifica 'inherit' nella prima dichiarazione
ja: 型定義に含めることができる 'inherit' 指定は 1 つのみであり、これを最初の宣言にする必要があります。
ko: 형식 정의에는 하나의 'inherit' 지정만 있을 수 있으며 이것이 첫 번째 선언이어야 합니다.
pl: Definicje typów mogą zawierać tylko jedną specyfikację „inherit”, która musi być pierwszą deklaracją
pt_br: As definições de tipo só podem ter uma especificação 'inherit' e devem ser a primeira declaração
ru: Определения типа могут иметь только одну спецификацию inherit, и она должна являться первым объявлением
tr: Tür tanımlarının yalnızca bir 'inherit' belirtimi olabilir ve bu ilk bildirim olmalıdır
zh_hans: 类型定义只能指定一个“inherit”，并且它必须是第一个声明
zh_hant: 類型定義只能有一個 'inherit' 規格，而且必須是第一個宣告

# tcTypeDefinitionsWithImplicitConstructionMustHaveLocalBindingsBeforeMembers
source: 'let' and 'do' bindings must come before member and interface definitions in type definitions
cs: Vazby let a do se musí v definicích typů umístit před definice členů a rozhraní.
de: let- und "do"-Bindungen müssen in Typdefinitionen vor Member- und Schnittstellendefinitionen kommen.
es: Los enlaces 'let' y 'do' deben preceder a las definiciones de miembro e interfaz en las definiciones de tipo.
fr: Les liaisons 'let' et 'do' doivent précéder les définitions de membre et d'interface dans les définitions de type
it: I binding 'let' e 'do' devono precedere le definizioni di membro e interfaccia nelle definizioni di tipo
ja: 型定義内のメンバーとインターフェイスの定義の前に、'let' および 'do' 束縛を含める必要があります
ko: 'let' 및 'do' 바인딩은 형식 정의에서 멤버 및 인터페이스 정의 앞에 와야 합니다.
pl: Powiązania „let” i „do” muszą występować przed definicjami elementów członkowskich i interfejsów w definicjach typów
pt_br: As associações 'let' e 'do' devem vir antes das definições de membro e interface nas definições de tipos
ru: Привязки let и do должны располагаться до определений элементов и интерфейсов в определениях типов
tr: 'let' ve 'do' bağlamaları tür tanımlarında üye ve arabirim tanımlarından önce gelmelidir
zh_hans: “let”和“do”绑定在类型定义中必须处于成员和接口定义之前
zh_hant: 'let' 和 'do' 繫結必須在類型定義中的成員和介面定義的前面

# tcInheritDeclarationMissingArguments
source: This 'inherit' declaration specifies the inherited type but no arguments. Consider supplying arguments, e.g. 'inherit BaseType(args)'.
cs: Tato deklarace inherit specifikuje zděděný typ, ale ne argumenty. Zvažte možnost poskytnutí argumentů, třeba inherit BaseType(args).
de: Diese inherit-Deklaration gibt zwar den geerbten Typ an, aber keine Argumente. Stellen Sie ggf. Argumente bereit, z.B. "inherit BaseType(args)".
es: Esta declaración 'inherit' especifica el tipo heredado pero no argumentos. Considere proporcionar argumentos; por ejemplo, 'inherit BaseType(args)'.
fr: Cette déclaration 'inherit' spécifie le type hérité mais aucun argument. Fournissez des arguments, par exemple 'inherit BaseType(args)'.
it: La dichiarazione 'inherit' specifica il tipo ereditato, ma senza argomenti. Provare a specificare argomenti, ad esempio 'inherit BaseType(args)'.
ja: この 'inherit' 宣言は継承された型を指定していますが、引数がありません。引数を指定してください (たとえば、'inherit BaseType(args)')。
ko: 이 'inherit' 선언은 상속된 형식을 지정하지만 인수는 지정하지 않습니다. 인수를 제공하십시오(예: 'inherit BaseType(args)').
pl: Ta deklaracja „inherit” określa dziedziczony typ, ale nie określa argumentów. Rozważ określenie argumentów, na przykład „inherit TypPodstawowy(argumenty)”.
pt_br: Esta declaração 'inherit' especifica o tipo herdado, mas não especifica nenhum argumento. Considere fornecer argumentos, por exemplo 'inherit BaseType(args)'.
ru: Данное объявление "inherit" указывает унаследованный тип, и не указывает аргументов. Рекомендуется предоставить аргументы, напр. "inherit BaseType(args)".
tr: Bu 'inherit' bildirimi devralınan türü belirtiyor ancak hiç bağımsız değişken yok. Bağımsız değişkenleri sağlamayı düşünün, örn. 'inherit BaseType(args)'.
zh_hans: 此“inherit”声明指定继承的类型，但没有参数。请考虑提供参数，例如“inherit BaseType(args)”。
zh_hant: 這個 'inherit' 宣告指定繼承類型，但沒有引數。請考慮提供引數，例如 'inherit BaseType(args)'。

# tcInheritConstructionCallNotPartOfImplicitSequence
source: This 'inherit' declaration has arguments, but is not in a type with a primary constructor. Consider adding arguments to your type definition, e.g. 'type X(args) = ...'.
cs: Deklarace inherit má argumenty, ale není v typu s primárním konstruktorem. Zvažte možnost přidat do definice typu argumenty, třeba type X(args) = ...
de: Diese "inherit"-Daklaration hat Argumente, ist jedoch nicht in einem Typ mit einem primären Konstruktor. Ziehen Sie in Betracht, Argumente zur Typdefinition hinzuzufügen, z. B. "type X(args) = ...".
es: Esta declaración 'inherit' tiene argumentos, pero no está en un tipo con un constructor principal. Considere agregar argumentos a la definición de tipo, por ejemplo, 'type X(args) = ...'.
fr: Cette déclaration 'inherit' a des arguments, mais ne figure pas dans un type avec un constructeur principal. Ajoutez des arguments à votre définition de type, par exemple 'type X(args) = …'.
it: La dichiarazione 'inherit' contiene argomenti ma non è in un tipo con un costruttore primario. Provare ad aggiungere argomenti alla definizione di tipo utilizzata, ad esempio 'type X(args) = ...'.
ja: この 'inherit' 宣言には引数が含まれていますが、これはプライマリ コンストラクターを含む型ではありません。型定義に引数を追加してください (たとえば、'type X(args) = ...')。
ko: 이 'inherit' 선언은 인수를 포함하지만 기본 생성자가 포함된 형식이 아닙니다. 'type X(args) = ...'와 같이 형식 정의에 인수를 추가해 보세요.
pl: Ta deklaracja „inherit” zawiera argumenty, ale nie należy do typu z konstruktorem podstawowym. Rozważ dodanie argumentów do definicji typu, na przykład „type X(argumenty) = ...”.
pt_br: Esta declaração 'inherit' possui argumentos, mas não está em um tipo com um construtor primário. Considere adicionar argumentos à sua definição de tipo, por exemplo, 'type X(args) = ...'.
ru: Данное объявление inherit содержит аргументы, но не находится в типе с первичным конструктором. Попробуйте добавить в определение типа аргументы, напр. "type X(args) = ...".
tr: Bu 'inherit' bildiriminin bağımsız değişkenleri var, ancak birincil oluşturucuya sahip bir türde bulunmuyor. Tür tanımınıza bağımsız değişkenler eklemeyi düşünün, örn. 'type X(args) = ...'.
zh_hans: 此“inherit”声明具有参数，但是不在具有主构造函数的类型中。请考虑向您的类型定义添加参数，例如“type X(args) = ...”。
zh_hant: 這個 'inherit' 宣告具有引數，但不在含有主要建構函式的類型中。請考慮在您的類型定義加入引數，例如 'type X(args) = ...'。

# tcLetAndDoRequiresImplicitConstructionSequence
source: This definition may only be used in a type with a primary constructor. Consider adding arguments to your type definition, e.g. 'type X(args) = ...'.
cs: Tato definice se dá použít jenom u typu s primárním konstruktorem. Zvažte možnost přidat do definice typu argumenty, třeba type X(args) = ...
de: Diese Definition kann nur in einem Typ mit einem primären Konstruktor verwendet werden. Ziehen Sie in Betracht, Argumente zur Typdefinition hinzuzufügen, z.B. "type X(args) = ...".
es: Esta definición se puede usar solo en un tipo con un constructor principal. Considere agregar argumentos a la definición de tipo, por ejemplo, 'type X(args) = ...'.
fr: Cette définition ne peut être utilisée que dans un type avec un constructeur principal. Ajoutez des arguments à votre définition de type, par exemple, e.g. 'type X(args) =…'.
it: Questa definizione può essere utilizzata solo in un tipo con un costruttore primario. Provare ad aggiungere argomenti alla definizione di tipo utilizzata, ad esempio 'type X(args) = ...'.
ja: この定義は、プライマリ コンストラクターを含む型でのみ使用できます。型定義に引数を追加してください (たとえば、'type X(args) = ...')。
ko: 이 정의는 기본 생성자가 포함된 형식에서만 사용할 수 있습니다. 'type X(args) = ...'와 같이 형식 정의에 인수를 추가해 보세요.
pl: Ta definicja może być używana tylko w typie z konstruktorem podstawowym. Rozważ dodanie argumentów do definicji typu, na przykład „type X(args) = ...”.
pt_br: Esta definição só pode ser usada em um tipo com um construtor primário. Considere adicionar argumentos à sua definição de tipo, por exemplo, 'type X(args) = ...'.
ru: Это определение можно использовать только в типе с первичным конструктором. Попробуйте добавить в определение типа аргумент, напр. "type X(args) = ...".
tr: Bu tanım yalnızca birincil oluşturucusu olan bir türde kullanılabilir. Tür tanımınıza bağımsız değişkenler eklemeyi düşünün, örn. 'type X(args) = ...'.
zh_hans: 此定义只能在具有主构造函数的类型中使用。请考虑向您的类型定义添加参数，例如“type X(args) = ...”。
zh_hant: 這個定義只能用於含有主要建構函式的類型中。請考慮在您的類型定義加入引數，例如 'type X(args) = ...'。

# tcTypeAbbreviationsCannotHaveAugmentations
source: Type abbreviations cannot have augmentations
cs: Zkratky typů nemůžou mít rozšíření.
de: Typabkürzungen dürfen keine Augmentationen aufweisen.
es: Las abreviaciones de tipo no pueden tener aumentos.
fr: Les abréviations de type ne peuvent pas avoir d'augmentations
it: Le abbreviazioni di tipo non possono avere aumenti
ja: 型略称に拡張を含めることはできません
ko: 형식 약어에는 확대를 지정할 수 없습니다.
pl: Skróty typów nie mogą mieć rozszerzeń
pt_br: Abreviações de tipo não podem ter aumentos
ru: Сокращения типов не могут иметь приращений
tr: Tür kısaltmalarının genişletmeleri olamaz
zh_hans: 类型缩写词不能具有扩大
zh_hant: 類型縮寫不能有增強指定

# tcModuleAbbreviationForNamespace
source: The path '{0}' is a namespace. A module abbreviation may not abbreviate a namespace.
cs: Cesta {0} je obor názvů. Zkratka modulu nemůže zkracovat obor názvů.
de: Der Pfad "{0}" ist ein Namespace. Eine Modulabkürzung darf nicht zum Abkürzen von Namespaces verwendet werden.
es: La ruta de acceso '{0}' es un espacio de nombres. Una abreviación de módulo no puede abreviar un espacio de nombres.
fr: Le chemin '{0}' est un espace de noms. Une abréviation de module ne peut pas être abrégée en espace de noms.
it: Il percorso '{0}' è uno spazio dei nomi. L'abbreviazione del modulo non può abbreviare uno spazio dei nomi.
ja: パス '{0}' は名前空間です。モジュールの省略形は名前空間の省略形にはできません。
ko: '{0}' 경로가 네임스페이스입니다. 모듈 약어가 네임스페이스의 약어가 아닐 수 있습니다.
pl: Ścieżka „{0}” jest przestrzenią nazw. Skrót modułu nie może zawierać skrótu przestrzeni nazw.
pt_br: O caminho '{0}' é um namespace. Uma abreviação de módulo não pode abreviar um namespace.
ru: Путь {0} указывает на пространство имен. Сокращение модуля не может уменьшать длину пространства имен.
tr: '{0}' yolu bir ad alanı. Modül kısaltması bir ad alanını kısaltamaz.
zh_hans: 路径“{0}”是一个命名空间。模块缩写词可能不会缩写命名空间。
zh_hant: 路徑 '{0}' 是命名空間。模組縮寫不可用來縮寫命名空間。

# tcTypeUsedInInvalidWay
source: The type '{0}' is used in an invalid way. A value prior to '{1}' has an inferred type involving '{2}', which is an invalid forward reference.
cs: Typ {0} se používá neplatným způsobem. Hodnota před pozicí {1} má odvozený typ zahrnující {2}: to je neplatný dopředný odkaz.
de: Die Verwendung des Typs "{0}" ist ungültig. Ein Wert vor "{1}" hat einen per Rückschluss abgeleiteten Typ mit "{2}"; dies ist ein ungültiger Vorwärtsverweis.
es: El tipo '{0}' se usa de un modo no válido. Un valor anterior a '{1}' tiene un tipo inferido que implica '{2}', que es una referencia adelantada no válida.
fr: Le type '{0}' est utilisé de manière incorrecte. Une valeur antérieure à '{1}' a un type déduit qui implique '{2}', qui est une référence anticipée non valide.
it: Il tipo '{0}' è utilizzato in modo non valido. Un valore prima di '{1}' ha un tipo dedotto che prevede '{2}', il che costituisce un riferimento in avanti non valido.
ja: 型 '{0}' の使用方法に誤りがあります。'{1}' の前の値に、'{2}' と推論されるような型があります。これは無効な前方参照です。
ko: {0}' 형식이 잘못된 방식으로 사용되었습니다. '{1}' 앞에 있는 값에 '{2}'을(를) 사용하는 유추 형식이 있습니다. 이는 잘못된 전방 참조입니다.
pl: Typ „{0}” jest używany w nieprawidłowy sposób. Wartość przed elementem „{1}” ma wywnioskowany typ dotyczący elementu „{2}”, który jest nieprawidłowym odwołaniem w przód.
pt_br: O tipo '{0}' é usado de forma inválida. Um valor anterior a '{1}' possui um tipo inferido envolvendo '{2}', que é uma referencia de encaminhamento inválida.
ru: Тип "{0}" используется недопустимо. Значение перед "{1}" имеет логически выведенный тип, включающий "{2}", что является недопустимой короткой ссылкой.
tr: {0}' türü geçersiz biçimde kullanılmış. '{1}' öğesinden önceki bir değer '{2}' içeren çıkarılmış türüne sahip, bu geçersiz bir ileriye doğru başvurudur.
zh_hans: 类型“{0}”的使用方式无效。“{1}”之前的值具有一个与“{2}”相关的推理类型，这是无效的前向引用。
zh_hant: 類型 '{0}' 的使用方式無效。在 '{1}' 之前的值具有涉及 '{2}' 的推斷類型，這是無效的向前參考。

# tcMemberUsedInInvalidWay
source: The member '{0}' is used in an invalid way. A use of '{1}' has been inferred prior to the definition of '{2}', which is an invalid forward reference.
cs: Člen {0} se používá neplatným způsobem. Použití {1} se odvozuje před definicí {2}. To je neplatný dopředný odkaz.
de: Die Verwendung des Members "{0}" ist ungültig. Die Verwendung von "{1}" wurde vor der Definition von "{2}" per Rückschluss abgeleitet; dies ist ein ungültiger Vorwärtsverweis.
es: El miembro '{0}' se usa de forma no válida. Se ha inferido un uso de '{1}' antes que la definición de '{2}', que es una referencia adelantada no válida.
fr: Le membre '{0}' est utilisé de manière incorrecte. Une utilisation de '{1}' a été déduite avant la définition de '{2}'. Il s'agit d'une référence anticipée non valide.
it: Il membro '{0}' è utilizzato in modo non valido. Uso di '{1}' dedotto prima della definizione di '{2}', il che costituisce un riferimento in avanti non valido.
ja: メンバー '{0}' の使用方法に誤りがあります。'{2}' の定義の前に '{1}' の使用が推論されました。これは無効な前方参照です。
ko: {0}' 멤버가 잘못된 방식으로 사용되었습니다. '{2}'이(가) 정의되기 전에 '{1}'의 사용이 유추되었습니다. 이는 잘못된 전방 참조입니다.
pl: Element członkowski „{0}” jest używany w nieprawidłowy sposób. Użycie elementu „{1}” zostało wywnioskowane przed definicją elementu „{2}”, co jest nieprawidłowym odwołaniem w przód.
pt_br: O membro '{0}' é usado de forma inválida. Um uso de '{1}' possui inferência anterior à definição de '{2}', que é uma referência de encaminhamento inválida.
ru: Элемент "{0}" используется недопустимо. Использование "{1}" было логически выведено перед определением "{2}", что является недопустимой короткой ссылкой.
tr: {0}' üyesi geçersiz bir biçimde kullanılmış. '{1}' kullanımı, '{2}' tanımından önce çıkarılmış, bu geçersiz bir ileriye doğru başvurudur.
zh_hans: 成员“{0}”的使用方式无效。在给出“{2}”的定义之前，已推理出“{1}”的用法，这是无效的前向引用。
zh_hant: 成員 '{0}' 的使用方式無效。系統推斷 '{1}' 在 '{2}' 的定義之前已經使用過，這是無效的向前參考。
