Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# lexCharNotAllowedInOperatorNames
source: '{0}' is not permitted as a character in operator names and is reserved for future use
cs: Znak {0} není v názvech operátorů povolený: je vyhrazený pro budoucí použití.
de: {0} darf nicht in Operatornamen verwendet werden und ist für eine zukünftige Verwendung reserviert.
es: '{0}' no se permite como carácter en nombres de operador y está reservado para uso futuro.
fr: '{0}' n'est pas autorisé en tant que caractère dans les noms d'opérateurs et est réservé pour un usage futur
it: '{0}' non è consentito come carattere nei nomi degli operatori ed è riservato per utilizzi futuri
ja: '{0}' は演算子名の文字として使用できません。将来利用するために予約されています
ko: '{0}'은(는) 연산자 이름에서 허용되는 문자가 아니며 나중에 사용할 수 있도록 예약되었습니다.
pl: Znak „{0}” jest niedozwolony w nazwach operatora i zarezerwowany do użytku w przyszłości
pt_br: '{0}' não é permitido como um caractere em nomes de operadores e está reservado para uso futuro
ru: {0} не может использоваться в качестве знака в именах операторов и зарезервирован для будущего использования
tr: İşleç adlarında karakter olarak '{0}' kullanılmasına izin verilmez; ileride kullanılmak üzere ayrılmıştır
zh_hans: 不允许将“{0}”作为运算符名称中的字符，已将其保留以供将来使用
zh_hant: 不允許將 '{0}' 當做運算子名稱中的字元，它已保留供未來使用

# lexUnexpectedChar
source: Unexpected character '{0}'
cs: Neočekávaný znak {0}
de: Unerwartetes Zeichen "{0}".
es: Carácter '{0}' inesperado.
fr: Caractère inattendu '{0}'
it: Il carattere '{0}' è imprevisto
ja: 予期しない文字 '{0}'
ko: 예기치 않은 '{0}' 문자입니다.
pl: Nieoczekiwany znak „{0}”
pt_br: Caractere inesperado '{0}'
ru: Недопустимый символ "{0}".
tr: Beklenmeyen karakter: '{0}'
zh_hans: 意外的字符“{0}”
zh_hant: 未預期的字元 '{0}'

# lexByteArrayCannotEncode
source: This byte array literal contains characters that do not encode as a single byte
cs: Tento literál bajtového pole obsahuje znaky, které se nekódují jako jednobajtové.
de: Dieses Bytearrayliteral enthält Zeichen, die sich nicht als einzelnes Byte codieren lassen.
es: Este literal de matriz de bytes contiene caracteres que no se codifican como un solo byte.
fr: Ce littéral de tableau d'octets contient des caractères qui ne sont pas encodés sous forme d'octet unique
it: Questo valore letterale della matrice di byte contiene caratteri non codificabili come singoli byte
ja: このバイト配列リテラルには、シングル バイトとしてエンコードされない文字が含まれます
ko: 이 바이트 배열 리터럴에는 단일 바이트로 인코딩되지 않는 문자가 포함되어 있습니다.
pl: Ten literał tablicy bajtowej zawiera znaki, które nie są kodowane jako pojedynczy bajt
pt_br: Este literal matriz de byte contém caracteres não codificados como um byte simples
ru: Этот литерал массива байтов содержит знаки, не поддерживающие однобайтовую кодировку
tr: Bu bayt dizisi sabit değeri tek bayt olarak kodlanmayan karakterler içeriyor
zh_hans: 此字节数组文本包含不会以单字节形式进行编码的字符
zh_hant: 這個位元組陣列常值包含不會編碼成單一位元組的字元

# lexIdentEndInMarkReserved
source: Identifiers followed by '{0}' are reserved for future use
cs: Identifikátory, po kterých následuje {0}, jsou vyhrazené pro budoucí použití.
de: Bezeichner, auf die "{0}" folgt, sind für die zukünftige Verwendung reserviert.
es: Los identificadores seguidos de '{0}' están reservados para uso futuro.
fr: Les identificateurs suivis de '{0}' sont réservés pour un usage futur
it: Gli identificatori seguiti da '{0}' sono riservati per utilizzi futuri
ja: '{0}' が続く識別子は将来利用するために予約されています
ko: 식별자 다음에 '{0}'이(가) 있는 형식은 나중에 사용할 수 있도록 예약되었습니다.
pl: Identyfikatory, po których następuje „{0}”, są zarezerwowane do użytku w przyszłości
pt_br: Os identificadores seguidos por '{0}' são reservados para uso futuro
ru: Идентификаторы, после которых следует "{0}", зарезервированы для будущего использования
tr: Ardından '{0}' gelen tanımlayıcılar ileride kullanılmak üzere ayrılmıştır
zh_hans: 已保留后跟“{0}”的标识符以供将来使用
zh_hant: 後面接著 '{0}' 的識別碼已保留供未來使用

# lexOutsideEightBitSigned
source: This number is outside the allowable range for 8-bit signed integers
cs: Toto číslo je mimo povolený rozsah pro 8bitová celá čísla se znaménkem.
de: Diese Zahl liegt außerhalb des zulässigen Bereichs für 8-Bit-Integer mit Vorzeichen.
es: Este número está fuera del intervalo permitido para enteros firmados de 8 bits.
fr: Ce nombre se trouve en dehors de la plage autorisée pour les entiers signés 8 bits
it: Questo numero non è compreso nell'intervallo consentito per interi con segno a 8 bit
ja: この数値は、8 ビット符号付き整数に使用できる範囲から外れています
ko: 이 숫자는 부호 있는 8비트 정수에 대해 허용 가능한 범위를 벗어납니다.
pl: Ta liczba jest poza dozwolonym zakresem 8-bitowych liczb całkowitych ze znakiem
pt_br: Este número está fora do intervalo permitido para inteiros de 8-bit com sinal
ru: Это число находится вне допустимого диапазона для 8-битных целых чисел со знаком
tr: Bu sayı, 8 bit işaretli tamsayılar için izin verilen aralığın dışında
zh_hans: 此数字在允许的 8 位带符号整数范围之外
zh_hant: 這個數字已經超出 8 位元有正負號整數允許的範圍

# lexOutsideEightBitSignedHex
source: This number is outside the allowable range for hexadecimal 8-bit signed integers
cs: Toto číslo je mimo povolený rozsah pro šestnáctková 8bitová celá čísla se znaménkem.
de: Diese Zahl liegt außerhalb des zulässigen Bereichs für hexadezimale 8-Bit-Integer mit Vorzeichen.
es: Este número está fuera del intervalo permitido para enteros firmados de 8 bits hexadecimales.
fr: Ce nombre se trouve en dehors de la plage autorisée pour les entiers signés 8 bits hexadécimaux
it: Questo numero non è compreso nell'intervallo consentito per interi con segno a 8 bit esadecimali
ja: この数値は、16 進 8 ビット符号付き整数に使用できる範囲から外れています
ko: 이 숫자는 부호 있는 16진수 8비트 정수에 대해 허용 가능한 범위를 벗어납니다.
pl: Ta liczba jest poza dozwolonym zakresem szesnastkowych, 8-bitowych liczb całkowitych ze znakiem
pt_br: Este número está fora do intervalo permitido para inteiros hexadecimais de 8-bit com sinal
ru: Это число находится вне допустимого диапазона для 8-битных шестнадцатеричных целых чисел со знаком
tr: Bu sayı, onaltılık 8 bit işaretli tamsayılar için izin verilen aralığın dışında
zh_hans: 此数字在允许的十六进制 8 位带符号整数范围之外
zh_hant: 這個數字已經超出十六進位 8 位元有正負號整數允許的範圍

# lexOutsideEightBitUnsigned
source: This number is outside the allowable range for 8-bit unsigned integers
cs: Toto číslo je mimo povolený rozsah pro 8bitová celá čísla bez znaménka.
de: Diese Zahl liegt außerhalb des zulässigen Bereichs für 8-Bit-Integer ohne Vorzeichen.
es: Este número está fuera del intervalo permitido para enteros no firmados de 8 bits.
fr: Ce nombre se trouve en dehors de la plage autorisée pour les entiers non signés 8 bits
it: Questo numero non è compreso nell'intervallo consentito per interi senza segno a 8 bit
ja: この数値は、8 ビット符号なし整数に使用できる範囲から外れています
ko: 이 숫자는 부호 없는 8비트 정수에 대해 허용 가능한 범위를 벗어납니다.
pl: Ta liczba jest poza dozwolonym zakresem 8-bitowych liczb całkowitych bez znaku
pt_br: Este número está fora do intervalo permitido para inteiros de 8-bit sem sinal
ru: Это число находится вне допустимого диапазона для 8-битных целых чисел без знака
tr: Bu sayı, 8 bit işaretsiz tamsayılar için izin verilen aralığın dışında
zh_hans: 此数字在允许的 8 位无符号整数范围之外
zh_hant: 這個數字已經超出 8 位元無正負號整數允許的範圍

# lexOutsideSixteenBitSigned
source: This number is outside the allowable range for 16-bit signed integers
cs: Toto číslo je mimo povolený rozsah pro 16bitová celá čísla se znaménkem.
de: Diese Zahl liegt außerhalb des zulässigen Bereichs für 16-Bit-Integer mit Vorzeichen.
es: Este número está fuera del intervalo permitido para enteros firmados de 16 bits.
fr: Ce nombre se trouve en dehors de la plage autorisée pour les entiers signés 16 bits
it: Questo numero non è compreso nell'intervallo consentito per interi con segno a 16 bit
ja: この数値は、16 ビット符号付き整数に使用できる範囲から外れています
ko: 이 숫자는 부호 있는 16비트 정수에 대해 허용 가능한 범위를 벗어납니다.
pl: Ta liczba jest poza dozwolonym zakresem 16-bitowych liczb całkowitych ze znakiem
pt_br: Este número está fora do intervalo permitido para inteiros de 16-bit com sinal
ru: Это число находится вне допустимого диапазона для 16-битных целых чисел со знаком
tr: Bu sayı, 16 bit işaretli tamsayılar için izin verilen aralığın dışında
zh_hans: 此数字在允许的 16 位带符号整数范围之外
zh_hant: 這個數字已經超出 16 位元有正負號整數允許的範圍

# lexOutsideSixteenBitUnsigned
source: This number is outside the allowable range for 16-bit unsigned integers
cs: Toto číslo je mimo povolený rozsah pro 16bitová celá čísla bez znaménka.
de: Diese Zahl liegt außerhalb des zulässigen Bereichs für 16-Bit-Integer ohne Vorzeichen.
es: Este número está fuera del intervalo permitido para enteros no firmados de 16 bits.
fr: Ce nombre se trouve en dehors de la plage autorisée pour les entiers non signés 16 bits
it: Questo numero non è compreso nell'intervallo consentito per interi senza segno a 16 bit
ja: この数値は、16 ビット符号なし整数に使用できる範囲から外れています
ko: 이 숫자는 부호 없는 16비트 정수에 대해 허용 가능한 범위를 벗어납니다.
pl: Ta liczba jest poza dozwolonym zakresem 16-bitowych liczb całkowitych bez znaku
pt_br: Este número está fora do intervalo permitido para inteiros de 16-bit sem sinal
ru: Это число находится вне допустимого диапазона для 16-битных целых чисел без знака
tr: Bu sayı, 16 bit işaretsiz tamsayılar için izin verilen aralığın dışında
zh_hans: 此数字在允许的 16 位无符号整数范围之外
zh_hant: 這個數字已經超出 16 位元無正負號整數允許的範圍

# lexOutsideThirtyTwoBitSigned
source: This number is outside the allowable range for 32-bit signed integers
cs: Toto číslo je mimo povolený rozsah pro 32bitová celá čísla se znaménkem.
de: Diese Zahl liegt außerhalb des zulässigen Bereichs für 32-Bit-Integer mit Vorzeichen.
es: Este número está fuera del intervalo permitido para enteros firmados de 32 bits.
fr: Ce nombre se trouve en dehors de la plage autorisée pour les entiers signés 32 bits
it: Questo numero non è compreso nell'intervallo consentito per interi con segno a 32 bit
ja: この数値は、32 ビット符号付き整数に使用できる範囲から外れています
ko: 이 숫자는 부호 있는 32비트 정수에 대해 허용 가능한 범위를 벗어납니다.
pl: Ta liczba jest poza dozwolonym zakresem 32-bitowych liczb całkowitych ze znakiem
pt_br: Este número está fora do intervalo permitido para inteiros de 32-bit com sinal
ru: Это число находится вне допустимого диапазона для 32-битных целых чисел со знаком
tr: Bu sayı, 32 bit işaretli tamsayılar için izin verilen aralığın dışında
zh_hans: 此数字在允许的 32 位带符号整数范围之外
zh_hant: 這個數字已經超出 32 位元有正負號整數允許的範圍

# lexOutsideThirtyTwoBitUnsigned
source: This number is outside the allowable range for 32-bit unsigned integers
cs: Toto číslo je mimo povolený rozsah pro 32bitová celá čísla bez znaménka.
de: Diese Zahl liegt außerhalb des zulässigen Bereichs für 32-Bit-Integer ohne Vorzeichen.
es: Este número está fuera del intervalo permitido para enteros no firmados de 32 bits.
fr: Ce nombre se trouve en dehors de la plage autorisée pour les entiers non signés 32 bits
it: Questo numero non è compreso nell'intervallo consentito per interi senza segno a 32 bit
ja: この数値は、32 ビット符号なし整数に使用できる範囲から外れています
ko: 이 숫자는 부호 없는 32비트 정수에 대해 허용 가능한 범위를 벗어납니다.
pl: Ta liczba jest poza dozwolonym zakresem 32-bitowych liczb całkowitych bez znaku
pt_br: Este número está fora do intervalo permitido para inteiros de 32-bit sem sinal
ru: Это число находится вне допустимого диапазона для 32-битных целых чисел без знака
tr: Bu sayı, 32 bit işaretsiz tamsayılar için izin verilen aralığın dışında
zh_hans: 此数字在允许的 32 位无符号整数范围之外
zh_hant: 這個數字已經超出 32 位元無正負號整數允許的範圍

# lexOutsideSixtyFourBitSigned
source: This number is outside the allowable range for 64-bit signed integers
cs: Toto číslo je mimo povolený rozsah pro 64bitová celá čísla se znaménkem.
de: Diese Zahl liegt außerhalb des zulässigen Bereichs für 64-Bit-Integer mit Vorzeichen.
es: Este número está fuera del intervalo permitido para enteros firmados de 64 bits.
fr: Ce nombre se trouve en dehors de la plage autorisée pour les entiers signés 64 bits
it: Questo numero non è compreso nell'intervallo consentito per interi con segno a 64 bit
ja: この数値は、64 ビット符号付き整数に使用できる範囲から外れています
ko: 이 숫자는 부호 있는 64비트 정수에 대해 허용 가능한 범위를 벗어납니다.
pl: Ta liczba jest poza dozwolonym zakresem 64-bitowych liczb całkowitych ze znakiem
pt_br: Este número está fora do intervalo permitido para inteiros de 64-bit com sinal
ru: Это число находится вне допустимого диапазона для 64-битных целых чисел со знаком
tr: Bu sayı, 64 bit işaretli tamsayılar için izin verilen aralığın dışında
zh_hans: 此数字在允许的 64 位带符号整数范围之外
zh_hant: 這個數字已經超出 64 位元有正負號整數允許的範圍

# lexOutsideSixtyFourBitUnsigned
source: This number is outside the allowable range for 64-bit unsigned integers
cs: Toto číslo je mimo povolený rozsah pro 64bitová celá čísla bez znaménka.
de: Diese Zahl liegt außerhalb des zulässigen Bereichs für 64-Bit-Integer ohne Vorzeichen.
es: Este número está fuera del intervalo permitido para enteros no firmados de 64 bits.
fr: Ce nombre se trouve en dehors de la plage autorisée pour les entiers non signés 64 bits
it: Questo numero non è compreso nell'intervallo consentito per interi senza segno a 64 bit
ja: この数値は、64 ビット符号なし整数に使用できる範囲から外れています
ko: 이 숫자는 부호 없는 64비트 정수에 대해 허용 가능한 범위를 벗어납니다.
pl: Ta liczba jest poza dozwolonym zakresem 64-bitowych liczb całkowitych bez znaku
pt_br: Este número está fora do intervalo permitido para inteiros de 64-bit sem sinal
ru: Это число находится вне допустимого диапазона для 64-битных целых чисел без знака
tr: Bu sayı, 64 bit işaretsiz tamsayılar için izin verilen aralığın dışında
zh_hans: 此数字在允许的 64 位无符号整数范围之外
zh_hant: 這個數字已經超出 64 位元無正負號整數允許的範圍

# lexOutsideNativeSigned
source: This number is outside the allowable range for signed native integers
cs: Toto číslo je mimo povolený rozsah pro nativní celá čísla se znaménkem.
de: Diese Zahl liegt außerhalb des zulässigen Bereichs für native Integer mit Vorzeichen.
es: Este número está fuera del intervalo permitido para enteros nativos firmados.
fr: Ce nombre se trouve en dehors de la plage autorisée pour les entiers natifs signés
it: Questo numero non è compreso nell'intervallo consentito per interi con segno nativi
ja: この数値は、符号付きネイティブ整数に使用できる範囲から外れています
ko: 이 숫자는 부호 있는 원시 정수에 대해 허용 가능한 범위를 벗어납니다.
pl: Ta liczba jest poza dozwolonym zakresem natywnych liczb całkowitych ze znakiem
pt_br: Este número está fora do intervalo permitido para inteiros nativos com sinal
ru: Это число находится вне допустимого диапазона для собственных целых чисел со знаком
tr: Bu sayı, işaretli yerel tamsayılar için izin verilen aralığın dışında
zh_hans: 此数字在允许的带符号本机整数范围之外
zh_hant: 這個數字已經超出有正負號原生整數允許的範圍

# lexOutsideNativeUnsigned
source: This number is outside the allowable range for unsigned native integers
cs: Toto číslo je mimo povolený rozsah pro nativní celá čísla bez znaménka.
de: Diese Zahl liegt außerhalb des zulässigen Bereichs für native Integer ohne Vorzeichen.
es: Este número está fuera del intervalo permitido para enteros nativos no firmados.
fr: Ce nombre se trouve en dehors de la plage autorisée pour les entiers natifs non signés
it: Questo numero non è compreso nell'intervallo consentito per interi senza segno nativi
ja: この数値は、符号なしネイティブ整数に使用できる範囲から外れています
ko: 이 숫자는 부호 없는 원시 정수에 대해 허용 가능한 범위를 벗어납니다.
pl: Ta liczba jest poza dozwolonym zakresem natywnych liczb całkowitych bez znaku
pt_br: Este número está fora do intervalo permitido para inteiros nativos sem sinal
ru: Это число находится вне допустимого диапазона для собственных целых чисел без знака
tr: Bu sayı, işaretsiz yerel tamsayılar için izin verilen aralığın dışında
zh_hans: 此数字在允许的无符号本机整数范围之外
zh_hant: 這個數字已經超出無正負號原生整數允許的範圍

# lexInvalidFloat
source: Invalid floating point number
cs: Neplatné číslo s plovoucí desetinnou čárkou
de: Ungültige Gleitkommazahl.
es: Número de punto flotante no válido.
fr: Nombre à virgule flottante non valide
it: Numero a virgola mobile non valido
ja: 浮動小数点数が無効です
ko: 부동 소수점 수가 잘못되었습니다.
pl: Nieprawidłowa liczba zmiennoprzecinkowa
pt_br: Número do ponto flutuante inválido
ru: Недопустимое число с плавающей точкой
tr: Geçersiz kayan noktalı sayı
zh_hans: 浮点数无效
zh_hant: 無效的浮點數

# lexOusideDecimal
source: This number is outside the allowable range for decimal literals
cs: Toto číslo je mimo povolený rozsah pro desítkové literály.
de: Diese Zahl liegt außerhalb des zulässigen Bereichs für Dezimalliterale.
es: Este número está fuera del intervalo permitido para literales decimales.
fr: Ce nombre se trouve en dehors de la plage autorisée pour les littéraux décimaux
it: Questo numero non è compreso nell'intervallo consentito per valori letterali decimali
ja: この数値は、10 進リテラルに使用できる範囲から外れています
ko: 이 숫자는 10진 리터럴에 대해 허용 가능한 범위를 벗어납니다.
pl: Ta liczba jest poza dozwolonym zakresem literałów dziesiętnych
pt_br: Este número está fora do intervalo permitido para literais decimais
ru: Это число находится вне допустимого диапазона для десятичных литералов
tr: Bu sayı, ondalık sabit değerleri için izin verilen aralığın dışında
zh_hans: 此数字在允许的十进制文本范围之外
zh_hant: 這個數字已經超出十進位常值允許的範圍

# lexOusideThirtyTwoBitFloat
source: This number is outside the allowable range for 32-bit floats
cs: Toto číslo je mimo povolený rozsah pro 32bitové číslo s plovoucí desetinnou čárkou.
de: Diese Zahl liegt außerhalb des zulässigen Bereichs für 32-Bit-Gleitkommastellen.
es: Este número está fuera del intervalo permitido para flotantes de 32 bits.
fr: Ce nombre se trouve en dehors de la plage autorisée pour les valeurs float 32 bits
it: Questo numero non è compreso nell'intervallo consentito per valori float a 32 bit
ja: この数値は、32 ビット浮動小数点に使用できる範囲から外れています
ko: 이 숫자는 32비트 부동 수에 대해 허용 가능한 범위를 벗어납니다.
pl: Ta liczba jest poza dozwolonym zakresem 32-bitowych liczb zmiennoprzecinkowych
pt_br: Este número está fora do intervalo permitido para floats de 32-bit
ru: Это число находится вне допустимого диапазона для 32-битных чисел с плавающей точкой
tr: Bu sayı, 32 bit kayan noktalı sayılar için izin verilen aralığın dışında
zh_hans: 此数字在允许的 32 位浮点数范围之外
zh_hant: 這個數字已經超出 32 位元浮點數允許的範圍

# lexInvalidNumericLiteral
source: This is not a valid numeric literal. Valid numeric literals include 1, 0x1, 0o1, 0b1, 1l (int), 1u (uint32), 1L (int64), 1UL (uint64), 1s (int16), 1y (sbyte), 1uy (byte), 1.0 (float), 1.0f (float32), 1.0m (decimal), 1I (BigInteger).
cs: Toto není platný číselný literál. Mezi platné číselné literály patří 1, 0x1, 0o1, 0b1, 1l (int), 1u (uint32), 1L (int64), 1UL (uint64), 1s (int16), 1y (sbyte), 1uy (byte), 1.0 (float), 1.0f (float32), 1.0m (decimal), 1I (BigInteger).
de: Dies ist kein gültiges numerisches Literal. Unter anderem sind die folgenden numerischen Literale gültig: 1, 0x1, 0o1, 0b1, 1l (int), 1u (uint32), 1L (int64), 1UL (uint64), 1s (int16), 1y (sbyte), 1uy (byte), 1.0 (float), 1.0f (float32), 1.0m (decimal), 1I (BigInteger).
es: Este literal numérico no es válido. Entre los literales numéricos válidos se incluyen 1, 0x1, 0o1, 0b1, 1l (int), 1u (uint32), 1L (int64), 1UL (uint64), 1s (int16), 1y (sbyte), 1uy (byte), 1.0 (float), 1.0f (float32), 1.0m (decimal) y 1I (BigInteger).
fr: Littéral numérique non valide. Littéraux numériques valides : 1, 0x1, 0o1, 0b1, 1l (int), 1u (uint32), 1L (int64), 1UL (uint64), 1s (int16), 1y (sbyte), 1uy (byte), 1.0 (float), 1.0f (float32), 1.0m (decimal), 1I (BigInteger).
it: Questo non è un valore letterale numerico valido. I valori letterali numerici validi includono 1, 0x1, 0o1, 0b1, 1l (int), 1u (uint32), 1L (int64), 1UL (uint64), 1s (int16), 1y (sbyte), 1uy (byte), 1.0 (float), 1.0f (float32), 1.0m (decimal), 1I (BigInteger).
ja: これは有効な数値リテラルではありません。有効な数値リテラルの例には、1、0x1、0o1、0b1、1l (int)、1u (uint32)、1L (int64)、1UL (uint64)、1s (int16)、1y (sbyte)、1uy (byte)、1.0 (float)、1.0f (float32)、1.0m (decimal)、1I (BigInteger) などがあります。
ko: 유효한 숫자 리터럴이 아닙니다. 유효한 숫자 리터럴로는 1, 0x1, 0o1, 0b1, 1l(int), 1u(uint32), 1L(int64), 1UL(uint64), 1s(int16), 1y(sbyte), 1uy(byte), 1.0(float), 1.0f(float32), 1.0m(decimal), 1I(BigInteger) 등이 있습니다.
pl: Jest to nieprawidłowy literał liczbowy. Do prawidłowych literałów liczbowych należą: 1, 0x1, 0o1, 0b1, 1l (int), 1u (uint32), 1L (int64), 1UL (uint64), 1s (int16), 1y (sbyte), 1uy (byte), 1.0 (float), 1.0f (float32), 1.0m (decimal), 1I (BigInteger).
pt_br: Este não é um literal numérico válido. Literais numéricos válidos incluem 1, 0x1, 0o1, 0b1, 1l (int), 1u (uint32), 1L (int64), 1UL (uint64), 1s (int16), 1y (sbyte), 1uy (byte), 1.0 (float), 1.0f (float32), 1.0m (decimal), 1I (BigInteger).
ru: Это не является допустимым числовым литералом. Допустимые числовые литералы: 1, 0x1, 0o1, 0b1, 1l (int), 1u (uint32), 1L (int64), 1UL (uint64), 1s (int16), 1y (sbyte), 1uy (byte), 1.0 (float), 1.0f (float32), 1.0m (decimal), 1I (BigInteger).
tr: Bu geçerli bir sayısal sabit değer değil. Geçerli sayısal sabit değerler şunları içerir: 1, 0x1, 0o1, 0b1, 1l (int), 1u (uint32), 1L (int64), 1UL (uint64), 1s (int16), 1y (sbyte), 1uy (byte), 1.0 (float), 1.0f (float32), 1.0m (decimal), 1I (BigInteger).
zh_hans: 这不是有效的数字文本。有效的数字文本包括 1、0x1、0o1、0b1、1l (int)、1u (uint32)、1L (int64)、1UL (uint64)、1s (int16)、1y (sbyte)、1uy (byte)、1.0 (float)、1.0f (float32)、1.0m (decimal)、1I (BigInteger)。
zh_hant: 這不是有效的數值常值。有效的數值常值包括 1、0x1、0o1、0b1、1l (int)、1u (uint32)、1L (int64)、1UL (uint64)、1s (int16)、1y (sbyte)、1uy (byte)、1.0 (float)、1.0f (float32)、1.0m (decimal)、1I (BigInteger)。

# lexInvalidByteLiteral
source: This is not a valid byte literal
cs: Toto není platný bajtový literál.
de: Dies ist kein gültiges Byteliteral.
es: Este no es un literal de byte válido.
fr: Littéral d'octet non valide
it: Valore letterale byte non valido
ja: これは有効なバイト リテラルではありません
ko: 올바른 바이트 리터럴이 아닙니다.
pl: Nie jest to prawidłowy literał bajtowy
pt_br: Este não é um literal de byte válido
ru: Не является допустимым байтовым литералом.
tr: Bu geçerli bir bayt sabit değeri değil
zh_hans: 这不是有效的字节文本
zh_hant: 這不是有效的位元組常值

# lexInvalidCharLiteral
source: This is not a valid character literal
cs: Toto není platný znakový literál.
de: Dies ist kein gültiges Zeichenliteral.
es: Este no es un literal de carácter válido.
fr: Littéral de caractère non valide
it: Valore letterale carattere non valido
ja: これは有効な文字リテラルではありません
ko: 올바른 문자 리터럴이 아닙니다.
pl: Nie jest to prawidłowy literał znakowy
pt_br: Este não é um literal de caractere válido
ru: Не является допустимым символьным литералом.
tr: Bu geçerli bir karakter sabit değeri değil
zh_hans: 这不是有效的字符文本
zh_hant: 這不是有效的字元常值

# lexThisUnicodeOnlyInStringLiterals
source: This Unicode encoding is only valid in string literals
cs: Toto kódování Unicode je platné jenom u řetězcových literálů.
de: Diese Unicode-Codierung ist nur für Zeichenfolgenliterale zulässig.
es: Esta codificación Unicode es válida solo en literales de cadena.
fr: Cet encodage Unicode est uniquement valide dans les littéraux de chaîne
it: Questa codifica Unicode è valida solo in valori letterali stringa
ja: この Unicode エンコーディングが有効なのはリテラル文字列内のみです
ko: 이 유니코드 인코딩은 문자열 리터럴에서만 올바릅니다.
pl: To kodowanie Unicode jest prawidłowe tylko w literałach ciągu
pt_br: Esta codificação Unicode só é válida em literais de cadeia de caracteres
ru: Эта кодировка Юникод может использоваться только в строковых литералах
tr: Bu Unicode kodlaması yalnızca dize sabit değerlerinde geçerlidir
zh_hans: 此 Unicode 编码仅在字符串中有效
zh_hant: 這個 Unicode 編碼只在字串常值中才有效

# lexTokenReserved
source: This token is reserved for future use
cs: Tento token je vyhrazený pro budoucí použití.
de: Dieses Token ist für die zukünftige Verwendung reserviert.
es: Este token está reservado para uso futuro.
fr: Ce jeton est réservé pour un usage futur
it: Token riservato per utilizzi futuri
ja: このトークンは将来利用するために予約されています
ko: 이 토큰은 나중에 사용할 수 있도록 예약되었습니다.
pl: Ten token jest zarezerwowany do użytku w przyszłości
pt_br: Este token está reservado para uso futuro
ru: Этот токен зарезервирован для будущего использования
tr: Bu belirteç ileride kullanılmak üzere ayrılmıştır
zh_hans: 已保留此标记供将来使用
zh_hant: 這個語彙基元已保留供未來使用
