Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# tcMatchMayNotBeUsedWithQuery
source: 'match' expressions may not be used in queries
cs: Výrazy match se nedají v dotazech použít.
de: 'match'-Ausdrücke dürfen in Abfragen nicht verwendet werden.
es: Las expresiones 'match' no se pueden usar en las consultas.
fr: Les expressions 'match' ne peuvent pas être utilisées dans les requêtes
it: Le espressioni 'match' non possono essere utilizzate nelle query
ja: 'match' 式はクエリ内で使用できません
ko: 'match' 식은 쿼리에서 사용할 수 없습니다.
pl: Wyrażenia „match” nie mogą być używane w zapytaniach
pt_br: As expressões 'match' não podem ser usadas em consultas
ru: В запросах нельзя использовать выражения match
tr: 'match' ifadeleri sorgularda kullanılamaz
zh_hans: “match”表达式不能在查询中使用
zh_hant: 不可以在查詢中使用 'match' 運算式

# memberOperatorDefinitionWithNonTripleArgument
source: Infix operator member '{0}' has {1} initial argument(s). Expected a tuple of 3 arguments
cs: Člen operátoru vpony {0} má počáteční argumenty v počtu {1}. Očekávala se řazená kolekce členů se třemi argumenty.
de: Infix-Operatormember '{0}' weist {1} anfängliche(s) Argument(e) auf. Erwartet wurde ein Tupel mit 3 Argumenten
es: El miembro de operador de infijo '{0}' tiene {1} argumentos iniciales. Se esperaba una tupla de 3 argumentos.
fr: Le membre opérateur infixe '{0}' a {1} argument initiaux. Tuple de 3 arguments attendu
it: Il membro dell'operatore infisso '{0}' ha {1} argomento/i iniziale/i. Prevista una tupla di 3 argomenti
ja: 挿入演算子メンバー '{0}' に {1} 個の初期引数があります。3 つの引数を持つタプルを指定してください
ko: 중위 연산자 멤버 '{0}'에 {1}개의 초기 인수가 있습니다. 3개 인수의 튜플이 필요합니다.
pl: Element członkowski operatora infiksu „{0}” ma następującą liczbę argumentów początkowych: {1}. Oczekiwano krotki liczącej 3 argumenty
pt_br: O membro do operador infixo '{0}' possui {1} argumentos iniciais. Uma tupla de 3 argumentos é esperada
ru: Элемент инфиксного оператора "{0}" имеет {1} начальных аргументов. Ожидался кортеж из 3 аргументов
tr: Infix işleç üyesi '{0}', {1} başlangıç bağımsız değişkenine sahip. 3 bağımsız değişkenli bir demet bekleniyordu
zh_hans: 中缀运算符成员“{0}”具有 {1} 个初始参数。需要一个由 3 个参数构成的元组
zh_hant: 中置運算子成員 '{0}' 有 {1} 個初始引數。必須是 3 個引數的元組

# cannotResolveNullableOperators
source: The operator '{0}' cannot be resolved. Consider opening the module 'Microsoft.FSharp.Linq.NullableOperators'.
cs: Operátor {0} se nedá přeložit. Zvažte možnost otevření modulu Microsoft.FSharp.Linq.NullableOperators.
de: Der Operator '{0}' konnte nicht aufgelöst werden. Möglicherweise sollte das Modul 'Microsoft.FSharp.Linq.NullableOperators' geöffnet werden.
es: El operador '{0}' no se puede resolver. Considere abrir el módulo 'Microsoft.FSharp.Linq.NullableOperators'.
fr: Impossible de résoudre l'opérateur '{0}'. Essayez d'ouvrir le module 'Microsoft.FSharp.Linq.NullableOperators'.
it: Non è possibile risolvere l'operatore '{0}'. Provare ad aprire il modulo 'Microsoft.FSharp.Linq.NullableOperators'.
ja: 演算子 '{0}' を解決できません。'Microsoft.FSharp.Linq.NullableOperators' モジュールを開いてください。
ko: '{0}' 연산자를 확인할 수 없습니다. 'Microsoft.FSharp.Linq.NullableOperators' 모듈을 열어 보세요.
pl: Nie można rozpoznać operatora „{0}”. Rozważ otwarcie modułu „Microsoft.FSharp.Linq.NullableOperators”.
pt_br: O operador '{0}' não pode ser resolvido. Considere abrir o módulo 'Microsoft.FSharp.Linq.NullableOperators'.
ru: Не удается разрешить оператор "{0}". Попробуйте открыть модуль Microsoft.FSharp.Linq.NullableOperators.
tr: '{0}' işleci çözümlenemiyor. 'Microsoft.FSharp.Linq.NullableOperators' modülünü açmayı düşünün.
zh_hans: 无法解析运算符“{0}”。请考虑打开模块“Microsoft.FSharp.Linq.NullableOperators”。
zh_hant: 無法解析運算子 '{0}'。請考慮開啟模組 'Microsoft.FSharp.Linq.NullableOperators'。

# tcOperatorRequiresIn
source: '{0}' must be followed by 'in'. Usage: {1}.
cs: Po {0} musí následovat in. Použití: {1}.
de: "{0}" muss von "in" gefolgt werden. Verwendung: {1}.
es: "{0}" debe ir seguido de "in". Uso: {1}.
fr: '{0}' doit être suivi de 'in'. Utilisation : {1}.
it: '{0}' deve essere seguito da 'in'. Utilizzo: {1}.
ja: '{0}' の後には 'in' が必要です。使い方: {1}。
ko: '{0}' 뒤에는 'in'이 와야 합니다. 사용법: {1}.
pl: Po operatorze „{0}” musi występować element „in”. Użycie: {1}.
pt_br: '{0}' deve ser seguido por 'in'. Uso: {1}.
ru: После "{0}" должно следовать "in". Использование: {1}.
tr: '{0}' öğesinden sonra 'in' gelmelidir. Kullanım: {1}.
zh_hans: “{0}”后面必须跟“in”。用法: {1}。
zh_hant: ’{0}' 之後必須是 'in'。使用方式: {1}。

# parsIllegalMemberVarInObjectImplementation
source: Neither 'member val' nor 'override val' definitions are permitted in object expressions.
cs: U objektových výrazů se nepovolují definice member val ani override val.
de: Weder die Definition 'member val' noch die Definition 'override val' ist in Objektausdrücken zulässig.
es: No se permiten las definiciones 'member val' ni 'override val' en las expresiones de objeto.
fr: Les définitions 'member val' et 'override val' ne sont pas autorisées dans les expressions d'objet.
it: Le definizioni 'member val' e 'override val' non sono consentite nelle espressioni dell'oggetto.
ja: オブジェクト式では 'member val' 定義も 'override val' 定義も使用できません。
ko: 개체 식에는 'member val' 또는 'override val' 정의를 사용할 수 없습니다.
pl: W wyrażeniach obiektu nie są dozwolone definicje „member val” ani definicje „override val”.
pt_br: As definições de 'member val' e 'override val' não são permitidas em expressões de objetos.
ru: В выражениях объектов не разрешены определения "member val" и "override val".
tr: Nesne ifadelerinde 'member val' ve 'override val' tanımlarına izin verilmez.
zh_hans: 对象表达式中既不允许使用“member val”定义也不允许使用“override val”定义。
zh_hant: 物件運算式中不允許使用 'member val' 和 'override val' 定義。

# tcEmptyCopyAndUpdateRecordInvalid
source: Copy-and-update record expressions must include at least one field.
cs: Výrazy záznamu zkopírování a aktualizace musí zahrnovat aspoň jedno pole.
de: Copy-and-Update-Datensatzausdrücke müssen mindestens ein Feld enthalten.
es: Las expresiones de registro de copiar y actualizar deben incluir al menos un campo.
fr: Les expressions d'enregistrement de copie et mise à jour doivent inclure au moins un champ.
it: Le espressioni del record Copia e aggiorna devono includere almeno un campo.
ja: copy-and-update レコード式には 1 つ以上のフィールドを含める必要があります。
ko: 레코드 복사 및 업데이트 식에는 적어도 하나의 필드가 포함되어야 합니다.
pl: Wyrażenia rekordów kopiowania i aktualizowania muszą zawierać co najmniej jedno pole.
pt_br: As expressões de registros copiar e atualizar devem incluir pelo menos um campo.
ru: Выражения записей копирования и обновления должны включать хотя бы одно поле.
tr: Kayıt kopyalama ve güncelleştirme ifadeleri en az bir alan içermelidir.
zh_hans: 复制和更新记录表达式必须包含至少一个字段。
zh_hant: 複製並更新記錄運算式必須至少包含一個欄位。

# parsUnderscoreInvalidFieldName
source: '_' cannot be used as field name
cs: Podtržítko se pro název pole použít nedá.
de: '_' kann nicht als Feldname verwendet werden
es: '_' no se puede usar como nombre de campo.
fr: '_' ne peut pas être utilisé comme nom de champ
it: Non è possibile usare '_' come nome di campo
ja: '_' はフィールド名に使用できません
ko: 필드 이름에는 '_'을(를) 사용할 수 없습니다.
pl: Znak „_” nie może być używany jako nazwa pola
pt_br: '_' não pode ser usado como nome de campo
ru: Символ "_" нельзя использовать как имя поля
tr: '_' alan adı olarak kullanılamaz
zh_hans: “_”不能用作字段名称
zh_hant: '_' 不可做為欄位名稱

# tcGeneratedTypesShouldBeInternalOrPrivate
source: The provided types generated by this use of a type provider may not be used from other F# assemblies and should be marked internal or private. Consider using 'type internal TypeName = ...' or 'type private TypeName = ...'.
cs: Poskytnuté typy generované tímto použitím zprostředkovatele typu možná nepůjde použít v jiných sestaveních F# a měly by se označit jako interní nebo privátní. Zvažte použití notace type internal TypeName = ... nebo type private TypeName = ...
de: Die angegebenen Typen, die durch diese Verwendung eines Typanbieters generiert wurden, können von anderen F#-Assemblys nicht verwendet werden und sollten als intern oder privat markiert werden. Verwenden Sie stattdessen 'type internal TypeName = ...' oder 'type private TypeName = ...'.
es: Los tipos proporcionados generados por este uso de un proveedor de tipos no se pueden usar desde otros ensamblados de F# y deben marcarse como internos o privados. Considere usar 'type internal TypeName = ...' o 'type private TypeName = ...'.
fr: Les types fournis générés par cette utilisation d'un fournisseur de type ne peuvent pas être utilisés à partir d'autres assemblys F# et doivent être marqués comme internes ou privés. Envisagez d'utiliser 'type internal TypeName = ...' ou 'type private TypeName = ...'.
it: I tipi forniti generati da questo utilizzo di un provider di tipi potrebbero non essere utilizzati da altri assembly F# e devono essere contrassegnati come interni o privati. Provare a utilizzare 'type internal TypeName = ...' o 'type private TypeName = ...'.
ja: ここで型プロバイダーを使用して生成した指定された型は、他の F# アセンブリからは使用できないため、内部またはプライベートとしてマークする必要があります。'type internal TypeName = ...' または 'type private TypeName = ...' を使用することを検討してください。
ko: 이런 방법으로 형식 공급자를 사용하여 생성된 제공된 형식은 다른 F# 어셈블리에서 사용할 수 없으므로 내부 또는 개인 형식으로 표시해야 합니다. 'type internal TypeName = ...' 또는 'type private TypeName = ...'을 사용하세요.
pl: Podane typy wygenerowane w ramach tego użycia dostawcy typów nie mogą być używane z innych zestawów języka F# i powinny być oznaczone jako wewnętrzne lub prywatne. Rozważ użycie ciągu „type internal TypeName = ...” lub „type private TypeName = ...”.
pt_br: Os tipos fornecidos gerados por este uso de um provedor de tipos não podem ser usados de outros assemblies F# e devem ser marcados como internos ou privados. Considere usar 'type internal TypeName = ...' ou 'type private TypeName = ...'.
ru: Предоставленные типы, созданные в результате данного использования поставщика типов, не могут использоваться из других сборок F#, и их следует пометить модификатором internal или private. Попробуйте использовать конструкцию "type internal TypeName = ..." или "type private TypeName = ...".
tr: Tür sağlayıcısının bu kullanımının oluşturduğu sağlanan türler diğer F# bütünleştirilmiş kodlarından kullanılamaz ve iç veya özel olarak işaretlenmeleri gerekir. 'type internal TypeName = ...' veya 'type private TypeName = ...' kullanmayı düşünün.
zh_hans: 通过这种类型提供程序使用方式生成的提供的类型不能从其他 F# 程序集使用，应标记为内部或私有的。请考虑使用“type internal TypeName = ...”或“type private TypeName = ...”。
zh_hant: 以這種方式使用型別提供者所產生的提供型別不能在其他 F# 組件中使用，而且應該標記為內部或私用。請考慮使用 'type internal TypeName = ...' 或 'type private TypeName = ...'。

# chkGetterAndSetterHaveSamePropertyType
source: A property's getter and setter must have the same type. Property '{0}' has getter of type '{1}' but setter of type '{2}'.
cs: Metody getter a setter vlastnosti musí být stejného typu. Vlastnost {0} má metodu get typu {1}, ale metodu set typu {2}.
de: Getter und Setter einer Eigenschaft müssen denselben Typ aufweisen. Eigenschaft '{0}' hat einen Getter vom Typ '{1}', jedoch einen Setter vom Typ '{2}'.
es: El captador y el establecedor de una propiedad deben tener el mismo tipo. La propiedad '{0}' tiene un captador de tipo '{1}', pero el establecedor es de tipo '{2}'.
fr: Les méthodes getter et setter d'une propriété doivent avoir le même type. La propriété '{0}' a une méthode getter de type '{1}' alors que sa méthode setter est de type '{2}'.
it: Il getter e il setter di una proprietà devono essere dello stesso tipo. Il getter della proprietà '{0}' è di tipo '{1}', mentre il setter è di tipo '{2}'.
ja: プロパティのゲッターとセッターは同じ型でなければなりません。プロパティ '{0}' は、ゲッターの型が '{1}' でセッターの型が '{2}' です。
ko: 속성의 getter 및 setter는 형식이 같아야 합니다. '{0}' 속성의 getter 형식은 '{1}'인데 setter 형식은 '{2}'입니다.
pl: Metoda pobierająca i metoda ustawiająca właściwość muszą mieć taki sam typ. Właściwość „{0}” ma metodę pobierającą typu „{1}”, a metodę ustawiającą typu „{2}”.
pt_br: O getter e o setter de uma propriedade devem ter o mesmo tipo. A propriedade '{0}' possui getter do tipo '{1}', mas setter do tipo '{2}'.
ru: Метод получения и метод задания свойства должны относиться к одному типу. Свойство "{0}" имеет метод получения типа "{1}" и метод задания типа "{2}".
tr: Bir özelliğin alıcısı ve ayarlayıcısı aynı türde olmalıdır. '{0}' özelliğinin alıcı türü '{1}' ancak ayarlayıcı türü '{2}'.
zh_hans: 属性的 Getter 和 Setter 的类型必须相同。属性“{0}”的 Getter 的类型为“{1}”，而 Setter 的类型为“{2}”。
zh_hant: 屬性的 getter 和 setter 必須具有相同類型。屬性 '{0}' 的 getter 類型為 '{1}'，但 setter 類型為 '{2}'。

# tcRuntimeSuppliedMethodCannotBeUsedInUserCode
source: Array method '{0}' is supplied by the runtime and cannot be directly used in code. For operations with array elements consider using family of GetArray/SetArray functions from LanguagePrimitives.IntrinsicFunctions module.
cs: Metodu pole {0} poskytuje modul runtime a nedá se v kódu použít přímo. U operací s prvky polí zvažte možnost použití skupiny funkcí GetArray/SetArray z modulu LanguagePrimitives.IntrinsicFunctions.
de: Die Arraymethode '{0}' wird von der Laufzeit bereitgestellt und kann nicht direkt in Code verwendet werden. Ziehen Sie bei Vorgängen mit Arrayelementen die Familie der GetArray/SetArray-Funktionen aus dem LanguagePrimitives.IntrinsicFunctions-Modul in Erwägung.
es: El método de matrices '{0}' se proporciona mediante el runtime y no se puede usar directamente en el código. Para las operaciones con elementos de matriz, considere el uso de la familia de funciones GetArray/SetArray del módulo LanguagePrimitives.IntrinsicFunctions.
fr: La méthode Array '{0}' est fournie par le runtime et ne peut pas être utilisée directement dans le code. Pour les opérations comportant des éléments Array, envisagez d'utiliser la famille de fonctions GetArray/SetArray du module LanguagePrimitives.IntrinsicFunctions.
it: Il metodo di matrice '{0}' è fornito dal runtime e non può essere utilizzato direttamente nel codice. Per operazioni con elementi di matrice, considerare l'impiego della famiglia di funzioni GetArray/SetArray dal modulo LanguagePrimitives.IntrinsicFunctions.
ja: 配列メソッド '{0}' はランタイムによって提供されるため、コードで直接使用することはできません。配列要素を操作する場合は、LanguagePrimitives.IntrinsicFunctions モジュールにある GetArray/SetArray 関数のファミリを使用することを検討してください。
ko: 배열 메서드 '{0}'은(는) 런타임에서 제공되며 코드에 직접 사용할 수 없습니다. 배열 요소를 사용하는 작업에서는 LanguagePrimitives.IntrinsicFunctions 모듈의 GetArray/SetArray 함수 패밀리를 사용하세요.
pl: Metoda tablicy „{0}” jest dostarczana przez środowisko uruchomieniowe i nie może być używane bezpośrednio w kodzie. W przypadku operacji z elementami tablic rozważ użycie rodziny funkcji GetArray/SetArray z modułu LanguagePrimitives.IntrinsicFunctions.
pt_br: O método de matriz '{0}' é fornecido pelo tempo de execução e não pode ser usado diretamente no código. Para operações com elementos de matriz, considere usar a família de funções GetArray/SetArray do módulo LanguagePrimitives.IntrinsicFunctions.
ru: Метод массива "{0}" предоставляет средой выполнения и не может использовать непосредственно в коде. Для операций с элементами используйте семейство функций GetArray/SetArray из модуля LanguagePrimitives.IntrinsicFunctions.
tr: Dizi metodu '{0}', çalışma zamanı tarafından sağlanır ve kodda doğrudan kullanılamaz. Dizi öğeleriyle işlemler için LanguagePrimitives.IntrinsicFunctions modülünden GetArray/SetArray işlev ailesini kullanmayı düşünün.
zh_hans: 数组方法“{0}”由运行时提供且不能直接在代码中使用。对于带数组元素的操作，请考虑使用 LanguagePrimitives.IntrinsicFunctions 模块中的 GetArray/SetArray 函数系列。
zh_hant: 陣列方法 '{0}' 是由執行階段所提供，無法直接用於程式碼中。對於含有陣列元素的作業，請考慮使用 LanguagePrimitives.IntrinsicFunctions 模組中的 GetArray/SetArray 函式系列。

# tcUnionCaseConstructorDoesNotHaveFieldWithGivenName
source: The union case '{0}' does not have a field named '{1}'.
cs: Případ typu union {0} nemá žádné pole s názvem {1}.
de: Union-Fall "{0}" verfügt nicht über ein Feld mit dem Namen "{1}".
es: El caso de unión "{0}" no tiene un campo denominado "{1}".
fr: Le cas d'union '{0}' n'a pas de champ nommé '{1}'.
it: Il case di unione '{0}' non include un campo denominato '{1}'.
ja: 共用体ケース '{0}' には '{1}' という名前のフィールドはありません。
ko: 공용 구조체 케이스 '{0}'에 '{1}' 필드가 없습니다.
pl: Przypadek unii „{0}” nie ma pola o nazwie „{1}”.
pt_br: O caso união '{0}' não tem um campo nomeado '{1}'.
ru: Ветвь объединения '{0}' не содержит поля с именем '{1}'.
tr: '{0}' birleşim durumunun '{1}' adlı bir alanı yok.
zh_hans: 联合用例“{0}”没有名为“{1}”的字段。
zh_hant: 聯集 '{0}' 沒有名為 '{1}' 的欄位。

# tcUnionCaseFieldCannotBeUsedMoreThanOnce
source: Union case/exception field '{0}' cannot be used more than once.
cs: Pole {0} výjimky nebo případu typu union se nedá použít víc než jednou.
de: Feld für Union-Fall/Ausnahme '{0}' kann nicht mehrmals verwendet werden.
es: El campo de excepción o caso de unión '{0}' no se puede usar más de una vez.
fr: Le champ de cas ou d'exception d'union '{0}' ne peut pas être utilisé plusieurs fois.
it: Il campo case di unione/eccezione '{0}' non può essere utilizzato più di una volta.
ja: 共用体ケース/例外フィールド '{0}' を 2 回以上使用することはできません。
ko: 공용 구조체 케이스/예외 필드 '{0}'은(는) 두 번 이상 사용할 수 없습니다.
pl: Pole przypadku unii/wyjątku „{0}” nie może zostać użyte więcej niż raz.
pt_br: O campo '{0}' do caso união/exceção não pode ser usado mais de uma vez.
ru: Поле "{0}" ветви объединения/исключения не может использоваться более одного раза.
tr: '{0}' birleşim durumu/özel durumu alanı birden çok kez kullanılamaz.
zh_hans: 无法多次使用联合用例/异常字段“{0}”。
zh_hant: 等位/例外狀況欄位 '{0}' 不可以重複使用。

# tcFieldNameIsUsedModeThanOnce
source: Named field '{0}' is used more than once.
cs: Pojmenované pole {0} se používá víc než jednou.
de: Das Feld mit dem Namen '{0}' wird mehrmals verwendet.
es: El campo denominado '{0}' se usa más de una vez.
fr: Le champ nommé '{0}' est utilisé plusieurs fois.
it: Il campo denominato '{0}' viene utilizzato più di una volta.
ja: 名前付きフィールド '{0}' が複数回使用されています。
ko: 명명된 필드 {0}이(가) 두 번 이상 사용되었습니다.
pl: Nazwane pole „{0}” jest używane więcej niż raz.
pt_br: O campo nomeado '{0}' é usado mais de uma vez.
ru: Именованное поле "{0}" используется более одного раза.
tr: Adlandırılmış alan '{0}', birden çok kez kullanıldı.
zh_hans: 命名字段“{0}”多次被使用。
zh_hant: 具名欄位 '{0}' 使用一次以上。

# tcFieldNameConflictsWithGeneratedNameForAnonymousField
source: Named field '{0}' conflicts with autogenerated name for anonymous field.
cs: Pojmenované pole {0} koliduje s automaticky generovaným názvem anonymního pole.
de: Das Feld mit dem Namen '{0}' steht in Konflikt mit dem automatisch generierten Namen für ein anonymes Feld.
es: El campo denominado '{0}' está en conflicto con el nombre generado automáticamente para el campo anónimo.
fr: Le champ nommé '{0}' est en conflit avec le nom généré automatiquement pour le champ anonyme.
it: Il campo denominato '{0}' è in conflitto con il nome generato automaticamente per il campo anonimo.
ja: 名前付きフィールド '{0}' が、匿名フィールドのために自動生成された名前と競合しています。
ko: 명명된 필드 '{0}'이(가) 자동 생성된 익명 필드 이름과 충돌합니다.
pl: Nazwane pole „{0}” powoduje konflikt z automatycznie generowaną nazwą pola anonimowego.
pt_br: O campo nomeado '{0}' está em conflito com o nome gerado automaticamente para o campo anônimo.
ru: Конфликт именованного поля "{0}" с автоматически созданным именем для анонимного поля.
tr: Adlandırılmış alan '{0}', anonim alanın otomatik oluşturulmuş adıyla çakışıyor.
zh_hans: 命名字段“{0}”与匿名字段的自动生成名称发生冲突。
zh_hant: 具名欄位 '{0}' 與匿名欄位的自動產生名稱相衝突。

# tastConstantExpressionOverflow
source: This literal expression or attribute argument results in an arithmetic overflow.
cs: Tento literálový výraz nebo argument atributu má za následek přetečení aritmetické operace.
de: Dieser literale Ausdruck oder dieses Attributargument führt zu einem arithmetischen Überlauf.
es: Esta expresión literal o argumento de atributo da lugar a un desbordamiento aritmético.
fr: Cette expression littérale ou cet argument d'attribut engendre un dépassement arithmétique.
it: L'espressione letterale o l'argomento dell'attributo restituisce un overflow aritmetico.
ja: この定数式または属性引数の演算結果は、オーバーフローになります。
ko: 이 리터럴 식 또는 특성 인수를 사용하면 산술 연산 오버플로가 발생합니다.
pl: Wynikiem tego wyrażenia literału lub argumentu atrybutu jest przepełnienie arytmetyczne.
pt_br: Esta expressão literal ou este argumento de atributo resulta em um estouro aritmético.
ru: Это строковое выражение или аргумент атрибута вызывает арифметическое переполнение.
tr: Bu sabit değer ifadesi veya öznitelik bağımsız değişkeni aritmetik taşma ile sonuçlanıyor.
zh_hans: 此文本表达式或特性参数会导致算术溢出。
zh_hant: 這個常值運算式或屬性引數會導致算術溢位。

# tcIllegalStructTypeForConstantExpression
source: This is not valid literal expression. The [<Literal>] attribute will be ignored.
cs: Toto není platný literálový výraz. Atribut [<Literal>] se bude ignorovat.
de: Dies ist kein gültiger Literalausdruck. Das [<Literal>]-Attribut wird ignoriert.
es: Esta no es expresión una literal. Se omitirá el atributo [<Literal>].
fr: Cette expression n'est pas une expression littérale valide. L'attribut [<Literal>] est ignoré.
it: Espressione letterale non valida. L'attributo [<Literal>] verrà ignorato.
ja: 有効なリテラル式ではありません。[<Literal>] 属性は無視されます。
ko: 유효한 리터럴 식이 아닙니다. [<Literal>] 특성은 무시됩니다.
pl: To nie jest prawidłowe wyrażenie literału. Atrybut [<Literal>] zostanie zignorowany.
pt_br: Esta não é uma expressão literal válida. O atributo [<Literal>] será ignorado.
ru: Это выражение не является литеральным. Атрибут [<Literal>] будет проигнорирован.
tr: Bu geçerli bir sabit değer ifadesi değil. [<Literal>] özniteliği yoksayılacak.
zh_hans: 这不是有效的文本表达式。将忽略 [<Literal>] 属性。
zh_hant: 這不是有效的常值運算式。將會略過 [<Literal>] 屬性。

# fscSystemRuntimeInteropServicesIsRequired
source: System.Runtime.InteropServices assembly is required to use UnknownWrapper\DispatchWrapper classes.
cs: Aby bylo možné použít třídy UnknownWrapper\DispatchWrapper, vyžaduje se sestavení System.Runtime.InteropServices.
de: System.Runtime.InteropServices-Assembly erfordert Verwendung von UnknownWrapper\DispatchWrapper-Klassen.
es: El ensamblado System.Runtime.InteropServices es necesario para usar clases UnknownWrapper\DispatchWrapper.
fr: L'assembly System.Runtime.InteropServices est requis pour l'utilisation de classes UnknownWrapper\DispatchWrapper.
it: L'assembly System.Runtime.InteropServices è necessario per usare le classi UnknownWrapper\DispatchWrapper.
ja: UnknownWrapper\DispatchWrapper クラスを使用するには、System.Runtime.InteropServices アセンブリが必要です。
ko: UnknownWrapper\DispatchWrapper 클래스를 사용하려면 System.Runtime.InteropServices 어셈블리가 필요합니다.
pl: Do korzystania z klas UnknownWrapper\DispatchWrapper jest wymagany zestaw System.Runtime.InteropServices.
pt_br: O assembly System.Runtime.InteropServices é necessário para usar classes as UnknownWrapper\DispatchWrapper.
ru: Для использования классов UnknownWrapper\DispatchWrapper требуется сборка System.Runtime.InteropServices.
tr: UnknownWrapper\DispatchWrapper sınıflarını kullanmak için System.Runtime.InteropServices bütünleştirilmiş kodu gerekiyor.
zh_hans: 要使用 UnknownWrapper\DispatchWrapper 类，System.Runtime.InteropServices 程序集是必须的。
zh_hant: 使用 UnknownWrapper\DispatchWrapper 類別需要 System.Runtime.InteropServices 組件。
