Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# csMemberIsNotAccessible
source: The member or object constructor '{0}' is not {1}
cs: Konstruktor členu nebo objektu {0} není {1}.
de: Der Member oder Objektkonstruktor "{0}" ist nicht {1}.
es: El constructor de objeto o miembro '{0}' no es {1}.
fr: Le membre ou le constructeur d'objet '{0}' n'est pas {1}
it: Il costruttore di oggetti o membro '{0}' non è {1}
ja: メンバーまたはオブジェクト コンストラクター '{0}' は {1} ではありません
ko: 멤버 또는 개체 생성자 '{0}'은(는) {1}이(가) 아닙니다.
pl: Konstruktor elementu członkowskiego lub obiektu „{0}” nie jest {1}
pt_br: O construtor de membro ou objeto '{0}' não é {1}
ru: Конструктор элемента или объекта "{0}" не является {1}
tr: Üye veya nesne oluşturucu '{0}', {1} değil
zh_hans: 成员或对象构造函数“{0}”不是 {1}
zh_hant: 成員或物件建構函式 '{0}' 不是 {1}

# csMemberIsNotAccessible2
source: The member or object constructor '{0}' is not {1}. Private members may only be accessed from within the declaring type. Protected members may only be accessed from an extending type and cannot be accessed from inner lambda expressions.
cs: Konstruktor členu nebo objektu {0} není {1}. K soukromým členům se dá přistupovat jenom z deklarujícího typu. K chráněným členům se dá přistupovat jenom z rozšiřujícího typu a nedá se k nim přistupovat z vnitřních výrazů lambda.
de: Der Member oder Objektkonstruktor "{0}" ist nicht {1}. Auf private Member darf nur innerhalb des deklarierenden Typs zugegriffen werden. Auf geschützte Member darf nur von einem erweiternden Typ zugegriffen werden; der Zugriff von inneren lambda-Ausdrücken ist nicht zulässig.
es: El constructor de objeto o miembro '{0}' no es {1}. Los miembros privados solo son accesibles desde el tipo que los declara. Los miembros protegidos solo son accesibles desde un tipo de extensión y no son accesibles desde expresiones lambda internas.
fr: Le membre ou le constructeur d'objet '{0}' n'est pas {1}. Les membres privés ne peuvent être accessibles qu'à partir du type déclarant. Les membres protégés ne peuvent être accessibles qu'à partir d'un type d'extension et ne sont pas accessibles à partir d'expressions lambda internes.
it: Il costruttore di oggetti o membro '{0}' non è {1}. È possibile accedere ai membri privati solo dall'interno del tipo dichiarante. I membri privati sono invece accessibili solo da un tipo di estensione e non da espressioni lambda interne.
ja: メンバーまたはオブジェクト コンストラクター '{0}' は {1} ではありません。プライベート メンバーには、宣言する型の中からのみアクセスできます。プロテクト メンバーには、拡張する型からのみアクセスでき、内部ラムダ式からアクセスすることはできません。
ko: 멤버 또는 개체 생성자 '{0}'은(는) {1}이(가) 아닙니다. 전용 멤버는 선언 형식 내에서만 액세스할 수 있습니다. 보호된 멤버는 확장 형식에서만 액세스할 수 있으며 내부 람다 식에서는 액세스할 수 없습니다.
pl: Element członkowski lub konstruktor obiektów „{0}” nie jest {1}. Prywatne elementy członkowskie mogą być dostępne tylko w obrębie typu deklarującego. Chronione elementy członkowskie mogą być dostępne tylko z poziomu typu rozszerzającego. Nie można uzyskać do nich dostępu z poziomu wewnętrznych wyrażeń lambda.
pt_br: O construtor de membro ou objeto '{0}' não é {1}. Membros particulares só podem ser acessados no tipo de declaração. Membros protegidos só podem ser acessados em um tipo de extensão e não podem ser acessados em expressões lambda internas.
ru: Конструктор элемента или объекта "{0}" не является {1}. Закрытые элементы доступны только внутри типа, в котором они объявляются. Защищенные типы доступны только из расширяющего типа и недоступны из внутренних лямбда-выражений.
tr: Üye veya nesne oluşturucu '{0}', {1} değil. Özel üyelere yalnızca tanımlayan türün içinden erişilebilir. Korunan üyelere yalnızca genişletilen bir türden erişilebilir, iç lambda ifadelerinden erişilemez.
zh_hans: 成员或对象构造函数“{0}”不是 {1}。只可以从声明类型中访问私有成员。只可以从扩展类型访问受保护的成员，而不能从内部 lambda 表达式访问这些成员。
zh_hant: 成員或物件建構函式 '{0}' 不是 {1}。私用成員只能從宣告類型中存取。受保護的成員只能從擴充類型存取，無法從內部 Lambda 運算式存取。

# csMethodIsNotAStaticMethod
source: {0} is not a static method
cs: {0} není statická metoda.
de: {0} ist keine statische Methode.
es: {0} no es un método estático.
fr: {0} n'est pas une méthode statique
it: {0} non è un metodo statico
ja: {0} は静的メソッドではありません
ko: {0}은(는) 정적 메서드가 아닙니다.
pl: Metoda {0} nie jest metodą statyczną
pt_br: {0} não é um método estático
ru: {0} не является статическим методом
tr: {0} bir statik metot değil
zh_hans: {0} 不是静态方法
zh_hant: {0} 不是靜態方法

# csMethodIsNotAnInstanceMethod
source: {0} is not an instance method
cs: {0} není metoda instance.
de: {0} ist keine Instanzmethode.
es: {0} no es un método de instancia.
fr: {0} n'est pas une méthode d'instance
it: {0} non è un metodo di istanza
ja: {0} はインスタンス メソッドではありません
ko: {0}은(는) 인스턴스 메서드가 아닙니다.
pl: Metoda {0} nie jest metodą wystąpienia
pt_br: {0} não é um método de instância
ru: {0} не является экземплярным методом
tr: {0} bir örnek metodu değil
zh_hans: {0} 不是实例方法
zh_hant: {0} 不是執行個體方法

# csMemberHasNoArgumentOrReturnProperty
source: The member or object constructor '{0}' has no argument or settable return property '{1}'. {2}.
cs: Konstruktor členu nebo objektu {0} nemá žádný argument nebo nastavitelnou návratovou vlastnost {1}. {2}.
de: Der Member oder Objektkonstruktor "{0}" enthält kein Argument und keine festlegbare Rückgabeeigenschaft "{1}". {2}.
es: El constructor de objeto o miembro '{0}' no tiene ningún argumento o propiedad de valor devuelto '{1}' que se pueda establecer. {2}.
fr: Le membre ou le constructeur d'objet '{0}' n'a aucun argument ou aucune propriété de retour définissable '{1}'. {2}.
it: Il costruttore di oggetti o membro '{0}' non dispone di un argomento o di una proprietà restituita impostabile '{1}'. {2}.
ja: メンバーまたはオブジェクト コンストラクター '{0}' には、引数または設定可能な戻り値のプロパティ '{1}' がありません。{2}
ko: 멤버 또는 개체 생성자 '{0}'에 인수 또는 설정 가능한 반환 속성 '{1}'이(가) 없습니다. {2}
pl: Element członkowski lub konstruktor obiektów „{0}” nie ma argumentu lub ustawialnej właściwości zwracanej „{1}”. {2}.
pt_br: O construtor de membro ou objeto '{0}' não possui argumento ou propriedade de retorno configurável '{1}'. {2}.
ru: Конструктор элемента или объекта "{0}" не содержит аргумент или задаваемое возвращаемое свойство "{1}". {2}.
tr: Üye veya nesne oluşturucu '{0}' bağımsız değişkene veya ayarlanabilen '{1}' dönüş özelliğine sahip değil. {2}.
zh_hans: 成员或对象构造函数“{0}”没有参数或可设置的返回属性“{1}”。{2}。
zh_hant: 成員或物件建構函式 '{0}' 沒有引數或可設定的傳回屬性 '{1}'。{2}。

# csCtorHasNoArgumentOrReturnProperty
source: The object constructor '{0}' has no argument or settable return property '{1}'. {2}.
cs: Konstruktor objektu {0} nemá žádné argumenty nebo návratovou vlastnost {1}, která by šla nastavit. {2}.
de: Der Objektkonstruktor "{0}" besitzt kein Argument oder keine festlegbare Rückgabeeigenschaft "{1}". {2}.
es: El constructor de objeto "{0}" no tiene ningún argumento ni propiedad de valor devuelto "{1}" que se pueda establecer. {2}.
fr: Le constructeur d'objet '{0}' n'a aucun argument ou aucune propriété de retour définissable '{1}'. {2}.
it: Per il costruttore di oggetti '{0}' non esiste un argomento o una proprietà restituita impostabile '{1}'. {2}.
ja: オブジェクト コンストラクター '{0}' には、引数または設定可能な戻り値のプロパティ '{1}' がありません。{2}。
ko: 개체 생성자 '{0}'에 인수 또는 설정 가능한 반환 속성 '{1}'이(가) 없습니다. {2}.
pl: Konstruktor obiektu „{0}” nie ma argumentu lub konfigurowalnej właściwości zwracania „{1}”. {2}.
pt_br: O construtor de objeto '{0}' não tem argumento ou propriedade de retorno configurável '{1}'. {2}.
ru: Конструктор объектов "{0}" не содержит аргумент или задаваемое возвращаемое свойство "{1}". {2}.
tr: {0}' nesne oluşturucusu, bağımsız değişkene veya ayarlanabilen '{1}' dönüş özelliğine sahip değil. {2}.
zh_hans: 对象构造函数“{0}”无参数或无可设置的返回属性“{1}”。{2}。
zh_hant: 物件建構函式 '{0}' 沒有引數或可設定的傳回屬性 '{1}'。{2}。

# csRequiredSignatureIs
source: The required signature is {0}
cs: Požadovaná signatura je {0}.
de: Die erforderliche Signatur ist {0}.
es: La signatura necesaria es {0}.
fr: La signature requise est {0}
it: La firma obbligatoria è {0}
ja: 必要なシグネチャは {0} です
ko: 필요한 시그니처는 {0}입니다.
pl: Wymagana sygnatura to {0}
pt_br: A assinatura requerida é {0}
ru: Необходимая сигнатура: "{0}"
tr: Gereken imza: {0}
zh_hans: 所需签名为 {0}
zh_hant: 需要的簽章是 {0}

# csMemberSignatureMismatch
source: The member or object constructor '{0}' requires {1} argument(s). The required signature is '{2}'.
cs: Konstruktor členu nebo objektu {0} vyžaduje argumenty ({1}). Požadovaná signatura je {2}.
de: Der Member oder Objektkonstruktor "{0}" erfordert {1} Argument(e). Die erforderliche Signatur lautet "{2}".
es: El constructor de objeto o miembro '{0}' requiere {1} argumentos. La signatura necesaria es '{2}'.
fr: Le membre ou le constructeur d'objet '{0}' requiert {1} argument(s). La signature requise est '{2}'.
it: Il costruttore di oggetti o membro '{0}' richiede {1} argomento/i. La firma necessaria è '{2}'.
ja: メンバーまたはオブジェクト コンストラクター '{0}' には {1} 個の引数が必要です。必要なシグネチャは '{2}' です。
ko: 멤버 또는 개체 생성자 '{0}'을(를) 사용하려면 {1}개의 인수가 필요합니다. 필요한 시그니처는 '{2}'입니다.
pl: Element członkowski lub konstruktor obiektów „{0}” wymaga argumentów w liczbie {1}. Wymagana sygnatura to „{2}”.
pt_br: O construtor de membro ou objeto '{0}' requer {1} argumentos. A assinatura requerida é '{2}'.
ru: Для конструктора элемента или объекта "{0}" требуется следующее число аргументов: {1}. Необходимая сигнатура: "{2}".
tr: Üye veya nesne oluşturucu '{0}' {1} bağımsız değişken gerektirir. Gereken imza: '{2}'.
zh_hans: 成员或对象构造函数“{0}”需要 {1} 个参数。所需签名为“{2}”。
zh_hant: 成員或物件建構函式 '{0}' 需要 {1} 個引數。需要的簽章是 '{2}'。

# csMemberSignatureMismatch2
source: The member or object constructor '{0}' requires {1} additional argument(s). The required signature is '{2}'.
cs: Konstruktor členu nebo objektu {0} vyžaduje další argumenty ({1}). Požadovaná signatura je {2}.
de: Der Member oder Objektkonstruktor "{0}" erfordert {1} zusätzliche(s) Argument(e). Die erforderliche Signatur lautet "{2}".
es: El constructor de objeto o miembro '{0}' requiere {1} argumentos adicionales. La signatura necesaria es '{2}'.
fr: Le membre ou le constructeur d'objet '{0}' requiert {1} argument(s) supplémentaire(s). La signature requise est '{2}'.
it: Il costruttore di oggetti o membro '{0}' richiede {1} argomento/i aggiuntivo/i. La firma necessaria è '{2}'.
ja: メンバーまたはオブジェクト コンストラクター '{0}' には追加で {1} 個の引数が必要です。必要なシグネチャは '{2}' です。
ko: 멤버 또는 개체 생성자 '{0}'을(를) 사용하려면 {1}개의 인수가 더 필요합니다. 필요한 시그니처는 '{2}'입니다.
pl: Element członkowski lub konstruktor obiektów „{0}” wymaga dodatkowych argumentów w liczbie {1}. Wymagana sygnatura to „{2}”.
pt_br: O construtor de membro ou objeto '{0}' requer {1} argumentos adicionais. A assinatura requerida é '{2}'.
ru: Для конструктора элемента или объекта "{0}" требуется следующее число дополнительных аргументов: {1}. Необходимая сигнатура: "{2}".
tr: Üye veya nesne oluşturucu '{0}' {1} bağımsız değişken daha gerektiriyor. Gereken imza: '{2}'.
zh_hans: 成员或对象构造函数“{0}”需要 {1} 个附加参数。所需签名为“{2}”。
zh_hant: 成員或物件建構函式 '{0}' 還需要 {1} 個其他引數。需要的簽章是 '{2}'。

# csMemberSignatureMismatch3
source: The member or object constructor '{0}' requires {1} argument(s). The required signature is '{2}'. Some names for missing arguments are {3}.
cs: Konstruktor členu nebo objektu {0} vyžaduje argumenty ({1}). Požadovaná signatura je {2}. Některé názvy chybějících argumentů jsou {3}.
de: Der Member oder Objektkonstruktor "{0}" erfordert {1} Argument(e). Die erforderliche Signatur lautet "{2}". Einige fehlende Argumente sind {3}.
es: El constructor de objeto o miembro '{0}' requiere {1} argumentos. La signatura necesaria es '{2}'. Algunos nombres de argumentos que faltan son {3}.
fr: Le membre ou le constructeur d'objet '{0}' requiert {1} argument(s). La signature requise est '{2}'. Voici certains noms des arguments manquants : {3}.
it: Il costruttore di oggetti o membro '{0}' richiede {1} argomento/i. La firma necessaria è '{2}'. Alcuni nomi di argomenti mancanti sono {3}.
ja: メンバーまたはオブジェクト コンストラクター '{0}' には {1} 個の引数が必要です。必要なシグネチャは '{2}' です。足りない引数の名前は {3} です。
ko: 멤버 또는 개체 생성자 '{0}'을(를) 사용하려면 {1}개의 인수가 필요합니다. 필요한 시그니처는 '{2}'입니다. 누락된 인수의 이름에는 {3} 등이 있습니다.
pl: Element członkowski lub konstruktor obiektów „{0}” wymaga argumentów w liczbie {1}. Wymagana sygnatura to „{2}”. Niektóre nazwy brakujących argumentów to: {3}.
pt_br: O construtor de membro ou objeto '{0}' requer {1} argumentos. A assinatura requerida é '{2}'. Alguns nomes dos argumentos em falta são {3}.
ru: Для конструктора элемента или объекта "{0}" требуется следующее число аргументов: {1}. Необходимая сигнатура: "{2}". Некоторые имена отсутствующих аргументов: {3}.
tr: Üye veya nesne oluşturucu '{0}' {1} bağımsız değişken gerektirir. Gereken imza: '{2}'. Eksik bağımsız değişkenlerden bazılarının adları: {3}.
zh_hans: 成员或对象构造函数“{0}”需要 {1} 个参数。所需签名为“{2}”。一些缺少的参数的名称为 {3}。
zh_hant: 成員或物件建構函式 '{0}' 需要 {1} 個引數。需要的簽章是 '{2}'。遺漏引數的部分名稱是 {3}。

# csMemberSignatureMismatch4
source: The member or object constructor '{0}' requires {1} additional argument(s). The required signature is '{2}'. Some names for missing arguments are {3}.
cs: Konstruktor členu nebo objektu {0} vyžaduje další argumenty ({1}). Požadovaná signatura je {2}. Některé názvy chybějících argumentů jsou {3}.
de: Der Member oder Objektkonstruktor "{0}" erfordert {1} zusätzliche(s) Argument(e). Die erforderliche Signatur lautet "{2}". Einige fehlende Argumente sind {3}.
es: El constructor de objeto o miembro '{0}' requiere {1} argumentos adicionales. La signatura necesaria es '{2}'. Algunos nombres de argumentos que faltan son {3}.
fr: Le membre ou le constructeur d'objet '{0}' requiert {1} argument(s) supplémentaire(s). La signature requise est '{2}'. Voici certains noms des arguments manquants : {3}.
it: Il costruttore di oggetti o membro '{0}' richiede {1} argomento/i aggiuntivo/i. La firma necessaria è '{2}'. Alcuni nomi di argomenti mancanti sono {3}.
ja: メンバーまたはオブジェクト コンストラクター '{0}' には追加で {1} 個の引数が必要です。必要なシグネチャは '{2}' です。足りない引数の名前は {3} です。
ko: 멤버 또는 개체 생성자 '{0}'을(를) 사용하려면 {1}개의 인수가 더 필요합니다. 필요한 시그니처는 '{2}'입니다. 누락된 인수의 이름에는 {3} 등이 있습니다.
pl: Konstruktor elementu członkowskiego lub obiektu „{0}” wymaga dodatkowych argumentów w liczbie {1}. Wymagana sygnatura to „{2}”. Niektóre nazwy brakujących argumentów to: {3}.
pt_br: O construtor de membro ou objeto '{0}' requer {1} argumentos adicionais. A assinatura requerida é '{2}'. Alguns nomes dos argumentos em falta são {3}.
ru: Для конструктора элемента или объекта "{0}" требуется следующее число дополнительных аргументов: {1}. Необходимая сигнатура: "{2}". Некоторые имена отсутствующих аргументов: {3}.
tr: Üye veya nesne oluşturucu '{0}' {1} bağımsız değişken daha gerektirir. Gereken imza: '{2}'. Eksik bağımsız değişkenlerden bazılarının adları: {3}.
zh_hans: 成员或对象构造函数“{0}”需要 {1} 个附加参数。所需签名为“{2}”。一些缺少的参数的名称为 {3}。
zh_hant: 成員或物件建構函式 '{0}' 還需要 {1} 個其他引數。需要的簽章是 '{2}'。遺漏引數的部分名稱是 {3}。

# csMemberSignatureMismatchArityNamed
source: The member or object constructor '{0}' requires {1} argument(s) but is here given {2} unnamed and {3} named argument(s). The required signature is '{4}'.
cs: Počet argumentů, které konstruktor členu nebo objektu {0} vyžaduje, je {1}, ale počet těch, které se mu tady předávají, je {2} (nepojmenované) a {3} (pojmenované). Požadovaná signatura je {4}.
de: Der Member oder Objektkonstruktor "{0}" erfordert {1} Argument(e), erhält hier aber {2} unbenannte(s) und {3} benannte(s) Argument(e). Die erforderliche Signatur lautet "{4}".
es: El constructor de objeto o miembro '{0}' requiere {1} argumentos, pero aquí se le proporcionan {2} sin nombre y {3} argumentos con nombre. La signatura necesaria es '{4}'.
fr: Le membre ou le constructeur d'objet '{0}' requiert {1} argument(s) mais reçoit ici {2} argument(s) non nommé(s) et {3} argument(s) nommé(s). La signature requise est '{4}'.
it: Il costruttore di oggetti o membro '{0}' richiede {1} argomento/i, tuttavia sono specificati {2} argomento/i non denominato/i e {3} argomento/i denominato/i. La firma necessaria è '{4}'.
ja: メンバーまたはオブジェクト コンストラクター '{0}' には {1} 個の引数が必要ですが、名前がない引数が {2} 個、名前付き引数が {3} 個です。必要なシグネチャは '{4}' です。
ko: 멤버 또는 개체 생성자 '{0}'을(를) 사용하려면 {1}개의 인수가 필요하지만 여기에서는 {2}개의 명명되지 않은 인수와 {3}개의 명명된 인수가 지정되었습니다. 필요한 시그니처는 '{4}'입니다.
pl: Konstruktor elementu członkowskiego lub obiektu „{0}” wymaga argumentów w liczbie {1}, ale podano tutaj nienazwane i nazwane argumenty w liczbie wynoszącej odpowiednio {2} i {3}. Wymagana sygnatura to „{4}”.
pt_br: O construtor de membro ou objeto '{0}' requer {1} argumentos, mas aqui são fornecidos os argumentos sem nome {2} e nomeado {3}. A assinatura requerida é '{4}'.
ru: Для конструктора элемента или объекта "{0}" требуется следующее число аргументов: {1}, однако здесь задано следующее число аргументов: неименованные ({2}) и именованные ({3}). Необходимая сигнатура: "{4}".
tr: Üye veya nesne oluşturucu '{0}' {1} bağımsız değişken alır ancak burada adlandırılmamış {2} ve adlandırılmış {3} bağımsız değişken verilmiş. Gereken imza: '{4}'.
zh_hans: 成员或对象构造函数“{0}”需要 {1} 个参数，而此处给定了 {2} 个未命名参数和 {3} 个已命名参数。所需签名为“{4}”。
zh_hant: 成員或物件建構函式 '{0}' 需要 {1} 個引數，但此處指定了 {2} 個未命名和 {3} 個具名引數。需要的簽章是 '{4}'。

# csMemberSignatureMismatchArity
source: The member or object constructor '{0}' takes {1} argument(s) but is here given {2}. The required signature is '{3}'.
cs: Počet argumentů, které přebírá konstruktor členu nebo objektu {0}, je {1}, ale počet těch, které se mu tady předávají, je {2}. Požadovaná signatura je {3}.
de: Der Member oder Objektkonstruktor "{0}" akzeptiert {1} Argument(e), erhält hier aber {2}. Die erforderliche Signatur lautet "{3}".
es: El constructor de objeto o miembro '{0}' toma {1} argumentos, pero aquí se le proporcionan {2}. La signatura necesaria es '{3}'.
fr: Le membre ou le constructeur d'objet '{0}' accepte {1} argument(s) mais en reçoit ici {2}. La signature requise est '{3}'.
it: Il costruttore di oggetti o membro '{0}' utilizza {1} argomento/i, tuttavia il numero di argomenti specificati è pari a {2}. La firma necessaria è '{3}'.
ja: メンバーまたはオブジェクト コンストラクター '{0}' には {1} 個の引数が必要ですが、{2} 個です。必要なシグネチャは '{3}' です。
ko: 멤버 또는 개체 생성자 '{0}'은(는) {1}개의 인수를 사용하지만 여기에서는 {2}개가 지정되었습니다. 필요한 시그니처는 '{3}'입니다.
pl: Konstruktor elementu członkowskiego lub obiektu „{0}” pobiera argumenty w liczbie {1}, ale podano tutaj {2}. Wymagana sygnatura to „{3}”.
pt_br: O construtor de membro ou objeto '{0}' obtém {1} argumentos, mas aqui são fornecidos {2}. A assinatura requerida é '{3}'.
ru: Для конструктора элемента или объекта "{0}" требуется следующее число аргументов: {1}, однако здесь задано следующее число аргументов: {2}. Необходимая сигнатура: "{3}".
tr: Üye veya nesne oluşturucu '{0}' {1} bağımsız değişken alır ancak burada {2} bağımsız değişken verilmiş. Gereken imza: '{3}'.
zh_hans: 成员或对象构造函数“{0}”需要 {1} 个参数，而此处给定了 {2} 个参数。所需签名为“{3}”。
zh_hant: 成員或物件建構函式 '{0}' 接受 {1} 個引數，但此處指定了 {2} 個。需要的簽章是 '{3}'。

# csCtorSignatureMismatchArity
source: The object constructor '{0}' takes {1} argument(s) but is here given {2}. The required signature is '{3}'.
cs: Konstruktor objektu {0} přebírá tento počet argumentů: {1}. Tady ale získal jen tento počet: {2}. Vyžadovaná signatura: {3}.
de: Der Objektkonstruktor "{0}" akzeptiert {1} Argument(e), erhält hier aber {2}. Die erforderliche Signatur ist "{3}".
es: El constructor de objeto "{0}" toma {1} argumentos, pero aquí se le dan {2}. La signatura necesaria es "{3}".
fr: Le constructeur d'objet '{0}' accepte {1} argument(s), mais il en reçoit {2} ici. La signature exigée est '{3}'.
it: Il costruttore di oggetti '{0}' accetta {1} argomento/i, ma ne sono stati specificati {2}. La firma obbligatoria è '{3}'.
ja: オブジェクト コンストラクター '{0}' には {1} 個の引数が必要ですが、指定されているのは {2} 個です。必要なシグネチャは '{3}' です。
ko: 개체 생성자 '{0}'은(는) {1}개의 인수를 사용하지만, 여기에서는 {2}개가 지정되었습니다. 필요한 시그니처는 '{3}'입니다.
pl: Konstruktor obiektu „{0}” przyjmuje argumenty {1}, ale tutaj podano {2}. Wymagany podpis to „{3}”.
pt_br: O construtor de objeto '{0}' obtém {1} argumentos, mas aqui são fornecidos {2}. A assinatura requerida é '{3}'.
ru: Конструктор объектов "{0}" принимает определенное число аргументов (а именно: {1}), но здесь ему предоставлено {2}. Требуется сигнатура "{3}".
tr: {0}' nesne oluşturucusunun {1} bağımsız değişken alması gerekiyor, ancak burada {2} bağımsız değişken almış. Gerekli imza: '{3}'.
zh_hans: 对象构造函数“{0}”有 {1} 个参数，但此处只提供 {2} 个。所需的签名为“{3}”。
zh_hant: 物件建構函式 '{0}' 要用到 {1} 個引數，但此處提供了 {2} 個引數。需要的簽章是 '{3}'。

# csCtorSignatureMismatchArityProp
source: The object constructor '{0}' takes {1} argument(s) but is here given {2}. The required signature is '{3}'. If some of the arguments are meant to assign values to properties, consider separating those arguments with a comma (',').
cs: Konstruktor objektu {0} přebírá tento počet argumentů: {1}. Tady ale získal jen tento počet: {2}. Vyžadovaná signatura: {3}. Pokud je účelem některých argumentů přiřazování hodnot k vlastnostem, zvažte oddělení těchto argumentů čárkou (,).
de: Der Objektkonstruktor "{0}" akzeptiert {1} Argument(e), erhält hier aber {2}. Die erforderliche Signatur ist "{3}". Wenn bestimmte Argumente Eigenschaften Werte zuordnen sollen, trennen Sie diese Argumente mit einem Komma (",").
es: El constructor de objeto "{0}" toma {1} argumentos, pero aquí se le dan {2}. La signatura necesaria es "{3}". Si algunos de los argumentos son para asignar valores a propiedades, considere separarlos con una coma (",").
fr: Le constructeur d'objet '{0}' accepte {1} argument(s), mais il en reçoit {2} ici. La signature exigée est '{3}'. Si certains arguments sont destinés à affecter des valeurs aux propriétés, séparez ces arguments par une virgule (',').
it: Il costruttore di oggetti '{0}' accetta {1} argomento/i, ma ne sono stati specificati {2}. La firma obbligatoria è '{3}'. Se alcuni degli argomenti vengono usati per assegnare valori alle proprietà, provare a delimitarli con una virgola (',').
ja: オブジェクト コンストラクター '{0}' には {1} 個の引数が必要ですが、指定されているのは {2} 個です。必要なシグネチャは '{3}' です。いくつかの引数がプロパティに値を割り当てる引数である場合は、それらの引数をコンマ (',') で区切ることを検討してください。
ko: 개체 생성자 '{0}'은(는) {1}개의 인수를 사용하지만, 여기에서는 {2}개가 지정되었습니다. 필요한 시그니처는 '{3}'입니다. 여러 인수로 속성에 값을 할당하는 경우 해당 인수를 쉼표(',')로 구분하세요.
pl: Konstruktor obiektu „{0}” przyjmuje argumenty {1}, ale tutaj podano {2}. Wymagany podpis to „{3}”. Jeśli niektóre z argumentów mają przypisywać wartości do właściwości, rozważ rozdzielenie tych argumentów za pomocą przecinka („,”).
pt_br: O construtor de objeto '{0}' obtém {1} argumentos, mas aqui são fornecidos {2}. A assinatura requerida é '{3}'. Se alguns dos argumentos tiver que atribuir valores a propriedades, considere separar esses argumentos com uma vírgula (',').
ru: Конструктор объектов "{0}" принимает определенное число аргументов (а именно: {1}), но здесь ему предоставлено {2}. Требуется сигнатура "{3}". Если некоторые аргументы предполагают назначение значений свойствам, рекомендуется отделить их запятой (",").
tr: {0}' nesne oluşturucusunun {1} bağımsız değişken alması gerekiyor, ancak burada {2} bağımsız değişken almış. Gerekli imza: '{3}'. Bazı bağımsız değişkenler özelliklere değer atamak için kullanıldıysa, bu bağımsız değişkenleri virgül (',') ile ayırmanız önerilir.
zh_hans: 对象构造函数“{0}”有 {1} 个参数，但此处只提供 {2} 个。所需的签名为“{3}”。如果某些参数用于向属性分配值，请考虑使用逗号(",")分隔这些参数。
zh_hant: 物件建構函式 '{0}' 要用到 {1} 個引數，但此處提供了 {2} 個引數。需要的簽章是 '{3}'。如果有部分引數是要為屬性指派值，請考慮以逗號 (',') 分隔這些引數。
