Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DefinitionsInSigAndImplNotCompatibleSignatureSaysNull2
source: The {0} definitions for type '{1}' in the signature and implementation are not compatible because the signature says this type may use nulls as an extra value but the implementation does not
cs: Definice {0} pro typ {1} v signatuře a implementaci nejsou kompatibilní, protože signatura uvádí, že tento typ může jako hodnotu navíc používat null, ale implementace to neuvádí.
de: Die {0} Definitionen für den Typ "{1}" in der Signatur und in der Implementierung sind nicht kompatibel, weil dieser Typ laut Signatur NULL als zusätzlichen Wert verwenden darf, laut Implementierung aber nicht.
es: Las definiciones de {0} para el tipo "{1}" en la signatura y la implementación no son compatibles porque la signatura indica que este tipo puede usar valores NULL como un valor extra pero la implementación no
fr: Les {0} définitions pour le type '{1}' dans la signature et l'implémentation ne sont pas compatibles, car la signature indique que ce type peut utiliser des valeurs Null comme valeurs supplémentaires, contrairement à l'implémentation
it: Le definizioni di {0} per il tipo '{1}' nella firma e nell'implementazione non sono compatibili perché in base alla firma questo tipo e non l'implementazione può usare come valore aggiuntivo valori Null
ja: シグネチャでは特別な値としてこの型に null を使用できると指定していますが、実装は指定していないため、シグネチャおよび実装内の型 '{1}' の {0} 定義は互換性がありません
ko: 시그니처가 이 형식에서 null을 추가 값으로 사용할 수 있다고 하지만 구현은 그렇지 않으므로 시그니처 및 구현의 '{1}' 형식에 대한 {0} 정의가 호환되지 않습니다.
pl: Definicje {0} dla typu „{1}” w sygnaturze i implementacji są niezgodne, ponieważ sygnatura wskazuje, że ten typ może używać wartości null jako dodatkowej wartości, ale implementacja tego nie wskazuje
pt_br: As definições {0} para o tipo '{1}' na assinatura e implementação não são compatíveis, pois a assinatura diz que este tipo pode usar nulos como um valor adicional, mas a implementação não
ru: Определения {0} для типа "{1}" в сигнатуре и реализации несовместимы, так как сигнатура (в отличие от реализации) определяет, что этот тип может использовать значение NULL в качестве дополнительного значения.
tr: İmzada bu türün ek değer olarak null değerleri kullanabileceği belirtilmesine rağmen uygulamada bu belirtilmediğinden, imza ve uygulamadaki '{1}' türü için {0} tanımları uyumlu değil
zh_hans: 签名和实现中类型“{1}”的 {0} 定义不兼容，因为签名指明此类型可以使用 null 作为额外值，而实现未指明这一点
zh_hant: 簽章與實作中類型 '{1}' 的 {0} 定義不相容，因為簽章宣稱這個類型可以使用 null 作為額外值，但實作未宣稱

# DefinitionsInSigAndImplNotCompatibleImplementationSealed
source: The {0} definitions for type '{1}' in the signature and implementation are not compatible because the implementation type is sealed but the signature implies it is not. Consider adding the [<Sealed>] attribute to the signature.
cs: Definice {0} pro typ {1} v signatuře a implementaci nejsou kompatibilní, protože typ implementace je zapečetěný, ale signatura uvádí, že není. Zvažte možnost přidat k signatuře atribut [<Sealed>].
de: Die {0}-Definitionen für den Typ "{1}" in der Signatur und in der Implementierung sind nicht kompatibel, weil der Implementierungstyp versiegelt ist, laut Signatur aber nicht versiegelt sein sollte. Fügen Sie der Signatur ggf. das [<Sealed>]-Attribut hinzu.
es: Las definiciones {0} para el tipo "{1}" en la firma y la implementación no son compatibles porque el tipo de implementación está sellado pero la firma implica que no lo está. Considere agregar el atributo [<Sealed>] a la firma.
fr: Les définitions {0} du type '{1}' dans la signature et l'implémentation ne sont pas compatibles, car le type d'implémentation est sealed et la signature suggère qu'il ne l'est pas. Ajoutez l'attribut [<Sealed>] à la signature.
it: Le definizioni di {0} per il tipo '{1}' nella firma e nell'implementazione non sono compatibili perché il tipo di implementazione è sealed ma la firma implica che non lo sia. Provare ad aggiungere l'attributo [<Sealed>] alla firma.
ja: シグネチャと実装の型 '{1}' の {0} 定義に互換性がありません。実装の種類はシールドですが、シグネチャではシールドが暗黙的に示されていません。シグネチャに [<Sealed>] 属性を追加してください。
ko: 구현 형식이 봉인되어 있지만 시그니처는 봉인되어 있지 않음을 암시하므로 시그니처 및 구현의 '{1}' 형식 {0} 정의가 호환되지 않습니다. 시그니처에 [<Sealed>] 특성을 추가하세요.
pl: Definicje {0} dla typu „{1}” w podpisie i implementacji są niezgodne, ponieważ typ implementacji jest zapieczętowany, ale podpis sugeruje, że nie jest zapieczętowany. Rozważ dodanie atrybutu [<Sealed>] do podpisu.
pt_br: As definições de {0} para o tipo '{1}' na assinatura e na implementação não são compatíveis, porque o tipo de implementação é selado, mas a assinatura implica que não é. Adicione o atributo [<Sealed>] à assinatura.
ru: Определения {0} типа '{1}' в подписи и реализации несовместимы, так как тип реализации закрыт, но он не должен быть закрыт согласно подписи. Добавьте в подпись атрибут [<Sealed>].
tr: Uygulama türü mühürlü olduğu halde imza mühürlü olmadığını işaret ettiğinden, '{1}' türü için imzadaki ve uygulamadaki {0} tanımları uyumsuz. İmzaya [<Sealed>] özniteliğini eklemeyi göz önünde bulundurun.
zh_hans: 签名和实现中类型为“{1}”的 {0} 定义不兼容，因为实现类型已密封，但签名暗示其未密封。请考虑向签名添加 [<Sealed>] 属性。
zh_hant: 因為實作類型已密封，特徵標記卻表示未密封，所以特徵標記和實作中類型 '{1}' 的 {0} 定義不相容。請考慮將 [<Sealed>] 屬性新增到特徵標記。

# DefinitionsInSigAndImplNotCompatibleImplementationIsNotSealed
source: The {0} definitions for type '{1}' in the signature and implementation are not compatible because the implementation type is not sealed but signature implies it is. Consider adding the [<Sealed>] attribute to the implementation.
cs: Definice {0} pro typ {1} v signatuře a implementaci nejsou kompatibilní, protože typ implementace není zapečetěný, ale signatura uvádí, že je. Zvažte možnost přidat k implementaci atribut [<Sealed>].
de: Die {0}-Definitionen für den Typ "{1}" in der Signatur und in der Implementierung sind nicht kompatibel, weil der Implementierungstyp nicht versiegelt ist, laut Signatur aber versiegelt sein sollte. Fügen Sie der Implementierung ggf. das [<Sealed>]-Attribut hinzu.
es: Las definiciones {0} para el tipo "{1}" en la firma y la implementación no son compatibles porque el tipo de implementación no está sellado pero la firma implica que lo está. Considere agregar el atributo [<Sealed>] a la implementación.
fr: Les définitions {0} du type '{1}' dans la signature et l'implémentation ne sont pas compatibles, car le type d'implémentation n'est pas sealed et la signature suggère qu'il l'est. Ajoutez l'attribut [<Sealed>] à l'implémentation.
it: Le definizioni di {0} per il tipo '{1}' nella firma e nell'implementazione non sono compatibili perché il tipo di implementazione non è sealed ma la firma implica che lo sia. Provare ad aggiungere l'attributo [<Sealed>] all'implementazione.
ko: 구현 형식이 봉인되어 있지 않지만 시그니처는 봉인되어 있음을 암시하므로 시그니처 및 구현의 '{1}' 형식에 대한 {0} 정의가 호환되지 않습니다. 구현에 [<Sealed>] 특성을 추가해 보세요.
pl: Definicje {0} dla typu „{1}” w podpisie i implementacji są niezgodne, ponieważ typ implementacji nie jest zapieczętowany, ale sygnatura sugeruje, że jest zapieczętowany. Rozważ dodanie atrybutu [<Sealed>] do implementacji.
pt_br: As definições de {0} para o tipo '{1}' na assinatura e na implementação não são compatíveis, porque o tipo de implementação não é selado, mas a assinatura implica que é. Adicione o atributo [<Sealed>] à implementação.
ru: Определения {0} типа '{1}' в подписи и реализации несовместимы, так как тип реализации не закрыт, однако в соответствии с подписью он должен быть закрыт. Добавьте атрибут [<Sealed>] в реализацию.
tr: Uygulama türü mühürlü olmadığı halde imza mühürlü olduğunu işaret ettiğinden, '{1}' türü için imzadaki ve uygulamadaki {0} tanımları uyumsuz. İmzaya [<Sealed>] özniteliğini eklemeyi göz önünde bulundurun.
zh_hans: 签名和实现中类型为“{1}”的 {0} 定义不兼容，因为实现类型并未密封，但签名暗示其已密封。请考虑向实现添加 [<Sealed>] 属性。
zh_hant: 因為實作類型未密封，但特徵標記表示其已密封，所以特徵標記和實作中類型 '{1}' 的 {0} 定義不相容。請考慮將 [<Sealed>] 屬性新增到實作。

# DefinitionsInSigAndImplNotCompatibleImplementationIsAbstract
source: The {0} definitions for type '{1}' in the signature and implementation are not compatible because the implementation is an abstract class but the signature is not. Consider adding the [<AbstractClass>] attribute to the signature.
cs: Definice {0} pro typ {1} v signatuře a implementaci nejsou kompatibilní, protože implementace je abstraktní třída, ale signatura ne. Zvažte možnost přidat k signatuře atribut [<AbstractClass>].
de: Die {0} Definitionen für den Typ "{1}" in der Signatur und in der Implementierung sind nicht kompatibel, weil es sich bei der Implementierung um eine abstrakte Klasse handelt, bei der Signatur hingegen nicht. Fügen Sie der Signatur ggf. das [<AbstractClass>]-Attribut hinzu.
es: Las definiciones de {0} de tipo "{1}" en la firma y la aplicación no son compatibles porque la aplicación es una clase abstracta, pero la firma no los es. Considere agregar el atributo [<AbstractClass>] a la firma.
fr: Les définitions {0} du type '{1}' dans la signature et l'implémentation ne sont pas compatibles, car l'implémentation est une classe abstraite et la signature ne l'est pas. Ajoutez l'attribut [<AbstractClass>] à la signature.
it: Le definizioni di {0} per il tipo '{1}' nella firma e nell'implementazione non sono compatibili perché, a differenza della firma, l'implementazione è una classe astratta. Provare ad aggiungere l'attributo [<AbstractClass>] alla firma.
ja: シグネチャと実装の型 '{1}' の {0} 定義に互換性がありません。実装は抽象クラスですが、シグネチャは抽象クラスではありません。シグネチャに [<AbstractClass>] 属性を追加してください。
ko: 구현이 추상 클래스이지만 시그니처는 추상 클래스가 아니므로 시그니처 및 구현의 '{1}' 형식에 대한 {0} 정의가 호환되지 않습니다. 시그니처에 [<AbstractClass>] 특성을 추가해 보세요.
pl: Definicje {0} dla typu „{1}” w podpisie i implementacji są niezgodne, ponieważ implementacja jest klasą abstrakcyjną, a podpis nie. Rozważ dodanie atrybutu [<AbstractClass>] do podpisu.
pt_br: As definições de {0} para o tipo '{1}' na assinatura e na implementação não são compatíveis, porque a implementação é uma classe abstrata, mas a assinatura não é. Adicione o atributo [< AbstractClass>] para a assinatura.
ru: Определения {0} типа '{1}' в подписи и реализации несовместимы, так как реализация представляет собой абстрактный класс, а подпись — нет. Добавьте атрибут [<AbstractClass>] к подписи.
tr: Uygulama soyut bir sınıf olduğu halde imza soyut sınıf olmadığından '{1}' türü için imzadaki ve uygulamadaki {0} tanımları uyumlu değil. İmzaya [<AbstractClass>] özniteliğini eklemeyi göz önünde bulundurun.
zh_hans: 签名和实现中类型为“{1}”的 {0} 定义不兼容，因为实现是一个抽象类，但签名不是。请考虑向签名添加 [<AbstractClass>] 属性。
zh_hant: 因為實作是抽象類別，但特徵標記並不是，所以特徵標記和實作中類型 '{1}' 的 {0} 定義不相容。請考慮將 [<AbstractClass>] 屬性新增到特徵標記。

# DefinitionsInSigAndImplNotCompatibleSignatureIsAbstract
source: The {0} definitions for type '{1}' in the signature and implementation are not compatible because the signature is an abstract class but the implementation is not. Consider adding the [<AbstractClass>] attribute to the implementation.
cs: Definice {0} pro typ {1} v signatuře a implementaci nejsou kompatibilní, protože signatura je abstraktní třída, ale implementace ne. Zvažte možnost přidat k implementaci atribut [<AbstractClass>].
de: Die {0}-Definitionen für den Typ "{1}" in der Signatur und Implementierung sind nicht kompatibel, da es sich bei der Signatur um eine abstrakte Klasse handelt, bei der Implementierung jedoch nicht. Fügen Sie das [<AbstractClass>]-Attribut zur Implementierung hinzu.
es: Las definiciones {0} para el tipo "{1}" en la firma y la implementación no son compatibles porque la firma es una clase abstracta, pero la implementación no lo es. Considere agregar el atributo [<AbstractClass>] a la implementación.
fr: Les définitions {0} pour le type '{1}' dans la signature et l'implémentation ne sont pas compatibles, car la signature est une classe abstraite et l'implémentation ne l'est pas. Ajoutez l'attribut [<AbstractClass>] à l'implémentation.
it: Le definizioni di {0} per il tipo '{1}' nella firma e nell'implementazione non sono compatibili perché, a differenza dell'implementazione, la firma è una classe astratta. Provare ad aggiungere l'attributo [<AbstractClass>] all'implementazione.
ja: シグネチャと実装の型 '{1}' の {0} の定義には互換性がありません。シグネチャは抽象クラスですが、実装は抽象クラスではありません。実装に [<AbstractClass>] 属性を追加してください。
ko: 시그니처가 추상 클래스이지만 구현은 추상 클래스가 아니므로 시그니처 및 구현의 '{1}' 형식에 대한 {0} 정의가 호환되지 않습니다. 구현에 [<AbstractClass>] 특성을 추가해 보세요.
pl: Definicje {0} typu „{1}” w podpisie i implementacji są niezgodne, ponieważ podpis jest klasą abstrakcyjną, a implementacja nią nie jest. Rozważ dodanie atrybutu [<AbstractClass>] do implementacji.
pt_br: As definições de {0} para o tipo '{1}' na assinatura e na implementação não são compatíveis, porque a assinatura é uma classe abstrata, mas a implementação não é. Adicione o atributo [<AbstractClass>] à implementação.
ru: Определения {0} для типа '{1}' в подписи и реализации несовместимы, так как подпись является абстрактным классом, а реализация — нет. Добавьте атрибут [<AbstractClass>] к реализации.
tr: İmza soyut bir sınıf olduğu halde uygulama soyut sınıf olmadığından '{1}' türü için imzadaki ve uygulamadaki {0} tanımları uyumlu değil. Uygulamaya [<AbstractClass>] özniteliğini eklemeyi göz önünde bulundurun.
zh_hans: 签名和实现中类型为“{1}”的 {0} 定义不兼容，因为签名是一个抽象类，但实现不是。请考虑向实现添加 [<AbstractClass>] 属性。
zh_hant: 因為特徵標記是抽象類別。但實作並不是，所以特徵標記和實作中類型 '{1}' 的 {0} 定義不相容。請考慮將 [<AbstractClass>] 屬性新增到實作。

# DefinitionsInSigAndImplNotCompatibleTypesHaveDifferentBaseTypes
source: The {0} definitions for type '{1}' in the signature and implementation are not compatible because the types have different base types
cs: Definice {0} pro typ {1} v signatuře a implementaci nejsou kompatibilní, protože jejich typy mají odlišné základní typy.
de: Die {0} Definitionen für den Typ "{1}" in der Signatur und in der Implementierung sind nicht kompatibel, weil die Typen unterschiedliche Basistypen aufweisen.
es: Las definiciones de {0} para el tipo "{1}" en la signatura y la implementación no son compatibles porque los tipos tienen tipos base diferentes
fr: Les {0} définitions pour le type '{1}' dans la signature et l'implémentation ne sont pas compatibles, car les types ont des types de base différents
it: Le definizioni di {0} per il tipo '{1}' nella firma e nell'implementazione non sono compatibili perché i tipi hanno tipi di base diversi
ja: 型の基本型が異なるため、シグネチャおよび実装内の型 '{1}' の {0} 定義は互換性がありません
ko: 형식의 기본 형식이 서로 다르므로 시그니처 및 구현의 '{1}' 형식에 대한 {0} 정의가 호환되지 않습니다.
pl: Definicje {0} dla typu „{1}” w sygnaturze i implementacji są niezgodne, ponieważ typy mają różne typy podstawowe
pt_br: As definições {0} para o tipo '{1}' na assinatura e implementação não são compatíveis, pois os tipos têm bases diferentes
ru: Определения {0} для типа "{1}" в сигнатуре и реализации несовместимы, так как типы имеют разные базовые типы.
tr: Türler farklı temel türlere sahip olduğundan, imza ve uygulamadaki '{1}' türü için {0} tanımları uyumlu değil
zh_hans: 签名和实现中类型“{1}”的 {0} 定义不兼容，因为类型具有不同的基类型
zh_hant: 簽章與實作中類型 '{1}' 的 {0} 定義不相容，因為類型具有不同的基底類型

# DefinitionsInSigAndImplNotCompatibleNumbersDiffer
source: The {0} definitions for type '{1}' in the signature and implementation are not compatible because the number of {2}s differ
cs: Definice {0} pro typ {1} v signatuře a implementaci nejsou kompatibilní, protože se liší počet {2}.
de: Die {0} Definitionen für den Typ "{1}" in der Signatur und in der Implementierung sind nicht kompatibel, weil die {2}-Anzahl unterschiedlich ist.
es: Las definiciones de {0} para el tipo "{1}" en la signatura y la implementación no son compatibles porque el número de {2}s difiere.
fr: Les {0} définitions pour le type '{1}' dans la signature et l'implémentation ne sont pas compatibles, car le nombre de {2} est différent
it: Le definizioni di {0} per il tipo '{1}' nella firma e nell'implementazione non sono compatibili perché il numero di elementi {2} è diverso
ja: {2} の数が異なるため、シグネチャおよび実装内の型 '{1}' の {0} 定義は互換性がありません
ko: {2} 수가 서로 다르므로 시그니처 및 구현의 '{1}' 형식에 대한 {0} 정의가 호환되지 않습니다.
pl: Definicje {0} dla typu „{1}” w sygnaturze i implementacji są niezgodne, ponieważ liczba elementów {2} jest różna
pt_br: As definições {0} para o tipo '{1}' na assinatura e implementação não são compatíveis, pois o número de {2}s são diferentes
ru: Определения {0} для типа "{1}" в сигнатуре и реализации несовместимы, так как количества {2} различаются.
tr: {2} sayıları farklı olduğundan, imza ve uygulamadaki '{1}' türü için {0} tanımları uyumlu değil
zh_hans: 签名和实现中类型“{1}”的 {0} 定义不兼容，因为 {2} 的数量不同
zh_hant: 簽章與實作中類型 '{1}' 的 {0} 定義不相容，因為 {2} 數目不同

# DefinitionsInSigAndImplNotCompatibleSignatureDefinesButImplDoesNot
source: The {0} definitions for type '{1}' in the signature and implementation are not compatible because the signature defines the {2} '{3}' but the implementation does not (or does, but not in the same order)
cs: Definice {0} pro typ {1} v signatuře a implementaci nejsou kompatibilní, protože signatura definuje {2} {3}, ale implementace ne (anebo ano, ale ne ve stejném pořadí).
de: Die {0} Definitionen für den Typ "{1}" in der Signatur und in der Implementierung sind nicht kompatibel, weil in der Signatur {2} "{3}" definiert ist, in der Implementierung aber nicht (oder nicht in der gleichen Reihenfolge).
es: Las definiciones de {0} para el tipo "{1}" en la signatura y la implementación no son compatibles porque la signatura define el {2} "{3}" pero la implementación no (o sí lo define pero en otro orden)
fr: Les {0} définitions pour le type '{1}' dans la signature et l'implémentation ne sont pas compatibles, car la signature définit le {2} '{3}' mais l'implémentation ne le fait pas (ou elle le fait mais dans un ordre différent)
it: Le definizioni di {0} per il tipo '{1}' nella firma e nell'implementazione non sono compatibili perché la firma definisce l'elemento {2} '{3}', il quale non è definito oppure è definito in un ordine diverso nell'implementazione
ja: シグネチャでは {2} '{3}' を定義していますが、実装では定義していないため (または定義していても同じ順序ではないため)、シグネチャおよび実装内の型 '{1}' の {0} 定義は互換性がありません
ko: 시그니처가 {2} '{3}'을(를) 정의하지만 구현은 그렇지 않거나 그렇더라도 순서가 다르므로 시그니처 및 구현의 '{1}' 형식에 대한 {0} 정의가 호환되지 않습니다.
pl: Definicje {0} dla typu „{1}” w sygnaturze i implementacji są niezgodne, ponieważ sygnatura definiuje element {2} „{3}”, ale implementacja nie (albo definiuje w innej kolejności)
pt_br: As definições {0} para o tipo '{1}' na assinatura e implementação não são compatíveis, pois a assinatura define {2} '{3}', mas a implementação não (ou define em uma ordem diferente)
ru: Определения {0} для типа "{1}" в сигнатуре и реализации несовместимы, так как сигнатура определяет {2} "{3}", а реализация — нет (или определяет, но не в том же порядке).
tr: İmzada '{3}' adlı {2} tanımlanmasına rağmen uygulamada tanımlanmadığından (veya farklı sırayla tanımlandığından), imza ve uygulamadaki '{1}' türü için {0} tanımları uyumlu değil
zh_hans: 签名和实现中类型“{1}”的 {0} 定义不兼容，因为签名定义了 {2}“{3}”，而实现没有定义(或者按不同的顺序进行了定义)
zh_hant: 簽章與實作中類型 '{1}' 的 {0} 定義不相容，因為簽章定義了 {2} '{3}'，但實作沒有 (或雖然定義了，但順序不同)

# DefinitionsInSigAndImplNotCompatibleImplDefinesButSignatureDoesNot
source: The {0} definitions for type '{1}' in the signature and implementation are not compatible because the implementation defines the {2} '{3}' but the signature does not (or does, but not in the same order)
cs: Definice {0} pro typ {1} v signatuře a implementaci nejsou kompatibilní, protože implementace definuje {2} {3}, ale signatura ne (anebo ano, ale ne ve stejném pořadí).
de: Die {0} Definitionen für den Typ "{1}" in der Signatur und in der Implementierung sind nicht kompatibel, weil in der Implementierung {2} "{3}" definiert ist, in der Signatur aber nicht (oder nicht in der gleichen Reihenfolge).
es: Las definiciones de {0} para el tipo "{1}" en la signatura y la implementación no son compatibles porque la implementación define el {2} "{3}"' pero la signatura no (o sí lo define pero en otro orden)
fr: Les {0} définitions pour le type '{1}' dans la signature et l'implémentation ne sont pas compatibles, car l'implémentation définit le {2} '{3}' mais la signature ne le fait pas (ou elle le fait mais dans un ordre différent)
it: Le definizioni di {0} per il tipo '{1}' nella firma e nell'implementazione non sono compatibili perché l'implementazione definisce l'elemento {2} '{3}', il quale non è definito oppure è definito in un ordine diverso nella firma
ja: 実装では {2} '{3}' を定義していますが、シグネチャでは定義していないため (または定義していても同じ順序ではないため)、シグネチャおよび実装内の型 '{1}' の {0} 定義は互換性がありません
ko: 구현이 {2} '{3}'을(를) 정의하지만 시그니처는 그렇지 않거나 그렇더라도 순서가 다르므로 시그니처 및 구현의 '{1}' 형식에 대한 {0} 정의가 호환되지 않습니다.
pl: Definicje {0} dla typu „{1}” w sygnaturze i implementacji są niezgodne, ponieważ implementacja definiuje element {2} „{3}”, ale sygnatura nie (albo definiuje w innej kolejności)
pt_br: As definições {0} para o tipo '{1}' na assinatura e implementação não são compatíveis, pois a implementação define {2} '{3}', mas a assinatura não (ou define em ordem diferente)
ru: Определения {0} для типа "{1}" в сигнатуре и реализации несовместимы, так как реализация определяет {2} "{3}", а сигнатура — нет (или определяет, но не в том же порядке).
tr: Uygulamada '{3}' adlı {2} tanımlanmasına rağmen imzada tanımlanmadığından (veya farklı sırada tanımlandığından), imza ve uygulamadaki '{1}' türü için {0} tanımları uyumlu değil
zh_hans: 签名和实现中类型“{1}”的 {0} 定义不兼容，因为实现定义了 {2}“{3}”，而签名没有定义(或者按不同的顺序进行了定义)
zh_hant: 簽章與實作中類型 '{1}' 的 {0} 定義不相容，因為實作定義了 {2} '{3}'，但簽章沒有 (或雖然定義了，但順序不同)

# DefinitionsInSigAndImplNotCompatibleImplDefinesStruct
source: The {0} definitions for type '{1}' in the signature and implementation are not compatible because the implementation defines a struct but the signature defines a type with a hidden representation
cs: Definice {0} pro typ {1} v signatuře a implementaci nejsou kompatibilní, protože implementace definuje strukturu, zatímco signatura typ se skrytou reprezentací.
de: Die {0} Definitionen für den Typ "{1}" in der Signatur und in der Implementierung sind nicht kompatibel, weil in der Implementierung eine Struktur definiert ist, in der Signatur hingegen ein Typ mit einer verborgenen Darstellung.
es: Las definiciones de {0} para el tipo "{1}" en la signatura y la implementación no son compatibles porque la implementación define un struct pero la signatura define un tipo con una representación oculta
fr: Les {0} définitions pour le type '{1}' dans la signature et l'implémentation ne sont pas compatibles, car l'implémentation définit un struct alors que la signature définit un type avec une représentation masquée
it: Le definizioni di {0} per il tipo '{1}' nella firma e nell'implementazione non sono compatibili perché l'implementazione definisce uno struct, ma la firma definisce un tipo con una rappresentazione nascosta
ja: 実装では構造体を定義していますが、シグネチャでは隠ぺいされた表現で型を定義しているため、シグネチャおよび実装内の型 '{1}' の {0} 定義は互換性がありません
ko: 구현이 구조체를 정의하지만 시그니처는 숨겨진 표현이 있는 형식을 정의하므로 시그니처 및 구현의 '{1}' 형식에 대한 {0} 정의가 호환되지 않습니다.
pl: Definicje {0} dla typu „{1}” w sygnaturze i implementacji są niezgodne, ponieważ implementacja definiuje strukturę, ale sygnatura definiuje typ z ukrytą reprezentacją
pt_br: As definições {0} para o tipo '{1}' na assinatura e implementação não são compatíveis, pois a implementação define um struct, mas a assinatura define um tipo com representação oculta
ru: Определения {0} для типа "{1}" в сигнатуре и реализации несовместимы, так как реализация определяет структуру, а сигнатура определяет тип со скрытым представлением.
tr: Uygulamada bir struct tanımlanmasına rağmen imzada gizli temsili olan bir tür tanımlandığından, imza ve uygulamadaki '{1}' türü için {0} tanımları uyumlu değil
zh_hans: 签名和实现中类型“{1}”的 {0} 定义不兼容，因为实现定义了一个结构，而签名采用隐藏的表示形式定义了一个类型
zh_hant: 簽章與實作中類型 '{1}' 的 {0} 定義不相容，因為實作定義了結構，但簽章定義了具隱藏表示法的類型
