Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# crefQuotationsCantContainGenericFunctions
source: Quotations cannot contain function definitions that are inferred or declared to be generic. Consider adding some type constraints to make this a valid quoted expression.
cs: Citace nemůžou obsahovat definice funkcí, které jsou odvozené nebo deklarované jako obecné. Zvažte přidání některých omezení typu, abyste vytvořili platný citovaný výraz.
de: Anführungszeichen dürfen keine Funktionsdefinitionen enthalten, die per Rückschluss abgeleitet sind oder als generisch deklariert werden. Fügen Sie Typeinschränkungen hinzu, damit dieser Ausdruck in Anführungszeichen gültig wird.
es: Las expresiones de código delimitadas no pueden contener definiciones de función que se infieran o declaren como genéricas. Considere agregar restricciones de tipo para que esta sea una expresión entre comillas válida.
fr: Les citations ne peuvent pas contenir de définitions de fonction déduites ou déclarées comme étant génériques. Ajoutez des contraintes de type pour rendre cette expression citée valide.
it: Le quotation non possono contenere definizioni di funzioni dedotte o dichiarate in modo da essere generiche. Provare ad aggiungere alcuni vincoli di tipo per rendere l'espressione in quotation valida.
ja: 引用符内には、ジェネリック型に推論または宣言する関数定義を含めることはできません。有効な引用符付きの式にするには、何らかの型の制約を追加してください。
ko: 인용구에는 제네릭 형식으로 유추되거나 선언되는 함수 정의를 포함할 수 없습니다. 형식 제약 조건을 추가하여 올바른 따옴표 붙은 식으로 만드세요.
pl: Wyrażenia cytowane nie mogą zawierać definicji funkcji, które są wnioskowane lub deklarowane jako ogólne. Rozważ dodanie ograniczeń typów w celu zapewnienia poprawności tego wyrażenia cytowanego.
pt_br: Cotações não podem conter definições de funções que foram deduzidas ou declaradas como genéricas. Considere adicionar algumas restrições para fazer desta uma expressão cotada válida.
ru: В кавычки нельзя заключать определения выведенных функций или функций, объявленных как универсальные. Рекомендуется добавить ограничения типа, преобразующие это выражение в допустимое выражение с кавычками.
tr: Alıntılar, genel olduğu çıkarılmış veya tanımlanmış işlev tanımları içeremez. Bunu geçerli bir alıntı ifadesi yapmak için bazı tür kısıtlamaları eklemeyi düşünün.
zh_hans: 引用内容不能包含推理为或声明为泛型的函数声明。请考虑添加一些类型约束，以使此引用内容成为带引号的有效表达式。
zh_hant: 引號內不能包含推斷或宣告為泛型的函式定義。請考慮加入一些類型條件約束，使它成為有效的加引號運算式。

# crefQuotationsCantContainObjExprs
source: Quotations cannot contain object expressions
cs: Citace nemůžou obsahovat objektové výrazy.
de: Anführungszeichen dürfen keine Objektausdrücke enthalten.
es: Las expresiones de código delimitadas no pueden contener expresiones de objeto.
fr: Les quotations ne peuvent pas contenir d'expressions d'objet
it: Le quotation non possono contenere espressioni di oggetto
ja: 引用符内には、オブジェクト式を含めることはできません
ko: 인용구에는 개체 식을 포함할 수 없습니다.
pl: Wyrażenia cytowane nie mogą zawierać wyrażeń obiektu
pt_br: Cotações não podem conter expressões de objeto
ru: Цитаты не могут содержать выражения объектов
tr: Alıntılar, nesne ifadeleri içeremez
zh_hans: 引用内容不能包含对象表达式
zh_hant: 引號內不能包含物件運算式

# crefQuotationsCantContainAddressOf
source: Quotations cannot contain expressions that take the address of a field
cs: Citace nemůžou obsahovat výrazy, které přebírají adresu pole.
de: Anführungszeichen dürfen keine Ausdrücke enthalten, die die Adresse eines Felds aufnehmen.
es: Las expresiones de código delimitadas no pueden contener expresiones que tomen la dirección de un campo.
fr: Les quotations ne peuvent pas contenir d'expressions qui acceptent l'adresse d'un champ
it: Le quotation non possono contenere espressioni che utilizzano l'indirizzo di un campo
ja: 引用符内には、フィールドのアドレスを使用した式を含めることはできません
ko: 인용구에는 필드의 주소를 사용하는 식을 포함할 수 없습니다.
pl: Konstrukcje w cudzysłowie nie mogą zawierać wyrażeń, które pobierają adres pola
pt_br: Cotações não podem conter expressões que obtêm o endereço de um campo
ru: В кавычки нельзя заключать выражения, используемые для получения адреса поля
tr: Alıntılar, bir alanın adresini alan ifadeler içeremez
zh_hans: 引用内容不能包含采用字段地址的表达式
zh_hant: 引號內不能包含接受欄位位址的運算式

# crefQuotationsCantContainStaticFieldRef
source: Quotations cannot contain expressions that fetch static fields
cs: Citace nemůžou obsahovat výrazy, které načítají statická pole.
de: Anführungszeichen dürfen keine Ausdrücke enthalten, die statische Felder abrufen.
es: Las expresiones de código delimitadas no pueden contener expresiones que busquen campos estáticos.
fr: Les quotations ne peuvent pas contenir d'expressions qui récupèrent des champs statiques
it: Le quotation non possono contenere espressioni che recuperano campi statici
ja: 引用符内には、静的フィールドをフェッチする式を含めることはできません
ko: 인용구에는 정적 필드를 페치하는 식을 포함할 수 없습니다.
pl: Wyrażenia cytowane nie mogą zawierać wyrażeń, które pobierają pola statyczne
pt_br: Cotações não podem conter expressões que buscam campos estáticos
ru: Цитаты не могут содержать выражения, извлекающие статические поля
tr: Alıntılar, statik alanlar getiren ifadeler içeremez
zh_hans: 引用内容不能包含获取静态字段的表达式
zh_hant: 引號內不能包含擷取靜態欄位的運算式

# crefQuotationsCantContainInlineIL
source: Quotations cannot contain inline assembly code or pattern matching on arrays
cs: Citace nemůžou obsahovat vložený kód sestavení nebo porovnávání vzorů polí.
de: Anführungszeichen dürfen keinen Inlineassemblycode oder Mustervergleich für Arrays enthalten.
es: Las expresiones de código delimitadas no pueden contener código de ensamblado alineado ni detección de patrones en matrices.
fr: Les quotations ne peuvent pas contenir de code assembleur inline ou de critères spéciaux dans les tableaux
it: Le quotation non possono contenere codice assembly inline o criteri di ricerca in matrici
ja: 引用符内にインライン アセンブラー コードまたは配列のパターン マッチを含めることはできません
ko: 인용구에는 인라인 어셈블리 코드 또는 배열에 대한 패턴 일치를 포함할 수 없습니다.
pl: Konstrukcje w cudzysłowie nie mogą zawierać wbudowanego kodu zestawu lub dopasowania wzorca w tablicach
pt_br: Cotações não podem conter código de assembly embutido ou padrões coincidentes em matrizes
ru: Цитаты не могут содержать встроенный код сборки или сопоставление по шаблону для массивов
tr: Alıntılar, satır içi bütünleştirilmiş kod kodu veya dizilerde desen eşleştirme içeremez
zh_hans: 引用内容不能包含内联程序集代码或数组模式匹配
zh_hant: 引號內不能包含內嵌組譯程式碼或陣列上的模式比對

# crefQuotationsCantContainDescendingForLoops
source: Quotations cannot contain descending for loops
cs: Citace nemůžou obsahovat sestupné smyčky for.
de: Anführungszeichen dürfen keine absteigenden For-Schleifen enthalten.
es: Las expresiones de código delimitadas no pueden contener bucles for descendentes.
fr: Les quotations ne peuvent pas contenir d'ordre décroissant pour les boucles
it: Le quotation non possono contenere elementi di ordinamento decrescente per i cicli
ja: 引用符内に降順の for loop を含めることはできません
ko: 인용구에는 루프의 내림차순을 포함할 수 없습니다.
pl: Konstrukcje w cudzysłowie nie mogą zawierać malejących pętli for
pt_br: Cotações não podem conter decrescentes para loops
ru: В кавычки нельзя заключать нисходящие циклы for
tr: Alıntılar, döngülere yönelik azalan sıra içeremez
zh_hans: 引用内容不能包含循环的递减
zh_hant: 引號內不能包含迴圈的遞減

# crefQuotationsCantFetchUnionIndexes
source: Quotations cannot contain expressions that fetch union case indexes
cs: Citace nemůžou obsahovat výrazy, které načítají indexy případů typu union.
de: Anführungszeichen dürfen keine Ausdrücke enthalten, die Union-Fallindizes abrufen.
es: Las expresiones de código delimitadas no pueden contener expresiones que busquen índices de caso de unión.
fr: Les quotations ne peuvent pas contenir d'expressions qui récupèrent des index de cas d'union
it: Le quotation non possono contenere espressioni che recuperano indici di case di unione
ja: 引用符内には、共用体ケースのインデックスをフェッチする式を含めることはできません
ko: 인용구에는 공용 구조체 케이스 인덱스를 페치하는 식을 포함할 수 없습니다.
pl: Wyrażenia cytowane nie mogą zawierać wyrażeń, które pobierają indeksy przypadku unii
pt_br: Cotações não podem conter expressões que busquem índices de casos união
ru: В кавычки нельзя заключать выражения, извлекающие индексы вариантов объединения
tr: Alıntılar, birleşim durumu dizinleri getiren ifadeler içeremez
zh_hans: 引用内容不能包含获取联合用例索引的表达式
zh_hant: 引號內不能包含擷取聯集索引的運算式

# crefQuotationsCantSetUnionFields
source: Quotations cannot contain expressions that set union case fields
cs: Citace nemůžou obsahovat výrazy, které nastavují pole případů typu union.
de: Anführungszeichen dürfen keine Ausdrücke enthalten, die Union-Fallfelder festlegen.
es: Las expresiones de código delimitadas no pueden contener expresiones que establezcan campos de caso de unión.
fr: Les quotations ne peuvent pas contenir d'expressions qui définissent des champs de cas d'union
it: Le quotation non possono contenere espressioni che impostano campi di case di unione
ja: 引用符内には、共用体ケースのフィールドを設定する式を含めることはできません
ko: 인용구에는 공용 구조체 케이스 필드를 설정하는 식을 포함할 수 없습니다.
pl: Konstrukcje w cudzysłowie nie mogą zawierać wyrażeń, które ustawiają pola przypadku unii
pt_br: Cotações não podem conter expressões que definem campos de casos união
ru: В кавычки нельзя заключать выражения, задающие поля вариантов объединения
tr: Alıntılar, birleşim durumu alanları ayarlayan ifadeler içeremez
zh_hans: 引用内容不能包含设置联合用例字段的表达式
zh_hant: 引號內不能包含設定聯集欄位的運算式

# crefQuotationsCantSetExceptionFields
source: Quotations cannot contain expressions that set fields in exception values
cs: Citace nemůžou obsahovat výrazy, které u polí nastavují výjimečné hodnoty.
de: Anführungszeichen dürfen keine Ausdrücke enthalten, die Felder in Ausnahmewerten festlegen.
es: Las expresiones de código delimitadas no pueden contener expresiones que establezcan campos en valores de excepción.
fr: Les quotations ne peuvent pas contenir d'expressions qui définissent des champs dans des valeurs d'exception
it: Le quotation non possono contenere espressioni che impostano campi in valori di eccezione
ja: 引用符内には、例外値のフィールドを設定する式を含めることはできません
ko: 인용구에는 예외 값에 필드를 설정하는 식을 포함할 수 없습니다.
pl: Konstrukcje w cudzysłowie nie mogą zawierać wyrażeń, które ustawiają pola w wartościach wyjątku
pt_br: Cotações não podem conter expressões que definem campos nos valores de exceção
ru: В кавычки нельзя заключать выражения, задающие поля в значениях исключений
tr: Alıntılar, özel durum değerleri içinde alanlar ayarlayan ifadeler içeremez
zh_hans: 引用内容不能包含设置异常值中的字段的表达式
zh_hant: 引號內不能包含設定例外狀況值中欄位的運算式

# crefQuotationsCantRequireByref
source: Quotations cannot contain expressions that require byref pointers
cs: Citace nemůžou obsahovat výrazy, které vyžadují ukazatele na parametry ByRef.
de: Anführungszeichen dürfen keine Ausdrücke enthalten, die byref-Zeiger erfordern.
es: Las expresiones de código delimitadas no pueden contener expresiones que requieran punteros byref.
fr: Les quotations ne peuvent pas contenir d'expressions qui requièrent des pointeurs byref
it: Le quotation non possono contenere espressioni che richiedono puntatori byref
ja: 引用符内には、byref ポインターを必要とする式を含めることはできません
ko: 인용구에는 byref 포인터를 필요로 하는 식을 포함할 수 없습니다.
pl: Konstrukcje w cudzysłowie nie mogą zawierać wyrażeń, które wymagają wskaźników byref
pt_br: Cotações não podem conter expressões que requerem ponteiros byref
ru: В кавычки нельзя заключать выражения, требующие использования указателей byref
tr: Alıntılar, byref işaretçileri gerektiren ifadeler içeremez
zh_hans: 引用内容不能包含需要 byref 指针的表达式
zh_hant: 引號內不能包含需要 ByRef 指標的運算式

# crefQuotationsCantCallTraitMembers
source: Quotations cannot contain expressions that make member constraint calls, or uses of operators that implicitly resolve to a member constraint call
cs: Citace nemůže zahrnovat výrazy, které volají omezení členů, ani nemůže používat operátory, které se na volání omezení členů implicitně překládají.
de: Anführungszeichen dürfen keine Ausdrücke, die Membereinschränkungsaufrufe durchführen, oder Operatorverwendungen enthalten, die implizit in einen Membereinschränkungsaufruf aufgelöst werden.
es: Las expresiones de código delimitadas no pueden contener expresiones que realicen llamadas de restricción de miembros ni usos de operadores que se resuelvan de forma implícita en una llamada de restricción de miembros.
fr: Les quotations ne peuvent pas contenir d'expressions qui appellent des contraintes de membres ou utilisent des opérateurs qui sont implicitement résolus en appel de contrainte membre
it: Le quotation non possono contenere espressioni che effettuano chiamate a vincoli di membro o utilizzi di operatori che vengono risolti in modo implicito in una chiamata a vincolo di membro
ja: 引用符内にメンバーの制約を呼び出す式を含めること、または暗黙的にメンバーの制約の呼び出しに解決される演算子を使用することはできません
ko: 인용구에는 멤버 제약 조건을 호출하는 식 또는 암시적으로 멤버 제약 조건 호출로 확인되는 연산자 사용을 포함할 수 없습니다.
pl: Konstrukcja w cudzysłowie nie mogą zawierać wyrażeń, które tworzą wywołania ograniczenia elementu członkowskiego, lub używać operatorów niejawnie rozpoznawanych jako wywołanie ograniczenia elementu członkowskiego
pt_br: As cotações não podem conter expressões que façam chamadas de restrição de membros ou usem operadores que resolvem implicitamente uma chamada de restrição de membro
ru: В кавычки нельзя заключать выражения, выполняющие вызовы ограничения элементов или использующие операторы, которые явным образом разрешаются в вызовы элементов ограничения
tr: Alıntılar, üye kısıtlama çağrıları yapan veya örtük olarak üye kısıtlama çağrısına çözümlenen işleçler kullanan ifadeler içeremez
zh_hans: 引用内容不能包含进行成员约束调用或使用隐式解析为成员约束调用的运算符的表达式
zh_hant: 引號內不能包含進行成員條件約束呼叫的運算式，或使用隱含解析成成員條件約束呼叫的運算子

# crefQuotationsCantContainThisConstant
source: Quotations cannot contain this kind of constant
cs: Citace nemůžou obsahovat tento druh konstanty.
de: Anführungszeichen dürfen diese Art von Konstante nicht enthalten.
es: Las expresiones de código delimitadas no pueden contener este tipo de constante.
fr: Les quotations ne peuvent pas contenir ce genre de constante
it: Le quotation non possono contenere questo tipo di costante
ja: 引用符内には、この種類の定数を含めることはできません
ko: 인용구에는 이러한 종류의 상수를 포함할 수 없습니다.
pl: Wyrażenia cytowane nie mogą zawierać tego rodzaju stałej
pt_br: Cotações não podem conter este tipo de constante
ru: Цитаты не могут содержать эту разновидность константы
tr: Alıntılar, bu tür bir sabit içeremez
zh_hans: 引用内容不能包含这种常数
zh_hant: 引號內不能包含這種常數

# crefQuotationsCantContainThisPatternMatch
source: Quotations cannot contain this kind of pattern match
cs: Citace nemůžou obsahovat tento druh porovnávání vzorů.
de: Anführungszeichen dürfen diese Art von Mustervergleich nicht enthalten.
es: Las expresiones de código delimitadas no pueden contener este tipo de detección de patrones.
fr: Les quotations ne peuvent pas contenir ce genre de critère spécial
it: Le quotation non possono contenere questo tipo di carattere jolly
ja: 引用符内には、この種類のパターン マッチを含めることはできません
ko: 인용구에는 이러한 종류의 패턴 일치를 포함할 수 없습니다.
pl: Wyrażenia cytowane nie mogą zawierać tego rodzaju dopasowania wzorca
pt_br: Cotações não podem conter este tipo de correspondência de padrão
ru: Цитаты не могут содержать эту разновидность сопоставления шаблону
tr: Alıntılar, bu tür bir desen eşleştirme içeremez
zh_hans: 引用内容不能包含这种模式匹配
zh_hant: 引號內不能包含這種模式比對

# crefQuotationsCantContainArrayPatternMatching
source: Quotations cannot contain array pattern matching
cs: V citacích nemůže být zahrnuté porovnávání vzorů polí.
de: Anführungszeichen dürfen keinen Arraymustervergleich enthalten.
es: Las expresiones de código delimitadas no pueden contener detección de patrones de matriz.
fr: Les quotations ne peuvent pas contenir de critères spéciaux de tableau
it: Le quotation non possono contenere criteri di ricerca per identificare matrici
ja: 引用符内には、配列のパターン マッチを含めることはできません
ko: 인용구에는 배열 패턴 일치를 포함할 수 없습니다.
pl: Konstrukcje w cudzysłowie nie mogą zawierać dopasowania wzorca tablicy
pt_br: Cotações não podem conter correspondências de padrão de matriz
ru: В кавычки нельзя заключать сопоставления шаблонов массивов
tr: Alıntılar, dizi deseni eşleştirmesi içeremez
zh_hans: 引用内容不能包含数组模式匹配
zh_hant: 引號內不能包含陣列模式比對

# crefQuotationsCantContainThisType
source: Quotations cannot contain this kind of type
cs: Citace nemůžou obsahovat tento druh typu.
de: Anführungszeichen dürfen diese Art von Typ nicht enthalten.
es: Las expresiones de código delimitadas no pueden contener este tipo de tipo.
fr: Les quotations ne peuvent pas contenir ce genre de type
it: Le quotation non possono contenere questo genere di tipo
ja: 引用符内には、この種類の型を含めることはできません
ko: 인용구에는 이러한 종류의 형식을 포함할 수 없습니다.
pl: Wyrażenia cytowane nie mogą zawierać tego rodzaju typu
pt_br: Cotações não podem conter esta espécie de tipo
ru: Цитаты не могут содержать эту разновидность типа
tr: Alıntılar, böyle bir tür içeremez
zh_hans: 引用内容不能包含这种类型
zh_hant: 引號內不能包含這種類型

# csTypeCannotBeResolvedAtCompileTime
source: The declared type parameter '{0}' cannot be used here since the type parameter cannot be resolved at compile time
cs: Parametr deklarovaného typu {0} se tady použít nedá, protože parametr typu nejde přeložit za kompilace.
de: Der deklarierte Typparameter "{0}" kann an dieser Stelle nicht verwendet werden, weil der Typparameter zur Kompilierzeit nicht aufgelöst werden kann.
es: El parámetro de tipo declarado '{0}' no se puede usar aquí porque no se puede resolver en tiempo de compilación.
fr: Impossible d'utiliser ici le paramètre de type déclaré '{0}', car le paramètre de type ne peut pas être résolu au moment de la compilation
it: Non è possibile usare il parametro di tipo dichiarato '{0}' in questa posizione perché non può essere risolto in fase di compilazione
ja: 宣言された型パラメーター '{0}' はコンパイル時に解決できないため、使用できません
ko: 선언된 형식 매개 변수 '{0}'은(는) 컴파일 시간에 확인할 수 없으므로 여기에 사용할 수 없습니다.
pl: Zadeklarowany parametr typu „{0}” nie może być tutaj używany, ponieważ nie można rozpoznać parametru typu w czasie kompilacji
pt_br: O parâmetro do tipo declarado '{0}' não pode ser usado aqui, uma vez que o parâmetro de tipo não pode ser resolvido no tempo de compilação
ru: Не удается использовать объявленный параметр типа "{0}", поскольку не удается разрешить его во время выполнения
tr: Tanımlanan tür parametresi '{0}' derleme zamanında çözümlenemediği için burada kullanılamaz
zh_hans: 此处不能使用声明的类型参数“{0}”，因为编译时无法解析该类型参数
zh_hant: 此處不能使用宣告的型別參數 '{0}'，因為型別參數無法於編譯時間解析

# csCodeLessGeneric
source: This code is less generic than indicated by its annotations. A unit-of-measure specified using '_' has been determined to be '1', i.e. dimensionless. Consider making the code generic, or removing the use of '_'.
cs: Tento kód je míň obecný, než udávají jeho poznámky. U měrné jednotky specifikované pomocí podtržítka (_) se určila hodnota 1, tj. bezrozměrná. Zvažte zobecnění kódu nebo odebrání podtržítka (_).
de: Dieser Code ist weniger generisch, als aus seinen Anmerkungen hervorgeht. Eine mit "_" angegebene Maßeinheit ist "1", also ohne Dimension. Machen Sie den Code generisch, oder entfernen Sie "_".
es: Este código es menos genérico que lo indicado en sus anotaciones. Se ha determinado que una unidad de medida especificada con '_' sea '1', es decir, sin dimensión. Considere hacer genérico el código o quitar el uso de '_'.
fr: Ce code est moins générique que ne l'indiquaient ses annotations. Une unité de mesure spécifiée à l'aide de '_' a été déterminée comme étant égale à '1', c'est-à-dire sans dimension. Rendez le code générique ou supprimez l'utilisation de '_'.
it: Il codice è meno generico di quanto indicato dalle relative annotazioni. Un'unità di misura specificata mediante '_' risulta essere '1', ovvero senza dimensione. Provare a rendere il codice generico oppure a rimuovere l'utilizzo di '_'.
ja: このコードは注釈よりも総称性が低く設定されています。'_' を使用して指定された単位は、'1' (無次元) と判断されます。コードをジェネリックにするか、'_' を使用しないでください。
ko: 이 코드는 해당 주석에 표시된 것보다 일반적이지 않습니다. '_'을 사용하여 지정된 측정 단위는 '1', 즉 차원이 없는 것으로 결정되었습니다. 코드를 제네릭 형식으로 만들거나 '_'을 사용하지 마세요.
pl: Ten kod jest mniej ogólny, niż wskazują na to jego adnotacje. Jednostka miary podana przy użyciu konstrukcji „_” została określona jako „1” (czyli bez wymiaru). Rozważ zapewnienie ogólności kodu lub zrezygnowanie z użycia konstrukcji „_”.
pt_br: Este código é menos genérico que o indicado pelas suas anotações. Uma unidade de medida especificada com uso de '_' foi determinada como '1', ou seja, sem dimensão. Considere tornar o código genérico ou remover a utilização de '_'.
ru: Этот код является менее универсальным, чем указано в соответствующих аннотациях. Значение единицы измерения, заданной с помощью знака "_", определено как "1" (безразмерная). Рекомендуется сделать код универсальным или удалить знак "_".
tr: Bu kod, ek açıklamalarında belirtilenden daha az genel. '_' kullanılarak belirtilen bir ölçü biriminin '1', yani boyutsuz olduğu belirlendi. Kodu genel yapmayı veya '_' kullanımını kaldırmayı düşünün.
zh_hans: 此代码并不像其批注所述的那样通用。使用“_”指定的度量单位已确定为“1”，即无度量。请考虑使此代码成为泛型代码，或删除对“_”的使用。
zh_hant: 這個程式碼的一般程度低於註釋所指示的程度。系統判定使用 '_' 指定的測量單位為 '1'，也就是無維度。請考慮使程式碼變成泛型程式碼，或移除 '_'。

# csTypeInferenceMaxDepth
source: Type inference problem too complicated (maximum iteration depth reached). Consider adding further type annotations.
cs: Problém s odvozením typu proměnných: příliš složité (dosáhli jste maximální možné hloubky iterace). Zvažte přidání dalších poznámek typu.
de: Problem beim Rückschluss von Typen ist zu komplex (maximale Iterationstiefe erreicht). Fügen Sie ggf. weitere Typanmerkungen hinzu.
es: Problema de inferencia de tipos demasiado complicado (se alcanzó la profundidad de iteración máxima). Considere agregar más anotaciones de tipo.
fr: Problème d'inférence de type trop complexe (profondeur d'itération maximale atteinte). Ajoutez d'autres annotations de type.
it: Problema di inferenza del tipo troppo complesso (raggiunta profondità di iterazione massima). Provare ad aggiungere ulteriori annotazioni di tipo.
ja: 複雑すぎるため、型推論ができません (最大反復回数に達しました)。さらに詳細な型の注釈を増やしてください。
ko: 형식 유추 문제가 너무 복잡합니다(최대 반복 깊이에 도달함). 형식 주석을 더 추가하세요.
pl: Problem wnioskowania o typie jest zbyt złożony (osiągnięto maksymalną głębokość iteracji). Rozważ dodanie dodatkowych adnotacji typów.
pt_br: Problema de inferência de tipo excessivamente complicado (profundidade de iteração máxima atingida). Considere adicionar mais anotações de tipo.
ru: Слишком сложная проблема определения типа (достигнута максимальная глубина итераций). Рекомендуется добавить дополнительные аннотации типов.
tr: Tür çıkarma sorunu çok karmaşık (en fazla yinelenme derinliğine ulaşıldı). İlave tür ek açıklamaları eklemeyi düşünün.
zh_hans: 类型推理问题太复杂(已达到最大迭代深度)。请考虑添加更多类型批注。
zh_hant: 類型推斷問題太複雜 (已達到反覆項目深度上限)。請考慮加入進一步的類型註釋。

# csExpectedArguments
source: Expected arguments to an instance member
cs: Očekávaly se argumenty člena instance.
de: Argumente für einen Instanzmember wurden erwartet.
es: Se esperan argumentos en un miembro de instancia.
fr: Arguments attendus pour un membre d'instance
it: Argomenti previsti in un membro di istanza
ja: インスタンス メンバーに対して引数を指定してください
ko: 인스턴스 멤버에 대한 인수가 필요합니다.
pl: Oczekiwano argumentów elementu członkowskiego wystąpienia
pt_br: Argumentos esperados para um membro de instância
ru: Требуются аргументы элемента экземпляра
tr: Örnek üye için bağımsız değişkenler bekleniyordu
zh_hans: 应为实例成员的参数
zh_hant: 引數必須是執行個體成員
