Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# etProvidedTypeReferenceInvalidText
source: A reference to a provided type had an invalid value '{0}' for a static parameter. You may need to recompile one or more referenced assemblies.
cs: U odkazu na poskytnutý typ je hodnota {0} pro statický parametr neplatná. Možná bude potřeba znovu zkompilovat jedno nebo víc odkazovaných sestavení.
de: Ein Verweis auf einen angegebenen Typ hatte für einen statischen Parameter den ungültigen Wert '{0}'. Es müssen möglicherweise eine oder mehrere referenzierte Assemblys erneut kompiliert werden.
es: Una referencia a un tipo proporcionado tenía un valor '{0}' no válido para un parámetro estático. Puede que sea necesario recompilar uno o varios de los ensamblados a los que se hace referencia.
fr: Une référence à un type fourni a une valeur non valide '{0}' pour un paramètre statique. Vous devrez peut-être recompiler un ou plusieurs assemblys référencés.
it: Un riferimento a un tipo fornito contiene un valore '{0}' non valido per un parametro statico. Potrebbe essere necessario ricompilare uno o più assembly a cui viene fatto riferimento.
ja: 指定された型に対する参照に、静的パラメーターでは無効な値 '{0}' が含まれていました。1 つ以上の参照アセンブリを再コンパイルする必要がある場合があります。
ko: 제공된 형식에 대한 참조의 값('{0}')이 정적 매개 변수에 대해 잘못되었습니다. 참조되는 어셈블리를 하나 이상 다시 컴파일해야 할 수 있습니다.
pl: Odwołanie do udostępnionego typu miało nieprawidłową wartość „{0}” parametru statycznego. Może być konieczne ponowne skompilowanie co najmniej jednego zestawu, do którego występuje odwołanie.
pt_br: Uma referência a um tipo fornecido possuía um valor inválido '{0}' para um parâmetro estático. Talvez seja necessário recompilar um ou mais assemblies referenciados.
ru: Ссылка на предоставленный тип имеет недопустимое значение "{0}" статического параметра. Может потребоваться перекомпилировать одну или более сборок, на которые указывают ссылки.
tr: Sağlanan türe yapılan başvuruda statik parametre için geçersiz '{0}' değeri vardı. Bir veya daha fazla başvurulan bütünleştirilmiş kodu yeniden derlemeniz gerekiyor.
zh_hans: 对所提供类型的引用具有无效的静态参数值“{0}”。可能需要重新编译一个或多个引用的程序集。
zh_hant: 提供之類型的參考具有靜態參數的無效值 '{0}'。您可能需要重新編譯一或多個參考的組件。

# tcCustomOperationNotUsedCorrectly
source: '{0}' is not used correctly. This is a custom operation in this query or computation expression.
cs: {0} se nepoužívá správně. Toto je vlastní operace v tomto výrazu dotazu nebo výpočtu.
de: '{0}' wird nicht ordnungsgemäß verwendet. Hierbei handelt es sich um einen benutzerdefinierten Vorgang in dieser Abfrage oder im Berechnungsausdruck.
es: '{0}' no se usa correctamente. Esta es una operación personalizada de esta expresión de consulta o cómputo.
fr: '{0}' n'est pas utilisé correctement. Il s'agit d'une opération personnalisée dans cette requête ou opération de calcul.
it: '{0}' non è utilizzato correttamente. Si tratta di un'operazione personalizzata nella query o nell'espressione di calcolo corrente.
ja: '{0}' の使用方法が正しくありません。これは、このクエリまたはコンピュテーション式のカスタム操作です。
ko: '{0}'이(가) 잘못 사용되었습니다. 이 항목은 이 쿼리 또는 계산 식의 사용자 지정 연산입니다.
pl: Operacja „{0}” nie jest używana poprawnie. Jest to operacja niestandardowa w tym zapytaniu lub wyrażeniu obliczenia.
pt_br: '{0}' não está sendo usado corretamente. Esta é uma operação personalizada nesta consulta ou expressão de computação.
ru: {0} используется неверно. Это пользовательская операция в данном запросе или выражении с вычислениями.
tr: '{0}' doğru kullanılmadı. Bu, geçerli sorguda veya hesaplama ifadesinde özel bir işlemdir.
zh_hans: “{0}”使用有误。这是此查询或计算表达式中的自定义运算。
zh_hant: '{0}' 未正確使用。這是這個查詢或計算運算式中的自訂作業。

# tcCustomOperationNotUsedCorrectly2
source: '{0}' is not used correctly. Usage: {1}. This is a custom operation in this query or computation expression.
cs: {0} se nepoužívá správně. Použití: {1}. Toto je vlastní operace v tomto výrazu dotazu nebo výpočtu.
de: "{0}" wird nicht ordnungsgemäß verwendet. Verwendung: {1}. Hierbei handelt es sich um einen benutzerdefinierten Vorgang in dieser Abfrage oder im Berechnungsausdruck.
es: "{0}" no se usa correctamente. Uso: {1}. Esta es una operación personalizada de esta expresión de consulta o cómputo.
fr: '{0}' n'est pas utilisé correctement. Utilisation : {1}. Il s'agit d'une opération personnalisée dans cette requête ou expression de calcul.
it: '{0}' non è usato correttamente. Utilizzo: {1}. Si tratta di un'operazione personalizzata nella query o nell'espressione di calcolo corrente.
ja: '{0}' の使用方法が正しくありません。使い方: {1}。これは、このクエリまたはコンピュテーション式のカスタム操作です。
ko: '{0}'이(가) 잘못 사용되었습니다. 사용법: {1}. 이 항목은 이 쿼리 또는 계산 식의 사용자 지정 연산입니다.
pl: Operacja „{0}” nie jest używana poprawnie. Użycie: {1}. Jest to operacja niestandardowa w tym zapytaniu lub wyrażeniu obliczenia.
pt_br: '{0}' não está sendo usado corretamente. Uso: {1}. Esta é uma operação personalizada nesta consulta ou expressão de computação.
ru: "{0}" используется неверно. Использование: {1}. Это пользовательская операция в данном запросе или выражении с вычислениями.
tr: '{0}' doğru kullanılmadı. Kullanım: {1}. Bu, geçerli sorgudaki veya hesaplama ifadesindeki özel bir işlemdir.
zh_hans: “{0}”使用有误。用法: {1}。这是此查询或计算表达式中的自定义运算。
zh_hant: 未正確使用 '{0}'。使用方式: {1}。此為這個查詢或計算運算式中的自訂作業。

# customOperationTextLikeJoin
source: {0} var in collection {1} (outerKey = innerKey). Note that parentheses are required after '{2}'
cs: {0} proměnná v kolekci {1} (outerKey = innerKey). Poznámka: Za {2} se vyžadují závorky.
de: {0}-Variable in der Sammlung {1} (outerKey = innerKey). Nach "{2}" sind Klammern erforderlich.
es: Variable {0} de la colección {1} (outerKey = innerKey). Tenga en cuenta que, después de "{2}", se requieren paréntesis.
fr: var {0} dans la collection {1} (outerKey = innerKey). Notez que les parenthèses sont obligatoires après '{2}'
it: {0} var nella raccolta {1} (outerKey = innerKey). Si noti che dopo '{2}' le parentesi sono obbligatorie
ja: {0} var in collection {1} (outerKey = innerKey)。'{2}' の後にかっこが必要であることに注意してください
ko: {0} var in collection {1} (outerKey = innerKey). '{2}' 뒤에 괄호가 필요합니다.
pl: {0} zmienna in kolekcja {1} (klucz_zewnętrzny = klucz_wewnętrzny). Pamiętaj, że po „{2}” wymagane są nawiasy.
pt_br: {0} var na coleção {1} (outerKey = innerKey). Observe que os parênteses são necessários após '{2}'
ru: Переменная {0} в коллекции {1} (outerKey = innerKey). Обратите внимание, что после "{2}" нужны круглые скобки
tr: {1} koleksiyonunda {0} değişkeni (outerKey = innerKey). '{2}' öğesinden sonra parantez eklenmesi gerektiğini unutmayın
zh_hans: 集合 {1} (outerKey = innerKey)中的 {0} var。请注意，“{2}”后面要使用圆括号
zh_hant: 集合 {1} 中的 {0} var (outerKey = innerKey)。請注意，'{2}' 後需要括弧

# customOperationTextLikeGroupJoin
source: {0} var in collection {1} (outerKey = innerKey) into group. Note that parentheses are required after '{2}'
cs: {0} proměnná v kolekci {1} (outerKey = innerKey) do skupiny. Poznámka: Za {2} se vyžadují závorky.
de: {0}-Variable in der Sammlung {1} (outerKey = innerKey) in der Gruppe. Nach "{2}" sind Klammern erforderlich.
es: Variable {0} de la colección {1} (outerKey = innerKey) en el grupo. Tenga en cuenta que, después de "{2}", se requieren paréntesis.
fr: var {0} dans la collection {1} (outerKey = innerKey) au sein du groupe. Notez que les parenthèses sont obligatoires après '{2}'
it: {0} var nella raccolta {1} (outerKey = innerKey) nel gruppo. Si noti che dopo '{2}' le parentesi sono obbligatorie
ja: コレクション {1} (outerKey = innerKey) の {0} をグループに var 宣言します。'{2}' の後にかっこが必要であることに注意してください
ko: 그룹에 {0} var in collection {1} (outerKey = innerKey). '{2}' 다음에 괄호가 필요합니다.
pl: {0} zmienna in kolekcja {1} (klucz_zewnętrzny = klucz_wewnętrzny) into grupa. Pamiętaj, że po „{2}” wymagane są nawiasy.
pt_br: {0} var na coleção {1} (outerKey = innerKey) para o grupo. Observe que os parênteses são necessários após '{2}'
ru: Переменная {0} из коллекции {1} (outerKey = innerKey) в группе. Обратите внимание, что после "{2}" нужны круглые скобки
tr: {1} koleksiyonunda {0} değişkeni (outerKey = innerKey) gruba eklendi. '{2}' öğesinden sonra parantez eklenmesi gerektiğini unutmayın
zh_hans: {0} var in collection {1} (outerKey = innerKey) into group。请注意，“{2}”后需使用括号
zh_hant: 集合 {1} 中的 {0} var (outerKey = innerKey) 進入群組。請注意，'{2}' 後需要括弧。

# customOperationTextLikeZip
source: {0} var in collection
cs: {0} proměnná v kolekci
de: {0}-Variable in der Sammlung
es: Variable {0} de la colección
fr: var {0} dans la collection
it: {0} var nella raccolta
pl: {0} zmienna in kolekcja
pt_br: {0} var na coleção
ru: Переменная {0} в коллекции
tr: Koleksiyonda {0} değişkeni
zh_hans: 集合中的 {0} var
zh_hant: 集合中的 {0} var

# tcBinaryOperatorRequiresVariable
source: '{0}' must be followed by a variable name. Usage: {1}.
cs: Po {0} musí následovat název proměnné. Použití: {1}.
de: "{0}" muss von einem Variablennamen gefolgt werden. Verwendung: {1}.
es: "{0}" debe ir seguido de un nombre de variable. Uso: {1}.
fr: '{0}' doit être suivi d'un nom de variable. Utilisation : {1}.
it: '{0}' deve essere seguito da un nome di variabile. Utilizzo: {1}.
ja: '{0}' の後には変数名が必要です。使い方: {1}。
ko: '{0}' 뒤에는 변수 이름이 와야 합니다. 사용법: {1}.
pl: Element „{0}” musi występować przed nazwą zmiennej. Użycie: {1}.
pt_br: '{0}' deve ser seguido por um nome de variável. Uso: {1}.
ru: После "{0}" должно идти имя переменной. Использование: {1}.
tr: '{0}' ifadesini değişken adı izlemelidir. Kullanım: {1}.
zh_hans: “{0}”后面必须跟变量名。用法: {1}。
zh_hant: '{0}' 之後必須接著變數名稱。使用方式: {1}。

# tcOperatorIncorrectSyntax
source: Incorrect syntax for '{0}'. Usage: {1}.
cs: Neplatná syntaxe pro {0}. Použití: {1}.
de: Fehlerhafte Syntax für '{0}'. Verwendung: {1}.
es: Sintaxis incorrecta de '{0}'. Uso: {1}.
fr: Syntaxe incorrecte pour '{0}'. Utilisation : {1}.
it: Sintassi non corretta per '{0}'. Utilizzo: {1}.
ja: {0}' の構文が正しくありません。使い方: {1}。
ko: {0}' 구문이 잘못되었습니다. 사용법: {1}.
pl: Niepoprawna składnia operatora „{0}”. Użycie: {1}.
pt_br: Sintaxe incorreta para '{0}'. Uso: {1}.
ru: Неверный синтаксис для "{0}". Использование: {1}.
tr: {0}' için hatalı sözdizimi. Kullanım: {1}.
zh_hans: “{0}”的语法不正确。用法: {1}。
zh_hant: {0}' 的語法不正確。使用方式: {1}。

# tcBinaryOperatorRequiresBody
source: '{0}' must come after a 'for' selection clause and be followed by the rest of the query. Syntax: ... {1} ...
cs: {0} se musí umístit za klauzuli výběru for a pak musí následovat zbytek dotazu. Syntaxe: ... {1} ...
de: "{0}" muss auf eine for-Auswahlklausel folgen und vom Rest der Abfrage gefolgt werden. Syntax: ... {1} ...
es: "{0}" debe aparecer después de una cláusula de selección "for" e ir seguido del resto de la consulta. Sintaxis: ... {1} ...
fr: '{0}' doit suivre une clause de sélection 'for' et être suivi du reste de la requête. Syntaxe : ... {1} ...
it: '{0}' deve essere preceduto da una clausola di selezione 'for' e seguito dal resto della query. Sintassi: ... {1} ...
ja: '{0}' は 'for' 選択句の後に配置し、その後に残りのクエリを配置する必要があります。構文: ... {1} ...
ko: '{0}' 앞에는 'for' 선택 절이 와야 하고 뒤에는 나머지 쿼리 부분이 와야 합니다. 구문: ... {1} ...
pl: Element „{0}” musi występować po klauzuli wyboru „for” i przed pozostałą częścią zapytania. Składnia: ... {1} ...
pt_br: '{0}' deve vir após uma cláusula de seleção 'for' e ser seguido pelo restante da consulta. Sintaxe: ... {1} ...
ru: Перед "{0}" должно идти предложение выбора "for", а после — оставшаяся часть запроса. Синтаксис: … {1} …
tr: '{0}' ifadesi bir 'for' seçim yan tümcesinden sonra gelmelidir ve bu ifadeyi sorgunun geri kalanı izlemelidir. Söz dizimi: ... {1} ...
zh_hans: “{0}”的前面必须是“for”选择子句，后面必须是查询的剩余部分。语法: ... {1} ...
zh_hant: '{0}' 必須跟在 'for' 選取範圍子句後面，之後再接其餘的查詢。語法: ... {1} ...

# tcCustomOperationHasIncorrectArgCount
source: '{0}' is used with an incorrect number of arguments. This is a custom operation in this query or computation expression. Expected {1} argument(s), but given {2}.
cs: {0} se používá s nesprávným počtem argumentů. Toto je vlastní operace v tomto výrazu dotazu nebo výpočtu. Očekávaný počet argumentů je {1}, ale počet předávaných je {2}.
de: "{0}" wird mit einer unzulässigen Anzahl von Argumenten verwendet. Hierbei handelt es sich um einen benutzerdefinierten Vorgang in dieser Abfrage oder im Berechnungsausdruck. {1} Argument(e) erwartet, jedoch {2} erhalten.
es: "{0}" se usa con un número de argumentos incorrecto. Esta es una operación personalizada de esta expresión de consulta o cómputo. Se esperaban {1} argumentos, pero se proporcionaron {2}.
fr: '{0}' est utilisé avec un nombre incorrect d'arguments. Il s'agit d'une opération personnalisée dans cette requête ou expression de calcul. {1} argument(s) attendu(s), mais {2} fourni(s).
it: '{0}' è usato con un numero di argomenti non corretto. Si tratta di un'operazione personalizzata nella query o nell'espressione di calcolo corrente. Argomenti previsti: {1}. Argomenti specificati: {2}.
ja: '{0}' で使用されている引数の数が正しくありません。これはこのクエリのカスタム操作であるか、コンピュテーション式です。適正な引数の数は {1} 個ですが、渡されたのは {2} 個でした。
ko: '{0}'에 사용된 인수의 수가 잘못되었습니다. 이 항목은 이 쿼리나 계산 식의 사용자 지정 연산입니다. {1}개의 인수가 필요한데 {2}개가 제공되었습니다.
pl: Element „{0}” jest używany z niepoprawną liczbą argumentów. Jest to niestandardowa operacja w tym zapytaniu lub wyrażeniu obliczenia. Oczekiwana liczba argumentów: {1}. Rzeczywista liczba argumentów: {2}.
pt_br: '{0}' é usado com um número incorreto de argumentos. Esta é uma operação personalizada nesta consulta ou expressão de computação. {1} argumentos são esperados, mas {2} foram fornecidos.
ru: "{0}" используется с неверным числом аргументов. Это пользовательская операция в данном запросе или выражении с вычислениями. Ожидалось аргументов: {1}. Задано аргументов: {2}.
tr: '{0}' hatalı sayıda bağımsız değişkenle kullanıldı. Bu, geçerli sorgudaki veya hesaplama ifadesindeki özel bir işlemdir. {1} bağımsız değişken bekleniyordu, ancak {2} verildi.
zh_hans: “{0}”使用的参数数量有误。这是此查询或计算表达式中的自定义运算。应为 {1} 个参数，但提供了 {2} 个。
zh_hant: '{0}' 搭配使用的引數數目不正確。這是此查詢或計算運算式中的自訂作業。必須是 {1} 個引數，但提供了 {2} 個。

# parsExpectedExpressionAfterToken
source: Expected an expression after this point
cs: Za touto pozicí se očekává výraz.
de: Nach diesem Punkt wurde ein Ausdruck erwartet.
es: Se esperaba una expresión después de este punto.
fr: Une expression était attendue après ce point
it: Prevista un'espressione dopo questa posizione
ja: この位置より後に式を置く必要があります
ko: 이 지점 뒤에 식이 필요합니다.
pl: Oczekiwano wyrażenia po tym punkcie
pt_br: Expressão esperada após este ponto
ru: После этой точки ожидалось выражение
tr: Bu noktadan sonra bir ifade bekleniyordu
zh_hans: 此点之后应是表达式
zh_hant: 在這個點之後必須有運算式

# parsExpectedTypeAfterToken
source: Expected a type after this point
cs: Za touto pozicí se očekával typ.
de: Nach diesem Punkt wurde ein Typ erwartet.
es: Se esperaba un tipo después de este punto.
fr: Un type était attendu après ce point
it: Previsto un tipo dopo questa posizione
ja: この位置より後に型を置く必要があります
ko: 이 지점 뒤에 형식이 필요합니다.
pl: Oczekiwano typu po tym punkcie
pt_br: Um tipo é esperado após este ponto
ru: После этой точки ожидался тип
tr: Bu noktadan sonra bir tür bekleniyordu
zh_hans: 此点之后应是类型
zh_hant: 在這個點之後必須有類型

# parsUnmatchedLBrackLess
source: Unmatched '[<'. Expected closing '>]'
cs: Nespárovaná dvojice znaků [<. Očekávala se dvojice znaků >].
de: Keine Übereinstimmung für "[<". Schließendes >]-Zeichen wird erwartet.
es: Falta el elemento correspondiente de "[<". Se esperaba un ">]" de cierre
fr: '[<' sans correspondance. '>]' fermant attendu
it: '[<' senza corrispondenza. È previsto '>]' di chiusura
ja: '[<' が対応していません。対応する '>]' が必要です
ko: '[<'의 짝이 맞지 않습니다. 닫는 '>]'가 필요합니다.
pl: Niedopasowany element „[<”. Oczekiwano elementu zamykającego „>]”
pt_br: [<'. Fechamento esperado '>]' incompatível
ru: Отсутствует парная скобка для '[<'. Ожидается закрывающая скобка '>]'
tr: Eşleşmeyen '[<'. '>]' kapanışı bekleniyordu
zh_hans: "[<" 不匹配。应为 ">]" 结尾
zh_hant: 不對稱的 '[<'。應有右方 '>]'

# parsUnexpectedEndOfFileMatch
source: Unexpected end of input in 'match' expression. Expected 'match <expr> with | <pat> -> <expr> | <pat> -> <expr> ...'.
cs: Neočekávaný konec vstupu ve výrazu match. Očekávaná notace je match <výraz> with | <vzor> -> <výraz> | <vzor> -> <výraz> ...
de: Unerwartetes Ende der Eingabe im "match"-Ausdruck. Erwartet wird "match <expr> with | <pat> -> <expr> | <pat> -> <expr> ...".
es: Final inesperado de la entrada en la expresión "match". Se esperaba "'match <expr> with | <pat> -> <expr> | <pat> -> <expr> ...".
fr: Fin d'entrée inattendue dans l'expression 'match'. Attendu 'match <expr> with | <pat> -> <expr> | <pat> -> <expr> ...'.
it: Fine dell'input imprevista nell'espressione 'match'. È previsto 'match <expr> with | <pat> -> <expr> | <pat> -> <expr> ...'.
ja: 'match' 式の入力が予期しない形式で終了しています。'match <expr> with | <pat> -> <expr> | <pat> -> <expr> ...' が必要でした。
ko: 'match' 식에 예기치 않은 입력의 끝이 있습니다. 'match <expr> with | <pat> -> <expr> | <pat> -> <expr> ...'이 필요합니다.
pl: Nieoczekiwane zakończenie danych wejściowych w wyrażeniu „match”. Oczekiwano konstrukcji „match <wyrażenie> with | <wzorzec> -> <wyrażenie> | <wzorzec> -> <wyrażenie> ...”.
pt_br: Fim inesperado da entrada na expressão 'match'. Esperado 'match <expr> with | <pat> -> <expr> | <pat> -> <expr> ...'.
ru: Неожиданное завершение входных данных в выражении 'match'. Ожидаемое завершение: 'match <expr> with | <pat> -> <expr> | <pat> -> <expr> ...'.
tr: 'match' ifadesinde beklenmeyen giriş sonu. 'match <expr> with | <pat> -> <expr> | <pat> -> <expr> ...' bekleniyordu.
zh_hans: "match" 表达式中的输入意外结束。应为 "match <expr> with | <pat> -> <expr> | <pat> -> <expr> ..."。
zh_hant: 'match' 運算式中有未預期的輸入結尾。應為 'match <expr> with | <pat> -> <expr> | <pat> -> <expr> ...'。

# parsUnexpectedEndOfFileTry
source: Unexpected end of input in 'try' expression. Expected 'try <expr> with <rules>' or 'try <expr> finally <expr>'.
cs: Neočekávaný konec vstupu ve výrazu try. Očekávalo se try <výraz> with <pravidla> nebo try <výraz> finally <výraz>.
de: Unerwartetes Ende der Eingabe im "try"-Ausdruck. Erwartet wird: "try <expr> with <rules>" oder "try <expr> finally <expr>".
es: Final inesperado en la expresión "try". Se esperaba "try <expr> with <rules>" o "try <expr> finally <expr>".
fr: Fin d'entrée inattendue dans l'expression 'try'. Attendu 'try <expr> with <rules>' ou 'try <expr> finally <expr>'.
it: Fine dell'input imprevista nell'espressione 'try'. È previsto 'try <expr> with <rules>' o 'try <expr> finally <expr>'.
ja: 'try' 式の入力が予期しない形式で終了しています。'try <expr> with <rules>' または 'try <expr> finally <expr>' が必要でした。
ko: 'try' 식에 예기치 않은 입력의 끝이 있습니다. 'try <expr> with <rules>' 또는 'try <expr> finally <expr>'이 필요합니다.
pl: Nieoczekiwane zakończenie danych wejściowych w wyrażeniu „try”. Oczekiwano konstrukcji „try <wyrażenie> with <reguły>” lub „try <wyrażenie> finally <wyrażenie>”.
pt_br: Fim inesperado da entrada na expressão 'try'. Esperado 'try <expr> with <rules>' ou 'try <expr> finally <expr>'.
ru: Неожиданное завершение входных данных в выражении 'try'. Ожидаемые варианты: 'try <expr> with <rules>' или 'try <expr> finally <expr>'.
tr: 'try' ifadesinde beklenmeyen giriş sonu. 'try <expr> with <rules>' veya 'try <expr> finally <expr>' bekleniyordu.
zh_hans: "try" 表达式中的输入意外结束。应为 "try <expr> with <rules>" 或 "try <expr> finally <expr>"。
zh_hant: 'try' 運算式中有未預期的輸入結尾。應為 'try <expr> with <rules>' 或 'try <expr> finally <expr>'。

# parsUnexpectedEndOfFileWhile
source: Unexpected end of input in 'while' expression. Expected 'while <expr> do <expr>'.
cs: Neočekávaný konec vstupu ve výrazu while. Očekávalo se while <výraz> do <výraz>.
de: Unerwartetes Ende der Eingabe im "while"-Ausdruck. Erwartet wird: "while <expr> do <expr>".
es: Fin de entrada inesperado en la expresión "while". Se esperaba "while <expr> do <expr>".
fr: Fin d'entrée inattendue dans l'expression 'while'. Attendu 'while <expr> do <expr>'.
it: Fine dell'input imprevista nell'espressione 'while'. È previsto 'while <expr> do <expr>'.
ja: 'while' 式の入力が予期しない形式で終了しています。'while <expr> do <expr>' が必要でした。
ko: 'while' 식에 예기치 않은 입력의 끝이 있습니다. 'while <expr> do <expr>'이 필요합니다.
pl: Nieoczekiwane zakończenie danych wejściowych w wyrażeniu „while”. Oczekiwano konstrukcji „while <wyrażenie> do <wyrażenie>”.
pt_br: Fim inesperado da entrada na expressão 'while'. Esperado 'while <expr> do <expr>'.
ru: Неожиданное завершение входных данных в выражении 'while'. Ожидаемое завершение: 'while <expr> do <expr>'.
tr: 'while' ifadesinde beklenmeyen giriş sonu. 'while <expr> do <expr>' bekleniyordu.
zh_hans: "while" 表达式中的输入意外结束。应为 "while <expr> do <expr>"。
zh_hant: 'while' 運算式中有未預期的輸入結尾。應為 'while <expr> do <expr>'。

# parsUnexpectedEndOfFileFor
source: Unexpected end of input in 'for' expression. Expected 'for <pat> in <expr> do <expr>'.
cs: Neočekávaný konec vstupu ve výrazu for. Očekávaná notace je for <vzor> in <výraz> do <výraz>'.
de: Unerwartetes Ende der Eingabe im "for"-Ausdruck. Erwartet wird: "for <pat> in <expr> do <expr>".
es: Final inesperado de la entrada en la expresión "for". Se esperaba "for <pat> in <expr> do <expr>".
fr: Fin d'entrée inattendue dans l'expression 'for'. Attendu 'for <pat> in <expr> do <expr>'.
it: Fine dell'input imprevista nell'espressione 'for'. È previsto 'for <pat> in <expr> do <expr>'.
ja: 'for' 式の入力が予期しない形式で終了しています。'for <pat> in <expr> do <expr>' が必要でした。
ko: 'for' 식에 예기치 않은 입력 끝이 있습니다. 'for <pat> in <expr> do <expr>'이 필요합니다.
pl: Nieoczekiwane zakończenie danych wejściowych w wyrażeniu „for”. Oczekiwano konstrukcji „for <wzorzec> in <wyrażenie> do <wyrażenie>”.
pt_br: Fim inesperado de entrada na expressão 'for'. Esperado 'for <pat> in <expr> do <expr>'.
ru: Неожиданное завершение входных данных для выражения 'for'. Ожидаемое завершение: 'for <pat> в <expr> do <expr>'.
tr: 'for' ifadesinde beklenmeyen giriş sonu. 'for <pat> in <expr> do <expr>' bekleniyordu.
zh_hans: "for'" 表达式中的输入意外结束。应为 "for <pat> in <expr> do <expr>"。
zh_hant: 'for' 運算式中有未預期的輸入結尾。應為 'for <pat> in <expr> do <expr>'。

# parsUnexpectedEndOfFileWith
source: Unexpected end of input in 'match' or 'try' expression
cs: Neočekávaný konec vstupu ve výrazu match nebo try
de: Unerwartetes Eingabeende im 'match'- oder 'try'-Ausdruck
es: Final de entrada inesperado en la expresión 'match' o 'try'.
fr: Fin d'entrée inattendue dans l'expression 'match' ou 'try'
it: Fine dell'input imprevista nell'espressione 'match' o 'try'
ja: 'match' 式または 'try' 式に予期しない入力の終わりが見つかりました
ko: 'match' 또는 'try' 식에 예기치 않은 입력의 끝이 있습니다.
pl: Nieoczekiwane zakończenie danych wejściowych w wyrażeniu „match” lub „try”
pt_br: Fim inesperado de entrada na expressão 'match' ou 'try'.
ru: Непредвиденный конец входных данных в выражении "match" или "try"
tr: 'match' veya 'try' ifadesinde beklenmeyen giriş sonu
zh_hans: “match”或“try”表达式中出现意外的输入结尾
zh_hant: 'match' 或 'try' 運算式中不能以輸入結尾
