Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# tcTypeAbbreviationsCheckedAtCompileTime
source: As of F# 4.1, the accessibility of type abbreviations is checked at compile-time. Consider changing the accessibility of the type abbreviation. Ignoring this warning might lead to runtime errors.
cs: Od jazyka F# 4.1 se dostupnost zkratek typů kontroluje při kompilaci. Zvažte možnost změnit dostupnost zkratek typů. Pokud budete toto upozornění ignorovat, může to mít za následek chyby za běhu.
de: Ab F# 4.1 wird die Zugreifbarkeit von Typabkürzungen zur Kompilierzeit überprüft. Sie sollten die Zugreifbarkeit der Typabkürzung ggf. ändern. Das Ignorieren dieser Warnung führt möglicherweise zu Laufzeitfehlern.
es: A partir de F# 4.1, la accesibilidad de las abreviaturas de tipo se comprueba en tiempo de compilación. Considere la posibilidad de cambiar la accesibilidad de la abreviatura de tipo. Si pasa por alto esta advertencia, se podrían producir errores de tiempo de ejecución.
fr: À partir de F# 4.1, l'accessibilité des abréviations de type est vérifiée au moment de la compilation. Changez l'accessibilité de l'abréviation de type. Si vous ignorez cet avertissement, cela risque d'entraîner des erreurs d'exécution.
it: A partire da F# 4.1, l'accessibilità delle abbreviazioni dei tipi viene verificata in fase di compilazione. Provare a modificare l'accessibilità dell'abbreviazione dei tipi. Se si ignora questo avviso, potrebbero verificarsi errori di runtime.
ja: F# 4.1 まででは、型略称のアクセシビリティはコンパイル時に確認されます。型略称のアクセシビリティを変更することを検討してください。この警告を無視すると、ランタイム エラーが発生する可能性があります。
ko: F# 4.1부터 형식 약어의 액세스 가능성은 컴파일 시간에 확인합니다. 형식 약어의 액세스 가능성을 변경하세요. 이 경고를 무시하면 런타임 오류가 발생할 수 있습니다.
pl: Począwszy od wersji F# 4.1, dostępność skrótów typów jest sprawdzana w czasie kompilacji. Rozważ sprawdzenie dostępności skrótu typu. Zignorowanie tego ostrzeżenia może prowadzić do błędów w czasie wykonywania.
pt_br: Começando no F# 4.1, a acessibilidade das abreviações de tipo é verificada no momento da compilação. Considere alterar a acessibilidade do tipo de abreviação. Ignorar este aviso pode levar a erros de tempo de execução.
ru: В версии F# 4.1 доступность сокращений типов проверяется во время компиляции. Рекомендуется изменить доступность сокращений типов. Если проигнорировать это предупреждение, возможны ошибки во время выполнения.
tr: F# 4.1 ve sonrasında tür kısaltmalarının erişilebilirliği, derleme zamanında denetlenmektedir. Tür kısaltmasının erişilebilirliğini değiştirmeniz önerilir. Bu uyarıyı yoksaymak, çalışma zamanı hatalarına neden olabilir.
zh_hans: 从 F# 4.1 起，类型缩写词的辅助功能在编译时进行检查。请考虑更改类型缩写词的辅助功能。忽略此警告可能会导致运行时错误。
zh_hant: 自 F# 4.1 起，類型縮寫的協助工具會於編譯時期經過檢查。請考慮變更類型縮寫的協助工具。略過此警告會導致執行階段錯誤。

# tcEnumerationsMayNotHaveMembers
source: Enumerations cannot have members
cs: Výčty nemůžou mít členy.
de: Enumerationen dürfen keine Member aufweisen.
es: Las enumeraciones no pueden tener miembros.
fr: Les énumérations ne peuvent pas avoir de membres
it: Le enumerazione non possono avere membri
ja: 列挙型にメンバーを含めることはできません
ko: 열거형에는 멤버를 지정할 수 없습니다.
pl: Wyliczenia nie mogą zawierać elementów członkowskich
pt_br: Enumerações não podem ter membros
ru: Перечисления не могут содержать элементы
tr: Sabit listelerinde üyeler olamaz
zh_hans: 枚举不能具有成员
zh_hant: 列舉值不能有成員

# tcMeasureDeclarationsRequireStaticMembers
source: Measure declarations may have only static members
cs: Deklarace míry můžou mít jenom statické členy.
de: Maßeinheitendeklarationen dürfen nur statische Member enthalten.
es: Las declaraciones de medida solo pueden tener miembros estáticos.
fr: Les déclarations de mesure ne peuvent avoir que des membres statiques
it: Le dichiarazioni di misura possono avere solo membri statici
ja: 単位の宣言に使用できるのは静的なメンバーのみです
ko: 측정값 선언에는 정적 멤버만 있을 수 있습니다.
pl: Deklaracje miary mogą mieć tylko statyczne elementy członkowskie
pt_br: Declarações de medida só podem ter membros estáticos
ru: Определения измерений могут иметь только статические элементы
tr: Ölçü bildirimlerinin yalnızca statik üyeleri olabilir
zh_hans: 度量声明只能具有静态成员
zh_hant: 測量宣告只能有靜態成員

# tcStructsMayNotContainDoBindings
source: Structs cannot contain 'do' bindings because the default constructor for structs would not execute these bindings
cs: Struktury nemůžou obsahovat vazby do, protože výchozí konstruktor pro struktury by tyto vazby neprovedl.
de: Strukturen dürfen keine do-Bindungen enthalten, da der Standardkonstruktor für Strukturen diese Bindungen nicht ausführen würde.
es: Los structs no pueden contener enlaces 'do' porque el constructor predeterminado para structs no ejecutaría estos enlaces.
fr: Les structs ne peuvent pas contenir de liaisons 'do', car le constructeur par défaut des structs n'exécute pas ces liaisons
it: Gli struct non possono contenere binding 'do' perché il costruttore predefinito per gli struct non è in grado di eseguire tali binding
ja: 構造体の既定のコンストラクターは束縛を実行しないため、構造体には 'do' 束縛を含むことができません
ko: 구조체의 기본 생성자는 이러한 바인딩을 실행하지 않으므로 구조체에는 'do' 바인딩을 포함할 수 없습니다.
pl: Struktury nie mogą zawierać powiązań „do”, ponieważ domyślny konstruktor struktur nie wykona tych powiązań
pt_br: Structs não podem conter associações 'do' porque o construtor padrão para structs não as executaria
ru: Структуры не могут содержать привязок "do", так как конструктор по умолчанию для структур не будет выполнять эти привязки
tr: Yapıların varsayılan oluşturucusu 'do' bağlamalarını yürütmeyeceği için yapılar bu bağlamaları içeremez
zh_hans: 结构不能包含“do”绑定，因为结构的默认构造函数将不会执行这些绑定
zh_hant: 結構不能包含 'do' 繫結，因為結構的預設建構函式不會執行這些繫結

# tcStructsMayNotContainLetBindings
source: Structs cannot contain value definitions because the default constructor for structs will not execute these bindings. Consider adding additional arguments to the primary constructor for the type.
cs: Struktury nemůžou obsahovat definice hodnot, protože výchozí konstruktor pro struktury tyto vazby neprovede. Zvažte možnost přidat k primárnímu konstruktoru pro tento typ další argumenty.
de: Strukturen dürfen keine Wertdefinitionen enthalten, da der Standardkonstruktor für Strukturen diese Bindungen nicht ausführt. Fügen Sie dem primären Konstruktor für diesen Typ ggf. zusätzliche Argumente hinzu.
es: Los structs no pueden contener definiciones de valor porque el constructor predeterminado para structs no ejecutará estos enlaces. Considere agregar argumentos adicionales al constructor principal para el tipo.
fr: Les structs ne peuvent pas contenir de définitions de valeur, car le constructeur par défaut des structs n'exécute pas ces liaisons. Ajoutez des arguments supplémentaires au constructeur principal du type.
it: Gli struct non possono contenere definizioni di valore perché il costruttore predefinito per gli struct non è in grado di eseguire tali binding. Provare ad aggiungere altri argomenti al costruttore primario per il tipo.
ja: 構造体の既定のコンストラクターは束縛を実行しないため、構造体には値の定義を含むことができません。型のプライマリ コンストラクターに引数を追加してください。
ko: 구조체의 기본 생성자는 이러한 바인딩을 실행하지 않으므로 구조체에는 값 정의를 포함할 수 없습니다. 형식의 주 생성자에 인수를 더 추가하세요.
pl: Struktury nie mogą zawierać definicji wartości, ponieważ domyślny konstruktor konstrukcji nie wykona tych powiązań. Rozważ dodanie kolejnych argumentów do podstawowego konstruktora typu.
pt_br: Structs não podem conter definições de valores porque o construtor padrão para structs não executará essas vinculações. Considere adicionar argumentos complementares ao construtor primário para o tipo.
ru: Структуры не могут содержать определений значений, так как конструктор по умолчанию для структур не будет выполнять эти привязки. Попробуйте добавить к первичному конструктору для типа дополнительные аргументы.
tr: Yapıların varsayılan oluşturucusu bu bağlamaları yürütmeyeceği için yapılar değer tanımlarını içeremez. Türün birincil oluşturucusuna ek bağımsız değişkenler eklemeyi düşünün.
zh_hans: 结构不能包含值定义，因为结构的默认构造函数将不会执行这些绑定。请考虑为该类型的主构造函数添加更多参数。
zh_hant: 結構不能包含值定義，因為結構的預設建構函式不會執行這些繫結。請考慮將其他引數加入類型的主要建構函式。

# tcStaticLetBindingsRequireClassesWithImplicitConstructors
source: Static value definitions may only be used in types with a primary constructor. Consider adding arguments to the type definition, e.g. 'type X(args) = ...'.
cs: Statické definice hodnot se dají použít jenom u typů s primárním konstruktorem. Zvažte přidání argumentů do definice typu, třeba type X(args) = ...
de: Statische Wertdefinitionen dürfen nur in Typen mit einem primären Konstruktor verwendet werden. Ziehen Sie in Betracht, Argumente zur Typdefinition hinzuzufügen, z. B. "type X(args) = ...".
es: Las definiciones de valores estáticos se pueden usar solo en tipos con un constructor principal. Considere agregar argumentos a la definición de tipo, por ejemplo, 'type X(args) = ...'.
fr: Les définitions de valeur statiques peuvent uniquement être utilisées dans les types comportant un constructeur principal. Ajoutez des arguments à la définition de type, par exemple 'type X(args) = …'.
it: Le definizioni di valore statiche possono essere utilizzate solo nei tipi con un costruttore primario. Provare ad aggiungere argomenti alla definizione di tipo, ad esempio 'type X(args) = ...'.
ja: 静的な値の定義は、プライマリ コンストラクターを含む型でのみ使用できます。型定義に引数を追加してください ( たとえば、'type X(args) = ...')。
ko: 정적 값 정의는 기본 생성자가 포함된 형식에서만 사용할 수 있습니다. 'type X(args) = ...'와 같이 형식 정의에 인수를 추가해 보세요.
pl: Definicje wartości statycznych mogą być używane tylko w przypadku typów z konstruktorem podstawowym. Rozważ dodanie argumentów do definicji typu, na przykład „type X(argumenty) = ...”.
pt_br: Definições de valores estáticos só podem ser usadas em tipos com um construtor primário. Considere adicionar argumentos à definição de tipo, por exemplo, 'type X(args) = ...'.
ru: Статические определения значений можно использовать только в типах с первичными конструкторами. Попробуйте добавить в определение типа аргументы, напр. "type X(args) = ...".
tr: Statik değer tanımları yalnızca birincil oluşturucusu olan türlerde kullanılabilir. Tür tanımına bağımsız değişkenler eklemeyi düşünün, örn. 'type X(args) = ...'.
zh_hans: 静态值定义只能在具有主构造函数的类型中使用。请考虑向类型定义添加参数，例如“type X(args) = ...”。
zh_hant: 靜態值定義只能用於含有主要建構函式的類型中。請考慮在類型定義加入引數，例如 'type X(args) = ...'。

# tcMeasureDeclarationsRequireStaticMembersNotConstructors
source: Measure declarations may have only static members: constructors are not available
cs: Deklarace míry můžou mít jenom statické členy: Konstruktory dostupné nejsou.
de: Maßeinheitendeklarationen dürfen nur statische Member enthalten: Konstruktoren sind nicht verfügbar.
es: Las declaraciones de medida solo pueden tener miembros estáticos: no hay constructores disponibles.
fr: Les déclarations de mesure ne peuvent avoir que des membres statiques : les constructeurs ne sont pas disponibles
it: Le dichiarazioni di misura possono avere solo membri statici: costruttori non disponibili
ja: 単位の宣言に使用できるのは静的なメンバーのみです。コンストラクターは使用できません。
ko: 측정값 선언에는 정적 멤버만 있을 수 있습니다. 생성자는 사용할 수 없습니다.
pl: Deklaracje miary mogą mieć tylko statyczne elementy członkowskie: konstruktory są niedostępne
pt_br: Declarações de medida só podem ter membros estáticos: construtores não estão disponíveis
ru: Определения измерений могут иметь только статические элементы: конструкторы недоступны
tr: Ölçü bildirimlerinin yalnızca statik üyeleri olabilir: oluşturucular kullanılmaz
zh_hans: 度量声明只能具有静态成员: 构造函数不可用
zh_hant: 測量宣告只能有靜態成員: 無法使用建構函式

# tcMemberAndLocalClassBindingHaveSameName
source: A member and a local class binding both have the name '{0}'
cs: Vazba členské i lokální třídy má název {0}.
de: Ein Member und eine lokale Klassenbindung haben beide den Namen "{0}".
es: Un miembro y un enlace de clase local tienen el nombre '{0}'.
fr: Un membre et une liaison de classe locale se nomment tous les deux '{0}'
it: Un binding di una classe locale e un membro non possono avere entrambi il nome '{0}'
ja: メンバーとローカル クラスの束縛はどちらも '{0}' という名前を使用しています
ko: 멤버와 지역 클래스 바인딩 모두에 이름 '{0}'이(가) 있습니다.
pl: Element członkowski i lokalne powiązanie klasy mają tę samą nazwę („{0}”)
pt_br: Um membro e uma associação de classe local têm o mesmo nome '{0}'
ru: Элемент и привязка локального класса имеют одно имя "{0}"
tr: Hem üyenin hem de yerel sınıf bağlamasının adı '{0}' olabilir
zh_hans: 一个成员和一个本地类绑定的名称都为“{0}”
zh_hant: 成員和區域類別繫結都有名稱 '{0}'

# tcTypeAbbreviationsCannotHaveInterfaceDeclaration
source: Type abbreviations cannot have interface declarations
cs: Zkratky typů nemůžou mít deklarace rozhraní.
de: Typabkürzungen dürfen keine Schnittstellendeklarationen aufweisen.
es: Las abreviaciones de tipo no pueden tener declaraciones de interfaz.
fr: Les abréviations de type ne peuvent pas avoir de déclarations d'interface
it: Le abbreviazioni di tipo non possono avere dichiarazioni di interfaccia
ja: 型略称にインターフェイスの宣言を含めることはできません
ko: 형식 약어에는 인터페이스 선언을 지정할 수 없습니다.
pl: Skróty typów nie mogą mieć deklaracji interfejsów
pt_br: Abreviações de tipo não podem ter declarações de interface
ru: Сокращения типов не могут иметь объявлений интерфейса
tr: Tür kısaltmalarının arabirim bildirimleri olamaz
zh_hans: 类型缩写词不能具有接口声明
zh_hant: 類型縮寫不能有介面宣告

# tcEnumerationsCannotHaveInterfaceDeclaration
source: Enumerations cannot have interface declarations
cs: Výčty nemůžou mít deklarace rozhraní.
de: Enumerationen dürfen keine Schnittstellendeklarationen aufweisen.
es: Las enumeraciones no pueden tener declaraciones de interfaz.
fr: Les énumérations ne peuvent pas avoir de déclarations d'interface
it: Le enumerazioni non possono avere dichiarazioni di interfaccia
ja: 列挙型にインターフェイスの宣言を含めることはできません
ko: 열거형에는 인터페이스 선언을 지정할 수 없습니다.
pl: Wyliczenia nie mogą zawierać deklaracji interfejsu
pt_br: Enumeradores não podem ter declarações de interface
ru: Перечисления не могут содержать объявления элементов
tr: Sabit listelerinde arabirim bildirimleri olamaz
zh_hans: 枚举不能具有接口声明
zh_hant: 列舉值不能有介面宣告

# tcTypeIsNotInterfaceType0
source: This type is not an interface type
cs: Tento typ není typem rozhraní.
de: Dieser Typ ist kein Schnittstellentyp.
es: Este tipo no es un tipo de interfaz.
fr: Ce type n'est pas un type interface
it: Questo tipo non è un tipo di interfaccia
ja: この型はインターフェイス型ではありません
ko: 이 형식은 인터페이스 형식이 아닙니다.
pl: Ten typ nie jest typem interfejsu
pt_br: Este não é um tipo de interface
ru: Этот тип не является интерфейсным типом
tr: Bu tür bir arabirim türü değil
zh_hans: 此类型不是接口类型
zh_hant: 這種類型不是介面類型

# tcAllImplementedInterfacesShouldBeDeclared
source: All implemented interfaces should be declared on the initial declaration of the type
cs: Všechna implementovaná rozhraní by se měla deklarovat při počáteční deklaraci typu.
de: Alle implementierten Schnittstellen sollten in der anfänglichen Deklaration des Typs deklariert werden.
es: Todas las interfaces implementadas deben declararse en la declaración inicial del tipo.
fr: Toutes les interfaces implémentées doivent être déclarées dans la déclaration initiale du type
it: Tutte le interfacce implementate devono essere dichiarate nella dichiarazione iniziale del tipo
ja: 実装したすべてのインターフェイスは、型の最初の宣言で宣言する必要があります
ko: 구현된 모든 인터페이스는 초기 형식 선언 시 선언해야 합니다.
pl: Wszystkie zaimplementowane interfejsy powinny zostać zadeklarowane w początkowej deklaracji typu
pt_br: Todas as interfaces implementadas devem ser declaradas na declaração inicial do tipo
ru: В исходном объявлении типа должны быть объявлены все реализованные интерфейсы
tr: Türün ilk bildiriminde tüm uygulanan arabirimler tanımlanmalıdır
zh_hans: 应在类型的初始声明中声明所有实现的接口
zh_hant: 所有實作的介面都應該在類型的初始宣告上宣告

# tcDefaultImplementationForInterfaceHasAlreadyBeenAdded
source: A default implementation of this interface has already been added because the explicit implementation of the interface was not specified at the definition of the type
cs: Výchozí implementace tohoto rozhraní už se přidala, protože jste v definici typu nezadali explicitní implementaci tohoto rozhraní.
de: Es wurde bereits eine Standardimplementierung dieser Schnittstelle hinzugefügt, weil die explizite Implementierung der Schnittstelle nicht in der Typdefinition angegeben war.
es: Ya se ha agregado una implementación predeterminada de esta interfaz porque no se especificó la implementación explícita de la interfaz en la definición del tipo.
fr: Une implémentation par défaut de cette interface a déjà été ajoutée, car l'implémentation explicite de l'interface n'a pas été spécifiée lors de la définition du type
it: È stata già aggiunta un'implementazione predefinita di questa interfaccia perché l'implementazione esplicita dell'interfaccia stessa non è specificata nella definizione del tipo
ko: 형식을 정의할 때 인터페이스의 명시적 구현이 지정되지 않았으므로 이 인터페이스의 기본 구현이 이미 추가되었습니다.
pl: Dodano już domyślną implementację tego interfejsu, ponieważ nie określono jawnej implementacji interfejsu w definicji typu
pt_br: Uma implementação padrão desta interface já foi adicionada porque a implementação explícita da interface não foi especificada na definição do tipo
ru: Реализация по умолчанию для данного интерфейса уже была добавлена, так как в определении типа не была указана явная реализация интерфейса
tr: Bu arabirimin açık olarak uygulanması türün tanımında belirtilmediği için arabirimin varsayılan uygulaması zaten eklendi
zh_hans: 已添加此接口的默认实现，因为在相应类型的定义中未指定接口的显式实现
zh_hant: 已經加入這個介面的預設實作，因為未在類型的定義指定介面的明確實作

# tcMemberNotPermittedInInterfaceImplementation
source: This member is not permitted in an interface implementation
cs: Tento člen není v implementaci rozhraní povolený.
de: Dieser Member ist in einer Schnittstellenimplementierung unzulässig.
es: No se permite este miembro en una implementación de interfaz.
fr: Ce membre n'est pas autorisé dans l'implémentation d'une interface
it: Membro non consentito in un'implementazione di interfaccia
ja: インターフェイスの実装では、このメンバーは使用できません
ko: 이 멤버는 인터페이스 구현에서 허용되지 않습니다.
pl: Ten element członkowski nie jest dozwolony w implementacji interfejsu
pt_br: Este membro não é permitido em implementação de interfaces
ru: Этот элемент не разрешается в реализации интерфейса
tr: Arabirim uygulamasında bu üyeye izin verilmez
zh_hans: 接口实现中不允许使用此成员
zh_hant: 不允許在介面實作中使用這個成員

# tcDeclarationElementNotPermittedInAugmentation
source: This declaration element is not permitted in an augmentation
cs: Tento element deklarace není u rozšíření povolený.
de: Dieses Deklarationselement ist in einer Augmentation nicht zulässig.
es: Este elemento de declaración no se permite en un aumento.
fr: Cet élément de déclaration n'est pas autorisé dans une augmentation
it: Elemento di dichiarazione non consentito in un aumento
ja: 拡張にこの宣言の要素は使用できません
ko: 이 선언 요소는 확대에서 허용되지 않습니다.
pl: Ten element deklaracji nie jest dozwolony w rozszerzeniu
pt_br: Este elemento de declaração não é permitido em um aumento
ru: Данный элемент объявления не допускается в приращении
tr: Bir genişletmede bu tanımlama öğesine izin verilmez
zh_hans: 扩大中不允许使用此声明元素
zh_hant: 不允許在增強指定中使用這個宣告項目

# tcTypesCannotContainNestedTypes
source: Types cannot contain nested type definitions
cs: Typy nemůžou obsahovat definice vnořených typů.
de: Typen dürfen keine geschachtelten Typdefinitionen enthalten.
es: Los tipos no pueden contener definiciones de tipo anidadas.
fr: Les types ne peuvent pas contenir de définitions de type imbriquées
it: I tipi non possono contenere definizioni di tipo annidate
ja: 型に入れ子の型定義を含めることはできません
ko: 형식에는 중첩 형식 정의를 포함할 수 없습니다.
pl: Typy nie mogą zawierać definicji typów zagnieżdżonych
pt_br: Tipos não podem conter definições de tipo aninhadas
ru: Типы не могут содержать вложенные определения типов
tr: Türler iç içe tür tanımları içeremez
zh_hans: 类型不能包含嵌套的类型定义
zh_hant: 類型不能包含巢狀類型定義

# tcTypeExceptionOrModule
source: type, exception or module
cs: typ, výjimka nebo modul
de: Typ, Ausnahme oder Modul
es: tipo, excepción o módulo
fr: type, exception ou module
it: tipo, eccezione o modulo
ja: 型、例外、またはモジュール
ko: 형식, 예외 또는 모듈입니다.
pl: typ, wyjątek lub moduł
pt_br: tipo, exceção ou módulo
ru: тип, исключение или модуль
tr: tür, özel durum veya modül
zh_hans: 类型、异常或模块
zh_hant: 類型、例外狀況或模組

# tcTypeOrModule
source: type or module
cs: typ nebo modul
de: Typ oder Modul
es: tipo o módulo
fr: type ou module
it: tipo o modulo
ja: 型またはモジュール
ko: 형식 또는 모듈입니다.
pl: typ lub moduł
pt_br: tipo ou módulo
ru: тип или модуль
tr: tür veya modül
zh_hans: 类型或模块
zh_hant: 類型或模組

# tcImplementsIStructuralEquatableExplicitly
source: The struct, record or union type '{0}' implements the interface 'System.IStructuralEquatable' explicitly. Apply the 'CustomEquality' attribute to the type.
cs: Typ struktura, záznam nebo sjednocení {0} implementuje explicitně rozhraní System.IStructuralEquatable. Použijte pro tento typ atribut CustomEquality.
de: Der Struktur-, Datensatz- oder Union-Typ "{0}" implementiert die System.IStructuralEquatable-Schnittstelle explizit. Wenden Sie das CustomEquality-Attribut auf den Typ an.
es: El tipo de struct, registro o unión '{0}' implementa la interfaz 'System.IStructuralEquatable' de forma explícita. Aplique el atributo 'CustomEquality' al tipo.
fr: Le type struct, enregistrement ou union '{0}' implémente explicitement l'interface 'System.IStructuralEquatable'. Appliquez l'attribut 'CustomEquality' au type.
it: Il tipo di struct, record o unione '{0}' implementa l'interfaccia 'System.IStructuralEquatable' in modo esplicito. Applicare l'attributo 'CustomEquality' al tipo.
ja: 構造体型、レコード型、または共用体型の '{0}' はインターフェイス 'System.IStructuralEquatable' を明示的に実装しています。この型には 'CustomEquality' 属性を適用してください。
ko: 구조체, 레코드 또는 공용 구조체 형식 '{0}'은(는) 'System.IStructuralEquatable' 인터페이스를 명시적으로 구현합니다. 형식에 'CustomEquality' 특성을 적용하세요.
pl: Typ struktury, rekordu lub unii „{0}” zawiera jawną implementację interfejsu „System.IStructuralEquatable”. Zastosuj atrybut „CustomEquality” do typu.
pt_br: O tipo de struct, registro ou união '{0}' implementa explicitamente a interface 'System.IStructuralEquatable'. Aplique o atributo 'CustomEquality' ao tipo.
ru: Тип структуры, записи или объединения "{0}" явно реализует интерфейс "System.IStructuralEquatable". Необходимо применить к типу атрибут "CustomEquality".
tr: Yapı, kayıt veya birleşim türü '{0}', 'System.IStructuralEquatable' arabirimini açık olarak uyguluyor. Türe 'CustomEquality' özniteliğini uygulayın.
zh_hans: 结构、记录或联合类型“{0}”显式实现接口“System.IStructuralEquatable”。将“CustomEquality”特性应用于相应的类型。
zh_hant: 結構、記錄或等位型別 '{0}' 明確實作了介面 'System.IStructuralEquatable'。請將 'CustomEquality' 屬性套用到該型別。
