Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DefinitionsInSigAndImplNotCompatibleSignatureDeclaresDiffer
source: The {0} definitions for type '{1}' in the signature and implementation are not compatible because the signature declares a {2} while the implementation declares a {3}
cs: Definice {0} pro typ {1} v signatuře a implementaci nejsou kompatibilní, protože signatura deklaruje {2}, ale implementace deklaruje {3}.
de: Die {0} Definitionen für den Typ "{1}" in der Signatur und Implementierung sind nicht kompatibel, weil in der Signatur "{2}", in der Implementierung hingegen "{3}" deklariert wird.
es: Las definiciones de {0} para el tipo "{1}" en la signatura y la implementación no son compatibles porque la signatura declara un {2} mientras la implementación declara un {3}
fr: Les {0} définitions pour le type '{1}' dans la signature et l'implémentation ne sont pas compatibles, car la signature déclare {2} alors que l'implémentation déclare {3}
it: Le definizioni di {0} per il tipo '{1}' nella firma e nell'implementazione non sono compatibili perché la firma dichiara {2} mentre l'implementazione dichiara {3}
ja: シグネチャは {2} を宣言していますが、実装では {3} を宣言しているため、シグネチャおよび実装内の型 '{1}' の {0} 定義は互換性がありません
ko: 시그니처가 {2}을(를) 선언하지만 구현은 {3}을(를) 선언하므로 시그니처 및 구현의 '{1}' 형식에 대한 {0} 정의가 호환되지 않습니다.
pl: Definicje {0} dla typu „{1}” w sygnaturze i implementacji są niezgodne, ponieważ sygnatura deklaruje element {2}, natomiast implementacja deklaruje element {3}
pt_br: As definições {0} para o tipo '{1}' na assinatura e implementação não são compatíveis, pois a assinatura declara um {2} enquanto a implementação declara um {3}
ru: Определения {0} для типа "{1}" в сигнатуре и реализации несовместимы, так как сигнатура объявляет {2}, а реализация — {3}.
tr: İmzada {2} bildirilirken uygulamada {3} bildirildiğinden, imza ve uygulamadaki '{1}' türü için {0} tanımları uyumlu değil
zh_hans: 签名和实现中类型“{1}”的 {0} 定义不兼容，因为签名声明的是 {2}，而实现声明的是 {3}
zh_hant: 簽章與實作中類型 '{1}' 的 {0} 定義不相容，因為簽章宣告 {2}，而實作則宣告 {3}

# DefinitionsInSigAndImplNotCompatibleAbbreviationsDiffer
source: The {0} definitions for type '{1}' in the signature and implementation are not compatible because the abbreviations differ: {2} versus {3}
cs: Definice {0} pro typ {1} v signatuře a implementaci nejsou kompatibilní, protože se liší zkratky: {2} oproti {3}
de: Die {0} Definitionen für den Typ "{1}" in der Signatur und in der Implementierung sind aufgrund unterschiedlicher Abkürzungen nicht kompatibel: {2} und {3}.
es: Las definiciones de {0} para el tipo "{1}" de la signatura y la implementación no son compatibles porque las abreviaciones difieren: {2} frente a {3}
fr: Les {0} définitions pour le type '{1}' dans la signature et l'implémentation ne sont pas compatibles, car les abréviations sont différentes : {2} par opposition à {3}
it: Le definizioni di {0} per il tipo '{1}' nella firma e nell'implementazione non sono compatibili perché le abbreviazioni sono diverse: {2} invece di {3}
ja: シグネチャおよび実装内の型 '{1}' の {0} 定義は、省略形が異なるため ({2} と {3})、互換性がありません
ko: 약어가 {2}과(와) {3}(으)로 서로 다르므로 시그니처 및 구현의 '{1}' 형식에 대한 {0} 정의가 호환되지 않습니다.
pl: Definicje {0} dla typu „{1}” w sygnaturze i implementacji są niezgodne, ponieważ skróty są różne: {2} i {3}
pt_br: As definições {0} para o tipo '{1}' na assinatura e implementação não são compatíveis, pois as abreviações são diferentes: {2} versus {3}
ru: Определения {0} для типа "{1}" в сигнатуре и реализации несовместимы, так как сокращения различаются: {2} в сравнении с {3}.
tr: Kısaltmalar farklı olduğundan ({2} ve {3}), imza ve uygulamadaki '{1}' türü için {0} tanımları uyumlu değil
zh_hans: 签名和实现中类型“{1}”的 {0} 定义不兼容，因为缩写不同: {2} 与 {3}
zh_hant: 簽章與實作中類型 '{1}' 的 {0} 定義不相容，因為縮寫不同: {2} 與 {3}

# DefinitionsInSigAndImplNotCompatibleAbbreviationHiddenBySig
source: The {0} definitions for type '{1}' in the signature and implementation are not compatible because an abbreviation is being hidden by a signature. The abbreviation must be visible to other CLI languages. Consider making the abbreviation visible in the signature.
cs: Definice {0} pro typ {1} v signatuře a implementaci nejsou kompatibilní, protože signatura skrývá zkratku. Zkratka musí být viditelná pro ostatní jazyky CLI. Zvažte zviditelnění zkratky v signatuře.
de: Die {0} Definitionen für den Typ "{1}" in der Signatur und in der Implementierung sind nicht kompatibel, weil eine Abkürzung von einer Signatur verdeckt wird. Die Abkürzung muss für andere CLI-Sprachen sichtbar sein. Sorgen Sie dafür, dass die Abkürzung in der Signatur sichtbar ist.
es: Las definiciones de {0} para el tipo "{1}" de la signatura y la implementación no son compatibles porque una signatura oculta una abreviación. La abreviación debe estar visible para otros lenguajes CLI. Considere hacer que la abreviación esté visible en la signatura.
fr: Les {0} définitions pour le type '{1}' dans la signature et l'implémentation ne sont pas compatibles, car une abréviation est masquée par une signature. L'abréviation doit être visible par les autres langages CLI. Rendez l'abréviation visible dans la signature.
it: Le definizioni di {0} per il tipo '{1}' nella firma e nell'implementazione non sono compatibili perché un'abbreviazione è nascosta da una firma. L'abbreviazione deve essere visibile ad altri linguaggi CLI. Provare a rendere visibile l'abbreviazione nella firma.
ja: 省略形がシグネチャによって隠ぺいされているため、シグネチャおよび実装の型 '{1}' の {0} 定義に互換性がありません。省略形は他の CLI 言語から参照できるようにする必要があります。シグネチャ内の省略形を参照できるようにしてください。
ko: 시그니처에 의해 약어가 숨겨져 있으므로 시그니처 및 구현의 '{1}' 형식에 대한 {0} 정의가 호환되지 않습니다. 약어는 다른 CLI 언어에 표시되어야 합니다. 시그니처에서 약어를 표시하세요.
pl: Definicje {0} dla typu „{1}” w sygnaturze i implementacji są niezgodne, ponieważ skrót jest ukrywany przez sygnaturę. Skrót musi być widoczny dla innych języków infrastruktury CLI. Rozważ zapewnienie widoczności skrótu w sygnaturze.
pt_br: As definições {0} para o tipo '{1}' na assinatura e implementação não são compatíveis, pois uma abreviação está sendo ocultada por uma assinatura. A abreviação deve estar visível a outras linguagens CLIs. Considere deixar a abreviação visível na assinatura.
ru: Определения {0} для типа "{1}" в сигнатуре и реализации несовместимы, так как сокращение скрывается сигнатурой. Сокращение должно быть видимым для других языков CLI. Попробуйте сделать сокращение видимым в сигнатуре.
tr: Bir kısaltma imza ile gizlendiğinden, imza ve uygulamadaki '{1}' türü için {0} tanımları uyumlu değil. Kısaltmanın diğer CLI dilleri tarafından görünebilir olması gerekir. Kısaltmayı imzada görünür yapmayı düşünün.
zh_hans: 签名和实现中类型“{1}”的 {0} 定义不兼容，因为签名将隐藏缩写。缩写必须对其他 CLI 语言可见。请考虑使缩写在签名中可见。
zh_hant: 簽章與實作中類型 '{1}' 的 {0} 定義不相容，因為簽章隱藏了某縮寫。其他 CLI 語言必須可看見該縮寫。請考慮使縮寫在簽章中可見。

# DefinitionsInSigAndImplNotCompatibleSigHasAbbreviation
source: The {0} definitions for type '{1}' in the signature and implementation are not compatible because the signature has an abbreviation while the implementation does not
cs: Definice {0} pro typ {1} v signatuře a implementaci nejsou kompatibilní, protože signatura má zkratku, ale implementace ne.
de: Die {0} Definitionen für den Typ "{1}" in der Signatur und in der Implementierung sind nicht kompatibel, weil die Signatur eine Abkürzung enthält, die Implementierung hingegen nicht.
es: Las definiciones de {0} para el tipo "{1}" en la signatura y la implementación no son compatibles porque la signatura tiene una abreviación y la implementación no
fr: Les {0} définitions pour le type '{1}' dans la signature et l'implémentation ne sont pas compatibles, car la signature a une abréviation, contrairement à l'implémentation
it: Le definizioni di {0} per il tipo '{1}' nella firma e nell'implementazione non sono compatibili perché, a differenza dell'implementazione, la firma contiene un'abbreviazione
ja: シグネチャには省略形がありますが、実装にはないため、シグネチャおよび実装内の型 '{1}' の {0} 定義は互換性がありません
ko: 시그니처에 약어가 있지만 구현에는 없으므로 시그니처 및 구현의 '{1}' 형식에 대한 {0} 정의가 호환되지 않습니다.
pl: Definicje {0} dla typu „{1}” w sygnaturze i implementacji są niezgodne, ponieważ sygnatura ma skrót, a implementacja go nie ma
pt_br: As definições {0} para o tipo '{1}' na assinatura e implementação não são compatíveis, pois a assinatura foi uma abreviação enquanto a implementação não
ru: Определения {0} для типа "{1}" в сигнатуре и реализации несовместимы, так как сигнатура имеет сокращение, а реализация — нет.
tr: İmzanın kısaltması olmasına rağmen uygulamanın olmadığından, imza ve uygulamadaki '{1}' türü için {0} tanımları uyumlu değil
zh_hans: 签名和实现中类型“{1}”的 {0} 定义不兼容，因为签名具有缩写，而实现没有缩写
zh_hant: 簽章與實作中類型 '{1}' 的 {0} 定義不相容，因為簽章有縮寫，但實作沒有

# ModuleContainsConstructorButNamesDiffer
source: The module contains the constructor\n {0} \nbut its signature specifies\n {1} \nThe names differ
cs: Modul obsahuje konstruktor\n {0}, \nale jeho signatura definuje\n {1}. \nLiší se názvy.
de: Das Modul enthält den Konstruktor\n {0} \nDie Signatur gibt aber Folgendes an:\n {1} \nDie Namen sind unterschiedlich.
es: El módulo contiene el constructor\n {0} \npero su signatura especifica\n {1} \nLos nombres difieren.
fr: Le module contient le constructeur\n {0} \nmais sa signature spécifie\n {1} \nLes noms sont différents
it: Il modulo contiene il costruttore\n {0} \ntuttavia la relativa firma specifica\n {1} \nI nomi sono diversi
ja: モジュールにはコンストラクター\n {0} \nが含まれますが、シグネチャでは\n {1} \nを指定しています。名前が異なります。
ko: 모듈에\n {0} 생성자가 포함되어 있지만 \n해당 시그니처는\n {1}을(를) 지정합니다. \n이름이 서로 다릅니다.
pl: Moduł zawiera konstruktora\n {0}, \nale jego sygnatura określa\n {1} \nNazwy są różne
pt_br: O módulo contém o construtor\n {0} \n, mas sua assinatura especifica\n {1} \nOs nomes diferem
ru: Модуль содержит конструктор\n {0} \nоднако его сигнатура задает\n {1} \nИмена различаются
tr: Modül\n {0} \noluşturucusunu içeriyor ancak imzasında\n {1} \nbelirtiliyor. Adlar farklı
zh_hans: 该模块包含构造函数\n {0} \n而其签名指定\n {1} \n名称不同
zh_hant: 模組包含建構函式\n {0} \n但它的簽章卻指定\n {1} \n名稱不同

# ModuleContainsConstructorButDataFieldsDiffer
source: The module contains the constructor\n {0} \nbut its signature specifies\n {1} \nThe respective number of data fields differ
cs: Modul obsahuje konstruktor\n {0}, \nale jeho signatura definuje\n {1}. \nLiší se odpovídající počty datových polí.
de: Das Modul enthält den Konstruktor\n {0} \nDie Signatur gibt aber Folgendes an:\n {1} \nDie entsprechende Anzahl von Datenfeldern ist unterschiedlich.
es: El módulo contiene el constructor\n {0} \npero su signatura especifica\n {1} \nEl número respectivo de campos de datos difiere.
fr: Le module contient le constructeur\n {0} \nmais sa signature spécifie\n {1} \nLe nombre de champs de données respectifs est différent
it: Il modulo contiene il costruttore\n {0} \ntuttavia la relativa firma specifica\n {1} \nI rispettivi numeri di campi dati sono diversi
ja: モジュールにはコンストラクター\n {0} \nが含まれますが、シグネチャでは\n {1} \nを指定しています。データ フィールドの数が異なります。
ko: 모듈에\n {0} 생성자가 포함되어 있지만 \n해당 시그니처는\n {1}을(를) 지정합니다. \n각각의 데이터 필드 수가 서로 다릅니다.
pl: Moduł zawiera konstruktora\n {0}, \nale jego sygnatura określa\n {1} \nOdpowiednia liczba pól danych jest różna
pt_br: O módulo contém o construtor\n {0} \n, mas sua assinatura especifica\n {1} \nOs respectivos números de campos de dados diferem
ru: Модуль содержит конструктор\n {0} \nоднако его сигнатура задает\n {1} \nСоответствующие количества полей данных различаются
tr: Modül\n {0} \noluşturucusunu içeriyor ancak imzasında\n {1} \nbelirtiliyor. İlgili veri alanı sayısı farklı
zh_hans: 该模块包含构造函数\n {0} \n而其签名指定\n {1} \n各自的数据字段数不同
zh_hant: 模組包含建構函式\n {0} \n但它的簽章卻指定\n {1} \n個別的資料欄位數不同

# ModuleContainsConstructorButTypesOfFieldsDiffer
source: The module contains the constructor\n {0} \nbut its signature specifies\n {1} \nThe types of the fields differ
cs: Modul obsahuje konstruktor\n {0}, \nale jeho signatura definuje\n {1}. \nLiší se typy polí.
de: Das Modul enthält den Konstruktor\n {0} \nDie Signatur gibt aber Folgendes an:\n {1} \nDie Typen der Felder sind unterschiedlich.
es: El módulo contiene el constructor\n {0} \npero su signatura especifica\n {1} \nLos tipos de los campos difieren.
fr: Le module contient le constructeur\n {0} \nmais sa signature spécifie\n {1} \nLes types des champs sont différents
it: Il modulo contiene il costruttore\n {0} \ntuttavia la relativa firma specifica\n {1} \nI tipi dei campi sono diversi
ja: モジュールにはコンストラクター\n {0} \nが含まれますが、シグネチャでは\n {1} \nを指定しています。フィールドの型が異なります。
ko: 모듈에\n {0} 생성자가 포함되어 있지만 \n해당 시그니처는\n {1}을(를) 지정합니다. \n필드의 형식이 서로 다릅니다.
pl: Moduł zawiera konstruktora\n {0}, \nale jego sygnatura określa\n {1} \nTypy pól są różne
pt_br: O módulo contém o construtor\n {0} \n, mas sua assinatura especifica\n {1} \nOs tipos dos campos são diferentes
ru: Модуль содержит конструктор\n {0} \nоднако его сигнатура задает\n {1} \nТипы полей различаются
tr: Modül\n {0} \noluşturucusunu içeriyor ancak imzasında\n {1} \nbelirtiliyor. Alanların türleri farklı
zh_hans: 该模块包含构造函数\n {0} \n而其签名指定\n {1} \n字段的类型不同
zh_hant: 模組包含建構函式\n {0} \n但它的簽章卻指定\n {1} \n欄位的類型不同

# ModuleContainsConstructorButAccessibilityDiffers
source: The module contains the constructor\n {0} \nbut its signature specifies\n {1} \nthe accessibility specified in the signature is more than that specified in the implementation
cs: Modul obsahuje konstruktor\n {0}, \nale jeho signatura definuje\n {1}. \nDostupnost zadaná v signatuře přesahuje dostupnost zadanou v implementaci.
de: Das Modul enthält den Konstruktor\n {0} \nDie Signatur gibt aber Folgendes an:\n {1} \nIn der Signatur ist eine höhere Zugreifbarkeit angegeben als in der Implementierung.
es: El módulo contiene el constructor\n {0} \npero su signatura especifica\n {1} \nLa accesibilidad especificada en la signatura es superior a la especificada en la implementación.
fr: Le module contient le constructeur\n {0} \nmais sa signature spécifie\n {1} \nL'accessibilité spécifiée dans la signature est supérieure à celle spécifiée dans l'implémentation
it: Il modulo contiene il costruttore\n {0} \ntuttavia la relativa firma specifica\n {1} \nL'accessibilità specificata nella firma è maggiore rispetto a quella specificata nell'implementazione
ja: モジュールにはコンストラクター\n {0} \nが含まれますが、シグネチャでは\n {1} \nを指定しています。シグネチャに指定されたアクセシビリティの方が、実装よりも高い設定です。
ko: 모듈에\n {0} 생성자가 포함되어 있지만 \n해당 시그니처는\n {1}을(를) 지정합니다. \n시그니처에 지정된 액세스 가능성이 구현에 지정된 액세스 가능성보다 높습니다.
pl: Moduł zawiera konstruktora\n {0}, \nale jego sygnatura określa\n {1} \nDostępność określona w sygnaturze jest większa od określonej w implementacji
pt_br: O módulo contém o construtor\n {0} \n, mas sua assinatura especifica\n {1} \nA acessibilidade especificada na assinatura é maior que a especificada na implementação
ru: Модуль содержит конструктор\n {0} \nоднако его сигнатура задает\n {1} \nдоступность, заданная в сигнатуре, шире указанной в реализации
tr: Modül\n {0} \noluşturucusunu içeriyor ancak imzasında\n {1} \nbelirtiliyor; imzada belirtilen erişilebilirlik uygulamada belirtilenden daha fazla
zh_hans: 该模块包含构造函数\n {0} \n而其签名指定\n {1} \n签名中指定的可访问性高于实现中指定的可访问性
zh_hant: 模組包含建構函式\n {0} \n但它的簽章卻指定\n {1} \n簽章中指定的存取範圍大於實作中指定的存取範圍

# FieldNotContainedNamesDiffer
source: The module contains the field\n {0} \nbut its signature specifies\n {1} \nThe names differ
cs: Modul obsahuje pole\n {0}, \nale jeho signatura definuje\n {1}. \nLiší se názvy.
de: Das Modul enthält das Feld\n {0} \nDie Signatur gibt aber Folgendes an:\n {1} \nDie Namen sind unterschiedlich.
es: El módulo contiene el campo\n {0} \npero su signatura especifica\n {1} \nLos nombres difieren.
fr: Le module contient le champ\n {0} \nmais sa signature spécifie\n {1} \nLes noms sont différents
it: Il modulo contiene il campo\n {0} \ntuttavia la relativa firma specifica\n {1} \nI nomi sono diversi
ja: モジュールにはフィールド\n {0} \nが含まれますが、シグネチャでは\n {1} \nを指定しています。名前が異なります。
ko: 모듈에\n {0} 필드가 포함되어 있지만 \n해당 시그니처는\n {1}을(를) 지정합니다. \n이름이 서로 다릅니다.
pl: Moduł zawiera pole\n {0}, \nale jego sygnatura określa\n {1} \nNazwy są różne
pt_br: O módulo contém o campo\n {0} \n, mas sua assinatura especifica\n {1} \nOs nomes são diferentes
ru: Модуль содержит поле\n {0} \nоднако его сигнатура задает\n {1} \nИмена различаются
tr: Modül\n {0} \nalanını içeriyor ancak imzasında\n {1} \nbelirtiliyor. Adlar farklı
zh_hans: 该模块包含字段\n {0} \n而其签名指定\n {1} \n名称不同
zh_hant: 模組包含欄位\n {0} \n但它的簽章卻指定\n {1} \n名稱不同

# FieldNotContainedAccessibilitiesDiffer
source: The module contains the field\n {0} \nbut its signature specifies\n {1} \nthe accessibility specified in the signature is more than that specified in the implementation
cs: Modul obsahuje pole\n {0}, \nale jeho signatura definuje\n {1}. \nDostupnost zadaná v signatuře přesahuje dostupnost zadanou v implementaci.
de: Das Modul enthält das Feld\n {0} \nDie Signatur gibt aber Folgendes an:\n {1} \nIn der Signatur ist eine höhere Zugreifbarkeit angegeben als in der Implementierung.
es: El módulo contiene el campo\n {0} \npero su signatura especifica\n {1} \nLa accesibilidad especificada en la signatura es superior a la especificada en la implementación.
fr: Le module contient le champ\n {0} \nmais sa signature spécifie\n {1} \nL'accessibilité spécifiée dans la signature est supérieure à celle spécifiée dans l'implémentation
it: Il modulo contiene il campo\n {0} \ntuttavia la relativa firma specifica\n {1} \nL'accessibilità specificata nella firma è maggiore rispetto a quella specificata nell'implementazione
ja: モジュールにはフィールド\n {0} \nが含まれますが、シグネチャでは\n {1} \nを指定しています。シグネチャに指定されたアクセシビリティの方が、実装よりも高い設定です。
ko: 모듈에\n {0} 필드가 포함되어 있지만 \n해당 시그니처는\n {1}을(를) 지정합니다. \n시그니처에 지정된 액세스 가능성이 구현에 지정된 액세스 가능성보다 높습니다.
pl: Moduł zawiera pole\n {0}, \nale jego sygnatura określa\n {1} \nDostępność określona w sygnaturze jest większa od określonej w implementacji
pt_br: O módulo contém o campo\n {0} \n, mas sua assinatura especifica\n {1} \nA acessibilidade especificada na assinatura é maior que a especificada na implementação
ru: Модуль содержит поле\n {0} \nоднако его сигнатура задает\n {1} \nдоступность, заданная в сигнатуре, шире указанной в реализации
tr: Modül\n {0} \nalanını içeriyor ancak imzasında\n {1} \nbelirtiliyor; imzada belirtilen erişilebilirlik uygulamada belirtilenden daha fazla
zh_hans: 该模块包含字段\n {0} \n而其签名指定\n {1} \n签名中指定的可访问性高于实现中指定的可访问性
zh_hant: 模組包含欄位\n {0} \n但它的簽章卻指定\n {1} \n簽章中指定的存取範圍大於實作中指定的存取範圍

# FieldNotContainedStaticsDiffer
source: The module contains the field\n {0} \nbut its signature specifies\n {1} \nThe 'static' modifiers differ
cs: Modul obsahuje pole\n {0}, \nale jeho signatura definuje\n {1}. \nLiší se modifikátory static.
de: Das Modul enthält das Feld\n {0} \nDie Signatur gibt aber Folgendes an:\n {1} \nDie static-Modifizierer sind unterschiedlich.
es: El módulo contiene el campo\n {0} \npero su signatura especifica\n {1} \nLos modificadores 'static' difieren.
fr: Le module contient le champ\n {0} \nmais sa signature spécifie\n {1} \nLes modificateurs 'static' sont différents
it: Il modulo contiene il campo\n {0} \ntuttavia la relativa firma specifica\n {1} \nI modificatori 'static' sono diversi
ja: モジュールにはフィールド\n {0} \nが含まれますが、シグネチャでは\n {1} \nを指定しています。'static' 修飾子が異なります。
ko: 모듈에\n {0} 필드가 포함되어 있지만 \n해당 시그니처는\n {1}을(를) 지정합니다. \n'static' 한정자가 서로 다릅니다.
pl: Moduł zawiera pole\n {0}, \nale jego sygnatura określa\n {1} \nModyfikatory „static” są różne
pt_br: O módulo contém o campo\n {0} \n, mas sua assinatura especifica\n {1} \nOs modificadores 'static' são diferentes
ru: Модуль содержит поле\n {0} \nоднако его сигнатура задает\n {1} \nМодификаторы "static" различаются
tr: Modül\n {0} \nalanını içeriyor ancak imzasında\n {1} \nbelirtiliyor. 'static' değiştiricileri farklı
zh_hans: 该模块包含字段\n {0} \n而其签名指定\n {1} \n"static" 修饰符不同
zh_hant: 模組包含欄位\n {0} \n但它的簽章卻指定\n {1} \n'static' 修飾詞不同

# FieldNotContainedMutablesDiffer
source: The module contains the field\n {0} \nbut its signature specifies\n {1} \nThe 'mutable' modifiers differ
cs: Modul obsahuje pole\n {0}, \nale jeho signatura definuje\n {1}. \nLiší se modifikátory mutable.
de: Das Modul enthält das Feld\n {0} \nDie Signatur gibt aber Folgendes an:\n {1} \nDie mutable-Modifizierer sind unterschiedlich.
es: El módulo contiene el campo\n {0} \npero su signatura especifica\n {1} \nLos modificadores 'mutable' difieren.
fr: Le module contient le champ\n {0} \nmais sa signature spécifie\n {1} \nLes modificateurs 'mutable' sont différents
it: Il modulo contiene il campo\n {0} \ntuttavia la relativa firma specifica\n {1} \nI modificatori 'mutable' sono diversi
ja: モジュールにはフィールド\n {0} \nが含まれますが、シグネチャでは\n {1} \nを指定しています。'mutable' 修飾子が異なります。
ko: 모듈에\n {0} 필드가 포함되어 있지만 \n해당 시그니처는\n {1}을(를) 지정합니다. \n'mutable' 한정자가 서로 다릅니다.
pl: Moduł zawiera pole\n {0}, \nale jego sygnatura określa\n {1} \nModyfikatory „mutable” są różne
pt_br: O módulo contém o campo\n {0} \n, mas sua assinatura especifica\n {1} \nOs modificares 'mutable' são diferentes
ru: Модуль содержит поле\n {0} \nоднако его сигнатура задает\n {1} \nМодификаторы "mutable" различаются
tr: Modül\n {0} \nalanını içeriyor ancak imzasında\n {1} \nbelirtiliyor. 'mutable' değiştiricileri farklı
zh_hans: 该模块包含字段\n {0} \n而其签名指定\n {1} \n"mutable" 修饰符不同
zh_hant: 模組包含欄位\n {0} \n但它的簽章卻指定\n {1} \n'mutable' 修飾詞不同

# FieldNotContainedLiteralsDiffer
source: The module contains the field\n {0} \nbut its signature specifies\n {1} \nThe 'literal' modifiers differ
cs: Modul obsahuje pole\n {0}, \nale jeho signatura definuje\n {1}. \nLiší se modifikátory literal.
de: Das Modul enthält das Feld\n {0} \nDie Signatur gibt aber Folgendes an:\n {1} \nDie literal-Modifizierer sind unterschiedlich.
es: El módulo contiene el campo\n {0} \npero su signatura especifica\n {1} \nLos modificadores 'literal' difieren.
fr: Le module contient le champ\n {0} \nmais sa signature spécifie\n {1} \nLes modificateurs 'literal' sont différents
it: Il modulo contiene il campo\n {0} \ntuttavia la relativa firma specifica\n {1} \nI modificatori 'literal' sono diversi
ja: モジュールにはフィールド\n {0} \nが含まれますが、シグネチャでは\n {1} \nを指定しています。'literal' 修飾子が異なります。
ko: 모듈에\n {0} 필드가 포함되어 있지만 \n해당 시그니처는\n {1}을(를) 지정합니다. \n'literal' 한정자가 서로 다릅니다.
pl: Moduł zawiera pole\n {0}, \nale jego sygnatura określa\n {1} \nModyfikatory „literal” są różne
pt_br: O módulo contém o campo\n {0} \n, mas sua assinatura especifica\n {1} \nOs modificadores 'literal' são diferentes
ru: Модуль содержит поле\n {0} \nоднако его сигнатура задает\n {1} \nМодификаторы "literal" различаются
tr: Modül\n {0} \nalanını içeriyor ancak imzasında\n {1} \nbelirtiliyor. 'literal' değiştiricileri farklı
zh_hans: 该模块包含字段\n {0} \n而其签名指定\n {1} \n"literal" 修饰符不同
zh_hant: 模組包含欄位\n {0} \n但它的簽章卻指定\n {1} \n'literal' 修飾詞不同

# FieldNotContainedTypesDiffer
source: The module contains the field\n {0} \nbut its signature specifies\n {1} \nThe types differ
cs: Modul obsahuje pole\n {0}, \nale jeho signatura definuje\n {1}. \nLiší se typy.
de: Das Modul enthält das Feld\n {0} \nDie Signatur gibt aber Folgendes an:\n {1} \nDie Typen sind unterschiedlich.
es: El módulo contiene el campo\n {0} \npero su signatura especifica\n {1} \nLos tipos difieren.
fr: Le module contient le champ\n {0} \nmais sa signature spécifie\n {1} \nLes types sont différents
it: Il modulo contiene il campo\n {0} \ntuttavia la relativa firma specifica\n {1} \nI tipi sono diversi
ko: 모듈에\n {0} 필드가 포함되어 있지만 \n해당 시그니처는\n {1}을(를) 지정합니다. \n형식이 서로 다릅니다.
pl: Moduł zawiera pole\n {0}, \nale jego sygnatura określa\n {1} \nTypy są różne
pt_br: O módulo contém o campo\n {0} \n, mas sua assinatura especifica\n {1} \nOs tipos são diferentes
ru: Модуль содержит поле\n {0} \nоднако его сигнатура задает\n {1} \nТипы различаются
tr: Modül\n {0} \nalanını içeriyor ancak imzasında\n {1} \nbelirtiliyor. Türler farklı
zh_hans: 该模块包含字段\n {0} \n而其签名指定\n {1} \n类型不同
zh_hant: 模組包含欄位\n {0} \n但它的簽章卻指定\n {1} \n類型不同
