Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# etProviderErrorWithContext
source: The type provider '{0}' reported an error in the context of provided type '{1}', member '{2}'. The error: {3}
cs: Zprostředkovatel typu {0} oznámil chybu v kontextu poskytnutého typu {1} a člena {2}: {3}
de: Der Typanbieter '{0}' hat einen Fehler im Kontext des angegebenen Typs '{1}', Member '{2}' gemeldet. Fehler: {3}
es: El proveedor de tipos '{0}' informó de un error en el contexto del tipo '{1}' proporcionado, miembro '{2}'. El error: {3}
fr: Le fournisseur de type '{0}' a signalé une erreur dans le contexte du type fourni '{1}', membre '{2}'. Erreur : {3}
it: Errore segnalato dal provider di tipi '{0}' nel contesto del tipo fornito '{1}', membro '{2}'. Errore: {3}
ja: 型プロバイダー '{0}' が、指定された型 '{1}'、メンバー '{2}' のコンテキストでエラーを報告しました。エラー: {3}
ko: {0}' 형식 공급자가 제공된 형식 '{1}', 멤버 '{2}'의 컨텍스트에서 오류를 보고했습니다. 오류는 {3}입니다.
pl: Dostawca typów „{0}” zgłosił błąd w kontekście udostępnionego typu „{1}”. Element członkowski: „{2}”. Błąd: {3}
pt_br: O provedor de tipos '{0}' relatou um erro no contexto do tipo fornecido '{1}', membro '{2}'. Erro: {3}
ru: Поставщик типов сообщил об ошибке "{0}" в контексте предоставленного типа "{1}", элемент "{2}". Ошибка: {3}
tr: Tür sağlayıcısı '{0}', sağlanan tür '{1}', üye '{2}' bağlamında bir hata bildirdi. Hata: {3}
zh_hans: 类型提供程序“{0}”在所提供类型“{1}”、成员“{2}”的上下文中报告了错误。错误: {3}
zh_hant: 型別提供者 '{0}' 已回報所提供型別 '{1}'，成員 '{2}' 的內容中出現錯誤。錯誤: {3}

# etProvidedTypeWithNameException
source: An exception occurred when accessing the '{0}' of a provided type: {1}
cs: Při přístupu k {0} poskytnutého typu došlo k výjimce: {1}
de: Beim Zugreifen auf '{0}' eines angegebenen Typs ist eine Ausnahme aufgetreten: {1}
es: Se produjo una excepción al obtener acceso al '{0}' de un tipo proporcionado: {1}
fr: Une exception s'est produite lors de l'accès au '{0}' d'un type fourni : {1}
it: Eccezione durante l'accesso all'oggetto '{0}' di un tipo fornito: {1}
ja: 指定された型の '{0}' にアクセスする際に例外が発生しました: {1}
ko: 제공된 형식 {1}의 '{0}'에 액세스하는 동안 예외가 발생했습니다.
pl: Wystąpił wyjątek podczas uzyskiwania dostępu do elementu „{0}” udostępnionego typu: {1}
pt_br: Exceção ao acessar o '{0}' de um tipo fornecido: {1}
ru: Исключение при обращении к "{0}" предоставленного типа: {1}
tr: {1} sağlanan türünün '{0}' öğesine erişirken bir özel durum oluştu
zh_hans: 访问所提供类型的“{0}”时发生异常: {1}
zh_hant: 存取提供之類型的 '{0}' 時發生例外狀況: {1}

# etProvidedTypeWithNullOrEmptyName
source: The '{0}' of a provided type was null or empty.
cs: Název {0} poskytnutého typu má hodnotu null nebo je prázdný.
de: '{0}' eines angegebenen Typs war NULL oder leer.
es: El '{0}' de un tipo proporcionado era NULL o estaba vacío.
fr: Le '{0}' d'un type fourni était Null ou vide.
it: L'oggetto '{0}' di un tipo fornito è Null o vuoto.
ja: 指定された型の '{0}' が null または空でした。
ko: 제공된 형식의 '{0}'이 null이거나 비어 있습니다.
pl: Nazwa „{0}” udostępnionego typu miała wartość null lub była pusta.
pt_br: O '{0}' de um tipo fornecido era nulo ou vazio.
ru: Значение "{0}" предоставленного типа равнялось NULL или было пустым.
tr: Sağlanan türün '{0}' öğesi null veya boştu.
zh_hans: 所提供类型的“{0}”为 null 或为空。
zh_hant: 提供之類型的 '{0}' 為 null 或空白。

# etIllegalCharactersInTypeName
source: Character '{0}' is not allowed in provided type name '{1}'
cs: Znak {0} není v názvu poskytnutého typu {1} povolený.
de: Das Zeichen '{0}' ist im angegebenen Typnamen '{1}' nicht zulässig.
es: No se permite el carácter '{0}' en el nombre de tipo '{1}' proporcionado.
fr: Le caractère '{0}' n'est pas autorisé dans le nom de type fourni '{1}'
it: Il carattere '{0}' non è consentito nel nome del tipo fornito '{1}'
ja: 指定された型名 '{1}' には、文字 '{0}' を使用することはできません
ko: 제공된 형식 이름 '{1}'에는 '{0}' 문자를 사용할 수 없습니다.
pl: Znak „{0}” jest niedozwolony w nazwie udostępnionego typu „{1}”
pt_br: O caractere '{0}' não é permitido no nome de tipo fornecido '{1}'.
ru: Не допускается использовать символ "{0}" в указанном имени типа "{1}"
tr: {1}' sağlanan tür adında '{0}' karakterine izin verilmez
zh_hans: 所提供的类型名称“{1}”中不允许出现字符“{0}”
zh_hant: 提供的類型名稱 '{1}' 中不允許使用字元 '{0}'

# tcJoinMustUseSimplePattern
source: In queries, '{0}' must use a simple pattern
cs: V dotazech musí {0} použít jednoduchý vzor.
de: In Abfragen muss '{0}' ein einfaches Muster verwenden.
es: En las consultas, '{0}' debe usar un patrón simple.
fr: Dans les requêtes, '{0}' doit utiliser un modèle simple
it: Nelle query '{0}' deve essere un modello semplice
ja: クエリ内では、'{0}' は単純なパターンを使用する必要があります
ko: 쿼리에서 '{0}'은(는) 단순 패턴을 사용해야 합니다.
pl: W zapytaniach element „{0}” musi używać prostego wzorca
pt_br: Em consultas, '{0}' deve usar um padrão simples
ru: В запросах для "{0}" следует использовать простой шаблон
tr: Sorgularda, '{0}' basit desen kullanmalıdır
zh_hans: 在查询中，“{0}”必须使用简单模式
zh_hant: 在查詢中，'{0}' 必須使用簡單模式

# tcMissingCustomOperation
source: A custom query operation for '{0}' is required but not specified
cs: Vyžaduje se operace vlastního dotazu pro {0}, která ale není zadaná.
de: Für '{0}' ist ein benutzerdefinierter Abfragevorgang erforderlich, der jedoch nicht angegeben wurde.
es: Se requiere una operación de consulta personalizada para '{0}', pero no se especifica.
fr: Une opération de requête personnalisée pour '{0}' est requise mais non spécifiée
it: Un'operazione di query personalizzata per '{0}' è obbligatoria ma non è stata specificata
ja: '{0}' に対するカスタム クエリ操作が必要ですが、指定されていません
ko: '{0}'에 대한 사용자 지정 쿼리 연산이 필요한데 지정되지 않았습니다.
pl: Wymagana jest niestandardowa operacja zapytania „{0}”, ale jej nie określono
pt_br: Uma consulta de operação personalizada para '{0}' é necessária, mas não foi especificada
ru: Пользовательская операция запроса для "{0}" является обязательной, но не указана
tr: '{0}' için özel bir sorgu işlemi gerekiyor ancak belirtilmemiş
zh_hans: 需要“{0}”的自定义查询运算，但未指定该运算
zh_hant: 需要 '{0}' 的自訂查詢作業，但未指定

# etBadUnnamedStaticArgs
source: Named static arguments must come after all unnamed static arguments
cs: Pojmenované statické argumenty se musí umístit až za všechny nepojmenované statické argumenty.
de: Die benannten statischen Argumente müssen auf alle unbenannten statischen Argumente folgen.
es: Los argumentos estáticos con nombre deben aparecer después de todos los argumentos estáticos sin nombre.
fr: Les arguments statiques nommés doivent suivre tous les arguments statiques non nommés
it: Gli argomenti statici denominati devono seguire tutti gli argomenti statici non denominati
ja: 名前付きの静的引数は、名前のない静的引数の後に置く必要があります
ko: 명명되지 않은 모든 정적 인수 뒤에는 명명된 정적 인수가 와야 합니다.
pl: Nazwane argumenty statyczne muszą następować po wszystkich nienazwanych argumentach statycznych
pt_br: Argumentos estáticos nomeados devem ser colocados após todos os argumentos estáticos não nomeados
ru: Именованные статические аргументы должны располагаться после неименованных статических аргументов
tr: Adlandırılmış statik bağımsız değişkenler, adlandırılmamış statik bağımsız değişkenlerin tümünden sonra gelmelidir
zh_hans: 命名静态参数必须位于所有未命名静态参数之后
zh_hant: 具名靜態引數必須在所有未命名靜態引數的後面

# etStaticParameterRequiresAValue
source: The static parameter '{0}' of the provided type or method '{1}' requires a value. Static parameters to type providers may be optionally specified using named arguments, e.g. '{2}<{3}=...>'.
cs: Statický parametr {0} poskytnutého typu nebo metody {1} vyžaduje hodnotu. Statické parametry pro zprostředkovatele typů je případně možné zadat pomocí pojmenovaných argumentů, třeba {2}<{3}=...>.
de: Der statische Parameter "{0}" vom angegebenen Typ "{1}" erfordert einen Wert. Statische Parameter zu Typanbietern können optional angegeben werden mithilfe von benannten Argumenten, z. b. "{2}<{3}=...>".
es: El parámetro estático "{0}" del tipo o método proporcionado "{1}" requiere un valor. Los parámetros estáticos para los proveedores de tipos pueden especificarse opcionalmente usando argumentos con nombre, por ejemplo, "{2}<{3}=...>".
fr: Le paramètre statique '{0}' de la méthode ou du type fourni '{1}' nécessite une valeur. Les paramètres statiques envoyés aux fournisseurs de type peuvent éventuellement être spécifiés à l'aide d'arguments nommés, par ex. '{2}<{3}=...>'.
it: Il parametro statico '{0}' del tipo o del metodo specificato '{1}' richiede un valore. I parametri statici per i provider di tipi possono essere specificati facoltativamente mediante argomenti denominati, ad esempio '{2}<{3}=...>'.
ja: 指定された型またはメソッド '{1}' の静的パラメーター '{0}' には値が必要です。型プロバイダーへの静的パラメーターは、名前付き引数を使用して任意で指定できます (例: '{2}<{3}=...>')。
ko: 제공된 형식 또는 메서드 '{1}'의 정적 매개 변수 '{0}'에 값이 필요합니다. 명명된 인수(예: '{2}<{3}=...>')를 사용하여 형식 공급자에 대한 정적 매개 변수를 선택적으로 지정할 수 있습니다.
pl: Parametr statyczny „{0}” podanego typu lub podanej metody „{1}” wymaga wartości. Parametry statyczne dostawców typów mogą być opcjonalnie określane przy użyciu argumentów nazwanych, np. „{2}<{3}=...>”.
pt_br: O parâmetro estático '{0}' do tipo ou método fornecido '{1}' exige um valor. Parâmetros estáticos para provedores de tipos podem ser especificados opcionalmente usando argumentos nomeados, ex.: '{2}<{3}=...>'.
ru: Необходимо указать значение статического параметра '{0}' указанного типа или метода '{1}'. Статические параметры для поставщиков типа можно указать с помощью именованных аргументов, например, '{2}<{3}=...>'.
tr: Sağlanan '{1}' türünün veya metodunun '{0}' statik parametresi bir değer gerektirir. İsteğe bağlı olarak, tür sağlayıcılarına yönelik statik parametreler adlandırılmış bağımsız değişkenler kullanılarak belirtilebilir, ör. '{2}<{3}=...>'.
zh_hans: 提供的类型或方法“{1}”的静态参数“{0}”需要一个值。可以选择使用命名参数(例如 "{2}<{3}=...>")指定类型提供程序的静态参数。
zh_hant: 所提供類型的靜態參數 '{0}' 或方法 '{1}' 需要值。您可以使用具名引數，選擇性地指定類型提供者的靜態參數，例如 '{2}<{3}=...>'。

# etNoStaticParameterWithName
source: No static parameter exists with name '{0}'
cs: Neexistuje žádný statický parametr s názvem {0}.
de: Es sind keine statische Parameter mit dem Namen '{0}' vorhanden.
es: No existe ningún parámetro estático con el nombre '{0}'.
fr: Il n'existe aucun paramètre statique nommé '{0}'
it: Non sono presenti parametri statici denominati '{0}'
ja: '{0}' という名前の静的パラメーターがありません
ko: 이름이 '{0}'인 정적 매개 변수가 없습니다.
pl: Nie istnieje parametr statyczny o nazwie „{0}”
pt_br: Não existe um parâmetro estático com o nome '{0}'
ru: Имя "{0}" не имеет статических параметров
tr: '{0}' adında hiç statik parametre yok
zh_hans: 不存在名称为“{0}”的静态参数
zh_hant: 沒有名稱為 '{0}' 的靜態參數

# etStaticParameterAlreadyHasValue
source: The static parameter '{0}' has already been given a value
cs: Statický parametr {0} už hodnotu převzal.
de: Der statische Parameter '{0}' verfügt bereits über einen Wert.
es: Ya se ha asignado un valor al parámetro estático '{0}'.
fr: Une valeur a déjà été attribuée au paramètre statique '{0}'
it: Al parametro statico '{0}' è già stato assegnato un valore
ja: 静的パラメーター '{0}' には既に値が指定されています
ko: 정적 매개 변수 '{0}'에 이미 값이 제공되었습니다.
pl: Została już podana wartość parametru statycznego „{0}”
pt_br: O parâmetro estático '{0}' já recebeu um valor
ru: Для статического параметра "{0}" уже было задано значение
tr: '{0}' statik parametresine zaten bir değer verildi
zh_hans: 已向静态参数“{0}”提供了值
zh_hant: 已經為靜態參數 '{0}' 指定值

# etMultipleStaticParameterWithName
source: Multiple static parameters exist with name '{0}'
cs: Existuje víc statických parametrů s názvem {0}.
de: Es sind mehrere statische Parameter mit dem Namen '{0}' vorhanden.
es: Existen varios parámetros estáticos con el nombre '{0}'.
fr: Il existe plusieurs paramètres statiques nommés '{0}'
it: Esistono più parametri statici con il nome '{0}'
ja: '{0}' という名前の静的パラメーターが複数存在しています
ko: 이름이 '{0}'인 정적 매개 변수가 여러 개 있습니다.
pl: Istnieje wiele parametrów statycznych o nazwie „{0}”
pt_br: Há vários parâmetros estáticos com o nome '{0}'
ru: Имя "{0}" имеет несколько статических параметров
tr: '{0}' adında birden çok statik parametre var
zh_hans: 存在多个名称为“{0}”的静态参数
zh_hant: 有多個名稱為 '{0}' 的靜態參數

# tcCustomOperationMayNotBeUsedInConjunctionWithNonSimpleLetBindings
source: A custom operation may not be used in conjunction with a non-value or recursive 'let' binding in another part of this computation expression
cs: Vlastní operace se nedají použít ve spojení s vazbou let, která je bez hodnoty nebo rekurzivní a nachází se v jiné části tohoto výrazu výpočtu.
de: Ein benutzerdefinierter Vorgang darf in einem anderen Teil dieses Berechnungsausdrucks nicht in Verbindung mit einem Nicht-Wert oder einer rekursiven 'let'-Bindung verwendet werden.
es: Una operación personalizada no se puede usar junto con un enlace 'let' sin valor o recursivo en otra parte de esta expresión de cómputo.
fr: Une opération personnalisée ne peut pas être utilisée en association avec une liaison sans valeur ou 'let' récursive dans une autre partie de cette expression de calcul
it: Non è possibile usare un'operazione personalizzata unitamente a un non valore o a un binding 'let' ricorsivo in un'altra parte di questa espressione di calcolo
ja: このコンピュテーション式の別の部分に値のない束縛または再帰的な 'let' 束縛が含まれている場合、カスタム操作を使用することができません
ko: 사용자 지정 연산은 이 계산 식의 다른 부분에 있는 값이 아니거나 재귀적인 'let' 바인딩과 함께 사용할 수 없습니다.
pl: Operacja niestandardowa nie może być używana razem z powiązaniem „let” bez wartości lub cyklicznym powiązaniem „let” w innej części tego wyrażenia obliczenia
pt_br: Uma operação personalizada não pode ser usada em conjunto com uma vinculação 'let' recursiva ou sem valor em outra parte desta expressão computacional
ru: Пользовательскую операцию нельзя использовать в сочетании c не содержащей значения или рекурсивной привязкой let в другой части этого выражения с вычислениями
tr: Özel işlem, bu hesaplama ifadesinin başka bir kısmında değersiz veya özyinelemeli 'let' bağlaması ile bağlantılı olarak kullanılamaz
zh_hans: 在此计算表达式的其他部分，不能与非值或递归“let”绑定一起使用自定义运算符
zh_hant: 自訂作業不能與這個計算運算式另一部分中的非值或遞迴 'let' 繫結一起使用

# tcCustomOperationMayNotBeUsedHere
source: A custom operation may not be used in conjunction with 'use', 'try/with', 'try/finally', 'if/then/else' or 'match' operators within this computation expression
cs: Vlastní operace se ve spojení s operátory use, try/with, try/finally, if/then/else nebo match v tomto výrazu výpočtu použít nedají.
de: Ein benutzerdefinierter Vorgang darf in diesem Berechnungsausdruck nicht in Verbindung mit den Operatoren 'use', 'try/with', 'try/finally', 'if/then/else' oder 'match' verwendet werden.
es: Una operación personalizada no se puede usar junto con los operadores 'use', 'try/with', 'try/finally', 'if/then/else' o 'match' dentro de esta expresión de cómputo.
fr: Une opération personnalisée ne peut pas être utilisée en association avec les opérateurs 'use', 'try/with', 'try/finally', 'if/then/else' ou 'match' dans cette expression de calcul
it: Un'operazione personalizzata non può essere utilizzata insieme agli operatori 'use', 'try/with', 'try/finally', 'if/then/else' o 'match' all'interno dell'espressione di calcolo corrente
ja: このコンピュテーション式に 'use'、'try/with'、'try/finally'、'if/then/else'、または 'match' 演算子が含まれている場合、カスタム操作を使用することができません
ko: 이 계산 식 내에서 사용자 지정 연산을 'use', 'try/with', 'try/finally', 'if/then/else' or 'match' 연산자와 함께 사용할 수 없습니다.
pl: Operacja niestandardowa nie może być używana razem z operatorem „use”, „try/with”, „try/finally”, „if/then/else” lub „match” w tym wyrażeniu obliczenia
pt_br: Uma operação personalizada não pode ser usada em conjunto com os operadores 'use', 'try/with', 'try/finally', 'if/then/else' ou 'match' nesta expressão computacional
ru: Пользовательскую операцию нельзя использовать в сочетании с операторами use, try/with, try/finally, if/then/else и match в этом выражении с вычислениями
tr: Özel işlem, bu hesaplama ifadesi içinde 'use', 'try/with', 'try/finally', 'if/then/else' veya 'match' işleçleri ile bağlantılı olarak kullanılamaz
zh_hans: 在此计算表达式中，不能与“use”、“try/with”、“try/finally”、“if/then/else”或“match”运算符一起使用自定义运算
zh_hant: 自訂作業不能與這個計算運算式內的 'use'、'try/with'、'try/finally'、'if/then/else' 或 'match' 運算子一起使用

# tcCustomOperationMayNotBeOverloaded
source: The custom operation '{0}' refers to a method which is overloaded. The implementations of custom operations may not be overloaded.
cs: Vlastní operace {0} odkazuje na metodu, která je přetěžovaná. Implementace vlastních operací se nemůžou přetěžovat.
de: Der benutzerdefinierte Vorgang '{0}' bezieht sich auf eine überladene Methode. Die Implementierungen der benutzerdefinierten Vorgänge sind möglicherweise nicht überladen.
es: La operación personalizada '{0}' hace referencia a un método sobrecargado. Las implementaciones de operaciones personalizadas no pueden estar sobrecargadas.
fr: L'opération personnalisée '{0}' fait référence à une méthode surchargée. Les implémentations d'opérations personnalisées ne peuvent pas être surchargées.
it: L'operazione personalizzata '{0}' fa riferimento a un metodo sottoposto a overload. Non è possibile eseguire l'overload delle implementazioni delle operazioni personalizzate.
ja: カスタム操作 '{0}' が、オーバーロードされたメソッドを参照しています。カスタム操作の実装をオーバーロードすることはできません。
ko: 사용자 지정 연산 '{0}'에서 오버로드된 메서드를 참조합니다. 사용자 지정 연산의 구현은 오버로드될 수 없습니다.
pl: Operacja niestandardowa „{0}” odwołuje się do przeciążonej metody. Implementacje operacji niestandardowych nie mogą być przeciążone.
pt_br: A operação personalizada '{0}' refere-se a um método que está sobrecarregado. As implementações das operações personalizadas não podem ser sobrecarregadas.
ru: Пользовательский оператор "{0}" ссылается на перегруженный метод. Нельзя перегружать реализации пользовательских операций.
tr: '{0}' özel işlemi aşırı yüklenmiş bir metoda başvuruyor. Özel işlemlerin uygulamaları aşırı yüklenemez.
zh_hans: 自定义运算“{0}”引用了重载的方法。自定义运算的实现不能进行重载。
zh_hant: 自訂作業 '{0}' 參考的方法已多載。可能無法多載自訂作業的實作。

# tcIfThenElseMayNotBeUsedWithinQueries
source: An if/then/else expression may not be used within queries. Consider using either an if/then expression, or use a sequence expression instead.
cs: Výraz if/then/else se nedá použít v dotazech. Zvažte možnost použít místo toho výraz if/then nebo výraz pořadí.
de: In Abfragen dürfen if/then/else-Ausdrücke nicht verwendet werden. Verwenden Sie stattdessen entweder einen if/then-Ausdruck oder einen Sequenzausdruck.
es: No se puede usar una expresión if/then/else en las consultas. Considere usar una expresión if/then o bien una expresión de secuencia en su lugar.
fr: Les expressions if/then/else ne peuvent pas être utilisées au sein des requêtes. Utilisez soit une expression if/then, soit une expression de séquence.
it: Un'espressione if/then/else non può essere utilizzata nelle query. Provare a utilizzare un'espressione if/then o un'espressione sequenza.
ja: if/then/else 式はクエリ内で使用できません。if/then 式を使用するか、シーケンス式を使用してください。
ko: if/then/else 식은 쿼리 내에서 사용할 수 없습니다. 대신 if/then 식을 사용하거나 시퀀스 식을 사용해 보세요.
pl: Wyrażenie if/then/else nie może być używane w zapytaniach. Zamiast tego rozważ użycie wyrażenia if/then lub wyrażenia sekwencji.
pt_br: Uma expressão if/then/else não pode ser usada em consultas. Considere usar uma expressão if/then ou uma expressão de sequência.
ru: В запросах нельзя использовать выражения if/then/else. Попробуйте использовать выражение if/then или используйте вместо этого выражение последовательности.
tr: Sorgularda if/then/else ifadesi kullanılamaz. Ya if/then ifadesi kullanmayı düşünün ya da onun yerine dizi ifadesi kullanın.
zh_hans: if/then/else 表达式不能在查询中使用。请考虑使用 if/then 表达式，或改用序列表达式。
zh_hant: 不可以在查詢中使用 if/then/else 運算式。請考慮使用 if/then 運算式，或者改用循序項運算式。

# ilxgenUnexpectedArgumentToMethodHandleOfDuringCodegen
source: Invalid argument to 'methodhandleof' during codegen
cs: Neplatný argument pro methodhandleof při generování kódu
de: Ungültiges Argument für 'methodhandleof' bei der Codegenerierung
es: Argumento no válido para 'methodhandleof' durante la generación de código.
fr: Argument non valide passé à 'methodhandleof' pendant la génération du code
it: Argomento non valido in 'methodhandleof' durante codegen
ja: codegen で 'methodhandleof' に無効な引数が渡されました
ko: 코드 생성 중에 'methodhandleof'에 대한 잘못된 인수가 발견되었습니다.
pl: Nieprawidłowy argument dla „methodhandleof” podczas generowania kodu
pt_br: Argumento inválido para 'methodhandleof' durante geração de código
ru: Недопустимый аргумент methodhandleof во время создания кода
tr: Kod oluşturma sırasında geçersiz 'methodhandleof' bağımsız değişkeni
zh_hans: codegen 过程中出现无效“methodhandleof”参数
zh_hant: codegen 期間 'methodhandleof' 的引數無效

# etProvidedTypeReferenceMissingArgument
source: A reference to a provided type was missing a value for the static parameter '{0}'. You may need to recompile one or more referenced assemblies.
cs: U odkazu na poskytnutý typ chybí hodnota pro statický parametr {0}. Možná bude potřeba znovu zkompilovat jedno nebo víc odkazovaných sestavení.
de: Einem Verweis auf einen angegebenen Typ fehlte ein Wert für den statischen Parameter '{0}'. Es müssen möglicherweise eine oder mehrere referenzierte Assemblys erneut kompiliert werden.
es: Una referencia a un tipo proporcionado no contenía un valor para el parámetro estático '{0}'. Puede que sea necesario recompilar uno o varios de los ensamblados a los que se hace referencia.
fr: Il manque une valeur pour le paramètre statique '{0}' dans une référence à un type fourni. Vous devrez peut-être recompiler un ou plusieurs assemblys référencés.
it: In un riferimento a un tipo fornito manca un valore per il parametro statico '{0}'. Potrebbe essere necessario ricompilare uno o più assembly a cui viene fatto riferimento.
ja: 指定された型に対する参照に、静的パラメーター '{0}' に対応する値がありません。1 つ以上の参照アセンブリを再コンパイルする必要がある場合があります。
ko: 제공된 형식에 대한 참조에서 정적 매개 변수 '{0}'의 값이 누락되었습니다. 참조되는 어셈블리를 하나 이상 다시 컴파일해야 할 수 있습니다.
pl: W odwołaniu do udostępnionego typu brakuje wartości parametru statycznego „{0}”. Może być konieczne ponowne skompilowanie co najmniej jednego zestawu, do którego występuje odwołanie.
pt_br: Uma referência para um tipo fornecido não continha um valor para o parâmetro estático '{0}'. Talvez seja necessário recompilar um ou mais assemblies referenciados.
ru: В ссылке на предоставленный тип отсутствовало значение статического параметра "{0}". Может потребоваться перекомпилировать одну или более сборок, на которые указывают ссылки.
tr: Sağlanan türe yapılan başvuruda '{0}' statik parametresinin bir değeri yoktu. Bir veya daha fazla başvurulan bütünleştirilmiş kodu yeniden derlemeniz gerekiyor.
zh_hans: 对所提供类型的引用缺少静态参数“{0}”的值。可能需要重新编译一个或多个引用的程序集。
zh_hant: 提供之類型的參考遺漏靜態參數 '{0}' 的值。您可能需要重新編譯一或多個參考的組件。
