Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# keywordDescriptionEnd
source: In type definitions and type extensions, indicates the end of a section of member definitions. In verbose syntax, used to specify the end of a code block that starts with the begin keyword.
cs: Označuje konec sekce definic členů v definicích typů a rozšířeních typů. V podrobné syntaxi se používá k určení konce bloku kódu, který začíná klíčovým slovem begin.
de: Gibt in Typendefinitionen und Typerweiterungen das Ende eines Abschnitts von Memberdefinitionen an. Wird in ausführlicher Syntax verwendet, um das Ende eines Codeblocks festzulegen, der mit dem Anfangsschlüsselwort beginnt.
es: En las definiciones de tipo y extensiones de tipo, indica el final de una sección de definiciones de miembro. En la sintaxis detallada, se usa para especificar el final de un bloque de código que comienza con la palabra clave begin.
fr: Dans les définitions de type et les extensions de type, indique la fin d'une section de définitions de membre. En syntaxe détaillée, permet de spécifier la fin d'un bloc de code qui commence par le mot clé begin.
it: Nelle definizioni dei tipi e nelle estensioni dei tipi indica la fine di una sezione di definizioni dei membri. Nella sintassi dettagliata viene usata per specificare la fine di un blocco di codice che inizia con la parola chiave begin.
ja: 型定義や型拡張で、メンバー定義セクションの末尾を示します。冗語構文では、begin キーワードで始まるコード ブロックの末尾を示すために使用します。
ko: 형식 정의 및 형식 확장에서 멤버 정의 섹션의 끝을 나타냅니다. 자세한 구문에서 begin 키워드로 시작하는 코드 블록의 끝을 지정하는 데 사용됩니다.
pl: W definicjach typu i rozszerzeniach typu wskazuje koniec sekcji definicji elementów członkowskich. W składni pełnej używane do określania końca bloku kodu rozpoczynającego się słowem kluczowym begin.
pt_br: Em definições e extensões de tipo, indica o final de uma seção de definições de membro. Na sintaxe detalhada, é usado para especificar o final de um bloco de código que começa com a palavra-chave "begin".
ru: В определениях и расширениях типов обозначает окончание раздела определений членов. В подробном синтаксисе используется для указания окончания блока кода, который начинается с ключевого слова begin.
tr: Tür tanımlarında ve tür uzantılarında, üye tanımları bölümünün sonunu gösterir. Ayrıntılı söz diziminde, begin anahtar sözcüğü ile başlayan bir kod bloğunun sonunu belirtmek için kullanılır.
zh_hans: 在类型定义和类型扩展中，表示成员定义的某部分的结尾。在详细语法中，用于指定以 begin 关键字开头的程序块的结尾。
zh_hant: 在類型定義及類型延伸模組中，指出成員定義區段的結尾。在詳細資訊語法中，用以指定開頭為 begin 關鍵字之程式碼區塊的結尾。

# keywordDescriptionException
source: Used to declare an exception type.
cs: Slouží k deklaraci typu výjimky.
de: Wird verwendet, um einen Ausnahmetyp zu deklarieren.
es: Se usa para declarar un tipo de excepción.
fr: Permet de déclarer un type d'exception.
it: Usata per dichiarare un tipo di eccezione.
ja: 例外の種類の宣言に使用します。
ko: 예외 형식을 선언하는 데 사용됩니다.
pl: Używane do deklarowania typu wyjątku.
pt_br: Usado para declarar um tipo de exceção.
ru: Используется для объявления типа исключения.
tr: Bir özel durum türünü bildirmek için kullanılır.
zh_hans: 用于声明异常类型。
zh_hant: 用以宣告例外狀況類型。

# keywordDescriptionExtern
source: Indicates that a declared program element is defined in another binary or assembly.
cs: Označuje, že deklarovaný element programu je definovaný v jiném binárním souboru nebo sestavení.
de: Gibt an, dass ein deklariertes Programmelement in einem anderen Binär oder einer anderen Assembly definiert ist.
es: Indica que un elemento de programa declarado está definido en otro binario o ensamblado.
fr: Indique qu'un élément de programme déclaré est défini dans une autre ressource binaire ou un autre assembly.
it: Indica che un elemento dichiarato del programma è definito in un altro assembly o file binario.
ja: 宣言されたプログラム要素が別のバイナリまたはアセンブリで定義されていることを示します。
ko: 선언된 프로그램 요소가 다른 이진 또는 어셈블리에 정의됨을 나타냅니다.
pl: Wskazuje, że zadeklarowany element programu został zdefiniowany w innym pliku binarnym lub zestawie.
pt_br: Indica que um elemento de programa declarado é definido em outro binário ou assembly.
ru: Указывает, что объявленный элемент программы определяется в другом двоичном файле или сборке.
tr: Bildirilen bir program öğesinin başka bir ikili dosyada veya bütünleştirilmiş kodda tanımlandığını belirtir.
zh_hans: 表示声明的计划元素在其他二进制文件或程序集中定义。
zh_hant: 指出宣告的程式元素已在另一個二進位檔或組件中定義。

# keywordDescriptionTrueFalse
source: Used as a Boolean literal.
cs: Používá se jako logický literál.
de: Wird als boolesches Literal verwendet.
es: Se usa como literal booleano.
fr: Utilisé comme littéral booléen.
it: Usata come valore letterale booleano.
ja: ブール型のリテラルとして使用します。
ko: 부울 리터럴로 사용됩니다.
pl: Używane jako literał wartości logicznej.
pt_br: Usado como um literal Booliano.
ru: Используется в качестве логического литерала.
tr: Boolean sabit değeri olarak kullanılır.
zh_hans: 用作布尔文本
zh_hant: 用作布林值常數。

# keywordDescriptionFinally
source: Used together with try to introduce a block of code that executes regardless of whether an exception occurs.
cs: Používá se společně s try k uvození bloku kódu, který se provede bez ohledu na to, jestli dojde k výjimce.
de: Wird zusammen mit "try" verwendet, um einen Codeblock bereitzustellen, der unabhängig davon ausgeführt wird, ob eine Ausnahme auftritt.
es: Se usa junto con try para incluir un bloque de código que se ejecuta independientemente de que se produzca una excepción.
fr: Utilisé avec try pour introduire un bloc de code qui s'exécute indépendamment de toute exception.
it: Usata insieme a try per introdurre un blocco di codice che viene eseguito indipendentemente dal fatto che si verifichi un'eccezione.
ja: 例外が発生するかどうかに関係なく実行されるコード ブロックを開始するために、try と一緒に使用します。
ko: 예외 발생 여부에 상관없이 실행되는 코드 블록을 지정하기 위해 try와 함께 사용됩니다.
pl: Używane razem ze słowem kluczowym try do wprowadzania bloku kodu, który jest wykonywany bez względu na to, czy wystąpi wyjątek.
pt_br: Usado junto com try para introduzir um bloco de código que é executado independentemente da ocorrência de uma exceção.
ru: Используется вместе с ключевым словом try для введения блока кода, который выполняется независимо от того, возникает ли исключение.
tr: Özel durumun oluşup oluşmadığına bakılmaksızın yürütülen bir kod bloğunu tanıtmak için try ile birlikte kullanılır.
zh_hans: 与 try 配合使用，以引入无论是否发生异常都将执行的代码块。
zh_hant: 當與 with 並用時，可引入無論例外狀況發生與否皆會執行的程式碼區塊。

# keywordDescriptionFor
source: Used in looping constructs.
cs: Používá se v konstruktorech cyklů.
de: Wird in Schleifenkonstrukten verwendet.
es: Se usa en construcciones de bucle.
fr: Utilisé dans les constructions de boucle.
it: Usata in costrutti di ciclo.
ja: ループ コンストラクトで使用します。
ko: 루프 구문에 사용됩니다.
pl: Używane w konstrukcjach zapętlenia.
pt_br: Usado em constructos de looping.
ru: Используется в циклических конструкциях.
tr: Döngü yapılarında kullanılır.
zh_hans: 用于循环构造。
zh_hant: 用於重複的建構。

# keywordDescriptionFun
source: Used in lambda expressions, also known as anonymous functions.
cs: Používá se ve výrazech lambda, známých také pod označením anonymní funkce.
de: Wird in Lambdaausdrücken verwendet, auch als anonyme Funktionen bekannt.
es: Se usa en expresiones lambda, que también se conocen como funciones anónimas.
fr: Utilisé dans les expressions lambda, également appelées fonctions anonymes.
it: Usata nelle espressioni lambda, note anche come funzioni anonime.
ja: ラムダ式で使用し、匿名関数とも呼ばれます。
ko: 익명 함수라고도 하는 람다 식에 사용됩니다.
pl: Używane w wyrażeniach lambda, znane również jako funkcje anonimowe.
pt_br: Usado em expressões lambda, também conhecidas como funções anônimas.
ru: Используется в лямбда-выражениях, также известных как анонимные функции.
tr: Anonim işlevler olarak da bilinen lambda ifadelerinde kullanılır.
zh_hans: 用于 lambda 表达式，也称为异步函数。
zh_hant: 用於 Lambda 運算式，也稱作匿名函式。

# keywordDescriptionFunction
source: Used as a shorter alternative to the fun keyword and a match expression in a lambda expression that has pattern matching on a single argument.
cs: Používá se jako kratší alternativa klíčového slova fun a jako porovnávací výraz ve výrazu lambda s porovnáváním vzoru u jednoho argumentu.
de: Wird als kürzere Alternative zum fun-Schlüsselwort und einen Vergleichsausdruck in einem Lambdaausdruck verwendet, der über Musterabgleich für ein einzelnes Argument verfügt.
es: Se usa como alternativa abreviada a la palabra clave fun y una expresión match en una expresión lambda que tiene coincidencia de patrones en un solo argumento.
fr: Utilisé comme alternative plus courte au mot clé fun et à une expression match dans une expression lambda ayant des critères spéciaux sur un argument unique.
it: Usata come alternativa più breve alla parola chiave fun e a un'espressione match in un'espressione lambda con criteri di ricerca su un singolo argomento.
ja: 単一の引数でパターン マッチングを持つラムダ式で fun キーワードと match 式の代わりに省略形として使用します。
ko: 단일 인수에 패턴 일치가 있는 람다 식에서 fun 키워드 및 일치 식에 대한 간단한 대체로 사용됩니다.
pl: Używane jako krótsza alternatywa słowa kluczowego fun i wyrażenie dopasowania w wyrażeniu lambda, które ma wzorzec pasujący do pojedynczego argumentu.
pt_br: Usado como uma alternativa menor para a palavra-chave "fun" e uma expressão de correspondência em uma expressão lambda que tem correspondência de padrão em um único argumento.
ru: Используется в качестве краткого варианта ключевого слова fun и выражения сопоставления в лямбда-выражении с сопоставлением шаблонов по одному аргументу.
tr: Tek bir bağımsız değişkende desen eşleştirmesine sahip bir lambda ifadesinde fun anahtar sözcüğünün ve match ifadesinin daha kısa bir alternatifi olarak kullanılır.
zh_hans: 用作 fun 关键字的更短替代项以及 lambda 表达式中具有单个参数模式匹配的匹配表达式。
zh_hant: 用作 fun 關鍵字的較短替代項，以及在單一引數有模式比對之 Lambda 運算式中的比對運算式。

# keywordDescriptionGlobal
source: Used to reference the top-level .NET namespace.
cs: Slouží k odkazu na obor názvů .NET na nejvyšší úrovni.
de: Wird verwendet, um auf den .NET-Namespace der obersten Ebene zu verweisen.
es: Se usa para hacer referencia al espacio de nombres .NET de nivel superior.
fr: Permet de référencer l'espace de noms .NET de niveau supérieur.
it: Usata per fare riferimento allo spazio dei nomi .NET di primo livello.
ja: 最上位の .NET 名前空間を参照するために使用します。
ko: 최상위 .NET 네임스페이스를 참조하는 데 사용됩니다.
pl: Używane do tworzenia odwołania do przestrzeni nazw najwyższego poziomu w technologii .NET.
pt_br: Usado para referenciar o namespace .NET de nível superior.
ru: Используется для ссылки на пространство имен .NET верхнего уровня.
tr: En üst düzey .NET ad alanına başvurmak için kullanılır.
zh_hans: 用于引用顶级 .NET 命名空间。
zh_hant: 用以參考頂層 .NET 命名空間。

# keywordDescriptionIf
source: Used in conditional branching constructs.
cs: Používá se v konstruktorech podmíněného větvení.
de: Wird in bedingten Verzweigungskonstrukten verwendet.
es: Se usa en construcciones de creación de ramas condicional.
fr: Utilisé dans les constructions de création de branche conditionnelle.
it: Usata nei costrutti di diramazione condizionale.
ja: 条件分岐のコンストラクトで使用します。
ko: 조건부 분기 구문에 사용됩니다.
pl: Używane w konstrukcjach rozgałęziania warunkowego.
pt_br: Usado em constructos de ramificação condicional.
ru: Используется в конструкциях условного ветвления.
tr: Koşullu dallanma yapılarında kullanılır.
zh_hans: 用于条件性分支构造。
zh_hant: 用於條件式分支建構。

# keywordDescriptionIn
source: Used for sequence expressions and, in verbose syntax, to separate expressions from bindings.
cs: Používá se ve výrazech pořadí a v podrobné syntaxi k oddělení výrazů od vazeb.
de: Wird für Sequenzausdrücke und in ausführlicher Syntax zum Trennen von Ausdrücken aus Bindungen verwendet.
es: Se usa para las expresiones de secuencia y, en la sintaxis detallada, para separar las expresiones de los enlaces.
fr: Utilisé pour les expressions de séquence et, en syntaxe détaillée, pour séparer les expressions des liaisons.
it: Usata per le espressioni di sequenza e, nella sintassi dettagliata, per separare le espressioni dai binding.
ko: 바인딩에서 식을 구분하기 위해 시퀀스 식과 자세한 구문에서 사용됩니다.
pl: Używane na potrzeby wyrażeń sekwencji oraz — w składni pełnej — do oddzielania wyrażeń od powiązań.
pt_br: Usada para expressões de sequência e, na sintaxe detalhada, para separar expressões de ligações.
ru: Используется для выражений последовательностей и (в подробном синтаксисе) для отделения выражений от привязок.
tr: Dizi ifadeleri için ve ayrıntılı söz diziminde ifadeleri bağlamalardan ayırmak için kullanılır.
zh_hans: 用于序列表达式，并且在详细语法中，用于分隔绑定中的表达式。
zh_hant: 用於順序運算式及詳細資料語法中，以從繫結分隔運算式。

# keywordDescriptionInherit
source: Used to specify a base class or base interface.
cs: Slouží k určení základní třídy nebo základního rozhraní.
de: Wird verwendet, um eine Basisklasse oder Basisschnittstelle festzulegen.
es: Se usa para especificar una clase base o una interfaz base.
fr: Permet de spécifier une classe de base ou une interface de base.
it: Usata per specificare una classe di base o un'interfaccia di base.
ja: 基底クラスまたは基底インターフェイスを指定するために使用します。
ko: 기본 클래스 또는 기본 인터페이스를 지정하는 데 사용됩니다.
pl: Używane do określania klasy podstawowej lub interfejsu podstawowego.
pt_br: Usado para especificar uma classe base ou interface base.
ru: Используется для указания базового класса или базового интерфейса.
tr: Temel sınıfı veya temel arabirimi belirtmek için kullanılır.
zh_hans: 用于指定基类或基接口。
zh_hant: 用以指定基底類別或基底介面。

# keywordDescriptionInline
source: Used to indicate a function that should be integrated directly into the caller's code.
cs: Slouží k označení funkce, která se má integrovat přímo do kódu volajícího.
de: Wird verwendet, um eine Funktion anzugeben, die direkt in den Code der aufrufenden Funktion integriert werden soll.
es: Se usa para indicar una función que debe integrarse directamente en el código de llamada.
fr: Permet d'indiquer une fonction qui doit être intégrée directement dans le code de l'appelant.
it: Usata per indicare una funzione che deve essere integrata direttamente nel codice del chiamante.
ja: 呼び出し元のコードに直接統合する必要のある関数を示すために使用します。
ko: 호출자의 코드로 바로 통합되어야 하는 함수를 나타내는 데 사용됩니다.
pl: Używane do wskazywania funkcji, która powinna zostać zintegrowana bezpośrednio z kodem funkcji wywołującej.
pt_br: Usado para indicar a função que deve ser integrada diretamente no código do chamador.
ru: Используется для обозначения функции, которая должна быть интегрирована непосредственно в код вызывающего объекта.
tr: Doğrudan çağıranın koduyla tümleştirilmesi gereken bir işlevi belirtmek için kullanılır.
zh_hans: 用于表示应直接集成到调用方代码中的函数。
zh_hant: 用以指出應直接整合到呼叫者程式碼中的函式。

# keywordDescriptionInterface
source: Used to declare and implement interfaces.
cs: Slouží k deklaraci a implementaci rozhraní.
de: Wird verwendet, um Schnittstellen zu deklarieren und implementieren.
es: Se usa para declarar e implementar interfaces.
fr: Permet de déclarer et d'implémenter des interfaces.
it: Usata per dichiarare e implementare interfacce.
ja: インターフェイスの宣言と実装に使用します。
ko: 인터페이스를 선언하고 구현하는 데 사용됩니다.
pl: Używane do deklarowania i implementowania interfejsów.
pt_br: Usado para declarar e implementar interfaces.
ru: Используется для объявления и реализации интерфейсов.
tr: Arabirimleri bildirmek ve uygulamak için kullanılır.
zh_hans: 用于声明和实现接口。
zh_hant: 用以宣告及實作介面。

# keywordDescriptionInternal
source: Used to specify that a member is visible inside an assembly but not outside it.
cs: Umožňuje určit, že je člen viditelný uvnitř sestavení, ale ne mimo toto sestavení.
de: Wird verwendet, um festzulegen, dass ein Member innerhalb einer Assembly sichtbar ist, außerhalb jedoch nicht.
es: Se usa para especificar que un miembro está visible dentro de un ensamblado pero no fuera de él.
fr: Permet de spécifier qu'un membre est visible dans un assembly mais pas à l'extérieur de celui-ci.
it: Usata per specificare che un membro è visibile all'interno ma non all'esterno di un assembly.
ja: アセンブリの外部では表示されず、内部でのみ表示されるメンバーを指定するために使用します。
ko: 멤버가 어셈블리 안에서는 보이지만 어셈블리 밖에서는 보이지 않도록 지정하는 데 사용됩니다.
pl: Używane do wskazywania, że element członkowski jest widoczny wewnątrz zestawu, ale nie poza nim.
pt_br: Usado para especificar que membro está visível dentro de um assembly, mas não fora dele.
ru: Используется для указания того, что член доступен внутри сборки, но не за ее пределами.
tr: Bir üyenin bütünleştirilmiş kodun içinde görünür olduğunu, dışında ise görünmediğini belirtmek için kullanılır.
zh_hans: 用于指定某成员在程序集内可见，但在程序集外不可见。
zh_hant: 用以指定在組件內可見，但在組件外不可見的成員。

# keywordDescriptionLazy
source: Used to specify a computation that is to be performed only when a result is needed.
cs: Slouží k určení výpočtu, který se má provést jen v případě, kdy je zapotřebí výsledek.
de: Wird verwendet, um eine Berechnung festzulegen, die nur ausgeführt wird, wenn ein Ergebnis erforderlich ist.
es: Se usa para especificar un cálculo que debe realizarse únicamente cuando se necesita un resultado.
fr: Permet de spécifier un calcul à effectuer uniquement quand un résultat est nécessaire.
it: Usata per specificare un calcolo che deve essere eseguito solo quando è necessario un risultato.
ja: 結果が必要な場合にのみ実行するコンピュテーションを指定するために使用します。
ko: 결과가 필요한 경우에만 수행되는 계산을 지정하는 데 사용됩니다.
pl: Używane do określania obliczenia, które ma być wykonywane tylko, jeśli potrzebny jest wynik.
pt_br: Usado para especificar uma computação que deve ser executada somente quando um resultado é necessário.
ru: Используется для указания вычисления, которое должно быть выполнено, только когда требуется результат.
tr: Yalnızca bir sonuç gerekli olduğunda gerçekleştirilecek bir hesaplamayı belirtmek için kullanılır.
zh_hans: 用于指定仅当需要结果时要执行的计算。
zh_hant: 用以指定只會在需要結果時才執行的計算。

# keywordDescriptionLet
source: Used to associate, or bind, a name to a value or function.
cs: Slouží k přidružení (neboli svázání) názvu k hodnotě nebo funkci.
de: Wird verwendet, um einen Namen einem Wert oder einer Funktion zuzuordnen oder daran zu binden.
es: Se usa para asociar o enlazar un nombre a un valor o una función.
fr: Permet d'associer, ou de lier, un nom à une valeur ou une fonction.
it: Usata per associare o eseguire il binding di un nome a un valore o a una funzione.
ja: 値または関数への名前の関連付けまたはバインドに使用します。
ko: 값 또는 함수에 이름을 연결하거나 바인딩하기 위해 사용됩니다.
pl: Używane do kojarzenia lub powiązywania nazwy z wartością lub funkcją.
pt_br: Usado para associar um nome para uma função ou valor.
ru: Используется для связывания (или привязки) имени со значением или функцией.
tr: Adı bir değer veya işlevle ilişkilendirmek ya da bağlamak için kullanılır.
zh_hans: 用于将名称关联或绑定到值或函数。
zh_hant: 用以對值或函式建立名稱的關聯或繫結。

# keywordDescriptionLetBang
source: Used in computation expressions to bind a name to the result of another computation expression.
cs: Používá se ve výrazech výpočtu k navázání názvu na výsledek jiného výrazu výpočtu.
de: Wird in Berechnungsausdrücken verwendet, um einen Namen an das Ergebnis eines anderen Berechnungsausdrucks zu binden.
es: Utilizado en expresiones de cálculo para enlazar un nombre al resultado de otra expresión de cálculo.
fr: Utilisé dans les expressions de calcul pour lier un nom au résultat d'une autre expression de calcul.
it: Usata nelle espressioni di calcolo per associare un nome al risultato di un'altra espressione di calcolo.
ja: 計算式で別の計算式の結果に名前をバインドするために使用されます。
ko: 계산 식에 사용되어 다른 계산 식 결과에 이름을 바인딩합니다.
pl: Używane w wyrażeniach obliczeń, aby powiązać nazwę z wynikiem innego wyrażenia obliczenia.
pt_br: Usado em expressões de computação para associar um nome ao resultado de outra expressão de computação.
ru: Используется в вычислительных выражениях для привязки имени к результату другого вычислительного выражения.
tr: Hesaplama ifadelerinde bir adın başka bir hesaplama ifadesinin sonucuna bağlanması için kullanılır.
zh_hans: 用于在计算表达式中将名称绑定到另一计算表达式的结果。
zh_hant: 在計算運算式中用來將名稱繫結到另一個計算運算式的結果。

# keywordDescriptionMatch
source: Used to branch by comparing a value to a pattern.
cs: Používá se k větvení porovnáním hodnoty s určitým vzorem.
de: Wird zum Verzweigen verwendet, indem ein Wert mit einem Muster verglichen wird.
es: Se usa para crear una rama mediante la comparación de un valor con un patrón.
fr: Permet de créer une branche en comparant une valeur à un modèle.
it: Usata per creare un ramo confrontando un valore con un criterio.
ja: 値をパターンと比較して分岐するために使用します。
ko: 패턴에 대한 값을 비교하여 분기하는 데 사용됩니다.
pl: Używane do rozgałęziania przez porównanie wartości z wzorcem.
pt_br: Usado para ramificar ao comparar um valor a um padrão.
ru: Используется для ветвления путем сравнения значения с шаблоном.
tr: Değeri bir desenle karşılaştırarak dal oluşturmak için kullanılır.
zh_hans: 用于通过比较值与模式来进行分支。
zh_hant: 用以對模式比較值，以進行分支。

# keywordDescriptionMember
source: Used to declare a property or method in an object type.
cs: Slouží k deklaraci vlastnosti nebo metody v objektovém typu.
de: Wird verwendet, um eine Eigenschaft oder Methode in einem Objekttypen zu deklarieren.
es: Se usa para declarar una propiedad o un método en un tipo de objeto.
fr: Permet de déclarer une propriété ou une méthode dans un type d'objet.
it: Usata per dichiarare una proprietà o un metodo in un tipo di oggetto.
ja: オブジェクトの種類のプロパティまたはメソッドの宣言に使用します。
ko: 개체 형식에서 속성 또는 메서드를 선언하는 데 사용됩니다.
pl: Używane do deklarowania właściwości lub metody w typie obiektu.
pt_br: Usado para declarar uma propriedade ou método em um tipo de objeto.
ru: Используется для объявления свойства или метода в типе объекта.
tr: Bir nesne türü içinde özellik veya metot bildirmek için kullanılır.
zh_hans: 用于声明对象类型中的属性或方法。
zh_hant: 用以宣告物件類型中的屬性或方法。

# keywordDescriptionModule
source: Used to associate a name with a group of related types, values, and functions, to logically separate it from other code.
cs: Slouží k přidružení názvu ke skupině souvisejících typů, hodnot a funkcí a jeho logickému oddělení od jiného kódu.
de: Wird verwendet, um einen Namen einer Gruppe zugehöriger Typen, Werte und Funktionen zuzuordnen, um ihn logisch von anderem Code zu trennen.
es: Se usa para asociar un nombre a un grupo de tipos, valores y funciones relacionados, a fin de separarlo de forma lógica del resto del código.
fr: Permet d'associer un nom à un groupe de types, valeurs et fonctions connexes, pour le séparer de manière logique du reste du code.
it: Usata per associare un nome a un gruppo di valori, funzioni e tipi correlati allo scopo di separare il gruppo in modo logico da altro codice.
ja: 関連する型、値、関数のグループに名前を関連付け、その他のコードと論理的に分離するために使用します。
ko: 관련 형식, 값 및 함수 그룹과 이름을 연결하기 위해 사용되며, 다른 코드와 논리적으로 구별하기 위해 사용됩니다.
pl: Używane do kojarzenia nazwy z grupą powiązanych typów, wartości i funkcji w celu jej logicznego oddzielenia od innego kodu.
pt_br: Usado para associar um nome com um grupo de tipos, valores e funções relacionados para separá-lo de outro código.
ru: Используется для связывания имени с группой соответствующих типов, значений и функций для логического отделения их от других частей кода.
tr: Bir adı diğer kodlardan mantıksal olarak ayırmak amacıyla, birbiriyle ilişkili bir tür, değer ve işlev grubuyla ilişkilendirmek için kullanılır.
zh_hans: 用于将名称与一组相关类型、值和函数关联，从逻辑上将其与其他代码分开。
zh_hant: 用以在名稱與相關類型、值及函式的群組之間建立關聯，以邏輯方式從其他程式碼分隔出名稱。

# keywordDescriptionMutable
source: Used to declare a variable, that is, a value that can be changed.
cs: Slouží k deklaraci proměnné, což je hodnota, která se může měnit.
de: Wird verwendet, um eine Variable zu deklarieren, d. h. einen veränderlichen Wert.
es: Se usa para declarar una variable, es decir, un valor que se puede cambiar.
fr: Permet de déclarer une variable, c'est-à-dire une valeur qui peut être modifiée.
it: Usata per dichiarare una variabile, ovvero un valore che può essere modificato.
ja: 変更可能な値である変数の宣言に使用します。
ko: 변경될 수 있는 값인 변수를 선언하는 데 사용됩니다.
pl: Używane do deklarowania zmiennej, czyli wartości, która może się zmienić.
pt_br: Usado para declarar uma variável, ou seja, um valor que pode ser alterado.
ru: Используется для объявления переменной, то есть значения, которое может быть изменено.
tr: Bir değişkeni, başka bir deyişle değiştirilebilir bir değeri bildirmek için kullanılır.
zh_hans: 用于声明变量，即可更改的值。
zh_hant: 用以宣告變數，亦即可變更的值。
