Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ValueNotContainedMutabilityOneIsConstructor
source: Module '{0}' contains\n {1} \nbut its signature specifies\n {2} \nOne is a constructor/property and the other is not
cs: Modul {0} obsahuje hodnotu\n {1}, \nale jeho signatura definuje hodnotu\n {2}. \nJedna je konstruktorem nebo vlastností a druhá ne.
de: Das Modul "{0}" enthält\n {1} \nDie Signatur gibt aber Folgendes an:\n {2} \nEine Angabe ist ein Konstruktor bzw. eine Eigenschaft, die andere nicht.
es: El módulo '{0}' contiene\n {1} \npero su signatura especifica\n {2} \nUno es un constructor o propiedad y el otro no.
fr: Le module '{0}' contient\n {1} \nmais sa signature spécifie\n {2} \nL'un est un constructeur/une propriété mais pas l'autre
it: Il modulo '{0}' contiene\n {1} \nma la relativa firma specifica\n {2} \nUno è un costruttore o una proprietà, l'altro no
ja: モジュール '{0}' には\n {1} \nが含まれますが、シグネチャには\n {2} \nを指定しています。一方はコンストラクター/プロパティですが、もう一方は違います。
ko: {0}' 모듈에\n {1}이(가) 포함되어 있지만 \n해당 시그니처는\n {2}을(를) 지정합니다. \n하나는 생성자/속성이고 다른 하나는 그렇지 않습니다.
pl: Moduł „{0}” zawiera element\n {1}, \nale jego sygnatura określa element\n {2} \nJeden element jest konstruktorem/właściwością, a drugi nie
pt_br: O módulo '{0}' contém\n {1} \n, mas sua assinatura especifica\n {2} \nUm é construtor/propriedade e o outro não
ru: Модуль "{0}" содержит\n {1} \nоднако его сигнатура задает\n {2} \nОдин является конструктором или свойством, другой - нет
tr: {0}' modülü\n {1} \niçeriyor ancak imzasında\n {2} \nbelirtiliyor. Biri oluşturucu/özellik, diğeri değil
zh_hans: 模块“{0}”包含\n {1} \n而其签名指定\n {2} \n一个是构造函数/属性，另一个不是构造函数/属性
zh_hant: 模組 '{0}' 包含\n {1} \n但它的簽章卻指定\n {2} \n其中一個是建構函式/屬性，另一個卻不是

# ValueNotContainedMutabilityStaticButInstance
source: Module '{0}' contains\n {1} \nbut its signature specifies\n {2} \nThe compiled representation of this method is as a static member but the signature indicates its compiled representation is as an instance member
cs: Modul {0} obsahuje hodnotu\n {1}, \nale jeho signatura definuje hodnotu\n {2}. \nZkompilovaná reprezentace této metody je statickým členem, ale signatura určuje její zkompilovanou reprezentaci jako člena instance.
de: Das Modul "{0}" enthält\n {1} \nDie Signatur gibt aber Folgendes an:\n {2} \nDie kompilierte Darstellung dieser Methode ist ein statischer Member, laut Signatur ist sie aber eine kompilierte Darstellung als Instanzmember.
es: El módulo '{0}' contiene\n {1} \npero su signatura especifica\n {2} \nLa representación compilada de este método es como un miembro estático, pero la signatura indica que su representación compilada es como un miembro de instancia.
fr: Le module '{0}' contient\n {1} \nmais sa signature spécifie\n {2} \nLa représentation compilée de cette méthode est celle d'un membre statique, mais la signature indique que sa représentation compilée est celle d'un membre d'instance
it: Il modulo '{0}' contiene\n {1} \ntuttavia la relativa firma specifica\n {2} \nLa rappresentazione compilata di questo metodo è un membro statico, tuttavia la firma indica che essa è un membro di istanza
ja: モジュール '{0}' には\n {1} \nが含まれますが、シグネチャには\n {2} \nを指定しています。このメソッドのコンパイル済み表現は静的メンバーとして指定されていますが、シグネチャが示すコンパイル済み表現はインスタンス メンバーです。
ko: {0}' 모듈에\n {1}이(가) 포함되어 있지만 \n해당 시그니처는\n {2}을(를) 지정합니다. \n이 메서드의 컴파일 표현이 정적 멤버이지만 시그니처는 해당 컴파일 표현이 인스턴스 멤버임을 나타냅니다.
pl: Moduł „{0}” zawiera element\n {1}, \nale jego sygnatura określa element\n {2} \nReprezentacja skompilowana tej metody ma postać statycznego elementu członkowskiego, ale sygnatura wskazuje, że jego reprezentacja skompilowana ma postać elementu członkowskiego wystąpienia
pt_br: O módulo '{0}' contém\n {1} \n, mas sua assinatura especifica\n {2} \nA representação compilada deste método é como um membro estático, mas a assinatura indica que sua representação compilada seria como um membro de instância
ru: Модуль "{0}" содержит\n {1} \nоднако его сигнатура задает\n {2} \nОткомпилированное представление этого метода является статическим элементом, однако его сигнатура указывает, что его откомпилированное представление является экземплярным элементом
tr: {0}' modülü\n {1} \niçeriyor ancak imzasında\n {2} \nbelirtiliyor. Bu metodun derlenen temsili statik üye olarak gösteriliyor ancak imzada derlenmiş gösterim örnek üye olarak belirtiliyor
zh_hans: 模块“{0}”包含\n {1} \n而其签名指定\n {2} \n此方法的已编译表示形式作为一个静态成员，而签名指示其已编译表示形式作为一个实例成员
zh_hant: 模組 '{0}' 包含\n {1} \n但它的簽章卻指定\n {2} \n這個方法的編譯表示是做為靜態成員，但簽章卻指示它的編譯表示是做為執行個體成員

# ValueNotContainedMutabilityInstanceButStatic
source: Module '{0}' contains\n {1} \nbut its signature specifies\n {2} \nThe compiled representation of this method is as an instance member, but the signature indicates its compiled representation is as a static member
cs: Modul {0} obsahuje hodnotu\n {1}, \nale jeho signatura definuje hodnotu\n {2}. \nZkompilovaná reprezentace této metody je členem instance, ale signatura určuje její zkompilovanou reprezentaci jako statického člena.
de: Das Modul "{0}" enthält\n {1} \nDie Signatur gibt aber Folgendes an:\n {2} \nDie kompilierte Darstellung dieser Methode ist ein Instanzmember, laut Signatur ist sie aber eine kompilierte Darstellung als statischer Member.
es: El módulo '{0}' contiene\n {1} \npero su signatura especifica\n {2} \nLa representación compilada de este método es como un miembro de instancia, pero la signatura indica que su representación compilada es como un miembro estático.
fr: Le module '{0}' contient\n {1} \nmais sa signature spécifie\n {2} \nLa représentation compilée de cette méthode est celle d'un membre d'instance, mais la signature indique que sa représentation compilée est celle d'un membre statique
it: Il modulo '{0}' contiene\n {1} \ntuttavia la relativa firma specifica\n {2} \nLa rappresentazione compilata di questo metodo è un membro di istanza, tuttavia la firma indica che essa è un membro statico
ja: モジュール '{0}' には\n {1} \nが含まれますが、シグネチャには\n {2} \nを指定しています。このメソッドのコンパイル済み表現はインスタンス メンバーとして指定されていますが、シグネチャが示すコンパイル済み表現は静的メンバーです。
ko: {0}' 모듈에\n {1}이(가) 포함되어 있지만 \n해당 시그니처는\n {2}을(를) 지정합니다. \n이 메서드의 컴파일 표현이 인스턴스 멤버이지만 시그니처는 해당 컴파일 표현이 정적 멤버임을 나타냅니다.
pl: Moduł „{0}” zawiera element\n {1}, \nale jego sygnatura określa element\n {2} \nReprezentacja skompilowana tej metody ma postać elementu członkowskiego wystąpienia, ale sygnatura wskazuje, że jego reprezentacja skompilowana ma postać statycznego elementu członkowskiego
pt_br: O módulo '{0}' contém\n {1} \n, mas sua assinatura especifica\n {2} \nA representação compilada deste método é como um membro de instância, mas a assinatura indica que sua representação compilada seria como um membro estático
ru: Модуль "{0}" содержит\n {1} \nоднако его сигнатура задает\n {2} \nОткомпилированное представление этого метода является экземплярным элементом, однако его сигнатура указывает, что его откомпилированное представление является статическим элементом
tr: {0}' modülü\n {1} \niçeriyor ancak imzasında\n {2} \nbelirtiliyor. Bu metodun derlenen gösterimi örnek üye olarak verilmiş, ancak imzada derlenen gösterim statik üye olarak belirtiliyor
zh_hans: 模块“{0}”包含\n {1} \n而其签名指定\n {2} \n此方法的已编译表示形式作为一个实例成员，而签名指示其已编译表示形式作为一个静态成员
zh_hant: 模組 '{0}' 包含\n {1} \n但它的簽章卻指定\n {2} \n這個方法的編譯表示是做為執行個體成員，但簽章卻指示它的編譯表示是做為靜態成員

# DefinitionsInSigAndImplNotCompatibleNamesDiffer
source: The {0} definitions in the signature and implementation are not compatible because the names differ. The type is called '{1}' in the signature file but '{2}' in implementation.
cs: Definice {0} v signatuře a implementaci nejsou kompatibilní, protože se liší názvy. Typ se v souboru signatury nazývá {1}, ale v implementaci se nazývá {2}.
de: Die {0} Definitionen in der Signatur und in der Implementierung sind nicht kompatibel, weil die Namen unterschiedlich sind. Der Typ heißt "{1}" in der Signaturdatei, aber "{2}" in der Implementierung.
es: Las definiciones de {0} en la signatura y la implementación no son compatibles porque los nombres son diferentes. El tipo se denomina "{1}" en el archivo de la signatura pero "{2}" en la implementación.
fr: Les {0} définitions dans la signature et l'implémentation ne sont pas compatibles, car les noms sont différents. Le type est appelé '{1}' dans le fichier de signature et '{2}' dans l'implémentation.
it: Le definizioni di {0} nella firma e nell'implementazione non sono compatibili perché i nomi sono diversi. Il nome del tipo è '{1}' nel file della firma e '{2}' nell'implementazione.
ja: シグネチャおよび実装内の {0} 定義は、名前が異なるため、互換性がありません。この型はシグネチャ ファイルでは '{1}' という名前ですが、実装では '{2}' という名前です。
ko: 이름이 서로 다르므로 시그니처 및 구현의 {0} 정의가 호환되지 않습니다. 시그니처 파일의 형식은 '{1}'이지만 구현의 형식은 '{2}'입니다.
pl: Definicje {0} w sygnaturze i implementacji są niezgodne, ponieważ nazwy są różne. Typ w pliku sygnatury ma nazwę „{1}”, a w implementacji „{2}”.
pt_br: As definições {0} na assinatura e implementação não são compatíveis, pois os nomes são diferentes. O tipo é chamado de '{1}' no arquivo de assinatura, mas de '{2}' na implementação.
ru: Определения {0} в сигнатуре и реализации несовместимы, так как названия различаются. Название типа — "{1}" в файле сигнатуры, но "{2}" в реализации.
tr: Adları farklı olduğundan, imza ve uygulamadaki {0} tanımları uyumlu değil. Türün adı, imzada '{1}' olmasına rağmen uygulamada '{2}'.
zh_hans: 签名和实现中的 {0} 定义不兼容，因为名称不同。该类型在签名文件中称为“{1}”，但在实现中称为“{2}”。
zh_hant: 簽章與名稱的 {0} 定義不相容，因為名稱不同。類型在簽名檔稱為 '{1}'，但在實作稱為 '{2}'。

# DefinitionsInSigAndImplNotCompatibleParameterCountsDiffer
source: The {0} definitions for type '{1}' in the signature and implementation are not compatible because the respective type parameter counts differ
cs: Definice {0} pro typ {1} v signatuře a implementaci nejsou kompatibilní, protože se liší odpovídajícím počtem parametrů typu.
de: Die {0} Definitionen für den Typ "{1}" in der Signatur und in der Implementierung sind nicht kompatibel, weil die Anzahl der entsprechenden Typparameter unterschiedlich ist.
es: Las definiciones de {0} para el tipo "{1}" en la signatura y la implementación no son compatibles porque los recuentos de parámetros de tipo respectivos difieren
fr: Les {0} définitions pour le type '{1}' dans la signature et l'implémentation ne sont pas compatibles, car le nombre de paramètres de type respectifs est différent
it: Le definizioni di {0} per il tipo '{1}' nella firma e nell'implementazione non sono compatibili perché i rispettivi conteggi dei parametri di tipo sono diversi
ja: 型パラメーターの数が異なるため、シグネチャおよび実装内の型 '{1}' の {0} 定義は互換性がありません
ko: 각각의 형식 매개 변수 수가 서로 다르므로 시그니처 및 구현의 '{1}' 형식에 대한 {0} 정의가 호환되지 않습니다.
pl: Definicje {0} dla typu „{1}” w sygnaturze i implementacji są niezgodne, ponieważ odpowiednie liczby parametrów typu są różne
pt_br: As definições {0} para o tipo '{1}' na assinatura e implementação não são compatíveis, pois as respectivas contagens de parâmetro de tipo são diferentes
ru: Определения {0} для типа "{1}" в сигнатуре и реализации несовместимы, так как соответствующие количества параметров типов различаются.
tr: İlgili tür parametresi sayıları farklı olduğundan, imza ve uygulamadaki '{1}' türü için {0} tanımları uyumlu değil
zh_hans: 签名和实现中类型“{1}”的 {0} 定义不兼容，因为各自的类型参数计数不同
zh_hant: 簽章與實作中類型 '{1}' 的 {0} 定義不相容，因為個別的型別參數計數不同

# DefinitionsInSigAndImplNotCompatibleAccessibilityDiffer
source: The {0} definitions for type '{1}' in the signature and implementation are not compatible because the accessibility specified in the signature is more than that specified in the implementation
cs: Definice {0} pro typ {1} v signatuře a implementaci nejsou kompatibilní, protože dostupnost zadaná v signatuře přesahuje dostupnost zadanou v implementaci.
de: Die {0} Definitionen für den Typ "{1}" in der Signatur und in der Implementierung sind nicht kompatibel, weil in der Signatur eine höhere Zugreifbarkeit angegeben ist als in der Implementierung.
es: Las definiciones de {0} para el tipo "{1}" en la signatura y la implementación no son compatibles porque la accesibilidad especificada en la signatura es superior a la especificada en la implementación
fr: Les {0} définitions pour le type '{1}' dans la signature et l'implémentation ne sont pas compatibles, car l'accessibilité spécifiée dans la signature est supérieure à celle spécifiée dans l'implémentation
it: Le definizioni di {0} per il tipo '{1}' nella firma e nell'implementazione non sono compatibili perché l'accessibilità specificata nella firma è maggiore rispetto a quella specificata nell'implementazione
ja: シグネチャに指定されたアクセシビリティが実装の指定よりも高いため、シグネチャおよび実装内の型 '{1}' の {0} 定義は互換性がありません
ko: 시그니처에 지정된 액세스 가능성이 구현에 지정된 액세스 가능성보다 높으므로 시그니처 및 구현의 '{1}' 형식에 대한 {0} 정의가 호환되지 않습니다.
pl: Definicje {0} dla typu „{1}” w sygnaturze i implementacji są niezgodne, ponieważ dostępność określona w sygnaturze jest większa od określonej w implementacji
pt_br: As definições {0} para o tipo '{1}' na assinatura e implementação não são compatíveis, pois a acessibilidade especificada na assinatura é maior que a especificada na implementação
ru: Определения {0} для типа "{1}" в сигнатуре и реализации несовместимы, так как доступность, заданная в сигнатуре, шире указанной в реализации.
tr: İmzada belirtilen erişilebilirlik uygulamada belirtilenden daha fazla olduğundan, imza ve uygulamadaki '{1}' türü için {0} tanımları uyumlu değil
zh_hans: 签名和实现中类型“{1}”的 {0} 定义不兼容，因为签名中指定的辅助功能比实现中指定的辅助功能多
zh_hant: 簽章與實作中類型 '{1}' 的 {0} 定義不相容，因為簽章中指定的存取範圍大於實作中指定的存取範圍

# DefinitionsInSigAndImplNotCompatibleMissingInterface
source: The {0} definitions for type '{1}' in the signature and implementation are not compatible because the signature requires that the type supports the interface {2} but the interface has not been implemented
cs: Definice {0} pro typ {1} v signatuře a implementaci nejsou kompatibilní, protože signatura vyžaduje, aby typ podporoval rozhraní {2}, které se ale neimplementovalo.
de: Die {0} Definitionen für den Typ "{1}" in der Signatur und in der Implementierung sind nicht kompatibel, weil die Signatur erfordert, dass der Typ die {2}-Schnittstelle unterstützt; diese Schnittstelle ist aber nicht implementiert.
es: Las definiciones de {0} para el tipo "{1}" en la signatura y la implementación no son compatibles porque la signatura requiere que el tipo admita la interfaz {2}, pero esta interfaz no se ha implementado
fr: Les {0} définitions pour le type '{1}' dans la signature et l'implémentation ne sont pas compatibles, car la signature requiert que le type prenne en charge l'interface {2} mais l'interface n'a pas été implémentée
it: Le definizioni di {0} per il tipo '{1}' nella firma e nell'implementazione non sono compatibili perché la firma richiede che il tipo supporti l'interfaccia {2}, ma quest'ultima non è stata implementata
ja: シグネチャでは型がインターフェイス {2} をサポートする必要がありますが、インターフェイスが実装されていないため、シグネチャおよび実装内の型 '{1}' の {0} 定義は互換性がありません
ko: 시그니처를 사용하려면 형식이 {2} 인터페이스를 지원해야 하지만 이 인터페이스가 구현되지 않았으므로 시그니처 및 구현의 '{1}' 형식에 대한 {0} 정의가 호환되지 않습니다.
pl: Definicje {0} dla typu „{1}” w sygnaturze i implementacji są niezgodne, ponieważ sygnatura wymaga, aby typ obsługiwał interfejs {2}, ale interfejs nie został zaimplementowany
pt_br: As definições {0} para o tipo '{1}' na assinatura e implementação não são compatíveis, pois a assinatura requer que o tipo dê suporte a interface {2}, mas esta não foi implementada
ru: Определения {0} для типа "{1}" в сигнатуре и реализации несовместимы, так как в сигнатуре указано, что тип поддерживает интерфейс {2}, который не реализован.
tr: İmzanın, türün {2} arabirimini desteklemesini gerektirmesine rağmen arabirim uygulanmadığından, imza ve uygulamadaki '{1}' türü için {0} tanımları uyumlu değil
zh_hans: 签名和实现中类型“{1}”的 {0} 定义不兼容，因为签名要求此类型支持接口 {2}，而该接口尚未实现
zh_hant: 簽章與實作中類型 '{1}' 的 {0} 定義不相容，因為簽章要求類型必須支援介面 {2}，但這個介面尚未實作

# DefinitionsInSigAndImplNotCompatibleImplementationSaysNull
source: The {0} definitions for type '{1}' in the signature and implementation are not compatible because the implementation says this type may use nulls as a representation but the signature does not
cs: Definice {0} pro typ {1} v signatuře a implementaci nejsou kompatibilní, protože implementace uvádí, že tento typ může jako reprezentaci používat null, ale signatura to neuvádí.
de: Die {0} Definitionen für den Typ "{1}" in der Signatur und in der Implementierung sind nicht kompatibel, weil dieser Typ laut Implementierung NULL als Darstellung verwenden darf, laut Signatur aber nicht.
es: Las definiciones de {0} para el tipo "{1}" en la signatura y la implementación no son compatibles porque la implementación indica que este tipo puede usar valores NULL como una representación pero la signatura no
fr: Les {0} définitions pour le type '{1}' dans la signature et l'implémentation ne sont pas compatibles, car l'implémentation indique que ce type peut utiliser des valeurs Null comme représentation, contrairement à la signature
it: Le definizioni di {0} per il tipo '{1}' nella firma e nell'implementazione non sono compatibili perché in base all'implementazione questo tipo e non la firma può usare come rappresentazione valori Null
ja: 実装では表現としてこの型に null を使用できると指定していますが、シグネチャは指定していないため、シグネチャおよび実装内の型 '{1}' の {0} 定義は互換性がありません
ko: 구현이 이 형식에서 null을 표현으로 사용할 수 있다고 하지만 시그니처는 그렇지 않으므로 시그니처 및 구현의 '{1}' 형식에 대한 {0} 정의가 호환되지 않습니다.
pl: Definicje {0} dla typu „{1}” w sygnaturze i implementacji są niezgodne, ponieważ implementacja wskazuje, że ten typ może używać wartości null jako reprezentacji, ale sygnatura tego nie wskazuje
pt_br: As definições {0} para o tipo '{1}' na assinatura e implementação não são compatíveis, pois a implementação diz que este tipo pode usar nulos como uma representação, mas a assinatura não
ru: Определения {0} для типа "{1}" в сигнатуре и реализации несовместимы, так как реализация (в отличие от сигнатуры) определяет, что этот тип может использовать значение NULL в качестве представления.
tr: Uygulamada bu türün temsil olarak null değerleri kullanabileceği belirtilmesine rağmen imzada bu belirtmediğinden, imza ve uygulamadaki '{1}' türü için {0} tanımları uyumlu değil
zh_hans: 签名和实现中类型“{1}”的 {0} 定义不兼容，因为实现指明此类型可以使用 null 作为表示形式，而签名未指明这一点
zh_hant: 簽章與實作中類型 '{1}' 的 {0} 定義不相容，因為實作宣稱這個類型可以使用 null 作為表示法，但簽章未宣稱

# DefinitionsInSigAndImplNotCompatibleImplementationSaysNull2
source: The {0} definitions for type '{1}' in the signature and implementation are not compatible because the implementation says this type may use nulls as an extra value but the signature does not
cs: Definice {0} pro typ {1} v signatuře a implementaci nejsou kompatibilní, protože implementace uvádí, že tento typ může jako hodnotu navíc používat null, ale signatura to neuvádí.
de: Die {0} Definitionen für den Typ "{1}" in der Signatur und in der Implementierung sind nicht kompatibel, weil dieser Typ laut Implementierung NULL als zusätzlichen Wert verwenden darf, laut Signatur aber nicht.
es: Las definiciones de {0} para el tipo "{1}" en la signatura y la implementación no son compatibles porque la implementación indica que este tipo puede usar valores NULL como un valor extra pero la signatura no
fr: Les {0} définitions pour le type '{1}' dans la signature et l'implémentation ne sont pas compatibles, car l'implémentation indique que ce type peut utiliser des valeurs Null comme valeurs supplémentaires, contrairement à la signature
it: Le definizioni di {0} per il tipo '{1}' nella firma e nell'implementazione non sono compatibili perché in base all'implementazione questo tipo e non la firma può usare come valore aggiuntivo valori Null
ja: 実装では特別な値としてこの型に null を使用できると指定していますが、シグネチャは指定していないため、シグネチャおよび実装内の型 '{1}' の {0} 定義は互換性がありません
ko: 구현이 이 형식에서 null을 추가 값으로 사용할 수 있다고 하지만 시그니처는 그렇지 않으므로 시그니처 및 구현의 '{1}' 형식에 대한 {0} 정의가 호환되지 않습니다.
pl: Definicje {0} dla typu „{1}” w sygnaturze i implementacji są niezgodne, ponieważ implementacja wskazuje, że ten typ może używać wartości null jako dodatkowej wartości, ale sygnatura tego nie wskazuje
pt_br: As definições {0} para o tipo '{1}' na assinatura e implementação não são compatíveis, pois a implementação diz que este tipo pode usar nulos como um valor adicional, mas a assinatura não
ru: Определения {0} для типа "{1}" в сигнатуре и реализации несовместимы, так как реализация (в отличие от сигнатуры) определяет, что этот тип может использовать значение NULL в качестве дополнительного значения.
tr: Uygulamada bu türün ek değer olarak null değerleri kullanabileceği belirtilmesine rağmen imzada bu belirtmediğinden, imza ve uygulamadaki '{1}' türü için {0} tanımları uyumlu değil
zh_hans: 签名和实现中类型“{1}”的 {0} 定义不兼容，因为实现指明此类型可以使用 null 作为额外值，而签名未指明这一点
zh_hant: 簽章與實作中類型 '{1}' 的 {0} 定義不相容，因為實作宣稱這個類型可以使用 null 作為額外值，但簽章未宣稱

# DefinitionsInSigAndImplNotCompatibleSignatureSaysNull
source: The {0} definitions for type '{1}' in the signature and implementation are not compatible because the signature says this type may use nulls as a representation but the implementation does not
cs: Definice {0} pro typ {1} v signatuře a implementaci nejsou kompatibilní, protože signatura uvádí, že tento typ může jako reprezentaci používat null, ale implementace to neuvádí.
de: Die {0} Definitionen für den Typ "{1}" in der Signatur und in der Implementierung sind nicht kompatibel, weil dieser Typ laut Signatur NULL als Darstellung verwenden darf, laut Implementierung aber nicht.
es: Las definiciones de {0} para el tipo "{1}" en la signatura y la implementación no son compatibles porque la signatura indica que este tipo puede usar valores NULL como una representación pero la implementación no
fr: Les {0} définitions pour le type '{1}' dans la signature et l'implémentation ne sont pas compatibles, car la signature indique que ce type peut utiliser des valeurs Null comme représentation, contrairement à l'implémentation
it: Le definizioni di {0} per il tipo '{1}' nella firma e nell'implementazione non sono compatibili perché in base alla firma questo tipo e non l'implementazione può usare come rappresentazione valori Null
ja: シグネチャでは表現としてこの型に null を使用できると指定していますが、実装では指定していないため、シグネチャおよび実装内の型 '{1}' の {0} 定義は互換性がありません
ko: 시그니처가 이 형식에서 null을 표현으로 사용할 수 있다고 하지만 구현은 그렇지 않으므로 시그니처 및 구현의 '{1}' 형식에 대한 {0} 정의가 호환되지 않습니다.
pl: Definicje {0} dla typu „{1}” w sygnaturze i implementacji są niezgodne, ponieważ sygnatura wskazuje, że ten typ może używać wartości null jako reprezentacji, ale implementacja tego nie wskazuje
pt_br: As definições {0} para o tipo '{1}' na assinatura e implementação não são compatíveis, pois a assinatura diz que este tipo pode usar nulos como uma representação, mas a implementação não
ru: Определения {0} для типа "{1}" в сигнатуре и реализации несовместимы, так как сигнатура (в отличие от реализации) определяет, что этот тип может использовать значение NULL в качестве представления.
tr: İmzada bu türün temsil olarak null değerleri kullanabileceği belirtilmesine rağmen uygulamada bu belirtilmediğinden, imza ve uygulamadaki '{1}' türü için {0} tanımları uyumlu değil
zh_hans: 签名和实现中类型“{1}”的 {0} 定义不兼容，因为签名指明此类型可以使用 null 作为表示形式，而实现未指明这一点
zh_hant: 簽章與實作中類型 '{1}' 的 {0} 定義不相容，因為簽章宣稱這個類型可以使用 null 作為表示法，但實作未宣稱
