Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# tcNoComparisonNeeded1
source: The struct, record or union type '{0}' is not structurally comparable because the type parameter {1} does not satisfy the 'comparison' constraint. Consider adding the 'NoComparison' attribute to the type '{2}' to clarify that the type is not comparable
cs: Typ struktura, záznam nebo sjednocení {0} se nedá strukturálně porovnávat, protože parametr typu {1} nevyhovuje omezení comparison. Zvažte možnost přidat k typu {2} atribut NoComparisonto: tak bude jasné, že se typ nedá porovnávat.
de: Der Struktur-, Datensatz- oder Union-Typ "{0}" ist strukturell nicht vergleichbar, weil der Typparameter "{1}" die comparison-Einschränkung nicht erfüllt. Fügen Sie dem Typ "{2}" das NoComparison-Attribut hinzu, um eindeutig anzugeben, dass der Typ nicht verglichen werden kann.
es: El tipo de struct, registro o unión '{0}' no es estructuralmente comparable porque el parámetro de tipo {1} no satisface la restricción 'comparison'. Considere agregar el atributo 'NoComparison' al tipo '{2}' para indicar que el tipo no es comparable.
fr: Le type struct, enregistrement ou union '{0}' n'est pas structurellement comparable, car le paramètre de type {1} ne satisfait pas la contrainte 'comparison'. Ajoutez l'attribut 'NoComparison' au type '{2}' pour préciser que le type n'est pas comparable
it: Il tipo di unione, struct o record '{0}' non è confrontabile a livello di struttura perché il parametro di tipo {1} non soddisfa il vincolo 'comparison'. Provare ad aggiungere l'attributo 'NoComparison' al tipo '{2}' per chiarire che il tipo non è confrontabile
ja: 型パラメーター {1} が 'comparison' 制約を満たしていないため、構造体型、レコード型、または共用体型 '{0}' は構造的に比較できません。型 '{2}' に 'NoComparison' 属性を追加して、型が比較できないことを明確にしてください。
ko: 형식 매개 변수 {1}이(가) 'comparison' 제약 조건을 만족하지 않으므로 구조체, 레코드 또는 공용 구조체 형식 '{0}'을(를) 구조적으로 비교할 수 없습니다. '{2}' 형식에 'NoComparison' 특성을 추가하여 해당 형식을 비교할 수 없음을 명확히 하세요.
pl: Nie można porównać struktury typu struktury, rekordu lub unii „{0}”, ponieważ parametr typu {1} nie spełnia ograniczenia „comparison”. Rozważ dodanie atrybutu „NoComparison” do typu „{2}” w celu określenia, że typu nie można porównywać
pt_br: O tipo de struct, registro ou união '{0}' não é estruturalmente comparável porque o parâmetro de tipo {1} não satisfaz a restrição 'comparison'. Considere adicionar o atributo 'NoComparison' ao tipo '{2}' para esclarecer que o tipo não é comparável
ru: Тип структуры, записи или объединения "{0}" не сравним структурно, так как параметр типа {1} не удовлетворяет ограничению "comparison". Рекомендуется добавить к типу "{2}" атрибут "NoComparison", чтобы пояснить, что тип не является сравнимым
tr: Tür parametresi {1} 'comparison' kısıtlamasını yerine getirmediği için yapı, kayıt veya birleşim türü '{0}' yapısal olarak karşılaştırılabilir değil. Türün karşılaştırılabilir olmadığını netleştirmek için '{2}' türüne 'NoComparison' özniteliği eklemeyi düşünün
zh_hans: 结构、记录或联合类型“{0}”在结构上是不可比较的，因为类型参数 {1} 不符合“comparison”约束的要求。请考虑将“NoComparison”特性添加到类型“{2}”以阐明此类型是不可比较的
zh_hant: 結構、記錄或等位型別 '{0}' 在結構上無法比較，因為型別參數 {1} 不滿足 'comparison' 條件約束。請考慮將 'NoComparison' 屬性加入型別 '{2}'，以釐清該型別為不可比較

# tcNoComparisonNeeded2
source: The struct, record or union type '{0}' is not structurally comparable because the type '{1}' does not satisfy the 'comparison' constraint. Consider adding the 'NoComparison' attribute to the type '{2}' to clarify that the type is not comparable
cs: Typ struktura, záznam nebo sjednocení {0} se nedá strukturálně porovnávat, protože typ {1} nevyhovuje omezení comparison. Zvažte možnost přidat k typu {2} atribut NoComparisonto: tak bude jasné, že se typ nedá porovnávat.
de: Der Struktur-, Datensatz- oder Union-Typ "{0}" ist strukturell nicht vergleichbar, weil der Typ "{1}" die comparison-Einschränkung nicht erfüllt. Fügen Sie dem Typ "{2}" das NoComparison-Attribut hinzu, um eindeutig anzugeben, dass der Typ nicht verglichen werden kann.
es: El tipo de struct, registro o unión '{0}' no es estructuralmente comparable porque el tipo '{1}' no satisface la restricción 'comparison'. Considere agregar el atributo 'NoComparison' al tipo '{2}' para indicar que el tipo no es comparable.
fr: Le type struct, enregistrement ou union '{0}' n'est pas structurellement comparable, car le type '{1}' ne satisfait pas la contrainte 'comparison'. Ajoutez l'attribut 'NoComparison' au type '{2}' pour préciser que le type n'est pas comparable
it: Il tipo di unione, struct o record '{0}' non è confrontabile a livello di struttura perché il tipo '{1}' non soddisfa il vincolo 'comparison'. Provare ad aggiungere l'attributo 'NoComparison' al tipo '{2}' per chiarire che il tipo non è confrontabile
ja: 型 {1} が 'comparison' 制約を満たしていないため、構造体型、レコード型、または共用体型 '{0}' は構造的に比較できません。型 '{2}' に 'NoComparison' 属性を追加して、型が比較できないことを明確にしてください。
ko: {1}' 형식이 'comparison' 제약 조건을 만족하지 않으므로 구조체, 레코드 또는 공용 구조체 형식 '{0}'을(를) 구조적으로 비교할 수 없습니다. '{2}' 형식에 'NoComparison' 특성을 추가하여 해당 형식을 비교할 수 없음을 명확히 하세요.
pl: Nie można porównać struktury typu struktury, rekordu lub unii „{0}”, ponieważ typ „{1}” nie spełnia ograniczenia „comparison”. Rozważ dodanie atrybutu „NoComparison” do typu „{2}” w celu określenia, że typu nie można porównywać
pt_br: O tipo de struct, registro ou união '{0}' não é estruturalmente comparável porque o tipo {1} não satisfaz a restrição 'comparison'. Considere adicionar o atributo 'NoComparison' ao tipo '{2}' para esclarecer que o tipo não é comparável
ru: Тип структуры, записи или объединения "{0}" не сравним структурно, так как тип {1} не удовлетворяет ограничению "comparison". Рекомендуется добавить к типу "{2}" атрибут "NoComparison", чтобы пояснить, что тип не является сравнимым
tr: {1}' türü 'comparison' kısıtlamasını yerine getirmediği için yapı, kayıt veya birleşim türü '{0}' yapısal olarak karşılaştırılabilir değil. Türün karşılaştırılabilir olmadığını netleştirmek için '{2}' türüne 'NoComparison' özniteliği eklemeyi düşünün
zh_hans: 结构、记录或联合类型“{0}”在结构上是不可比较的，因为类型“{1}”不符合“comparison”约束的要求。请考虑将“NoComparison”特性添加到类型“{2}”以阐明此类型是不可比较的
zh_hant: 結構、記錄或等位型別 '{0}' 在結構上無法比較，因為型別 '{1}' 不滿足 'comparison' 條件約束。請考慮將 'NoComparison' 屬性加入型別 '{2}'，以釐清該型別為不可比較

# tcNoEqualityNeeded1
source: The struct, record or union type '{0}' does not support structural equality because the type parameter {1} does not satisfy the 'equality' constraint. Consider adding the 'NoEquality' attribute to the type '{2}' to clarify that the type does not support structural equality
cs: Typ struktura, záznam nebo sjednocení {0} nepodporuje strukturální rovnost, protože parametr typu {1} nevyhovuje omezení equality. Zvažte možnost přidat k typu {2} atribut NoEquality: tak bude jasné, že typ nepodporuje strukturální rovnost.
de: Der Struktur-, Datensatz- oder Union-Typ "{0}" unterstützt keine strukturelle Gleichheit, weil der Typparameter "{1}" die equality-Einschränkung nicht erfüllt. Fügen Sie dem Typ "{2}" das NoEquality-Attribut hinzu, um eindeutig anzugeben, dass der Typ keine strukturelle Gleichheit unterstützt.
es: El tipo de struct, registro o unión '{0}' no admite igualdad estructural porque el parámetro de tipo {1} no satisface la restricción 'equality'. Considere agregar el atributo 'NoEquality' al tipo '{2}' para indicar que el tipo no admite igualdad estructural.
fr: Le type struct, enregistrement ou union '{0}' ne prend pas en charge l'égalité structurelle, car le paramètre de type {1} ne satisfait pas la contrainte 'equality'. Ajoutez l'attribut 'NoEquality' au type '{2}' pour préciser que le type ne prend pas en charge l'égalité structurelle
it: Il tipo di unione, struct o record '{0}' non supporta l'uguaglianza strutturale perché il parametro di tipo {1} non soddisfa il vincolo 'equality'. Provare ad aggiungere l'attributo 'NoEquality' al tipo '{2}' per chiarire che il tipo non supporta l'uguaglianza strutturale
ja: 型パラメーター {1} が 'equality' 制約を満たしていないため、構造体型、レコード型、または共用体型 '{0}' は構造の等値性をサポートしません。型 '{2}' に 'NoEquality' 属性を追加して、型が構造の等値性をサポートしないことを明確にしてください。
ko: 형식 매개 변수 {1}이(가) 'equality' 제약 조건을 만족하지 않으므로 구조체, 레코드 또는 공용 구조체 형식 '{0}'이(가) 구조적 같음을 지원하지 않습니다. '{2}' 형식에 'NoEquality' 특성을 추가하여 해당 형식이 구조적 같음을 지원하지 않음을 명확히 하세요.
pl: Typ struktury, rekordu lub unii „{0}” nie obsługuje równości strukturalnej, ponieważ parametr typu {1} nie spełnia ograniczenia „equality”. Rozważ dodanie atrybutu „NoEquality” do typu „{2}” w celu określenia, że typ nie obsługuje równości strukturalnej
pt_br: O tipo de struct, registro ou união '{0}' não suporta igualdade estrutural porque o parâmetro de tipo {1} não satisfaz a restrição 'equality'. Considere adicionar o atributo 'NoEquality' ao tipo '{2}' para esclarecer que o tipo não suporta igualdade estrutural
ru: Тип структуры, записи или объединения "{0}" не поддерживает структурное равенство, так как параметр типа {1} не удовлетворяет ограничению "equality". Рекомендуется добавить к типу "{2}" атрибут "NoEquality", чтобы пояснить, что тип не поддерживает структурное равенство
tr: Tür parametresi {1} 'equality' kısıtlamasını yerine getirmediği için yapı, kayıt veya birleşim türü '{0}' yapısal eşitliği desteklemez. Türün yapısal eşitliği desteklemediğini netleştirmek için '{2}' türüne 'NoEquality' özniteliği eklemeyi düşünün
zh_hans: 结构、记录或联合类型“{0}”不支持结构相等比较，因为类型参数 {1} 不符合“equality”约束的要求。请考虑将“NoEquality”特性添加到类型“{2}”以阐明此类型不支持结构相等比较
zh_hant: 結構、記錄或等位型別 '{0}' 不支援結構相等，因為型別參數 {1} 不滿足 'equality' 條件約束。請考慮將 'NoEquality' 屬性加入型別 '{2}'，以釐清該型別不支援結構相等

# tcNoEqualityNeeded2
source: The struct, record or union type '{0}' does not support structural equality because the type '{1}' does not satisfy the 'equality' constraint. Consider adding the 'NoEquality' attribute to the type '{2}' to clarify that the type does not support structural equality
cs: Typ struktura, záznam nebo sjednocení {0} nepodporuje strukturální rovnost, protože typ {1} nevyhovuje omezení equality. Zvažte možnost přidat k typu {2} atribut NoEquality: tak bude jasné, že typ nepodporuje strukturální rovnost.
de: Der Struktur-, Datensatz- oder Union-Typ "{0}" unterstützt keine strukturelle Gleichheit, weil der Typ "{1}" die equality-Einschränkung nicht erfüllt. Fügen Sie dem Typ "{2}" das NoEquality-Attribut hinzu, um eindeutig anzugeben, dass der Typ keine strukturelle Gleichheit unterstützt.
es: El tipo de struct, registro o unión '{0}' no admite igualdad estructural porque el tipo '{1}' no satisface la restricción 'equality'. Considere agregar el atributo 'NoEquality' al tipo '{2}' para indicar que el tipo no admite igualdad estructural.
fr: Le type struct, enregistrement ou union '{0}' ne prend pas en charge l'égalité structurelle, car le type '{1}' ne satisfait pas la contrainte 'equality'. Ajoutez l'attribut 'NoEquality' au type '{2}' pour préciser que le type ne prend pas en charge l'égalité structurelle
it: Il tipo di unione, struct o record '{0}' non supporta l'uguaglianza strutturale perché il tipo '{1}' non soddisfa il vincolo 'equality'. Provare ad aggiungere l'attributo 'NoEquality' al tipo '{2}' per chiarire che il tipo non supporta l'uguaglianza strutturale
ja: 型 {1} が 'equality' 制約を満たしていないため、構造体型、レコード型、または共用体型 '{0}' は構造の等値性をサポートしません。型 '{2}' に 'NoEquality' 属性を追加して、型が構造の等値性をサポートしないことを明確にしてください。
ko: {1}' 형식이 'equality' 제약 조건을 만족하지 않으므로 구조체, 레코드 또는 공용 구조체 형식 '{0}'이(가) 구조적 같음을 지원하지 않습니다. '{2}' 형식에 'NoEquality' 특성을 추가하여 해당 형식이 구조적 같음을 지원하지 않음을 명확히 하세요.
pl: Typ struktury, rekordu lub unii „{0}” nie obsługuje równości strukturalnej, ponieważ typ „{1}” nie spełnia ograniczenia „equality”. Rozważ dodanie atrybutu „NoEquality” do typu „{2}” w celu określenia, że typ nie obsługuje równości strukturalnej
pt_br: O tipo de struct, registro ou união '{0}' não suporta igualdade estrutural porque o tipo {1} não satisfaz a restrição 'equality'. Considere adicionar o atributo 'NoEquality' ao tipo '{2}' para esclarecer que o tipo não suporta igualdade estrutural
ru: Тип структуры, записи или объединения "{0}" поддерживает структурное равенство, так как параметр типа {1} не удовлетворяет ограничению "equality". Рекомендуется добавить к типу "{2}" атрибут "NoEquality", чтобы пояснить, что тип не поддерживает структурное равенство
tr: {1}' türü 'equality' kısıtlamasını yerine getirmediği için yapı, kayıt veya birleşim türü '{0}' yapısal eşitliği desteklemez. Türün yapısal eşitliği desteklemediğini netleştirmek için '{2}' türüne 'NoEquality' özniteliği eklemeyi düşünün
zh_hans: 结构、记录或联合类型“{0}”不支持结构相等比较，因为类型“{1}”不符合“equality”约束的要求。请考虑将“NoEquality”特性添加到类型“{2}”以阐明此类型不支持结构相等比较
zh_hant: 結構、記錄或等位型別 '{0}' 不支援結構相等，因為型別 '{1}' 不滿足 'equality' 條件約束。請考慮將 'NoEquality' 屬性加入型別 '{2}'，以釐清該型別不支援結構相等

# tcStructuralEqualityNotSatisfied1
source: The struct, record or union type '{0}' has the 'StructuralEquality' attribute but the type parameter '{1}' does not satisfy the 'equality' constraint. Consider adding the 'equality' constraint to the type parameter
cs: Typ struktura, záznam nebo sjednocení {0} má atribut StructuralEquality, ale parametr typu {1} nevyhovuje omezení equality. Zvažte možnost přidat k parametru typu omezení equality.
de: Der Struktur-, Datensatz- oder Union-Typ "{0}" ist mit dem StructuralEquality-Attribut versehen, aber der Typparameter "{1}" erfüllt die equality-Einschränkung nicht. Fügen Sie dem Typparameter die equality-Einschränkung hinzu.
es: El tipo de struct, registro o unión '{0}' tiene el atributo 'StructuralEquality', pero el parámetro de tipo '{1}' no satisface la restricción 'equality'. Considere agregar la restricción 'equality' al parámetro de tipo.
fr: Le type struct, enregistrement ou union '{0}' a l'attribut 'StructuralEquality' mais le paramètre de type '{1}' ne satisfait pas la contrainte 'equality'. Ajoutez la contrainte 'equality' au paramètre de type
it: Il tipo di unione, struct o record '{0}' contiene l'attributo 'StructuralEquality' ma il parametro di tipo '{1}' non soddisfa il vincolo 'equality'. Provare ad aggiungere il vincolo 'equality' al parametro di tipo
ja: 構造体型、レコード型、または共用体型 '{0}' に 'StructuralEquality' 属性がありますが、型パラメーター '{1}' は 'equality' 制約を満たしていません。型パラメーターに 'equality' 制約を追加してください。
ko: 구조체, 레코드 또는 공용 구조체 형식 '{0}'에 'StructuralEquality' 특성이 있지만 형식 매개 변수 '{1}'이(가) 'equality' 제약 조건을 만족하지 않습니다. 형식 매개 변수에 'equality' 제약 조건을 추가하세요.
pl: Typ struktury, rekordu lub unii „{0}” zawiera atrybut „StructuralEquality”, ale parametr typu „{1}” nie spełnia ograniczenia „equality”. Rozważ dodanie ograniczenia „equality” do parametru typu
pt_br: O tipo struct, registro ou união '{0}' tem o atributo 'StructuralEquality', mas o parâmetro de tipo '{1}' não satisfaz a restrição 'equality'. Considere adicionar a restrição 'equality' ao parâmetro de tipo
ru: Тип структуры, записи или объединения "{0}" имеет атрибут "StructuralEquality", но параметр типа "{1}" не удовлетворяет ограничению "equality". Рекомендуется добавить к параметру типа ограничение "equality"
tr: Yapı, kayıt veya birleşim türü '{0}', 'StructuralEquality' özniteliğine sahip ancak tür parametresi '{1}' 'equality' kısıtlamasını karşılamıyor. Tür parametresine 'equality' kısıtlamasını eklemeyi düşünün
zh_hans: 结构、记录或联合类型“{0}”具有“StructuralEquality”特性，但类型参数“{1}”不符合“equality”约束的要求。请考虑将“equality”约束添加到该类型参数
zh_hant: 結構、記錄或等位型別 '{0}' 有 'StructuralEquality' 屬性，但型別參數 '{1}' 不滿足 'equality' 條件約束。請考慮將 'equality' 條件約束加入型別參數

# tcStructuralEqualityNotSatisfied2
source: The struct, record or union type '{0}' has the 'StructuralEquality' attribute but the component type '{1}' does not satisfy the 'equality' constraint
cs: Typ struktura, záznam nebo sjednocení {0} má atribut StructuralEquality, ale typ komponenty {1} nevyhovuje omezení equality.
de: Der Struktur-, Datensatz- oder Union-Typ "{0}" ist mit dem StructuralEquality-Attribut versehen, aber der Komponententyp "{1}" erfüllt die equality-Einschränkung nicht.
es: El tipo de struct, registro o unión '{0}' tiene el atributo 'StructuralEquality', pero el tipo de componente '{1}' no satisface la restricción 'equality'.
fr: Le type struct, enregistrement ou union '{0}' a l'attribut 'StructuralEquality' mais le type de composant '{1}' ne satisfait pas la contrainte 'equality'
it: Il tipo di unione, struct o record '{0}' contiene l'attributo 'StructuralEquality' ma il tipo di componente '{1}' non soddisfa il vincolo 'equality'
ja: 構造体型、レコード型、または共用体型 '{0}' に 'StructuralEquality' 属性がありますが、コンポーネント型 '{1}' は 'equality' 制約を満たしていません。
ko: 구조체, 레코드 또는 공용 구조체 형식 '{0}'에 'StructuralEquality' 특성이 있지만 구성 요소 형식 '{1}'이(가) 'equality' 제약 조건을 만족하지 않습니다.
pl: Typ struktury, rekordu lub unii „{0}” zawiera atrybut „StructuralEquality”, ale typ składnika „{1}” nie spełnia ograniczenia „equality”
pt_br: O tipo struct, registro ou união '{0}' tem o atributo 'StructuralEquality', mas o tipo de componente '{1}' não satisfaz a restrição 'equality'
ru: Тип структуры, записи или объединения "{0}" имеет атрибут "StructuralEquality", но тип компонента "{1}" не удовлетворяет ограничению "equality"
tr: Yapı, kayıt veya birleşim türü '{0}', 'StructuralEquality' özniteliğine sahip ancak bileşen türü '{1}' 'equality' kısıtlamasını karşılamıyor
zh_hans: 结构、记录或联合类型“{0}”具有“StructuralEquality”特性，但组件类型“{1}”不符合“equality”约束的要求
zh_hant: 結構、記錄或等位型別 '{0}' 有 'StructuralEquality' 屬性，但元件型別 '{1}' 不滿足 'equality' 條件約束

# tcStructsMustDeclareTypesOfImplicitCtorArgsExplicitly
source: Each argument of the primary constructor for a struct must be given a type, for example 'type S(x1:int, x2: int) = ...'. These arguments determine the fields of the struct.
cs: Všem argumentům primárního konstruktoru pro strukturu se musí předávat typ, třeba pomocí notace type S(x1:int, x2: int) = ... Tyto argumenty určují pole struktury.
de: Jedes Argument des primären Konstruktors für eine Struktur muss einen Typ erhalten, z.B. "type S(x1:int, x2: int) = ...". Diese Argumente bestimmen die Felder der Struktur.
es: A cada argumento del constructor principal de un struct debe proporcionársele un tipo; por ejemplo, 'type S(x1:int, x2: int) = ...'. Estos argumentos determinan los campos del struct.
fr: Chaque argument du constructeur principal d'un struct doit recevoir un type, par exemple 'type S(x1:int, x2: int) = ...'. Ces arguments déterminent les champs du struct.
it: A ogni argomento del costruttore primario per uno struct deve essere assegnato un tipo, ad esempio 'type S(x1:int, x2: int) = ...'. Tali argomenti determinano i campi dello struct.
ja: 構造体のプライマリ コンストラクターの各引数には型を指定してください (たとえば、'type S(x1:int, x2: int) = ...')。これらの引数で構造体のフィールドが決定されます。
ko: 구조체의 주 생성자에 대한 각 인수에는 형식을 지정해야 합니다(예: 'type S(x1:int, x2: int) = ...'). 이러한 인수는 구조체의 필드를 결정합니다.
pl: Każdy argument podstawowego konstruktora struktury musi mieć określony typ, na przykład „type S(x1:int, x2:int) = ...”. Te argumenty określają pola struktury.
pt_br: Cada argumento do construtor primário para um struct deve receber um tipo, por exemplo 'type S(x1:int, x2: int) = ...'. Esses argumentos determinam o campo do struct.
ru: Каждый аргумент первичного конструктора для структуры должен получить тип, например "type S(x1:int, x2: int) = ...". Эти аргументы определяют поля структуры.
tr: Bir struct türünün birincil oluşturucusunun her bağımsız değişkenine bir tür verilmelidir, örneğin 'type S(x1:int, x2: int) = ...'. Bu bağımsız değişkenler yapının alanlarını belirler.
zh_hans: 必须为结构的主构造函数的每个参数给定一个类型，例如“type S(x1:int, x2: int) = ...”。这些参数确定该结构的各个字段。
zh_hant: 必須為類型的主要建構函式的每個引數指定類型，例如 'type S(x1:int, x2: int) = ...'。這些引數會決定結構的欄位。

# chkUnusedValue
source: The value '{0}' is unused
cs: Hodnota {0} se nepoužívá.
de: Der Wert "{0}" wird nicht verwendet.
es: El valor '{0}' no se usa.
fr: La valeur '{0}' est inutilisée
it: Valore '{0}' non utilizzato
ja: 値 '{0}' は使用されていません
ko: 값 '{0}'을(를) 사용하지 않습니다.
pl: Wartość „{0}” nie jest używana
pt_br: O valor '{0}' é não usado.
ru: Значение "{0}" не используется
tr: '{0}' değeri kullanılmıyor
zh_hans: 未使用值“{0}”
zh_hant: 值 '{0}' 未使用到

# chkUnusedThisVariable
source: The recursive object reference '{0}' is unused. The presence of a recursive object reference adds runtime initialization checks to members in this and derived types. Consider removing this recursive object reference.
cs: Rekurzivní odkaz na objekt {0} se nepoužívá. Přítomnost rekurzivního odkazu na objekt přidává ke členům tohoto a odvozených typů kontroly inicializace za běhu. Zvažte odebrání tohoto rekurzivního odkazu na objekt.
de: Der rekursive Objektverweis "{0}" wird nicht verwendet. Ist ein rekursiver Objektverweis vorhanden, werden Membern in diesem Typ und in abgeleiteten Typen Laufzeitinitialisierungsprüfungen hinzugefügt. Entfernen Sie diesen rekursiven Objektverweis.
es: La referencia de objeto recursiva '{0}' no se usa. La presencia de una referencia de objeto recursiva agrega comprobaciones de inicialización en tiempo de ejecución a los miembros de este tipo y los tipos derivados. Considere quitar esta referencia de objeto recursiva.
fr: La référence d'objet récursive '{0}' n'est pas utilisée. La présence d'une référence d'objet récursive ajoute des vérifications de l'initialisation du runtime aux membres de ce type et des types dérivés. Supprimez cette référence d'objet récursive.
it: Riferimento ricorsivo a oggetto '{0}' non usato. La presenza di un riferimento ricorsivo a un oggetto aggiunge verifiche di inizializzazione del runtime ai membri in questo tipo e nei relativi tipi derivati. Provare a rimuovere il riferimento ricorsivo all'oggetto.
ja: 再帰的オブジェクト参照 '{0}' は使用されていません。再帰的オブジェクト参照が存在すると、この型および派生型のメンバーに対するランタイムの初期化チェックが追加されます。この再帰的オブジェクト参照を削除してください。
ko: 재귀적 개체 참조 '{0}'을(를) 사용하지 않습니다. 재귀적 개체 참조가 있으면 이 형식 및 파생 형식의 멤버에 대한 런타임 초기화 검사가 추가됩니다. 이 재귀적 개체 참조를 제거하세요.
pl: Cykliczne odwołanie do obiektu „{0}” nie jest używane. Obecność cyklicznego odwołania do obiektu powoduje dodanie kontroli inicjowania środowiska uruchomieniowego do elementów członkowskich w tym typie i typach pochodnych. Rozważ usunięcie tego cyklicznego odwołania do obiektu.
pt_br: A referência de objeto recursiva '{0}' não é usada. A presença de uma referência de objeto recursiva adiciona verificações de inicialização em tempo de execução aos membros destes tipos e seus derivados. Considere remover essa referência de objeto recursiva.
ru: Рекурсивная ссылка на объект "{0}" не используется. Наличие рекурсивных ссылок на объект увеличивает число проверок инициализации, проводимых во время выполнения для элементов этого типа и его производных типов. Рекомендуется удалить рекурсивную ссылку на объект.
tr: Özyinelemeli nesne başvurusu '{0}' kullanılmıyor. Özyinelemeli nesne başvurusunun varlığı, bu ve bundan türetilmiş türlerdeki üyelere çalışma zamanı başlatma denetimleri ekler. Bu özyinelemeli nesne başvurusunu kaldırmayı değerlendirin.
zh_hans: 未使用递归对象引用“{0}”。如果存在递归对象引用，则会增加针对此类型和派生类型中的成员的运行时初始化检查。请考虑删除此递归对象引用。
zh_hant: 遞迴物件參考 '{0}' 未使用到。有了遞迴物件參考，就會在這個類型和衍生類型的成員中加入執行階段初始化檢查。請考慮移除這個遞迴物件參考。

# parsGetterAtMostOneArgument
source: A getter property may have at most one argument group
cs: Vlastnost getter může mít maximálně jednu skupinu argumentů.
de: Eine Getter-Eigenschaft darf maximal eine Argumentgruppe aufweisen.
es: Una propiedad de captador puede tener un grupo de argumentos como máximo.
fr: Une propriété de méthode getter peut avoir au maximum un groupe d'arguments
it: Una proprietà di getter può contenere al massimo un gruppo di argomenti
ja: ゲッターのプロパティに指定できる引数グループの数は 1 以下です
ko: getter 속성에는 인수 그룹이 최대 하나만 있을 수 있습니다.
pl: Właściwość metody pobierającej może mieć najwyżej jedną grupę argumentów
pt_br: Uma propriedade getter pode ter no máximo um grupo de argumento
ru: Свойство метода получения может иметь не более одной группы аргументов
tr: Alıcı özelliğinin en çok bir bağımsız değişken grubu olabilir
zh_hans: Getter 属性最多可以有一个参数组
zh_hant: getter 屬性最多只能有一個引數群組
