Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# tcNewMemberHidesAbstractMember
source: This new member hides the abstract member '{0}'. Rename the member or use 'override' instead.
cs: Tento nový člen skrývá abstraktní člen {0}. Změňte jeho název nebo místo toho použijte klíčové slovo override.
de: Dieser neue Member verbirgt den abstrakten Member "{0}". Benennen Sie den Member um, oder verwenden Sie stattdessen "override".
es: Este nuevo miembro oculta el miembro abstracto '{0}'. Cambie el nombre del miembro o use 'override' en su lugar.
fr: Ce nouveau membre masque le membre abstrait '{0}'. Renommez le membre ou utilisez 'override' à la place.
it: Il nuovo membro nasconde il membro astratto '{0}'. Rinominare il membro o utilizzare 'override'.
ja: この新しいメンバーは抽象メンバー '{0}' を隠ぺいします。メンバーの名前を変更するか、代わりに 'override' を使用してください。
ko: 이 새 멤버는 추상 멤버 '{0}'을(를) 숨깁니다. 멤버의 이름을 바꾸거나 대신 'override'를 사용하세요.
pl: Ten nowy element członkowski ukrywa abstrakcyjny element członkowski „{0}”. Zmień nazwę elementu członkowskiego lub użyj elementu „override”.
pt_br: Este novo membro oculta o membro abstrato '{0}'. Renomeie o membro ou use 'override'.
ru: Этот новый элемент скрывает абстрактный элемент "{0}". Переименуйте элемент или используйте "override".
tr: Bu yeni üye, '{0}' soyut üyesini gizliyor. Üyeyi yeniden adlandırın veya bunun yerine 'override' kullanın.
zh_hans: 此新成员隐藏了抽象成员“{0}”。重命名此成员或改用“override”。
zh_hant: 這個新成員會隱藏抽象成員 '{0}'。請重新命名成員或改用 'override'。

# tcNewMemberHidesAbstractMemberWithSuffix
source: This new member hides the abstract member '{0}' once tuples, functions, units of measure and/or provided types are erased. Rename the member or use 'override' instead.
cs: Tento nový člen skrývá po vymazání řazených kolekcí členů, funkcí, měrných jednotek a poskytnutých typů abstraktní člen {0}. Změňte jeho název nebo místo toho použijte klíčové slovo override.
de: Dieser neue Member verbirgt den abstrakten Member "{0}", nachdem alle Tupel, Funktionen, Maßeinheiten und/oder angegebene Typen gelöscht wurden. Benennen Sie den Member um, oder verwenden Sie stattdessen "override".
es: Este nuevo miembro oculta el miembro abstracto '{0}' una vez borradas las tuplas, funciones, unidades de medida y/o los tipos proporcionados. Cambie el nombre del miembro o use 'override' en su lugar.
fr: Ce nouveau membre masque le membre abstrait '{0}', une fois les tuples, fonctions, les unités de mesure et/ou les types fournis effacés. Renommez le membre ou utilisez 'override' à la place.
it: Il nuovo membro nasconde il membro astratto '{0}' dopo la cancellazione di tuple, funzioni, unità di misura e/o tipi forniti. Rinominare il membro o utilizzare 'override'.
ja: タプル、関数、測定単位、または指定された型が消去されると、この新しいメンバーは抽象メンバー '{0}' を隠ぺいします。メンバーの名前を変更するか、代わりに 'override' を使用してください。
ko: 이 새 멤버는 튜플, 함수, 측정 단위 및/또는 제공된 형식이 지워지면 추상 멤버 '{0}'을(를) 숨깁니다. 멤버의 이름을 바꾸거나 대신 'override'를 사용하세요.
pl: Ten nowy element członkowski ukrywa abstrakcyjny element członkowski „{0}” po wymazaniu krotek, funkcji, jednostek miary i/lub udostępnionych typów. Zmień nazwę elementu członkowskiego lub użyj elementu „override”.
pt_br: Este novo membro oculta o membro abstrato '{0}' assim que tuplas, funções, unidades de medida e/ou tipos fornecidos são apagados. Renomeie o membro ou use 'override'.
ru: Этот новый элемент скрывает абстрактный элемент "{0}" после удаления кортежей, функций, единиц измерения и предоставляемых типов. Переименуйте элемент или используйте override.
tr: Demetler, işlevler, ölçü birimleri ve/veya sağlanan türler silindikten sonra bu yeni üye, '{0}' soyut üyesini gizliyor. Üyeyi yeniden adlandırın veya bunun yerine 'override' kullanın.
zh_hans: 一旦清除元组、函数、度量单位和/或所提供的类型，此新成员就会隐藏抽象成员“{0}”。请重命名此成员或改用“override”。
zh_hant: 這個新成員在清除元組、函式、測量單位和/或提供的類型後會隱藏抽象成員 '{0}'。請重新命名成員或改用 'override'。

# tcStaticInitializersIllegalInInterface
source: Interfaces cannot contain definitions of static initializers
cs: Rozhraní nemůžou obsahovat definice statických inicializátorů.
de: Schnittstellen dürfen keine Definitionen von statischen Initialisierern enthalten.
es: Las interfaces no pueden contener definiciones de inicializadores estáticos.
fr: Les interfaces ne peuvent pas contenir de définitions d'initialiseurs statiques
it: Le interfacce non possono contenere definizioni di inizializzatori statici
ja: インターフェイスに静的初期化子の定義を含めることはできません
ko: 인터페이스에는 정적 이니셜라이저의 정의를 포함할 수 없습니다.
pl: Interfejsy nie mogą zawierać definicji inicjatorów statycznych
pt_br: Interfaces não podem conter definições de inicializadores estáticos
ru: Интерфейсы не могут содержать определения статических инициализаторов
tr: Arabirimler statik başlatıcı tanımları içeremez
zh_hans: 接口不能包含静态初始化表达式的定义
zh_hant: 介面不能包含靜態初始設定式的定義

# tcObjectConstructorsIllegalInInterface
source: Interfaces cannot contain definitions of object constructors
cs: Rozhraní nemůžou obsahovat definice konstruktorů objektu.
de: Schnittstellen dürfen keine Definitionen von Objektkonstruktoren enthalten.
es: Las interfaces no pueden contener definiciones de constructores de objeto.
fr: Les interfaces ne peuvent pas contenir de définitions de constructeurs d'objets
it: Le interfacce non possono contenere definizioni di costruttori di oggetto
ja: インターフェイスにオブジェクト コンストラクターの定義を含めることはできません
ko: 인터페이스에는 개체 생성자의 정의를 포함할 수 없습니다.
pl: Interfejsy nie mogą zawierać definicji konstruktorów obiektów
pt_br: Interfaces não podem conter definições de construtores de objeto
ru: Интерфейсы не могут содержать определения конструкторов объектов
tr: Arabirimler nesne oluşturucularının tanımlarını içeremez
zh_hans: 接口不能包含对象构造函数的定义
zh_hant: 介面不能包含物件建構函式的定義

# tcMemberOverridesIllegalInInterface
source: Interfaces cannot contain definitions of member overrides
cs: Rozhraní nemůžou obsahovat definice přepsání členů.
de: Schnittstellen dürfen keine Definitionen von Memberüberschreibungen enthalten.
es: Las interfaces no pueden contener definiciones de invalidaciones de miembro.
fr: Les interfaces ne peuvent pas contenir de définitions de substitutions de membres
it: Le interfacce non possono contenere definizioni di override di membri
ja: インターフェイスにメンバーのオーバーライドの定義を含めることはできません
ko: 인터페이스에는 멤버 재정의의 정의를 포함할 수 없습니다.
pl: Interfejsy nie mogą zawierać definicji przesłonięć elementów członkowskich
pt_br: Interfaces não podem conter definições de substituições de membros
ru: Интерфейсы не могут содержать определения переопределений элементов
tr: Arabirimler üye geçersiz kılma tanımları içeremez
zh_hans: 接口不能包含成员重写的定义
zh_hant: 介面不能包含成員覆寫的定義

# tcConcreteMembersIllegalInInterface
source: Interfaces cannot contain definitions of concrete members. You may need to define a constructor on your type to indicate that the type is a class.
cs: Rozhraní nemůžou obsahovat definice konkrétních členů. Možná bude potřeba definovat u typu konstruktor, který bude vyjadřovat, že jde o třídu.
de: Schnittstellen dürfen keine Definitionen konkreter Member enthalten. Sie müssen ggf. einen Konstruktor für den Typ definieren, um anzugeben, dass es sich bei dem Typ um eine Klasse handelt.
es: Las interfaces no pueden contener definiciones de miembros concretos. Puede ser necesario definir un constructor en el tipo para indicar que el tipo es una clase.
fr: Les interfaces ne peuvent pas contenir de définitions de membres concrets. Vous pouvez définir un constructeur sur votre type pour indiquer que le type est une classe.
it: Le interfacce non possono contenere definizioni di membri concreti. Potrebbe essere necessario definire un costruttore nel tipo utilizzato per indicare che il tipo è una classe.
ja: インターフェイスに具象メンバーの定義を含めることはできません。必要に応じて、型にコンストラクターを定義して、型がクラスであることを示してください。
ko: 인터페이스에는 구체적인 멤버의 정의를 포함할 수 없습니다. 사용자 형식에 대한 생성자를 정의하여 해당 형식이 클래스임을 나타내야 할 수 있습니다.
pl: Interfejsy nie mogą zawierać definicji konkretnych elementów członkowskich. Może być konieczne zdefiniowanie konstruktora w typie, aby określić, że typ to klasa.
pt_br: Interfaces não podem conter definições de membros concretos. Talvez seja necessário definir um construtor no seu tipo para indicar que o tipo é uma classe.
ru: Интерфейсы не могут содержать определений конкретных элементов. Чтобы указать, что тип является классом, возможно, потребуется определить конструктор для типа.
tr: Arabirimler somut üyelerin tanımlarını içeremez. Türün sınıf olduğunu belirtmek için türünüzde bir oluşturucu tanımlamanız gerekebilir.
zh_hans: 接口不能包含具体成员的定义。您可能需要定义类型的构造函数来指示该类型是类。
zh_hant: 介面不能包含具象成員的定義。您必須在類型上定義建構函式，以指示類型是類別。

# tcConstructorsDisallowedInExceptionAugmentation
source: Constructors cannot be specified in exception augmentations
cs: V rozšířeních výjimky nejde zadávat konstruktory.
de: Konstruktoren können nicht in Ausnahmeaugmentationen angegeben werden.
es: No se pueden especificar constructores en aumentos de excepciones.
fr: Impossible de spécifier des constructeurs dans des augmentations d'exception
it: I costruttori non possono essere specificati in aumenti di eccezione
ja: 例外の拡張にコンストラクターは指定できません
ko: 생성자는 예외 확대에 지정할 수 없습니다.
pl: Nie można określać konstruktorów w rozszerzeniach wyjątków
pt_br: Não é possível especificar construtores em aumentos de exceções
ru: Конструкторы нельзя указывать в приращениях исключений
tr: Oluşturucular özel durum genişletmelerinde belirtilemez
zh_hans: 不能在异常扩大中指定构造函数
zh_hant: 建構函式不能在例外狀況增強指定中指定

# tcStructsCannotHaveConstructorWithNoArguments
source: Structs cannot have an object constructor with no arguments. This is a restriction imposed on all CLI languages as structs automatically support a default constructor.
cs: Struktury nemůžou mít konstruktor objektu bez argumentů. Toto je omezení, které platí u všech jazyků CLI vzhledem k tomu, že struktury automaticky podporují výchozí konstruktor.
de: Strukturen dürfen keinen Objektkonstruktor ohne Argumente aufweisen. Diese Einschränkung gilt für alle CLI-Sprachen, da Strukturen automatisch einen Standardkonstruktor unterstützen.
es: Los structs no pueden tener un constructor de objeto sin argumentos. Esta es una restricción impuesta en todos los lenguajes CLI porque los structs admiten automáticamente un constructor predeterminado.
fr: Les structs ne peuvent pas avoir de constructeur d'objet sans arguments. Il s'agit d'une restriction imposée à tous les langages CLI, car les structs prennent automatiquement en charge un constructeur par défaut.
it: Gli struct non possono avere un costruttore di oggetto senza argomenti. Si tratta di una limitazione imposta in tutti i linguaggi CLI perché gli struct supportano automaticamente un costruttore predefinito.
ja: 構造体には、引数なしのオブジェクト コンストラクターを使用できません。構造体は既定のコンストラクターを自動的にサポートするため、これはすべての CLI 言語に課せられた制限です。
ko: 구조체에는 인수가 없는 개체 생성자를 지정할 수 없습니다. 이는 구조체가 기본 생성자를 자동으로 지원하기 때문에 모든 CLI 언어에 적용되는 제한입니다.
pl: Struktury nie mogą mieć konstruktora obiektów bez argumentów. To ograniczenie dotyczy wszystkich języków CLI, ponieważ struktury automatycznie obsługują konstruktor domyślny.
pt_br: Os structs não podem ter um construtor de objetos sem argumentos. Esta é uma restrição imposta a todas as linguagens CLI, porque os structs suportam automaticamente um construtor padrão.
ru: Структуры не могут иметь конструктор объектов без аргументов. Это ограничение, накладываемое на все языки CLI, так как структуры автоматически поддерживают конструктор по умолчанию.
tr: Yapıların bağımsız değişkensiz nesne oluşturucusu olamaz. Yapılar varsayılan oluşturucuyu otomatik olarak desteklediği için bu, tüm CLI dillerine getirilen bir kısıtlamadır.
zh_hans: 结构不能具有不带参数的对象构造函数。这是对所有 CLI 语言实施的限制，原因是结构自动支持默认构造函数。
zh_hant: 結構不能有不含引數的物件建構函式。這是對所有 CLI 語言施加的限制，因為結構會自動支援預設建構函式。

# tcConstructorsIllegalForThisType
source: Constructors cannot be defined for this type
cs: Pro tento typ nejde definovat konstruktory.
de: Für diesen Typ können keine Konstruktoren definiert werden.
es: No se pueden definir constructores para este tipo
fr: Impossible de définir des constructeurs pour ce type
it: Non è possibile definire costruttori per questo tipo
ko: 생성자는 이 형식에 대해 지정할 수 없습니다.
pl: Nie można definiować konstruktorów dla tego typu
pt_br: Não é possível definir construtores para este tipo
ru: Для данного типа не удается определить конструкторы
tr: Oluşturucular bu tür için tanımlanamaz
zh_hans: 不能为此类型定义构造函数
zh_hant: 無法為這個類型定義建構函式

# tcRecursiveBindingsWithMembersMustBeDirectAugmentation
source: Recursive bindings that include member specifications can only occur as a direct augmentation of a type
cs: Rekurzivní vazby, které obsahují specifikace členů, se dají použít jenom jako přímé rozšíření typu.
de: Rekursive Bindungen mit Memberspezifikationen dürfen nur als direkte Augmentation eines Typs auftreten.
es: Los enlaces recursivos que incluyen especificaciones de miembro pueden existir solo como aumento directo de un tipo.
fr: Les liaisons récursives qui incluent des spécifications de membres ne peuvent se produire qu'en tant qu'augmentation directe d'un type
it: I binding ricorsivi che includono specifiche di membro possono rappresentare solo un aumento diretto di un tipo
ko: 멤버 지정을 포함하는 재귀적 바인딩은 형식의 직접 확대로만 발생할 수 있습니다.
pl: Powiązania cykliczne zawierające specyfikacje elementów członkowskich mogą występować tylko jako bezpośrednie powiększenie typu
pt_br: Associações recursivas que incluem especificações de membros só podem ocorrer como um aumento direto de um tipo
ru: Рекурсивные привязки, включающие спецификации элементов, могут встречаться только как прямое приращение типа
tr: Üye belirtimleri içeren özyinelemeli bağlamalar yalnızca türün doğrudan genişletmesi olarak oluşabilir
zh_hans: 包含成员规格的递归绑定只能作为类型的直接扩大出现
zh_hant: 包含成員規格的遞迴繫結只能做為類型的直接增強指定

# tcOnlySimplePatternsInLetRec
source: Only simple variable patterns can be bound in 'let rec' constructs
cs: Vazbu v konstruktorech let rec můžou mít jenom vzory s jednoduchými proměnnými.
de: In "let rec"-Konstrukten können nur einfache Variablenmuster gebunden werden.
es: Solo se pueden enlazar patrones de variable simple en construcciones 'let rec'.
fr: Seuls les modèles de variable simples peuvent être liés dans les constructions 'let rec'
it: Solo i criteri variabili semplici possono essere associati in costrutti 'let rec'
ja: 'let rec' コンストラクトでバインドできるのは、単純な変数パターンのみです
ko: 단순 변수 패턴만 'let rec' 구문에 바인딩할 수 있습니다.
pl: Tylko proste wzorce zmiennych mogą być powiązane w konstrukcjach „let rec”
pt_br: Apenas padrões de variáveis simples podem ser associados em construtores 'let rec'
ru: Только простые шаблоны переменных могут быть связаны в конструкциях "let rec"
tr: 'let rec' yapılarında yalnızca basit değişken desenleri bağlanabilir
zh_hans: 只能在“let rec”构造中绑定简单的变量模式
zh_hant: 只有簡單的變數模式可以在 'let rec' 建構中繫結

# tcOnlyRecordFieldsAndSimpleLetCanBeMutable
source: Mutable 'let' bindings can't be recursive or defined in recursive modules or namespaces
cs: Proměnlivé vazby let nemůžou být rekurzivní ani definované v rekurzivních modulech nebo oborech názvů.
de: Änderbare let-Bindungen können nicht rekursiv sein oder in rekursiven Modulen oder Namespaces definiert werden.
es: Los enlaces "let" mutables no pueden ser recursivos ni estar definidos en espacios de nombres o módulos recursivos
fr: Les liaisons 'let' mutables ne peuvent pas être récursives ou définies dans des modules ou espaces de noms récursifs
it: I binding 'let' modificabili non possono essere ricorsivi o definiti in moduli o spazi dei nomi ricorsivi
ja: 変更可能な 'let' バインドは、再帰的にしたり、再帰的なモジュールまたは名前空間で定義したりすることはできません
ko: 변경이 가능한 'let' 바인딩을 반복하거나 재귀 모듈 또는 네임스페이스에서 정의할 수 없습니다.
pl: Modyfikowalne powiązania „let” nie mogą być rekurencyjne ani definiowane w modułach rekurencyjnych lub przestrzeniach nazw
pt_br: Associações 'let' mutáveis não podem ser recursivas ou definidas em módulos recursivos ou namespaces
ru: Изменяемые привязки "let" не могут быть рекурсивными или определенными в рекурсивных модулях или пространствах имен
tr: Değişebilir 'let' bağlamaları özyinelemeli olamaz veya özyinelemeli modüllerde ya da ad alanlarında tanımlanamaz
zh_hans: 可变 "let" 绑定不能在递归模块或命名空间中递归或定义
zh_hant: 可變 'let' 繫結不能在遞迴模組或命名空間中遞迴或定義

# tcMemberIsNotSufficientlyGeneric
source: This member is not sufficiently generic
cs: Tento člen není dostatečně obecný.
de: Dieser Member ist nicht generisch genug.
es: Este miembro no es lo suficientemente genérico.
fr: Ce membre n'est pas suffisamment générique
it: Questo membro non è sufficientemente generico
ja: このメンバーの総称性が十分ではありません
ko: 이 멤버는 충분히 일반적이지 않습니다.
pl: Ten element członkowski nie jest wystarczająco ogólny
pt_br: Este membro não é suficientemente genérico
ru: Данный элемент является недостаточно базовым
tr: Bu üye yeterince genel değil
zh_hans: 此成员的通用性不够
zh_hant: 這個成員的一般程度不足

# tcLiteralAttributeRequiresConstantValue
source: A declaration may only be the [<Literal>] attribute if a constant value is also given, e.g. 'val x : int = 1'
cs: Pokud se definuje také hodnota konstanty, třeba val x : int = 1, může být deklarací jenom atribut [<Literal>].
de: Eine Deklaration kann nur dem [<Literal>]-Attribut entsprechen, wenn auch ein konstanter Wert angegeben ist, z.B. "val x : int =1".
es: Una declaración solo puede ser el atributo [<Literal>] si también se proporciona un valor constante, por ejemplo, "val x: int = 1"
fr: Une déclaration peut seulement être l'attribut [<Literal>] si une valeur constante est aussi donnée, par ex. 'val x : int = 1'
it: Una dichiarazione può essere solo l'attributo [<Literal>] se è specificato anche un valore costante, ad esempio 'val x : int = 1'
ja: 定数値も指定する場合には宣言を [<Literal>] 属性のみにできます。例: 'val x : int = 1'
ko: 상수 값도 지정된 경우(예: 'val x : int = 1')에만 선언은 [<Literal>] 특성일 수 있습니다.
pl: Deklaracja może być atrybutem [<Literal>] tylko wtedy, gdy zostanie również podana wartość stała, np. „val x : int = 1”
pt_br: Uma declaração só pode ser o atributo [<Literal>] se um valor constante também é dado, ex.:' val x: int = 1'
ru: Объявление может представлять собой только атрибут [<Literal>], если указано значение константы, например, 'val x : int = 1'
tr: Bir sabit değer de sağlanmışsa bildirim yalnızca [<Literal>] özniteliği olabilir, ör. 'val x : int = 1'
zh_hans: 如果还给定了常量值，则声明只能是 [<Literal>] 属性，例如 "val x : int = 1"
zh_hant: 若也提供了常數值，宣告就只能是 [<Literal>] 屬性，例如 'val x : int = 1'

# tcValueInSignatureRequiresLiteralAttribute
source: A declaration may only be given a value in a signature if the declaration has the [<Literal>] attribute
cs: Deklaraci se může v signatuře předávat hodnota jenom v případě, že má deklarace atribut [<Literal>].
de: Eine Deklaration darf nur einen Wert in der Signatur aufweisen, wenn das Attribut "[<Literal>]" vorhanden ist.
es: A una declaración solo se le puede dar un valor en una firma si la declaración tiene el atributo [<Literal>]
fr: Une déclaration peut uniquement recevoir une valeur dans une signature si elle a l'attribut [<Literal>]
it: In una firma è possibile assegnare solo un valore a una dichiarazione se quest'ultima contiene l'attributo [<Literal>]
ja: 宣言に [<Literal>] 属性が設定されている場合には宣言によって値を指定できるのはシグネチャ内のみです
ko: [<Literal>] 특성이 있는 경우에만 선언의 시그니처에 값을 지정할 수 있습니다.
pl: Deklaracja może otrzymać wartość w podpisie tylko wtedy, gdy ma atrybut [<Literal>]
pt_br: Uma declaração só pode receber um valor em uma assinatura se a declaração tiver o atributo [<Literal>]
ru: Объявление может быть указано только в том случае, если в объявлении есть атрибут [<Literal>]
tr: Bir bildirime yalnızca bildirim [<Literal>] özniteliğine sahipse bir imzada değer verilebilir
zh_hans: 仅在声明具有 [<Literal>] 属性时, 才可在签名中为声明指定一个值
zh_hant: 若宣告有 [<Literal>] 屬性，宣告就只能有特徵標記中的值

# tcThreadStaticAndContextStaticMustBeStatic
source: Thread-static and context-static variables must be static and given the [<DefaultValue>] attribute to indicate that the value is initialized to the default value on each new thread
cs: Proměnné, které jsou statické na úrovni vlákna nebo kontextu, musí být statické a musí se jim předávat atribut [<DefaultValue>]. Tím se určí, že se hodnota v každém novém vláknu inicializuje na výchozí hodnotu.
de: Threadstatische und kontextstatische Variablen müssen statisch sein und mit dem [<DefaultValue>]-Attribut versehen werden, um anzugeben, dass der Wert bei jedem neuen Thread mit dem Standardwert initialisiert wird.
es: Las variables estáticas de subproceso y estáticas de contexto deben ser estáticas y proporcionarse al atributo [<DefaultValue>] para indicar que el valor se inicializa al valor predeterminado en cada nuevo subproceso
fr: Les variables static de thread et de contexte doivent être statiques et avoir l'attribut [<DefaultValue>] pour indiquer que la valeur est initialisée sur la valeur par défaut sur chaque nouveau thread
it: Le variabili statiche a livello di thread e a livello di contesto devono essere statiche e associate all'attributo [<DefaultValue>] per indicare che il valore viene inizializzato sul valore predefinito in ogni nuovo thread
ja: Thread-static 変数および context-static 変数は静的にし、[<DefaultValue>] 属性を指定し、新しいスレッドごとに値が既定値に初期化されることを示す必要があります
ko: Thread 정적 및 Context 정적 변수는 정적이어야 하며 값이 각 새 스레드에서 기본값으로 초기화됨을 나타내기 위해 [<DefaultValue>] 특성을 가져야 합니다.
pl: Zmienne statyczne dla wątku i kontekstu muszą być określone jako statyczne i mieć atrybut [<DefaultValue>] w celu wskazania, że wartość jest inicjowana w każdym nowym wątku przy użyciu wartości domyślnej
pt_br: As variáveis de contexto estático e de thread estático devem ser estáticas e dado o atributo [<DefaultValue>] para indicar que o valor é inicializado para o valor padrão em cada novo thread
ru: Статические переменные потока и контекста должны быть статическими, и для них необходимо указать атрибут [<DefaultValue>], чтобы подчеркнуть, что их значение инициализируется значением по умолчанию для каждого нового потока
tr: Thread-static ve context-static değişkenleri statik olmalı ve değerin her yeni iş parçacığında varsayılan değer olarak başlatıldığının gösterilmesi için bunlara [<DefaultValue>] özniteliği verilmelidir
zh_hans: 线程静态变量和上下文静态变量必须是静态的，并具有 [<DefaultValue>] 属性以指示该值初始化为每个新线程上的默认值
zh_hant: 靜態執行緒和環境變數必須是靜態的，且必須為其指定 [<DefaultValue>] 屬性，以指出值會在每個新的執行緒均初始化為預設值

# tcVolatileFieldsMustBeMutable
source: Volatile fields must be marked 'mutable' and cannot be thread-static
cs: Pole s modifikátorem volatile musí mít označení mutable a nemůžou být statická na úrovni vlákna.
de: Flüchtige Felder müssen als "mutable" markiert werden und können nicht threadstatisch sein.
es: Los campos volátiles deben marcarse como 'mutable' y no pueden ser ThreadStatic.
fr: Les champs volatiles doivent être marqués comme 'mutable' et ne peuvent pas être des champs static de thread
it: I campi volatili devono essere contrassegnati come 'mutable' e non possono essere statici a livello di thread
ja: volatile フィールドは 'mutable' とマークしてください。また、thread-static にすることはできません。
ko: volatile 필드는 'mutable'로 표시해야 하며 Thread 정적일 수 없습니다.
pl: Pola nietrwałe muszą być oznaczone jako „mutable” i nie mogą być statyczne dla wątku
pt_br: Campos voláteis devem ser marcados como 'mutable' e não podem ser thread estático
ru: Временные поля должны быть помечены как "mutable"; они также не могут быть потокостатическими
tr: Geçici alanlar 'mutable' olarak işaretlenmelidir ve bunlar statik iş parçacıklı olamaz
zh_hans: 可变字段必须标记为“mutable”且不能是线程静态的
zh_hant: Volatile 欄位必須標記為 'mutable'，而且不能是 Thread 靜態的
