Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# parsUnexpectedEndOfFileThen
source: Unexpected end of input in 'then' branch of conditional expression. Expected 'if <expr> then <expr>' or 'if <expr> then <expr> else <expr>'.
cs: Neočekávaný konec vstupu ve větvi then podmíněného výrazu. Očekávalo se if <výraz> then <výraz> nebo if <výraz> then <výraz> else <výraz>.
de: Unerwartetes Ende der Eingabe im "then"-Branch des bedingten Ausdrucks. Erwartet wird: "if <expr> then <expr>" oder "if <expr> then <expr> else <expr>".
es: Final inesperado de la entrada en la rama "then" de la expresión condicional. Se esperaba "if <expr> then <expr>" o "if <expr> then <expr> else <expr>".
fr: Fin d'entrée inattendue dans la branche 'then' de l'expression conditionnelle. Attendu 'if <expr> then <expr>' ou 'if <expr> then <expr> else <expr>'.
it: Fine dell'input imprevista nel ramo 'then' dell'espressione condizionale. È previsto 'if <expr> then <expr>' o 'if <expr> then <expr> else <expr>'.
ja: 条件式の 'then' 分岐の入力が予期しない形式で終了しています。'if <expr> then <expr>' または 'if <expr> then <expr> else <expr>' が必要でした。
ko: 조건식의 'then' 분기에 예기치 않은 입력의 끝이 있습니다. 'if <expr> then <expr>' 또는 'if <expr> then <expr> else <expr>'이 필요합니다.
pl: Nieoczekiwane zakończenie danych wejściowych w gałęzi „then” wyrażenia warunkowego. Oczekiwano konstrukcji „if <wyrażenie> then <wyrażenie>” lub „if <wyrażenie> then <wyrażenie> else <wyrażenie>”.
pt_br: Fim inesperado da entrada no branch 'then' da expressão condicional. Esperado 'if <expr> then <expr>' ou 'if <expr> then <expr> else <expr>'.
ru: Неожиданное завершение входных данных в ветви 'then' условного выражения. Ожидаемое завершение: 'if <expr> then <expr>' или 'if <expr> then <expr> else <expr>'.
tr: Koşullu ifadenin 'then' dalında beklenmeyen giriş sonu. 'if <expr> then <expr>' veya 'if <expr> then <expr> else <expr>' bekleniyordu.
zh_hans: 条件表达式的 "then" 分支中的输入意外结束。应为 "if <expr> then <expr>" 或 "if <expr> then <expr> else <expr>"。
zh_hant: 條件運算式的 'then' 分支中有未預期的輸入結尾。應為 'if <expr> then <expr>' 或 'if <expr> then <expr> else <expr>'。

# parsUnexpectedEndOfFileElse
source: Unexpected end of input in 'else' branch of conditional expression. Expected 'if <expr> then <expr>' or 'if <expr> then <expr> else <expr>'.
cs: Neočekávaný konec vstup ve větvi else podmíněného výrazu. Očekávalo se if <výraz> then <výraz> nebo if <výraz> then <výraz> else <výraz>.
de: Unerwartetes Ende der Eingabe im "else"-Branch des bedingten Ausdrucks. Erwartet wird: "if <expr> then <expr>" oder "if <expr> then <expr> else <expr>".
es: Fin de entrada inesperado en la rama "else" de la expresión condicional. Se esperaba "'if <expr> then <expr>" o "if <expr> then <expr> else <expr>".
fr: Fin d'entrée inattendue dans la branche 'else' de l'expression conditionnelle. Attendu 'if <expr> then <expr>' ou 'if <expr> then <expr> else <expr>'.
it: Fine dell'input imprevista nel ramo 'else' dell'espressione condizionale. È previsto 'if <expr> then <expr>' o 'if <expr> then <expr> else <expr>'.
ja: 条件式の 'else' 分岐の入力が予期しない形式で終了しています。'if <expr> then <expr>' または 'if <expr> then <expr> else <expr>' が必要でした。
ko: 조건식의 'else' 분기에 예기치 않은 입력의 끝이 있습니다. 'if <expr> then <expr>' 또는 'if <expr> then <expr> else <expr>'이 필요합니다.
pl: Nieoczekiwane zakończenie danych wejściowych w gałęzi „else” wyrażenia warunkowego. Oczekiwano konstrukcji „if <wyrażenie> then <wyrażenie>” lub „if <wyrażenie> then <wyrażenie> else <wyrażenie>”.
pt_br: Fim inesperado de entrada no branch 'else' da expressão condicional. Esperado 'if <expr> then <expr>' or 'if <expr> then <expr> else <expr>'.
ru: Неожиданное завершение входных данных ветви 'else' условного выражения. Ожидаемое завершение: 'if <expr> then <expr>' или 'if <expr> then <expr> else <expr>'.
tr: Koşullu ifadenin 'else' dalında beklenmeyen giriş sonu. 'if <expr> then <expr>' veya 'if <expr> then <expr> else <expr>' bekleniyordu.
zh_hans: 条件表达式的 "else" 分支中的输入意外结束。应为 ''if <expr> then <expr>" 或 "if <expr> then <expr> else <expr>"。
zh_hant: 條件運算式的 'else' 分支中有未預期的輸入結尾。應為 'if <expr> then <expr>' 或 'if <expr> then <expr> else <expr>'。

# parsUnexpectedEndOfFileFunBody
source: Unexpected end of input in body of lambda expression. Expected 'fun <pat> ... <pat> -> <expr>'.
cs: Neočekávaný konec vstupu v těle výrazu lambda. Očekávaná notace je fun <vzor> ... <vzor> -> <výraz>.
de: Unerwartetes Ende der Eingabe im Text des Lambdaausdrucks. Erwartet wird: "fun <pat> ... <pat> -> <expr>".
es: Final inesperado de la entrada en el cuerpo de la expresión lambda. Se esperaba "fun <pat> ... <pat> -> <expr>".
fr: Fin d'entrée inattendue dans le corps d'une expression lambda. Attendu 'fun <pat> ... <pat> -> <expr>'.
it: Fine dell'input imprevista nel corpo dell'espressione lambda. È previsto 'fun <pat> ... <pat> -> <expr>'.
ja: ラムダ式本体の入力末尾が予期されたものと異なります。必要な入力末尾は、'fun <pat> ... <pat> -> <expr>' です。
ko: 람다 식 본문에 예기치 않은 입력의 끝이 있습니다. 'fun <pat> ... <pat> -> <expr>'이 필요합니다.
pl: Nieoczekiwane zakończenie danych wejściowych w treści wyrażenia lambda. Oczekiwano konstrukcji „fun <wzorzec> ... <wzorzec> -> <wyrażenie>”.
pt_br: Fim inesperado de entrada no corpo da expressão lambda. Esperado 'fun <pat> ... <pat> -> <expr>'.
ru: Неожиданное завершение входных данных лямбда-выражения. Ожидаемое завершение: 'fun <pat> ... <pat> -> <expr>'.
tr: Lambda ifadesinin gövdesinde beklenmeyen giriş sonu. 'fun <pat> ... <pat> -> <expr>' bekleniyordu.
zh_hans: lambda 表达式正文中的输入意外结束。应为 "fun <pat> ... <pat> -> <expr>"。
zh_hant: Lambda 運算式的主體中有未預期的輸入結尾。應為 'fun <pat> ... <pat> -> <expr>'。

# parsUnexpectedEndOfFileTypeArgs
source: Unexpected end of input in type arguments
cs: Neočekávaný konec vstupu v argumentech typu
de: Unerwartetes Eingabeende in den Typargumenten
es: Final de entrada inesperado en los argumentos de tipo.
fr: Fin d'entrée inattendue dans les arguments de type
it: Fine dell'input imprevista negli argomenti tipo
ja: 型引数に予期しない入力の終わりが見つかりました
ko: 형식 인수에 예기치 않은 입력의 끝이 있습니다.
pl: Nieoczekiwane zakończenie danych wejściowych w argumentach typu
pt_br: Fim inesperado de entrada em argumentos de tipo
ru: Непредвиденный конец входных данных в аргументах типа
tr: Tür bağımsız değişkenlerinde beklenmeyen giriş sonu
zh_hans: 类型参数中出现意外的输入结尾
zh_hant: 類型引數中不能以輸入結尾

# parsUnexpectedEndOfFileTypeSignature
source: Unexpected end of input in type signature
cs: Neočekávaný konec vstupu v signatuře typu
de: Unerwartetes Eingabeende in der Typsignatur
es: Final de entrada inesperado en la signatura de tipo.
fr: Fin d'entrée inattendue dans la signature de type
it: Fine dell'input imprevista nella firma del tipo
ja: 型シグネチャに予期しない入力の終わりが見つかりました
ko: 형식 서명에 예기치 않은 입력의 끝이 있습니다.
pl: Nieoczekiwane zakończenie danych wejściowych w sygnaturze typu
pt_br: Fim inesperado de entrada em assinatura de tipo
ru: Непредвиденный конец входных данных в сигнатуре типа
tr: Tür imzasında beklenmeyen giriş sonu
zh_hans: 类型签名中出现意外的输入结尾
zh_hant: 類型簽章中不能以輸入結尾

# parsUnexpectedEndOfFileTypeDefinition
source: Unexpected end of input in type definition
cs: Neočekávaný konec vstupu v definici typu
de: Unerwartetes Eingabeende in der Typdefinition
es: Final de entrada inesperado en la definición de tipo.
fr: Fin d'entrée inattendue dans la définition de type
it: Fine dell'input imprevista nella definizione di tipo
ja: 型定義に予期しない入力の終わりが見つかりました
ko: 형식 정의에 예기치 않은 입력의 끝이 있습니다.
pl: Nieoczekiwane zakończenie danych wejściowych w definicji typu
pt_br: Fim inesperado de entrada em definição de tipo
ru: Непредвиденный конец входных данных в определении типа
tr: Tür tanımında beklenmeyen giriş sonu
zh_hans: 类型定义中出现意外的输入结尾
zh_hant: 類型定義中不能以輸入結尾

# parsUnexpectedEndOfFileObjectMembers
source: Unexpected end of input in object members
cs: Neočekávaný konec vstupu u členů objektu
de: Unerwartetes Eingabeende in Objektmembern
es: Final de entrada inesperado en miembros de objetos.
fr: Fin d'entrée inattendue dans les membres d'objet
it: Fine dell'input imprevista nei membri di oggetti
ja: オブジェクト メンバーに予期しない入力の終わりが見つかりました
ko: 개체 멤버에 예기치 않은 입력의 끝이 있습니다.
pl: Nieoczekiwane zakończenie danych wejściowych w elementach członkowskich obiektu
pt_br: Fim inesperado de entrada em membros de objeto.
ru: Непредвиденный конец входных данных в элементах объекта
tr: Nesne üyelerinde beklenmeyen giriş sonu
zh_hans: 对象成员中出现意外的输入结尾
zh_hant: 物件成員中不能以輸入結尾

# parsUnexpectedEndOfFileDefinition
source: Unexpected end of input in value, function or member definition
cs: Neočekávaný konec vstupu v definici hodnoty, funkce nebo člena
de: Unerwartetes Eingabeende im Wert, der Funktion oder der Memberdefinition
es: Final de entrada inesperado en una definición de miembro, función o valor.
fr: Fin d'entrée inattendue dans la définition de valeur, de fonction ou de membre
it: Fine dell'input imprevista nella definizione di membro, funzione o valore
ja: 値、関数、またはメンバーの定義内で予期しない入力の終わりが見つかりました
ko: 값, 함수 또는 멤버 정의에 예기치 않은 입력의 끝이 있습니다.
pl: Nieoczekiwany koniec danych wejściowych w definicji wartości, funkcji lub elementu członkowskiego
pt_br: Fim inesperado de entrada em definição de valor, função ou membro
ru: Непредвиденный конец входных данных в определении значения, функции или элемента
tr: Değer, işlev veya üye tanımında beklenmeyen giriş sonu
zh_hans: 值、函数或成员定义中出现意外的输入结尾
zh_hant: 值、函式或成員定義中不能以輸入結尾

# parsUnexpectedEndOfFileExpression
source: Unexpected end of input in expression
cs: Neočekávaný konec vstupu ve výrazu
de: Unerwartetes Eingabeende im Ausdruck
es: Final de entrada inesperado en una expresión.
fr: Fin d'entrée inattendue dans l'expression
it: Fine dell'input imprevista nell'espressione
ja: 式の中に予期しない入力の終わりが見つかりました
ko: 식에 예기치 않은 입력의 끝이 있습니다.
pl: Nieoczekiwany koniec danych wejściowych w wyrażeniu
pt_br: Fim inesperado de entrada na expressão
ru: Непредвиденный конец входных данных в выражении
tr: İfadede beklenmeyen giriş sonu
zh_hans: 表达式中出现意外的输入结尾
zh_hant: 運算式中不能以輸入結尾

# parsExpectedNameAfterToken
source: Unexpected end of type. Expected a name after this point.
cs: Neočekávaný konec typu. Za touto pozicí se očekává název.
de: Unerwartetes Typende. Nach diesem Punkt wurde ein Name erwartet.
es: Final de tipo inesperado. Se esperaba un nombre después de este punto.
fr: Fin de type inattendue. Un nom était attendu après ce point.
it: Fine del tipo imprevista. Previsto un nome dopo questa posizione.
ja: 予期しない型の末尾です。この位置より後に名前を置く必要があります。
ko: 예기치 않은 형식의 끝입니다. 이 지점 뒤에 이름이 필요합니다.
pl: Nieoczekiwany koniec typu. Oczekiwano nazwy po tym punkcie.
pt_br: Fim de tipo inesperado. Esperado um nome após este ponto.
ru: Непредвиденный конец файла. После этой точки ожидалось имя.
tr: Beklenmeyen tür sonu. Bu noktadan sonra bir ad bekleniyordu.
zh_hans: 意外的类型结尾。此点之后应是名称。
zh_hant: 不能以類型結尾。在這個點之後必須有名稱。

# parsUnmatchedLet
source: Incomplete value or function definition. If this is in an expression, the body of the expression must be indented to the same column as the 'let' keyword.
cs: Neúplná definice hodnoty nebo funkce. Pokud je tato definice ve výrazu, musí být tělo tohoto výrazu odsazené na stejnou úroveň jako klíčové slovo let.
de: Unvollständiger Wert oder unvollständige Funktionsdefinition. Wenn es sich hierbei um einen Ausdruck handelt, muss der Text des Ausdrucks in dieselbe Spalte wie das Schlüsselwort 'let' eingezogen werden.
es: Definición de valor o función incompleta. Si se encuentra en una expresión, se debe aplicar sangría al cuerpo de la expresión hasta la misma columna que la palabra clave 'let'.
fr: Définition de valeur ou de fonction incomplète. S'il s'agit d'une expression, le corps de l'expression doit être mis en retrait sur la même colonne que le mot-clé 'let'.
it: Definizione di funzione o di valore incompleta. Se presente in un'espressione, il corpo dell'espressione deve essere rientrato alla stessa colonna della parola chiave 'let'.
ja: 値または関数定義が不完全です。これが式の中にある場合、式の本体を 'let' キーワードと同じ列にインデントする必要があります。
ko: 값 또는 함수 정의가 불완전합니다. 해당 항목이 식인 경우 식 본문을 'let' 키워드와 같은 열로 들여써야 합니다.
pl: Niepełna definicja wartości lub funkcji. Jeśli jest to wyrażenie, treść wyrażenia musi być wcięta w tej samej kolumnie co słowo kluczowe „let”.
pt_br: Definição incompleta de valor ou função. Se isso for uma expressão, o corpo da expressão deverá ser recuado para a mesma coluna que a palavra-chave 'let'.
ru: Неполное определение значения или функции. Если оно находится в выражении, тело выражения должно располагаться с таким же отступом, что и ключевое слово let.
tr: Eksik değer veya işlev tanımı. Bu bir ifadeyse ifadenin gövdesi 'let' anahtar sözcüğü ile aynı sütuna girintilenmelidir.
zh_hans: 值或函数定义不完整。如果该定义处于表达式中，则表达式体必须与“let”关键字缩进到相同的列。
zh_hant: 不完整的值或函式定義。如果這是運算式，運算式的主體必須縮排成與 'let' 關鍵字在同一欄。

# parsUnmatchedLetBang
source: Incomplete value definition. If this is in an expression, the body of the expression must be indented to the same column as the 'let!' keyword.
cs: Neúplná definice hodnoty. Pokud je tato definice ve výrazu, musí být tělo tohoto výrazu odsazené na stejnou úroveň jako klíčové slovo let!.
de: Unvollständige Wertdefinition. Wenn es sich hierbei um einen Ausdruck handelt, muss der Text des Ausdrucks in dieselbe Spalte wie das Schlüsselwort 'let!' eingezogen werden.
es: Definición de valor incompleta. Si se encuentra en una expresión, se debe aplicar sangría al cuerpo de la expresión hasta la misma columna que la palabra clave 'let!'.
fr: Définition de valeur incomplète. S'il s'agit d'une expression, le corps de l'expression doit être mis en retrait sur la même colonne que le mot-clé 'let!'.
it: Definizione di valore incompleta. Se presente in un'espressione, il corpo dell'espressione deve essere rientrato alla stessa colonna della parola chiave 'let!'.
ja: 値の定義が不完全です。これが式の中にある場合、式の本体を 'let!' キーワードと同じ列にインデントする必要があります。
ko: 값 정의가 불완전합니다. 해당 항목이 식인 경우 식 본문을 'let!' 키워드와 같은 열로 들여써야 합니다.
pl: Niepełna definicja wartości. Jeśli jest to wyrażenie, treść wyrażenia musi być wcięta w tej samej kolumnie co słowo kluczowe „let!”.
pt_br: Definição incompleta de valor. Se isso for uma expressão, o corpo da expressão deverá ser recuado para a mesma coluna que a palavra-chave 'let'.
ru: Неполное определение значения. Если оно находится в выражении, тело выражения должно располагаться с таким же отступом, что и ключевое слово "let!".
tr: Eksik değer tanımı. Bu bir ifadeyse ifadenin gövdesi 'let!' anahtar sözcüğü ile aynı sütuna girintilenmelidir.
zh_hans: 值定义不完整。如果该定义处于表达式中，则表达式体必须与“let!”关键字缩进到相同的列。
zh_hant: 不完整的值定義。如果這是運算式，運算式的主體必須縮排成與 'let!' 關鍵字在同一欄。

# parsUnmatchedUseBang
source: Incomplete value definition. If this is in an expression, the body of the expression must be indented to the same column as the 'use!' keyword.
cs: Neúplná definice hodnoty. Pokud je tato definice ve výrazu, musí být tělo tohoto výrazu odsazené na stejnou úroveň jako klíčové slovo use!.
de: Unvollständige Wertdefinition. Wenn es sich hierbei um einen Ausdruck handelt, muss der Text des Ausdrucks in dieselbe Spalte wie das Schlüsselwort 'use!' eingezogen werden.
es: Definición de valor incompleta. Si se encuentra en una expresión, se debe aplicar sangría al cuerpo de la expresión hasta la misma columna que la palabra clave 'use!'.
fr: Définition de valeur incomplète. S'il s'agit d'une expression, le corps de l'expression doit être mis en retrait sur la même colonne que le mot-clé 'use!'.
it: Definizione di valore incompleta. Se presente in un'espressione, il corpo dell'espressione deve essere rientrato alla stessa colonna della parola chiave 'use!'.
ja: 値の定義が不完全です。これが式の中にある場合、式の本体を 'use!' キーワードと同じ列にインデントする必要があります。
ko: 값 정의가 불완전합니다. 해당 항목이 식인 경우 식 본문을 'use!' 키워드와 같은 열로 들여써야 합니다.
pl: Niepełna definicja wartości. Jeśli jest to wyrażenie, treść wyrażenia musi być wcięta w tej samej kolumnie co słowo kluczowe „use!”.
pt_br: Definição incompleta de valor. Se isso for uma expressão, o corpo da expressão deverá ser recuado para a mesma coluna que a palavra-chave 'use!'.
ru: Неполное определение значения. Если оно находится в выражении, тело выражения должно располагаться с таким же отступом, что и ключевое слово "use!".
tr: Eksik değer tanımı. Bu bir ifadeyse ifadenin gövdesi 'use!' anahtar sözcüğü ile aynı sütuna girintilenmelidir.
zh_hans: 值定义不完整。如果该定义处于表达式中，则表达式体必须与“use!”关键字缩进到相同的列。
zh_hant: 不完整的值定義。如果這是運算式，運算式的主體必須縮排成與 'use!' 關鍵字在同一欄。

# parsUnmatchedUse
source: Incomplete value definition. If this is in an expression, the body of the expression must be indented to the same column as the 'use' keyword.
cs: Neúplná definice hodnoty. Pokud je tato definice ve výrazu, musí být tělo tohoto výrazu odsazené na stejnou úroveň jako klíčové slovo use.
de: Unvollständige Wertdefinition. Wenn es sich hierbei um einen Ausdruck handelt, muss der Text des Ausdrucks in dieselbe Spalte wie das Schlüsselwort 'use' eingezogen werden.
es: Definición de valor incompleta. Si se encuentra en una expresión, se debe aplicar sangría al cuerpo de la expresión hasta la misma columna que la palabra clave 'use'.
fr: Définition de valeur incomplète. S'il s'agit d'une expression, le corps de l'expression doit être mis en retrait sur la même colonne que le mot-clé 'use'.
it: Definizione di valore incompleta. Se presente in un'espressione, il corpo dell'espressione deve essere rientrato alla stessa colonna della parola chiave 'use'.
ja: 値の定義が不完全です。これが式の中にある場合、式の本体を 'use' キーワードと同じ列にインデントする必要があります。
ko: 값 정의가 불완전합니다. 해당 항목이 식인 경우 식 본문을 'use' 키워드와 같은 열로 들여써야 합니다.
pl: Niepełna definicja wartości. Jeśli jest to wyrażenie, treść wyrażenia musi być wcięta w tej samej kolumnie co słowo kluczowe „use”.
pt_br: Definição incompleta de valor. Se isso for uma expressão, o corpo da expressão deverá ser recuado para a mesma coluna que a palavra-chave 'use'.
ru: Неполное определение значения. Если оно находится в выражении, тело выражения должно располагаться с таким же отступом, что и ключевое слово use.
tr: Eksik değer tanımı. Bu bir ifadeyse ifadenin gövdesi 'use' anahtar sözcüğü ile aynı sütuna girintilenmelidir.
zh_hans: 值定义不完整。如果该定义处于表达式中，则表达式体必须与“use”关键字缩进到相同的列。
zh_hant: 不完整的值定義。如果這是運算式，運算式的主體必須縮排成與 'use' 關鍵字在同一欄。

# parsWhileDoExpected
source: Missing 'do' in 'while' expression. Expected 'while <expr> do <expr>'.
cs: Chybí do ve výrazu while. Očekávalo se while <výraz> do <výraz>'.
de: Fehlendes "do"-Element" im "while"-Ausdruck. Erwartet wird: "while <expr> do <expr>".
es: Falta "do" en la expresión "while". Se esperaba "while <expr> do <expr>".
fr: 'do' est manquant dans l'expression 'while'. Attendu 'while <expr> do <expr>'.
it: 'do' mancante nell'espressione 'while'. È previsto 'while <expr> do <expr>'.
ja: 'while' 式に 'do' がありません。'while <expr> do <expr>' が必要でした。
ko: 'while' 식에서 'do'가 누락되었습니다. 'while <expr> do <expr>'이 필요합니다.
pl: Brak instrukcji „do” w wyrażeniu „while”. Oczekiwano konstrukcji „while <wyrażenie> do <wyrażenie>”.
pt_br: 'do' ausente na expressão 'while'. Esperado 'while <expr> do <expr>'.
ru: В выражении "while" отсутствует "do". Ожидаемый синтаксис: 'while <expr> do <expr>'.
tr: 'while' ifadesinde 'do' eksik. 'while <expr> do <expr>' bekleniyordu.
zh_hans: "while" 表达式中缺少 "do"。应为 "while <expr> do <expr>"。
zh_hant: 'while' 運算式中缺少 'do'。應為 'while <expr> do <expr>'。

# parsForDoExpected
source: Missing 'do' in 'for' expression. Expected 'for <pat> in <expr> do <expr>'.
cs: Chybí do ve výrazu for. Očekávalo se for <vzor> in <výraz> do <výraz>.
de: "do" fehlt in "for"-Ausdruck. Erwartet wird: "for <pat> in <expr> do <expr>".
es: Falta "do" en la expresión "for". Se espera "for <pat> in <expr> do <expr>".
fr: 'do' manquant dans l'expression 'for'. Attendu 'for <pat> in <expr> do <expr>'.
it: 'do' mancante nell'espressione 'for'. È previsto 'for <pat> in <expr> do <expr>'.
ja: 'for' 式で 'do' がありません。'for <pat> in <expr> do <expr>' が必要でした。
ko: 'for' 식에서 'do'가 누락되었습니다. 'for <pat> in <expr> do <expr>'이 필요합니다.
pl: Brak powiązania „do” w wyrażeniu „for”. Oczekiwano konstrukcji „for <wzorzec> in <wyrażenie> do <wyrażenie>”.
pt_br: 'do' ausente na expressão 'for'. Esperado 'for <pat> in <expr> do <expr>'.
ru: Отсутствует выражение 'do' в выражении 'for'. Ожидается 'for <pat> in <expr> do <expr>'.
tr: 'for' ifadesinde 'do' eksik. <expr> do <expr>' içinde 'for <pat> bekleniyordu.
zh_hans: "for" 表达式中缺少 "do"。应为 "for <pat> in <expr> do <expr>"。
zh_hant: 'for' 運算式中缺少 'do'。應為 'for <pat> in <expr> do <expr>'。

# tcInvalidRelationInJoin
source: Invalid join relation in '{0}'. Expected 'expr <op> expr', where <op> is =, =?, ?= or ?=?.
cs: Neplatná relace spojení v {0}. Očekávaná notace je výraz <op> výraz, kde <op> je =, =?, ?= nebo ?=?.
de: Ungültige Joinbeziehung in "{0}". Es wird "expr <op> expr" erwartet. Hierbei sollte "<op>" dem Operator =, =?, ?= oder ?=? entsprechen.
es: Relación de combinación no válida en "{0}". Se esperaba "expr <op> expr", donde <op> es =, =?, ?= o ?=?.
fr: Relation de jointure non valide dans '{0}'. Attendu 'expr <op> expr', où <op> est =, =?, ?= ou ?=?.
it: Relazione join non valida in '{0}'. È previsto 'expr <op> expr', dove <op> è =, =?, ?= o ?=?.
ja: '{0}' に無効な結合関係があります。'expr <op> expr' が必要でした。<op> は、=、=?、?=、?=? のいずれかです。
ko: '{0}'의 조인 관계가 잘못되었습니다. 'expr <op> expr'이 필요합니다. 여기서 <op>는 =, =?, ?= 또는 ?=?입니다.
pl: Nieprawidłowa relacja sprzężenia w elemencie „{0}”. Oczekiwano konstrukcji „wyrażenie <operator> wyrażenie”, gdzie <operator> to =, =?, ?= lub ?=?.
pt_br: Relação de associação inválida em '{0}'. Esperado 'expr <op> expr', onde <op> for =, =?, ?= ou ?=?.
ru: Недопустимое отношение соединения '{0}'. Ожидаемое отношение: 'expr <оператор> expr', где <оператор> is =, =?, ?= or ?=?.
tr: '{0}' içinde geçersiz birleştirme ilişkisi. <op> değerinin =, =?, ?= veya ?=? olduğu 'expr <op> expr' bekleniyordu.
zh_hans: “{0}”中的联接关系无效。应为 "expr <op> expr"，其中 <op> 为 =、=?、?= 或 ?=?。
zh_hant: '{0}' 中的連結關聯無效。應為 'expr <op> expr'，其中 <op> 為 =、=?、?= 或 ?=?。

# typeInfoCallsWord
source: Calls
cs: Počet volání
de: Aufrufe
es: Llamadas
fr: Appels
it: Chiamate
ja: 呼び出し
ko: 호출
pl: Wywołania
pt_br: Chamadas
ru: Вызовы
tr: Çağrılar
zh_hans: 调用
zh_hant: 呼叫

# impInvalidNumberOfGenericArguments
source: Invalid number of generic arguments to type '{0}' in provided type. Expected '{1}' arguments, given '{2}'.
cs: Neplatný počet obecných argumentů pro typ {0} u poskytnutého typu. Očekávaný počet argumentů je: {1}, počet předaných je: {2}.
de: Ungültige Anzahl generischer Argumente für Typ '{0}' im angegebenen Typ. Es wurden '{1}' Argumente erwartet, jedoch '{2}' ausgegeben.
es: Número no válido de argumentos genéricos para el tipo '{0}' en el tipo proporcionado. Se esperaban '{1}' argumentos y se proporcionaron '{2}'.
fr: Nombre d'arguments génériques non valide pour le type '{0}' dans le type fourni. '{1}' arguments étaient attendus, '{2}' ont été fournis.
it: Numero di argomenti generici non valido nel tipo '{0}' del tipo fornito. Previsti '{1}' argomenti, specificati '{2}'.
ja: 指定された型で、型 '{0}' に対して渡された汎用引数の数が無効です。適正な引数の数は '{1}' 個ですが、渡されたのは '{2}' 個でした。
ko: 제공된 형식에서 '{0}' 형식에 대한 제네릭 인수의 수가 잘못되었습니다. '{1}'개의 인수가 필요한데 '{2}'개가 제공되었습니다.
pl: Nieprawidłowa liczba ogólnych argumentów typu „{0}” w udostępnionym typie. Oczekiwano następującej liczby argumentów: „{1}”. Podano: „{2}”.
pt_br: Número inválido de argumentos genéricos para o tipo '{0}' no tipo fornecido. '{1}' argumentos esperados, '{2}' recebidos.
ru: Недопустимое число универсальных аргументов для типа "{0}" в предоставленном типе. Ожидалось аргументов: "{1}", задано аргументов: "{2}".
tr: Sağlanan türdeki '{0}' türünde geçersiz sayıda genel bağımsız değişken. '{1}' bağımsız değişken bekleniyordu, '{2}' verildi.
zh_hans: 所提供类型中的类型“{0}”的泛型参数数量无效。应是“{1}”个参数，提供了“{2}”个。
zh_hant: 提供之類型中類型 '{0}' 的泛型引數數目無效。必須是 '{1}' 個引數，但提供了 '{2}' 個。
