Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# etHostingAssemblyFoundWithoutHosts
source: Referenced assembly '{0}' has assembly level attribute '{1}' but no public type provider classes were found
cs: Odkazované sestavení {0} má atribut {1} na úrovní sestavení, ale nenašly se žádné třídy veřejného zprostředkovatele typu.
de: Die referenzierte Assembly '{0}' verfügt über das Attribut '{1}' auf Assemblyebene, es wurden jedoch keine öffentlichen Typanbieterklassen gefunden.
es: El ensamblado '{0}' al que se hace referencia tiene el atributo '{1}' de nivel de ensamblado, pero no se encontró ninguna clase de proveedor de tipos públicos.
fr: L'assembly référencé '{0}' a un attribut de niveau assembly '{1}', mais aucune classe de fournisseur de type publique n'a été trouvée
it: L'assembly '{0}' a cui viene fatto riferimento contiene l'attributo a livello di assembly '{1}' ma non è stata trovata alcuna classe di provider di tipi pubblica
ja: 参照アセンブリ '{0}' にアセンブリ レベル属性 '{1}' が含まれていますが、パブリックな型プロバイダー クラスが見つかりません
ko: 참조된 '{0}' 어셈블리에 어셈블리 수준 특성 '{1}'이(가) 있지만 공용 형식 공급자 클래스는 없습니다.
pl: Zestaw „{0}”, którego dotyczy odwołanie, ma atrybut poziomu zestawu „{1}”, ale nie znaleziono publicznych klas dostawcy typów
pt_br: O assembly referenciado '{0}' possui atributo de nível de assembly '{1}', mas nenhuma classe de provedor de tipos público foi encontrada
ru: Сборка "{0}", на которую указывает ссылка, содержит атрибут уровня сборки "{1}", однако классы поставщика открытых типов не обнаружены
tr: Başvurulan '{0}' bütünleştirilmiş kodunda '{1}' bütünleştirilmiş kod düzeyi özniteliği var ancak hiç ortak tür sağlayıcısı sınıfı bulunamadı
zh_hans: 引用的程序集“{0}”具有程序集级别特性“{1}”，但是找不到任何公共类型提供程序类
zh_hant: 參考的組件 '{0}' 具有組件層級屬性 '{1}'，但找不到公用型別提供者類別

# etEmptyNamespaceOfTypeNotAllowed
source: Type '{0}' from type provider '{1}' has an empty namespace. Use 'null' for the global namespace.
cs: Typ {0} od zprostředkovatele typu {1} má prázdný obor názvů. Pro globální obor názvů použijte null.
de: Typ '{0}' von Typanbieter '{1}' verfügt über einen leeren Namespace. Verwenden Sie für den globalen Namespace 'null'.
es: El tipo '{0}' del proveedor de tipos '{1}' tiene un espacio de nombres vacío. Use 'null' para el espacio de nombres global.
fr: Le type '{0}' du fournisseur de type '{1}' a un espace de noms vide. Utilisez 'null' pour l'espace de noms global.
it: Il tipo '{0}' nel provider di tipi '{1}' contiene uno spazio dei nomi vuoto. Usare 'null' per lo spazio dei nomi globale.
ja: 型プロバイダー '{1}' からの型 '{0}' に空の名前空間が含まれています。グローバル名前空間を表す 'null' を使用してください。
ko: 형식 공급자 '{1}' 의 형식 '{0}'에 빈 네임스페이스가 있습니다. 전역 네임스페이스에 대해 'null'을 사용하세요.
pl: Typ „{0}” od dostawcy typów „{1}” ma pustą przestrzeń nazw. Użyj wartości „null” dla globalnej przestrzeni nazw.
pt_br: O tipo '{0}' do provedor de tipos '{1}' possui um namespace vazio. Use 'null' para o namespace global.
ru: Тип "{0}" поставщика типов "{1}" имеет пустое пространство имен. Используйте null для глобального пространства имен.
tr: {1}' tür sağlayıcısından '{0}' türünün boş ad alanı var. Genel ad alanı için 'null' kullanın.
zh_hans: 来自类型提供程序“{1}”的类型“{0}”具有空命名空间。请将“null”用于全局命名空间。
zh_hant: 型別提供者 '{1}' 中的型別 '{0}' 具有空白命名空間。請將 'null' 用於全域命名空間。

# etEmptyNamespaceNotAllowed
source: Empty namespace found from the type provider '{0}'. Use 'null' for the global namespace.
cs: Našel se prázdný obor názvů od zprostředkovatele typu {0}. Pro globální obor názvů použijte null.
de: Leerer Namespace gefunden von Typanbieter '{0}'. Verwenden Sie für den globalen Namespace 'null'.
es: Se encontró un espacio de nombres vacío desde el proveedor de tipos '{0}'. Use 'null' para el espacio de nombres global.
fr: Un nom d'espace vide a été trouvé par le fournisseur de type '{0}'. Utilisez 'null' pour l'espace de noms global.
it: Spazio dei nomi vuoto trovato nel provider di tipi '{0}'. Utilizzare 'null' per lo spazio dei nomi globale.
ja: 型プロバイダー '{0}' に空の名前空間が見つかりました。グローバル名前空間を表す 'null' を使用してください。
ko: 형식 공급자 '{0}'에 빈 네임스페이스가 있습니다. 전역 네임스페이스에 대해 'null'을 사용하세요.
pl: Znaleziono pustą przestrzeń nazw od dostawcy typów „{0}”. Użyj wartości „null” dla globalnej przestrzeni nazw.
pt_br: Namespace vazio encontrado do provedor de tipos '{0}'. Use 'null' para o namespace global.
ru: У поставщика типов "{0}" обнаружено пустое пространство имен. Используйте null для глобального пространства имен.
tr: '{0}' tür sağlayıcısından boş ad alanı bulundu. Genel ad alanı için 'null' kullanın.
zh_hans: 在类型提供程序“{0}”中发现空命名空间。请将“null”用于全局命名空间。
zh_hant: 在型別提供者 '{0}' 中找到空白命名空間。請將 'null' 用於全域命名空間。

# etMustNotBeGeneric
source: Provided type '{0}' has 'IsGenericType' as true, but generic types are not supported.
cs: Vlastnost IsGenericType poskytnutého typu {0} má hodnotu true. Obecné typy se ale nepodporují.
de: Für den angegebenen Typ '{0}' ist 'IsGenericType' auf true festgelegt, es werden jedoch keine generischen Typen unterstützt.
es: El tipo '{0}' proporcionado tiene 'IsGenericType' establecido como true, pero no se admiten los tipos genéricos.
fr: 'IsGenericType' a la valeur True pour le type fourni '{0}', mais les types génériques ne sont pas pris en charge.
it: Nel tipo fornito '{0}' 'IsGenericType' è impostato su true, ma i tipi generici non sono supportati.
ja: 指定された型 '{0}' で 'IsGenericType' が true になっていますが、ジェネリック型はサポートされていません。
ko: 제공된 '{0}' 형식의 'IsGenericType'이 true인데 제네릭 형식이 지원되지 않습니다.
pl: Udostępniony typ „{0}” ma właściwość „IsGenericType” o wartości true, ale typy ogólne nie są obsługiwane.
pt_br: O tipo fornecido '{0}' possui 'IsGenericType' como verdadeiro, mas não há suporte a tipos genéricos.
ru: Предоставленный тип "{0}" имеет свойство IsGenericType, равное true, однако универсальные типы не поддерживаются.
tr: '{0}' sağlanan türünde 'IsGenericType' true olarak mevcut, ancak genel türler desteklenmiyor.
zh_hans: 所提供的类型“{0}”的“IsGenericType”为 true，但是不支持泛型类型。
zh_hant: 提供之類型 '{0}' 的 'IsGenericType' 為 true，但不支援泛型類型。

# etMustNotBeAnArray
source: Provided type '{0}' has 'IsArray' as true, but array types are not supported.
cs: Vlastnost IsArray poskytnutého typu {0} má hodnotu true. Typy polí se ale nepodporují.
de: Für den angegebenen Typ '{0}' ist 'IsArray' auf true festgelegt, es werden jedoch keine Arraytypen unterstützt.
es: El tipo '{0}' proporcionado tiene 'IsArray' establecido como true, pero no se admiten los tipos de matriz.
fr: 'IsArray' a la valeur True pour le type fourni '{0}', mais les types de tableau ne sont pas pris en charge.
it: Nel tipo fornito '{0}' 'IsArray' è impostato su true, ma i tipi matrice non sono supportati.
ja: 指定された型 '{0}' で 'IsArray' が true になっていますが、配列型はサポートされていません。
ko: 제공된 '{0}' 형식의 'IsArray'가 true인데 배열 형식이 지원되지 않습니다.
pl: Udostępniony typ „{0}” ma właściwość „IsArray” o wartości true, ale typy tablicy nie są obsługiwane.
pt_br: O tipo fornecido '{0}' possui 'IsArray' como verdadeiro, mas não há suporte a tipos matriz.
ru: Предоставленный тип "{0}" имеет свойство IsArray, равное true, однако типы массивов не поддерживаются.
tr: '{0}' sağlanan türünde 'IsArray' true olarak mevcut, ancak dizi türleri desteklenmiyor.
zh_hans: 所提供的类型“{0}”的“IsArray”为 true，但是不支持数组类型。
zh_hant: 提供之類型 '{0}' 的 'IsArray' 為 true，但不支援陣列類型。

# etMethodHasRequirements
source: Invalid member '{0}' on provided type '{1}'. Provided type members must be public, and not be generic, virtual, or abstract.
cs: Neplatný člen {0} u poskytnutého typu {1}. Členové poskytnutého typu musí být veřejné,ne obecné, virtuální nebo abstraktní.
de: Ungültiger Member '{0}' für Anbietertyp '{1}'. Die angegebenen Typmember müssen öffentlich, nicht jedoch generisch, virtuell oder abstrakt sein.
es: Miembro '{0}' no válido en el tipo '{1}' proporcionado. Los miembros de tipo proporcionados deben ser públicos y no genéricos, virtuales o abstractos.
fr: Membre '{0}' non valide sur le type fourni '{1}'. Les membres de type fourni doivent être publics et non pas génériques, virtuels ou abstraits.
it: Membro '{0}' non valido nel tipo fornito '{1}'. I membri dei tipi forniti devono essere pubblici e non generici, virtuali o astratti.
ja: 指定された型 '{1}' に無効なメンバー '{0}' が含まれています。指定された型のメンバーはパブリックである必要があり、汎用メンバー、仮想メンバー、および抽象メンバーは無効です。
ko: 제공된 '{1}' 형식에 잘못된 멤버('{0}')가 있습니다. 제공된 형식 멤버는 공용이어야 하며 제네릭, 가상 또는 추상 멤버여서는 안 됩니다.
pl: Nieprawidłowy element członkowski „{0}” w udostępnionym typie „{1}”. Elementy członkowskie udostępnionego typu muszą być publiczne, a nie ogólne, wirtualne lub abstrakcyjne.
pt_br: Membro inválido '{0}' no tipo fornecido '{1}'. Os membros do tipo fornecido devem ser públicos, e não genéricos, virtuais ou abstratos.
ru: Недопустимый элемент "{0}" предоставленного типа "{1}". Элементы предоставленного типа должны быть открытыми, а не универсальными, виртуальными или абстрактными.
tr: {1}' sağlanan türünde geçersiz '{0}' üyesi. Sağlanan tür üyeleri genel, sanal veya soyut değil ortak olmalıdır.
zh_hans: 所提供的类型“{1}”的成员“{0}”无效。所提供类型的成员必须是公共成员，而不是泛型、虚拟或抽象成员。
zh_hant: 提供之類型 '{1}' 上的成員 '{0}' 無效。提供之類型成員必須是公用，而不是泛型、虛擬或抽象。

# etUnsupportedMemberKind
source: Invalid member '{0}' on provided type '{1}'. Only properties, methods and constructors are allowed
cs: Neplatný člen {0} u poskytnutého typu {1}. Povolují se jenom vlastnosti, metody a konstruktory.
de: Ungültiger Member '{0}' für Anbietertyp '{1}'. Es sind nur Eigenschaften, Methoden und Konstruktoren zulässig.
es: Miembro '{0}' no válido en el tipo '{1}' proporcionado. Solamente se admiten propiedades, métodos y constructores.
fr: Membre non valide '{0}' sur le type fourni '{1}'. Seuls les propriétés, les méthodes et les constructeurs sont autorisés
it: Membro '{0}' non valido nel tipo fornito '{1}'. Sono consentiti solo costruttori, metodi e proprietà.
ja: 指定された型 '{1}' のメンバー '{0}' が無効です。許容されるのは、プロパティ、メソッド、およびコンストラクターのみです
ko: 제공된 형식 '{1}'의 '{0}' 멤버가 잘못되었습니다. 속성, 메서드 및 생성자만 허용됩니다.
pl: Nieprawidłowy element członkowski „{0}” w udostępnionym typie „{1}”. Dozwolone są tylko właściwości, metody i konstruktory
pt_br: Membro inválido '{0}' no tipo fornecido '{1}'. Somente propriedades, métodos e construtores são permitidos
ru: Недопустимый элемент "{0}" предоставленного типа "{1}". Разрешены только свойства, методы и конструкторы
tr: {1}' sağlanan türünde geçersiz '{0}' üyesi. Yalnızca özelliklere, metotlara ve oluşturuculara izin verilir
zh_hans: 所提供类型“{1}”的成员“{0}”无效。仅允许使用属性、方法和构造函数
zh_hant: 提供之類型 '{1}' 上的成員 '{0}' 無效。只允許屬性、方法和建構函式

# etPropertyCanReadButHasNoGetter
source: Property '{0}' on provided type '{1}' has CanRead=true but there was no value from GetGetMethod()
cs: Vlastnost {0} u poskytnutého typu {1} má CanRead s hodnotou true, ale metoda GetGetMethod() nevrátila žádnou hodnotu.
de: Die '{0}'-Eigenschaft des angegebenen Typs '{1}' ist auf CanRead=true festgelegt, es gab jedoch keinen Wert von GetGetMethod().
es: La propiedad '{0}' del tipo '{1}' proporcionado tiene el valor CanRead=true, pero no se encontró ningún valor de GetGetMethod().
fr: La propriété '{0}' sur le type fourni '{1}' a CanRead=true, mais aucune valeur n'a été retournée par GetGetMethod()
it: La proprietà '{0}' nel tipo fornito '{1}' contiene CanRead=true ma non era presente alcun valore da GetGetMethod()
ja: 指定された型 '{1}' のプロパティ '{0}' で CanRead=true となっていますが、GetGetMethod() からの値が存在しません
ko: 제공된 '{1}' 형식의 '{0}' 속성에서 CanRead=true인데 GetGetMethod()의 값이 없습니다.
pl: Właściwość „{0}” w udostępnionym typie „{1}” ma właściwość CanRead=true, ale brakuje wartości z metody GetGetMethod()
pt_br: A propriedade '{0}' no tipo fornecido '{1}' possui CanRead=true, mas não houve valor de GetGetMethod()
ru: У свойства "{0}" предоставленного типа "{1}" CanRead=true, однако значение GetGetMethod() не получено
tr: {1}' sağlanan türündeki '{0}' özelliğinde CanRead=true var, ancak GetGetMethod() yönteminden bir değer yok
zh_hans: 所提供的类型“{1}”的属性“{0}”的 CanRead 为 true，但是没有来自 GetGetMethod() 的值
zh_hant: 提供之類型 '{1}' 上的屬性 '{0}' 具有 CanRead=true，但沒有來自 GetGetMethod() 的值

# etPropertyHasGetterButNoCanRead
source: Property '{0}' on provided type '{1}' has CanRead=false but GetGetMethod() returned a method
cs: Vlastnost {0} u poskytnutého typu {1} má CanRead s hodnotou false, ale metoda GetGetMethod() vrátila metodu.
de: Die '{0}'-Eigenschaft des angegebenen Typs '{1}' ist auf CanRead=false festgelegt, GetGetMethod() hat jedoch eine Methode zurückgegeben.
es: La propiedad '{0}' del tipo '{1}' proporcionado tiene el valor CanRead=false, pero GetGetMethod() devolvió un método.
fr: La propriété '{0}' sur le type fourni '{1}' a CanRead=false, mais GetGetMethod() a retourné une méthode
it: La proprietà '{0}' nel tipo fornito '{1}' contiene CanRead=false ma GetGetMethod() ha restituito un metodo
ja: 指定された型 '{1}' のプロパティ '{0}' で CanRead=false となっていますが、GetGetMethod() がメソッドを返しました
ko: 제공된 '{1}' 형식의 '{0}' 속성에서 CanRead=false인데 GetGetMethod()에서 메서드를 반환했습니다.
pl: Właściwość „{0}” w udostępnionym typie „{1}” ma właściwość CanRead=false, ale metoda GetGetMethod() zwróciła metodę
pt_br: A propriedade '{0}' no tipo fornecido '{1}' possui CanRead=false, mas GetGetMethod() retornou um método
ru: У свойства "{0}" предоставленного типа "{1}" CanRead=false, но метод GetGetMethod() вернул метод
tr: {1}' sağlanan türündeki '{0}' özelliğinde CanRead=false var, ancak GetGetMethod() metodu bir metot döndürdü
zh_hans: 所提供的类型“{1}”的属性“{0}”的 CanRead 为 false，但是 GetGetMethod() 返回了方法
zh_hant: 提供之類型 '{1}' 上的屬性 '{0}' 具有 CanRead=false，但 GetGetMethod() 傳回了方法

# etPropertyCanWriteButHasNoSetter
source: Property '{0}' on provided type '{1}' has CanWrite=true but there was no value from GetSetMethod()
cs: Vlastnost {0} u poskytnutého typu {1} má CanWrite s hodnotou true, ale metoda GetSetMethod() nevrátila žádnou hodnotu.
de: Die '{0}'-Eigenschaft des angegebenen Typs '{1}' ist auf CanWrite=true festgelegt, es gab jedoch keinen Wert von GetSetMethod().
es: La propiedad '{0}' del tipo '{1}' proporcionado tiene el valor CanWrite=true, pero no se encontró ningún valor de GetSetMethod().
fr: La propriété '{0}' sur le type fourni '{1}' a CanWrite=true, mais aucune valeur n'a été retournée par GetSetMethod()
it: La proprietà '{0}' nel tipo fornito '{1}' contiene CanWrite=true ma non era presente alcun valore da GetSetMethod()
ja: 指定された型 '{1}' のプロパティ '{0}' で CanWrite=true となっていますが、GetSetMethod() からの値が存在しません
ko: 제공된 '{1}' 형식의 '{0}' 속성에서 CanWrite=true인데 GetSetMethod()의 값이 없습니다.
pl: Właściwość „{0}” w udostępnionym typie „{1}” ma właściwość CanWrite=true, ale brakuje wartości z metody GetSetMethod()
pt_br: A propriedade '{0}' no tipo fornecido '{1}' possui CanWrite=true, mas não houve valor de GetSetMethod()
ru: У свойства "{0}" предоставленного типа "{1}" CanWrite=true, однако значение GetSetMethod() не получено
tr: {1}' sağlanan türündeki '{0}' özelliğinde CanWrite=true var, ancak GetSetMethod() yönteminden bir değer yok
zh_hans: 所提供的类型“{1}”的属性“{0}”的 CanWrite 为 true，但是没有来自 GetSetMethod() 的值
zh_hant: 提供之類型 '{1}' 上的屬性 '{0}' 具有 CanWrite=true，但沒有來自 GetSetMethod() 的值

# etPropertyHasSetterButNoCanWrite
source: Property '{0}' on provided type '{1}' has CanWrite=false but GetSetMethod() returned a method
cs: Vlastnost {0} u poskytnutého typu {1} má CanWrite s hodnotou false, ale metoda GetSetMethod() vrátila metodu.
de: Die '{0}'-Eigenschaft des angegebenen Typs '{1}' ist auf CanWrite=false festgelegt, GetSetMethod() hat jedoch eine Methode zurückgegeben.
es: La propiedad '{0}' del tipo '{1}' proporcionado tiene el valor CanWrite=false, pero GetSetMethod() devolvió un método.
fr: La propriété '{0}' sur le type fourni '{1}' a CanWrite=false, mais GetSetMethod() a retourné une méthode
it: La proprietà '{0}' nel tipo fornito '{1}' contiene CanWrite=false ma GetSetMethod() ha restituito un metodo
ja: 指定された型 '{1}' のプロパティ '{0}' で CanWrite=false となっていますが、GetSetMethod() がメソッドを返しました
ko: 제공된 '{1}' 형식의 '{0}' 속성에서 CanWrite=fa인데 GetSetMethod()에서 메서드를 반환했습니다.
pl: Właściwość „{0}” w udostępnionym typie „{1}” ma właściwość CanWrite=false, ale metoda GetSetMethod() zwróciła metodę
pt_br: A propriedade '{0}' no tipo fornecido '{1}' possui CanWrite=false, mas GetSetMethod() retornou um método
ru: У свойства "{0}" предоставленного типа "{1}" CanWrite=false, но метод GetSetMethod() вернул метод
tr: {1}' sağlanan türündeki '{0}' özelliğinde CanWrite=false var, ancak GetSetMethod() metodu bir metot döndürdü
zh_hans: 所提供的类型“{1}”的属性“{0}”的 CanWrite 为 false，但是 GetSetMethod() 返回了方法
zh_hant: 提供之類型 '{1}' 上的屬性 '{0}' 具有 CanWrite=false，但 GetSetMethod() 傳回了方法

# etOneOrMoreErrorsSeenDuringExtensionTypeSetting
source: One or more errors seen during provided type setup
cs: Při nastavení poskytnutého typu se vyskytla nejmíň jedna chyba.
de: Beim Setup des angegebenen Typs ist mindestens ein Fehler aufgetreten.
es: Se encontraron uno o varios errores durante la configuración del tipo proporcionado.
fr: Une ou plusieurs erreurs se sont produites pendant la configuration du type fourni
it: Uno o più errori visualizzati durante l'impostazione del tipo fornito
ja: 指定された型のセットアップ中にエラーが発生しました
ko: 제공된 형식을 설정하는 동안 하나 이상의 오류가 확인되었습니다.
pl: Podczas konfigurowania udostępnionych typów napotkano co najmniej jeden błąd
pt_br: Um ou mais erros observados durante a configuração de tipo fornecida
ru: При настройке предоставленного типа были обнаружены одна или более ошибок
tr: Sağlanan tür ayarları sırasında bir veya daha fazla hata görüldü
zh_hans: 在所提供的类型的设置过程中出现了一个或多个错误
zh_hant: 在設定提供的類型期間已發生一或多個錯誤

# etUnexpectedExceptionFromProvidedTypeMember
source: Unexpected exception from provided type '{0}' member '{1}': {2}
cs: U poskytnutého typu {0}, člena {1} došlo k neočekávané výjimce: {2}
de: Unerwartete Ausnahme vom angegebenen Typ '{0}' Member '{1}': {2}
es: Excepción inesperada del tipo '{0}' proporcionado, miembro '{1}': {2}.
fr: Exception inattendue levée par le type fourni '{0}', membre '{1}' : {2}
it: Eccezione imprevista dal tipo fornito '{0}' membro '{1}': {2}
ja: 指定された型 '{0}' のメンバー '{1}' で予期しない例外が発生しました: {2}
ko: 제공된 형식 '{0}' 멤버 '{1}'에서 예기치 않은 예외가 발생했습니다. {2}
pl: Nieoczekiwany wyjątek udostępnionego typu „{0}”. Element członkowski: „{1}”: {2}
pt_br: Exceção inesperada do membro '{1}' do tipo fornecido '{0}': {2}
ru: Непредвиденное исключение, полученное из элемента "{1}" предоставленного типа "{0}": {2}
tr: {0}' sağlanan türü '{1}' üyesinden beklenmeyen özel durum: {2}
zh_hans: 在所提供类型“{0}”成员“{1}”中发生意外异常: {2}
zh_hant: 提供之類型 '{0}' 成員 '{1}' 發生未預期的例外狀況: {2}

# etUnsupportedConstantType
source: Unsupported constant type '{0}'. Quotations provided by type providers can only contain simple constants. The implementation of the type provider may need to be adjusted by moving a value declared outside a provided quotation literal to be a 'let' binding inside the quotation literal.
cs: Nepodporovaný typ konstanty {0}. Citace poskytované zprostředkovateli typu můžou obsahovat jenom jednoduché konstanty. Implementaci zprostředkovatele typu možná bude potřeba upravit přesunutím hodnoty deklarované mimo poskytnutý literál citace do vazby let v literálu citace.
de: Nicht unterstützter Konstantentyp "{0}". Vom Typanbieter bereitgestellte Quotations dürfen nur einfache Konstanten enthalten. Die Implementierung des Typanbieters muss unter Umständen angepasst werden, indem ein Wert, der außerhalb eines bereitgestellten Quotation-Literals daklariert wird, mittels Verschieben in eine let-Bindung innerhalb eines Quotation-Literals umgewandelt wird.
es: Tipo de constante '{0}' no admitido. Las expresiones de código delimitadas que los proveedores de tipos proporcionan solo pueden contener constantes simples. Puede que sea necesario mover un valor declarado fuera de un literal de expresión de código delimitada para ser un enlace "let" dentro del literal indicado y ajustar así la implementación del proveedor de tipos.
fr: Type de constante '{0}' non pris en charge. Les quotations fournies par les fournisseurs de type peuvent uniquement contenir des constantes simples. L'implémentation du fournisseur de type peut nécessiter un ajustement consistant à remplacer une valeur déclarée en dehors d'un littéral de quotation fourni par une liaison 'let' au sein du littéral de quotation.
it: Il tipo di costante '{0}' non è supportato. Le quotation fornite da provider di tipi possono contenere solo costanti semplici. Potrebbe essere necessario modificare l'implementazione del provider di tipi spostando un valore dichiarato all'esterno di un valore letterale di tipo quotation in modo che sia un binding 'let' all'interno del valore letterale di tipo quotation.
ja: サポートされない定数型 '{0}'。型プロバイダーで提供される引用に含められるのは単純定数のみです。型プロバイダーの実装は、指定された引用リテラル外部で宣言された値を移動して、引用リテラル内部の 'let' バインドにすることによって調整することが必要な場合があります。
ko: 지원되지 않는 상수 형식 '{0}'입니다. 형식 공급자가 제공하는 인용에는 간단한 상수만 포함될 수 있습니다. 인용구 리터럴 내에서 'let' 바인딩이 되려면 선언된 값을 제공된 인용구 리터럴 밖으로 이동시켜 형식 공급자의 구현을 조정해야 합니다.
pl: Nieobsługiwany typ stałej „{0}”. Cytowania udostępniane przez dostawców typu mogą zawierać tylko proste stałe. Implementacja dostawcy typu może wymagać dostosowania przez przeniesienie wartości zadeklarowanej poza udostępnionym literałem cytowania w celu utworzenia powiązania typu „let” wewnątrz literału cytowania.
pt_br: Tipo da constante sem suporte '{0}'. Citações fornecidas pelos provedores de tipo só podem conter constantes simples. A implementação do provedor do tipo talvez precise ser ajustada movendo um valor declarado para fora de um literal de citação fornecido para que seja uma associação 'let' dentro do literal de citação.
ru: Неподдерживаемый тип константы "{0}". Цитирования, предоставляемые поставщиками типов, могут содержать только простые константы. Может потребоваться изменить реализацию поставщика типов, переместив значение, объявленное вне предоставленного литерала цитирования, в литерал цитирования с привязкой let.
tr: Desteklenmeyen sabit türü '{0}'. Tür sağlayıcıları tarafından sağlanan alıntılar yalnızca basit sabitler içerebilir. Tür sağlayıcısı uygulamasının; sağlanmış alıntı sabit değerinin dışında bildirilen bir değer, alıntı sabit değerinin içindeki bir 'let' bağlaması olacak şekilde taşınarak ayarlanması gerekebilir.
zh_hans: 不支持的常数类型“{0}”。类型提供程序提供的引文只能包含简单常量。将提供的引文文本外声明的值移动为引文文本内的 "let" 绑定，可对类型提供程序的实现进行调整。
zh_hant: 不支援的常數類型 '{0}'。型別提供者所提供的引號只能包含簡單的常數。實作型別提供者可能需要調整，方法是將在提供的引號外宣告的值移為引號常值內的 'let' 繫結。
