Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSComp.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# fscQuotationLiteralsStaticLinking
source: The code in assembly '{0}' makes uses of quotation literals. Static linking may not include components that make use of quotation literals unless all assemblies are compiled with at least F# 4.0.
cs: Kód v sestavení {0} využívá literály citace. Je možné, že při statickém propojování se komponenty využívající literály citace nezahrnou, pokud nejsou všechna sestavení zkompilovaná v F# ve verzi alespoň 4.0.
de: Der Code in der Assembly "{0}" verwendet Quotation-Literale. Statische Verknüpfungen schließen unter Umständen Komponenten nicht ein, die Quotation-Literale verwenden, sofern nicht alle Assemblys mindestens mit F# 4.0 kompiliert sind.
es: El código del ensamblado "{0}" usa literales de expresiones de código delimitadas. La vinculación estática no puede incluir componentes que usen literales de expresiones de código delimitadas, a menos que todos los ensamblados se hayan compilado, como mínimo, con F# 4.0.
fr: Le code dans l'assembly '{0}' utilise des littéraux de citation. La liaison statique risque de ne pas inclure les composants qui utilisent des littéraux de citation, sauf si tous les assemblys sont compilés avec au moins F# 4.0.
it: Il codice nell'assembly '{0}' usa valori letterali di quotation. Il collegamento statico non può includere componenti che usano valori letterali di quotation a meno che tutti gli assembly non siano compilati con almeno F# 4.0.
ja: アセンブリ '{0}' 内のコードで引用符リテラルが使用されています。静的リンクでは、F# 4.0 以上ですべてのアセンブリがコンパイルされる場合を除き、引用符リテラルを使用するコンポーネントがインクルードされない可能性があります。
ko: 어셈블리 '{0}'의 코드에서 따옴표로 묶인 리터럴을 사용합니다. 정적 링크에서는 모든 어셈블리가 최소 F# 4.0으로 컴파일된 경우가 아니라면 따옴표로 묶인 리터럴을 사용하는 구성 요소를 포함할 수 없습니다.
pl: Kod w zestawie „{0}” używa literałów cytatu. Statyczne połączenie nie może obejmować składników, które używają literałów cytatu, chyba że wszystkie zestawy są kompilowane przy użyciu języka F# w wersji co najmniej 4.0.
pt_br: O código no assembly '{0}' usa literais de cotação. A vinculação estática pode não incluir componentes que usam literais de cotação, a menos que todos os assemblies estejam compilados com, pelo menos, F# 4.0.
ru: В коде сборки "{0}" используются литералы кавычек. При статическом связывании компоненты, использующие литералы кавычек, могут быть не включены, если все сборки не скомпилированы в версии F# не ниже 4.0.
tr: '{0}' bütünleştirilmiş kodundaki kod tırnak içinde sabit değerler kullanıyor. Bütün bütünleştirilmiş kodlar en az F# 4.0 ile derlenmediği sürece, statik bağlama tırnak içinde sabit değerler kullanan bileşenler içeremez.
zh_hans: 程序集“{0}”中的代码使用了引用文本。静态链接可能不包含使用引用文本的组件，除非所有程序集都使用至少 F# 4.0 进行编译。
zh_hant: 組件 '{0}' 中的程式碼使用了引號常值。除非所有組件都使用 F# 4.0 (含) 以上的版本編譯，否則靜態連結不會包含使用引號常值的元件。

# fscQuotationLiteralsStaticLinking0
source: Code in this assembly makes uses of quotation literals. Static linking may not include components that make use of quotation literals unless all assemblies are compiled with at least F# 4.0.
cs: Kód v tomto sestavení využívá literály citace. Je možné, že při statickém propojování se komponenty využívající literály citace nezahrnou, pokud nejsou všechna sestavení zkompilovaná v F# ve verzi alespoň 4.0.
de: Der Code in dieser Assembly verwendet Quotation-Literale. Statische Verknüpfungen schließen unter Umständen Komponenten nicht ein, die Quotation-Literale verwenden, sofern nicht alle Assemblys mindestens mit F# 4.0 kompiliert sind.
es: El código de este ensamblado usa literales de expresiones de código delimitadas. La vinculación estática no puede incluir componentes que usen literales de expresiones de código delimitadas, a menos que todos los ensamblados se hayan compilado, como mínimo, con F# 4.0.
fr: Le code dans cet assembly utilise des littéraux de citation. La liaison statique risque de ne pas inclure les composants qui utilisent des littéraux de citation, sauf si tous les assemblys sont compilés avec au moins F# 4.0.
it: Il codice in questo assembly usa valori letterali di quotation. Il collegamento statico non può includere componenti che usano valori letterali di quotation a meno che tutti gli assembly non siano compilati con almeno F# 4.0.
ja: このアセンブリ内のコードでは引用符リテラルが使用されています。静的リンクでは、F# 4.0 以上ですべてのアセンブリがコンパイルされる場合を除き、引用符リテラルを使用するコンポーネントがインクルードされない可能性があります。
ko: 이 어셈블리의 코드에서 따옴표로 묶인 리터럴을 사용합니다. 정적 링크에서는 모든 어셈블리가 최소 F# 4.0으로 컴파일된 경우가 아니라면 따옴표로 묶인 리터럴을 사용하는 구성 요소를 포함할 수 없습니다.
pl: Kod w tym zestawie używa literałów cytatu. Statyczne połączenie nie może obejmować składników, które używają literałów cytatu, chyba że wszystkie zestawy są kompilowane przy użyciu języka F# w wersji co najmniej 4.0.
pt_br: O código neste assembly usa literais de cotação. A vinculação estática pode não incluir componentes que usam literais de cotação, a menos que todos os assemblies estejam compilados com, pelo menos, F# 4.0.
ru: В коде этой сборки используются литералы кавычек. При статическом связывании компоненты, использующие литералы кавычек, могут быть не включены, если все сборки не скомпилированы в версии F# не ниже 4.0.
tr: Bu bütünleştirilmiş kod tırnak içinde sabit değerler kullanıyor. Tüm bütünleştirilmiş kodlar en az F# 4.0 ile derlenmediği sürece, statik bağlama tırnak içinde sabit değerler kullanan bileşenler içeremez.
zh_hans: 此程序集中的代码使用了引用文本。静态链接可能不包含使用引用文本的组件，除非所有程序集都使用至少 F# 4.0 进行编译。
zh_hant: 此組件中的程式碼使用引號常值。除非所有組件都使用 F# 4.0 (含) 以上的版本編譯，否則靜態連結不得包含使用引號常值的元件。

# fscStaticLinkingNoEXE
source: Static linking may not include a .EXE
cs: Je možné, že se při statickém propojování nezahrne soubor .exe.
de: Die statische Verknüpfung darf keine EXE-Datei einschließen.
es: La vinculación estática no puede incluir un archivo .EXE.
fr: La liaison statique ne peut pas inclure de fichier .EXE
it: Il collegamento statico non può includere un .EXE
ja: 静的リンクでは、.EXE がインクルードされない可能性があります
ko: 정적 링크에는 .EXE를 포함할 수 없습니다.
pl: Łączenie statyczne nie może obejmować pliku EXE
pt_br: A vinculação estática pode não incluir um .EXE
ru: Статическое связывание может не включать EXE-файл
tr: Statik bağlama .EXE içeremez
zh_hans: 静态链接不能包含 .EXE
zh_hant: 靜態連結不可包含 .EXE

# fscStaticLinkingNoMixedDLL
source: Static linking may not include a mixed managed/unmanaged DLL
cs: Je možné, že se při statickém propojování nezahrne kombinovaná spravovaná nebo nespravovaná knihovna DLL.
de: Eine statische Verknüpfung darf eine gemischte verwaltete/nicht verwaltete DLL nicht einschließen.
es: La vinculación estática no puede incluir un archivo DLL mixto administrado o no administrado.
fr: La liaison statique ne peut pas inclure une DLL mixte managée/non managée
it: Il collegamento dinamico non può includere una DLL mista gestita/non gestita
ja: 静的リンクでは、混合マネージ/アンマネージ DLL がインクルードされない可能性があります
ko: 정적 링크에는 관리되는/관리되지 않는 형식이 혼합된 DLL을 포함할 수 없습니다.
pl: Statyczne łączenie nie może obejmować mieszanej biblioteki zarządzanej/niezarządzanej DLL
pt_br: A vinculação estática pode não incluir uma DLL gerenciada/não gerenciada mista
ru: Статическое связывание может не включать DLL-файл смешанного (управляемого и неуправляемого) типа
tr: Statik bağlama karışık bir yönetilen/yönetilmeyen DLL içeremez
zh_hans: 静态链接不能包含混合的托管/非托管 DLL
zh_hant: 靜態連結不可包含混合的 Managed/Unmanaged DLL

# fscIgnoringMixedWhenLinking
source: Ignoring mixed managed/unmanaged assembly '{0}' during static linking
cs: Při statickém propojování se ignoruje kombinované spravované nebo nespravované sestavení {0}.
de: Die gemischte verwaltete/nicht verwaltete Assembly '{0}' wird während der statischen Verknüpfung ignoriert.
es: Se omitirá el ensamblado mixto administrado o no administrado '{0}' durante la vinculación estática.
fr: L'assembly mixte managé/non managé '{0}' est ignoré lors de la liaison statique
it: L'assembly misto gestito/non gestito '{0}' verrà ignorato durante il collegamento statico
ja: 静的リンク中に混合マネージド/アンマネージド アセンブリ '{0}' を無視しています
ko: 정적 링크 중에 관리되는/관리되지 않는 어셈블리가 혼합된 '{0}'을(를) 무시합니다.
pl: Ignorowanie mieszanego zestawu zarządzanego/niezarządzanego „{0}” podczas statycznego łączenia
pt_br: Ignorando assembly gerenciado/não gerenciado misto '{0}' durante vinculação estática
ru: Игнорирование сборки смешанного (управляемого и неуправляемого) типа "{0}" во время статического связывания
tr: Yönetilen/yönetilmeyen karışık '{0}' bütünleştirilmiş kodu statik bağlama sırasında yok sayılıyor
zh_hans: 在静态链接期间忽略混合托管/非托管程序集“{0}”
zh_hant: 在靜態連結期間忽略混合的受控/非受控組件 '{0}'

# fscAssumeStaticLinkContainsNoDependencies
source: Assembly '{0}' was referenced transitively and the assembly could not be resolved automatically. Static linking will assume this DLL has no dependencies on the F# library or other statically linked DLLs. Consider adding an explicit reference to this DLL.
cs: Na sestavení {0} se odkazovalo přechodně a nedalo se přeložit automaticky. Statické propojování bude předpokládat, že tato knihovna DLL nemá žádné závislosti na knihovně F# nebo jiných staticky propojených knihovnách DLL. Zvažte možnost přidat explicitní odkaz na tuto knihovnu DLL.
de: Auf die Assembly '{0}' wurde transitiv verwiesen, und sie konnte nicht automatisch aufgelöst werden. Bei einer statischen Verknüpfung wird davon ausgegangen, dass diese DLL keine Abhängigkeiten in der F#-Bibliothek oder anderen statisch verknüpften DLLs aufweist. Fügen Sie dieser DLL einen expliziten Verweis hinzu.
es: Se hizo referencia al ensamblado '{0}' de forma transitiva y no se pudo resolver automáticamente. La vinculación estática asumirá que este archivo DLL no tiene dependencias de la biblioteca de F# u otros archivos DLL vinculados de forma estática. Considere agregar una referencia explícita a este archivo DLL.
fr: L'assembly '{0}' a été référencé transitivement et n'a pas pu être résolu automatiquement. La liaison statique suppose que cette DLL n'a pas de dépendances par rapport à la bibliothèque F# ou toute autre DLL liée de manière statique. Ajoutez une référence explicite à cette DLL.
it: All'assembly '{0}' viene fatto riferimento in modo transitivo e non è stato possibile risolvere l'assembly automaticamente. Ai fini del collegamento statico si presuppone che la DLL non abbia dipendenze nella libreria F# o in altre DLL collegate in modo statico. Provare ad aggiungere un riferimento esplicito alla DLL.
ja: アセンブリ '{0}' は推移的に参照され、このアセンブリを自動的に解決できませんでした。静的リンクでは、この DLL に F# ライブラリ上またはその他の静的にリンクされた DLL 上の依存関係がないと見なされます。この DLL に明示的な参照を追加することを検討してください。
ko: 어셈블리 '{0}'이(가) 타동적으로 참조되었으며 어셈블리를 자동으로 확인할 수 없습니다. 정적 링크에서는 이 DLL에 F# 라이브러리나 다른 정적 링크 DLL에 대한 종속성이 없다고 가정합니다. 이 DLL에 대한 명시적 참조를 추가하는 것이 좋습니다.
pl: Do zestawu „{0}” wystąpiło odwołanie przechodnie i nie można automatycznie rozpoznać zestawu. W przypadku statycznego łączenia zostanie przyjęte, że ta biblioteka DLL nie ma żadnych zależności od biblioteki języka F# lub innych statycznie połączonych bibliotek DLL. Rozważ dodanie jawnego odwołania do tej biblioteki DLL.
pt_br: O assembly '{0}' foi referenciado transitivamente e o assembly não pôde ser resolvido automaticamente. A vinculação estática assumirá que esta DLL não possui dependências na biblioteca F# ou outras DLLs vinculadas estaticamente. Considere adicionar uma referência explícita a esta DLL.
ru: Ссылка на сборку "{0}" была задана транзитивно, поэтому автоматически разрешить сборку не удалось. При статическом связывании предполагается, что у этого DLL-файла нет зависимостей от библиотеки F# или других DLL-файлов со статическим связыванием. Попробуйте добавить явную ссылку на этот DLL-файл.
tr: '{0}' bütünleştirilmiş koduna geçişli olarak başvuruldu ve bütünleştirilmiş kod otomatik olarak çözümlenemedi. Statik bağlantı, bu DLL'nin F# kitaplığına veya statik bağlanmış diğer DLL'lere hiçbir bağımlılığı olmadığını kabul eder. Bu DLL'ye açık başvuru eklemeyi düşünün.
zh_hans: 已通过可传递的方式引用程序集“{0}”，但未能自动解析此程序集。静态链接将假定此 DLL 不依赖于 F# 库或其他静态链接的 DLL。请考虑添加对此 DLL 的显式引用。
zh_hant: 組件 '{0}' 是以可轉移方式被參考，而且此組件無法自動解析。靜態連結會假設這個 DLL 在 F# 程式庫或其他以靜態方式連結的 DLL 上沒有相依性。請考慮加入這個 DLL 的明確參考。

# fscAssemblyNotFoundInDependencySet
source: Assembly '{0}' not found in dependency set of target binary. Statically linked roots should be specified using an assembly name, without a DLL or EXE extension. If this assembly was referenced explicitly then it is possible the assembly was not actually required by the generated binary, in which case it should not be statically linked.
cs: Sestavení {0} se v sadě závislostí cílového binárního souboru nenašlo. Staticky propojená kořenová umístění by se měla specifikovat pomocí názvu sestavení bez přípony DLL nebo EXE. Pokud se na toto sestavení odkazovalo explicitně, pak je možné, že ho generovaný binární soubor ve skutečnosti nevyžadoval, a v tom případě by se nemělo propojovat staticky.
de: Assembly '{0}' wurde im Abhängigkeitssatz der Zielbinärdatei nicht gefunden. Statistisch verknüpfte Stämme müssen mithilfe eines Assemblynamen angegeben werden, ohne DLL- oder EXE-Erweiterung. Wenn explizit auf diese Assembly verwiesen wurde, ist es möglich, dass die Assembly nicht wirklich für die erzeugte Binärdatei erforderlich war. In diesem Fall sollte sie nicht statisch verknüpft sein.
es: No se encontró el ensamblado '{0}' en el conjunto de dependencias del archivo binario de destino. Las raíces vinculadas de forma estática se deben especificar con un nombre de ensamblado, sin una extensión DLL o EXE. Si se hizo referencia a este ensamblado de forma explícita, es posible que el ensamblado no fuese realmente necesario para el archivo binario generado, en cuyo caso no debería haberse vinculado de forma estática.
fr: L'assembly '{0}' est introuvable dans le jeu de dépendances du fichier binaire cible. Les racines liées de manière statique doivent être spécifiées à l'aide d'un nom d'assembly, sans extension DLL ou EXE. Si cet assembly a été référencé explicitement, il est possible qu'il n'ait pas été réellement requis par le fichier binaire généré. Dans ce cas, il ne doit pas être lié de manière statique.
it: Assembly '{0}' non trovato nel set di dipendenze del file binario di destinazione. Le radici collegate in modo statico devono essere specificate mediante un nome di assembly, senza estensione dll o exe. Se viene fatto riferimento all'assembly in modo esplicito, è possibile che l'assembly non sia effettivamente necessario per il file binario generato. In tal caso, non deve essere collegato in modo statico.
ja: アセンブリ '{0}' は、対象のバイナリの依存関係セットから見つかりませんでした。静的にリンクされたルートは、DLL または EXE 拡張子なしでアセンブリ名を使用して指定する必要があります。このアセンブリが明示的に参照された場合、アセンブリは生成されたバイナリで実際に要求されていない可能性があり、この場合には静的にリンクしないでください。
ko: 대상 이진 파일의 종속성 집합에서 어셈블리 '{0}'을(를) 찾지 못했습니다. 정적으로 링크된 루트는 DLL 또는 EXE 확장명이 없는 상태로 어셈블리 이름을 사용하여 지정해야 합니다. 이 어셈블리가 명시적으로 참조된 경우 생성된 이진 파일에서 실제로 필요하지 않을 수 있습니다. 이런 경우에는 정적으로 링크하지 마세요.
pl: Nie znaleziono zestawu „{0}” w zestawie zależności docelowych danych binarnych. Statycznie połączone elementy główne powinny być określone przy użyciu nazwy zestawu bez rozszerzenia DLL lub EXE. Jeśli do tego zestawu wystąpiło jawne odwołanie, możliwe jest, że zestaw nie był w rzeczywistości wymagany przez wygenerowane dane binarne. W takim przypadku nie powinny być statycznie połączone.
pt_br: O assembly '{0}' não foi encontrado no conjunto de dependências do binário de destino. Raízes vinculadas estaticamente devem ser especificadas por um nome de assembly, sem extensão DLL ou EXE. Se esse assembly foi referenciado explicitamente, é possível que ele não tenha sido exigido de fato pelo binário gerado e, nesse caso, ele não deve ser vinculado estaticamente.
ru: Сборка "{0}" не найдена в наборе зависимостей целевого двоичного файла. Корневые элементы со статическим связыванием должны указываться с помощью имени сборки без расширения DLL или EXE. Если сборка задана в ссылке явным образом, возможно, сборка на самом деле не требовалась для созданного двоичного файла. Это означает, что для нее не требуется статическое связывание.
tr: '{0}' bütünleştirilmiş kodu hedef ikilinin bağımlılık kümesinde bulunamadı. Statik olarak bağlanmış kökler, DLL veya EXE uzantısı olmadan bütünleştirilmiş kod adı kullanılarak belirtilmelidir. Bu bütünleştirilmiş koda açık olarak başvurulmuşsa bütünleştirilmiş koda aslında oluşturulan ikili dosya tarafından ihtiyaç duyulmamış olması mümkündür ve bu durumda statik olarak bağlanmamalıdır.
zh_hans: 在目标二进制文件的依赖项集中未找到程序集“{0}”。应使用不带扩展名 DLL 或 EXE 的程序集名称指定静态链接的根目录。如果已显式引用此程序集，则生成的二进制文件实际上可能不需要此程序集，在此情况下，不应静态链接此程序集。
zh_hant: 在目標二進位檔的相依性集中找不到組件 '{0}'。以靜態方式連結的根應該使用組件名稱指定，不加 DLL 或 EXE 副檔名。如果以明確方式參考這個組件，那麼所產生的二進位檔可能實際上不一定需要這個組件，在這種情況下，它就不應該以靜態方式連結。

# fscKeyFileCouldNotBeOpened
source: The key file '{0}' could not be opened
cs: Soubor klíče {0} se nedal otevřít.
de: Die Schlüsseldatei '{0}' konnte nicht geöffnet werden.
es: No se pudo abrir el archivo de clave '{0}'.
fr: Impossible d'ouvrir le fichier de clé '{0}'
it: Non è stato possibile aprire il file di chiave '{0}'
ja: キー ファイル '{0}' を開けませんでした
ko: 키 파일 '{0}'을(를) 열 수 없습니다.
pl: Nie można otworzyć pliku klucza „{0}”
pt_br: Não foi possível abrir o arquivo de chave '{0}'
ru: Не удалось открыть файл ключей "{0}"
tr: Anahtar dosyası '{0}' açılamadı
zh_hans: 未能打开密钥文件“{0}”
zh_hant: 無法開啟金鑰檔 '{0}'

# fscProblemWritingBinary
source: A problem occurred writing the binary '{0}': {1}
cs: Při zapisování binárního souboru {0} došlo k potížím: {1}
de: Fehler beim Schreiben der Binärdatei '{0}': {1}
es: Se produjo un problema al escribir el archivo binario '{0}': {1}.
fr: Un problème s'est produit lors de l'écriture du fichier binaire '{0}' : {1}
it: Si è verificato un problema durante la scrittura del binario '{0}': {1}
ja: バイナリ '{0}' の書き込み中に問題が発生しました: {1}
ko: 이진 파일 '{0}'을(를) 쓰는 동안 오류가 발생했습니다. {1}
pl: Wystąpił problem podczas zapisywania danych binarnych „{0}”: {1}
pt_br: Ocorreu um problema ao gravar o binário '{0}': {1}
ru: Проблема при записи двоичного файла "{0}": {1}
tr: {0}' ikili dosyası yazılırken bir sorun oluştu: {1}
zh_hans: 写入二进制文件“{0}”时出现问题: {1}
zh_hant: 寫入二進位檔 '{0}' 時發生問題: {1}

# fscAssemblyVersionAttributeIgnored
source: The 'AssemblyVersionAttribute' has been ignored because a version was given using a command line option
cs: Třída AssemblyVersionAttribute se ignorovala, protože jste verzi zadali pomocí možnosti příkazového řádku.
de: Das 'AssemblyVersionAttribute' wurde ignoriert, da eine Version mithilfe einer Befehlszeilenoption angegeben wurde.
es: Se omitió el atributo 'AssemblyVersionAttribute' porque se proporcionó una versión con una opción de la línea de comandos.
fr: 'AssemblyVersionAttribute' a été ignoré, car une version a été indiquée à l'aide d'une option en ligne de commande
it: 'AssemblyVersionAttribute' ignorato. È stata specificata una versione mediante un'opzione della riga di comando
ja: 'AssemblyVersionAttribute' は、バージョンがコマンド ライン オプションを使用して指定されたため無視されました
ko: 명령줄 옵션을 사용하여 버전을 지정했기 때문에 'AssemblyVersionAttribute'가 무시되었습니다.
pl: Element „AssemblyVersionAttribute” został zignorowany, ponieważ wersję podano przy użyciu opcji wiersza polecenia
pt_br: O 'AssemblyVersionAttribute' foi ignorado porque uma versão foi atribuída usando uma opção de linha de comando
ru: Атрибут AssemblyVersionAttribute был проигнорирован, поскольку версия задана с помощью параметра командной строки
tr: Komut satırı seçeneği kullanılarak sürüm verildiği için 'AssemblyVersionAttribute' yok sayıldı
zh_hans: 已忽略“AssemblyVersionAttribute”，因为已使用命令行选项给定一个版本
zh_hant: 忽略 'AssemblyVersionAttribute'，因為已經使用命令列選項指定了版本

# fscAssemblyCultureAttributeError
source: Error emitting 'System.Reflection.AssemblyCultureAttribute' attribute -- 'Executables cannot be satellite assemblies, Culture should always be empty'
cs: Chyba při generování atributu System.Reflection.AssemblyCultureAttribute: Spustitelné soubory nemůžou být satelitní sestavení. Jazyková verze by měla být vždycky prázdná.
de: Fehler beim Ausgeben des 'System.Reflection.AssemblyCultureAttribute'-Attributs -- "Ausführbare Dateien können keine Satellitenassemblys sein, Kulturen sollten immer leer sein".
es: Error al emitir el atributo 'System.Reflection.AssemblyCultureAttribute': 'Los archivos ejecutables no pueden ser ensamblados satélite y no deben tener referencia cultural'.
fr: Erreur lors de l'émission de l'attribut 'System.Reflection.AssemblyCultureAttribute' -- Les exécutables ne peuvent pas être des assemblys satellites. La culture doit toujours être vide
it: Errore durante la creazione dell'attributo 'System.Reflection.AssemblyCultureAttribute' -- Gli eseguibili non possono essere assembly satellite e Culture deve essere sempre vuoto'
ja: 'System.Reflection.AssemblyCultureAttribute' 属性の生成中にエラーが発生しました -- '実行可能ファイルをサテライト アセンブリにすることはできません。カルチャは常に空である必要があります'
ko: 'System.Reflection.AssemblyCultureAttribute' 특성을 내보내는 동안 오류 발생 -- '실행 파일은 위성 어셈블리일 수 없습니다. 문화권은 항상 비어 있어야 합니다.'
pl: Błąd podczas emitowania atrybutu „System.Reflection.AssemblyCultureAttribute” -- „Pliki wykonywalne nie mogą być zestawami satelickimi. Kultura zawsze powinna być pusta”
pt_br: Erro ao emitir o atributo 'System.Reflection.AssemblyCultureAttribute' -- 'Executáveis não podem ser assemblies satélites, a Cultura deve estar sempre vazia'
ru: Ошибка при создании атрибута System.Reflection.AssemblyCultureAttribute - "Исполняемые файлы не могут быть вспомогательными сборками; свойство " Культура" должно обязательно быть пустым"
tr: 'System.Reflection.AssemblyCultureAttribute' özniteliği yayılırken hata oluştu -- 'Çalıştırılabilir dosyalar uydu bütünleştirilmiş kodlar olamaz, Kültür her zaman boş olmalıdır'
zh_hans: 发出“System.Reflection.AssemblyCultureAttribute”特性时出错:“可执行文件不能是附属程序集，区域应始终为空”
zh_hant: 發出 'System.Reflection.AssemblyCultureAttribute' 屬性時發生錯誤 -- '可執行檔不可以是附屬組件，文化特性需保持空白'

# fscDelaySignWarning
source: Option '--delaysign' overrides attribute 'System.Reflection.AssemblyDelaySignAttribute' given in a source file or added module
cs: Možnost --delaysign přepisuje atribut System.Reflection.AssemblyDelaySignAttribute předaný ve zdrojovém souboru nebo přidaném modulu.
de: Die Option '--delaysign' überschreibt das Attribut 'System.Reflection.AssemblyDelaySignAttribute', das in einer Quelldatei oder einem hinzugefügten Modul angegeben wurde.
es: La opción '--delaysign' invalida el atributo 'System.Reflection.AssemblyDelaySignAttribute' proporcionado en un archivo de código fuente o un módulo agregado.
fr: L'option '--delaysign' remplace l'attribut 'System.Reflection.AssemblyDelaySignAttribute' fourni dans un fichier source ou un module ajouté
it: L'opzione '--delaysign' esegue l'override dell'attributo 'System.Reflection.AssemblyDelaySignAttribute' specificato in un file di codice sorgente o in un modulo aggiunto
ja: ソース ファイルまたは追加されたモジュールに指定された 'System.Reflection.AssemblyDelaySignAttribute' 属性は、'--delaysign' オプションでオーバーライドされます
ko: '--delaysign' 옵션은 소스 파일이나 추가 모듈에 지정된 'System.Reflection.AssemblyDelaySignAttribute' 특성을 재정의합니다.
pl: Opcja „--delaysign” przesłania atrybut „System.Reflection.AssemblyDelaySignAttribute” podany w pliku źródłowym lub dodanym module
pt_br: A opção '--delaysign' substitui o atributo 'System.Reflection.AssemblyDelaySignAttribute' fornecido em um arquivo de origem ou módulo adicionado
ru: Параметр --delaysign переопределяет атрибут System.Reflection.AssemblyDelaySignAttribute, заданный в файле с исходным кодом или в добавленном модуле
tr: '--delaysign' seçeneği kaynak dosyasında veya ekli modülde verilen 'System.Reflection.AssemblyDelaySignAttribute' özniteliğini geçersiz kılar
zh_hans: 选项“--delaysign”将重写源文件或添加的模块中给定的“System.Reflection.AssemblyDelaySignAttribute”特性
zh_hant: 選項 '--delaysign' 會覆寫原始程式檔或加入的模組中指定的屬性 'System.Reflection.AssemblyDelaySignAttribute'
