Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Parser.TOKEN.INT32.DOT.DOT
source: integer..
cs: celé číslo..
es: entero..
fr: entier..
ja: 整数..
ko: 정수..
pl: liczba całkowita..
pt_br: inteiro..
ru: целое..
tr: tamsayı..
zh_hans: 整数..
zh_hant: 整數

# Parser.TOKEN.DOT.DOT
source: symbol '..'
es: símbolo '..'
fr: symbole '..'
it: simbolo '..'
ja: シンボル '..'
ko: '..' 기호
pt_br: símbolo '..'
ru: символ ".."
tr: '..' simgesi
zh_hans: 符号“..”
zh_hant: 符號 '..'

# Parser.TOKEN.QUOTE
source: quote symbol
cs: symbol citace
de: Anführungszeichensymbol
es: símbolo de comilla
fr: symbole de quotation
it: simbolo di quotation
ja: 引用シンボル
ko: 인용 기호
pl: symbol cudzysłowu
pt_br: símbolo de cotação
ru: символ кавычки
tr: alıntı simgesi
zh_hans: 引用符号
zh_hant: 引號符號

# Parser.TOKEN.STAR
source: symbol '*'
es: símbolo '*'
fr: symbole '*'
it: simbolo '*'
ja: シンボル '*'
ko: '*' 기호
pt_br: símbolo '*'
ru: символ "*"
tr: '*' simgesi
zh_hans: 符号“*”
zh_hant: 符號 '*'

# Parser.TOKEN.HIGH.PRECEDENCE.TYAPP
source: type application
cs: použití typu
de: Typanwendung
es: aplicación de tipo
fr: application de type
it: applicazione tipo
ja: 型応用
ko: 형식 적용
pl: zastosowanie typu
pt_br: aplicação de tipo
ru: приложение типа
tr: tür uygulaması
zh_hans: 类型应用程序
zh_hant: 類型應用程式

# Parser.TOKEN.COLON
source: symbol ':'
es: símbolo ':'
fr: symbole ':'
it: simbolo ':'
ja: シンボル ':'
ko: ':' 기호
pt_br: símbolo ':'
ru: символ ":"
tr: ':' simgesi
zh_hans: 符号“:”
zh_hant: 符號 ':'

# Parser.TOKEN.COLON.EQUALS
source: symbol ':='
es: símbolo ':='
fr: symbole ':='
it: simbolo ':='
ja: シンボル ':='
ko: ':=' 기호
pt_br: símbolo ':='
ru: символ ":="
tr: ':=' simgesi
zh_hans: 符号“:=”
zh_hant: 符號 ':='

# Parser.TOKEN.LARROW
source: symbol '<-'
es: símbolo "<-"
fr: symbole '<-'
it: simbolo '<-'
ja: シンボル '<-'
ko: 기호 '<-'
pt_br: símbolo '<-'
ru: Обозначение '<-'
tr: sembol '<-'
zh_hans: 符号 "<-"
zh_hant: 符號 '<-'

# Parser.TOKEN.EQUALS
source: symbol '='
es: símbolo '='
fr: symbole '='
it: simbolo '='
ja: シンボル '='
ko: '=' 기호
pt_br: símbolo '='
ru: символ "="
tr: '=' simgesi
zh_hans: 符号“=”
zh_hant: 符號 '='

# Parser.TOKEN.GREATER.BAR.RBRACK
source: symbol '>|]'
es: símbolo ">|]"
fr: symbole '>|]'
it: simbolo '>|]'
ja: シンボル '>|]'
ko: 기호 '>|]'
pt_br: símbolo '>|]'
ru: Обозначение '>|]'
tr: sembol '>|]'
zh_hans: 符号 ">|]"
zh_hant: 符號 '>|]'

# Parser.TOKEN.MINUS
source: symbol '-'
es: símbolo '-'
fr: symbole '-'
it: simbolo '-'
ja: シンボル '-'
ko: '-' 기호
pt_br: símbolo '-'
ru: символ "-"
tr: '-' simgesi
zh_hans: 符号“-”
zh_hant: 符號 '-'

# Parser.TOKEN.ADJACENT.PREFIX.OP
source: prefix operator
cs: operátor předpony
de: Präfixoperator
es: operador de prefijo
fr: opérateur préfixé
it: operatore prefisso
ja: プレフィックス演算子
ko: 전위 연산자
pl: operator prefiksu
pt_br: operador pré-fixo
ru: префиксный оператор
tr: ön ek işleci
zh_hans: 前缀运算符
zh_hant: 前置運算子

# Parser.TOKEN.FUNKY.OPERATOR.NAME
source: operator name
cs: název operátora
es: nombre de operador
fr: nom d'opérateur
it: nome operatore
ja: 演算子名
ko: 연산자 이름
pl: nazwa operatora
pt_br: nome de operador
ru: имя оператора
tr: işleç adı
zh_hans: 运算符名称
zh_hant: 運算子名稱

# Parser.TOKEN.COMMA
source: symbol ','
es: símbolo ','
fr: symbole ','
it: simbolo ','
ja: シンボル ','
ko: ',' 기호
pt_br: símbolo ','
ru: символ ","
tr: ',' simgesi
zh_hans: 符号“,”
zh_hant: 符號 ','

# Parser.TOKEN.DOT
source: symbol '.'
es: símbolo '.'
fr: symbole '.'
it: simbolo '.'
ja: シンボル '.'
ko: '.' 기호
pt_br: símbolo '.'
ru: символ "."
tr: '.' simgesi
zh_hans: 符号“.”
zh_hant: 符號 '.'

# Parser.TOKEN.BAR
source: symbol '|'
es: símbolo '|'
fr: symbole '|'
it: simbolo '|'
ja: シンボル '|'
ko: '|' 기호
pt_br: símbolo '|'
ru: символ "|"
tr: '|' simgesi
zh_hans: 符号“|”
zh_hant: 符號 '|'

# Parser.TOKEN.HASH
source: symbol #
es: símbolo #
fr: symbole #
it: simbolo #
ja: シンボル #
ko: # 기호
pt_br: símbolo #
ru: символ #
tr: # simgesi
zh_hans: 符号 #
zh_hant: 符號 #

# Parser.TOKEN.UNDERSCORE
source: symbol '_'
es: símbolo '_'
fr: symbole '_'
it: simbolo '_'
ja: シンボル '_'
ko: '_' 기호
pt_br: símbolo '_'
ru: символ "_"
tr: '_' simgesi
zh_hans: 符号“_”
zh_hant: 符號 '_'

# Parser.TOKEN.SEMICOLON
source: symbol ';'
es: símbolo ';'
fr: symbole ';'
it: simbolo ';'
ja: シンボル ';'
ko: ';' 기호
pt_br: símbolo ';'
ru: символ ";"
tr: ';' simgesi
zh_hans: 符号“;”
zh_hant: 符號 ';'

# Parser.TOKEN.SEMICOLON.SEMICOLON
source: symbol ';;'
es: símbolo ';;'
fr: symbole ';;'
it: simbolo ';;'
ja: シンボル ';;'
ko: ';;' 기호
pt_br: símbolo ';;'
ru: символ ";;"
tr: ';;' simgesi
zh_hans: 符号“;;”
zh_hant: 符號 ';;'

# Parser.TOKEN.LPAREN
source: symbol '('
es: símbolo '('
fr: symbole '('
it: simbolo '('
ja: シンボル '('
ko: '(' 기호
pt_br: símbolo '('
ru: символ "("
tr: '(' simgesi
zh_hans: 符号“(”
zh_hant: 符號 '('

# Parser.TOKEN.RPAREN
source: symbol ')'
es: símbolo ')'
fr: symbole ')'
it: simbolo ')'
ja: シンボル ')'
ko: ')' 기호
pt_br: símbolo ')'
ru: символ ")"
tr: ')' simgesi
zh_hans: 符号“)”
zh_hant: 符號 ')'

# Parser.TOKEN.SPLICE.SYMBOL
source: symbol 'splice'
es: símbolo 'splice'
fr: symbole 'splice'
it: simbolo 'splice'
ja: シンボル 'splice'
ko: 'splice' 기호
pt_br: símbolo 'splice'
ru: символ "splice"
tr: 'splice' simgesi
zh_hans: 符号“splice”
zh_hant: 符號 'splice'

# Parser.TOKEN.LQUOTE
source: start of quotation
cs: začátek citace
de: Zitat Anfang
es: inicio de expresión de código delimitada
fr: début de la quotation
it: inizio quotation
ja: 引用の開始
ko: 인용구의 시작
pl: początek cytatu
pt_br: início de cotação
ru: начало цитирования
tr: alıntı başlangıcı
zh_hans: 引用开始
zh_hant: 引號開頭

# Parser.TOKEN.LBRACK
source: symbol '['
es: símbolo '['
fr: symbole '['
it: simbolo '['
ja: シンボル '['
ko: '[' 기호
pt_br: símbolo '['
ru: символ "["
tr: '[' simgesi
zh_hans: 符号“[”
zh_hant: 符號 '['

# Parser.TOKEN.LBRACK.BAR
source: symbol '[|'
es: símbolo '[|'
fr: symbole '[|'
it: simbolo '[|'
ja: シンボル '[|'
ko: '[|' 기호
pt_br: símbolo '[|'
ru: символ "[|"
tr: '[|' simgesi
zh_hans: 符号“[|”
zh_hant: 符號 '[|'

# Parser.TOKEN.LBRACK.LESS
source: symbol '[<'
es: símbolo "[<"
fr: symbole '[<'
it: simbolo '[<'
ja: シンボル '[<'
ko: 기호 '[<'
pt_br: símbolo '[<'
ru: Обозначение '[<'
tr: sembol '[<'
zh_hans: 符号 "[<"
zh_hant: 符號 '[<'

# Parser.TOKEN.LBRACE
source: symbol '{'
es: símbolo '{'
fr: symbole '{'
it: simbolo '{'
ja: シンボル '{'
ko: '{' 기호
pt_br: símbolo '{'
ru: символ "{"
tr: '{' simgesi
zh_hans: 符号“{”
zh_hant: 符號 '{'

# Parser.TOKEN.LBRACE.LESS
source: symbol '{<'
es: símbolo "{<"
fr: symbole '{<'
it: simbolo '{<'
ja: シンボル '{<'
ko: 기호 '{<'
pt_br: símbolo '{<'
ru: Обозначение '{<'
tr: sembol '{<'
zh_hans: 符号 "{<"
zh_hant: 符號 '{<'

# Parser.TOKEN.BAR.RBRACK
source: symbol '|]'
es: símbolo "|]"
fr: symbole '|]'
it: simbolo '|]'
ja: シンボル '|]'
ko: '|]' 기호
pt_br: símbolo '|]'
ru: символ "|]"
tr: '|]' simgesi
zh_hans: 符号“|]”
zh_hant: 符號 '|]'

# Parser.TOKEN.GREATER.RBRACE
source: symbol '>}'
es: símbolo ">}"
fr: symbole '>}'
it: simbolo '>}'
ja: シンボル '>}'
ko: 기호 '>}'
pt_br: símbolo '>}'
ru: Обозначение '>}'
tr: sembol '>}'
zh_hans: 符号 ">}"
zh_hant: 符號 '>}'

# Parser.TOKEN.GREATER.RBRACK
source: symbol '>]'
es: símbolo ">]'
fr: symbole '>]'
it: simbolo '>]'
ja: シンボル '>]'
ko: 기호 '>]'
pt_br: símbolo '>]'
ru: Обозначение '>]'
tr: sembol '>]'
zh_hans: 符号 ">]"
zh_hant: 符號 '>]'

# Parser.TOKEN.RQUOTE
source: end of quotation
cs: konec citace
de: Zitat Ende
es: final de expresión de código delimitada
fr: fin de la quotation
it: fine quotation
ja: 引用の終わり
ko: 인용구의 끝
pl: koniec cytatu
pt_br: final de cotação
ru: конец цитирования
tr: alıntı sonu
zh_hans: 引用结束
zh_hant: 引號結尾

# Parser.TOKEN.RBRACK
source: symbol ']'
es: símbolo "]"
fr: symbole ']'
it: simbolo ']'
ja: シンボル ']'
ko: ']' 기호
pt_br: símbolo ']'
ru: символ "]"
tr: ']' simgesi
zh_hans: 符号“]”
zh_hant: 符號 ']'

# Parser.TOKEN.RBRACE
source: symbol '}'
es: símbolo '}'
fr: symbole '}'
it: simbolo '}'
ja: シンボル '}'
ko: '}' 기호
pt_br: símbolo '}'
ru: символ "}"
tr: '}' simgesi
zh_hans: 符号“}”
zh_hant: 符號 '}'

# Parser.TOKEN.PUBLIC
source: keyword 'public'
cs: klíčové slovo public
de: Schlüsselwort "public"
es: palabra clave 'public'
fr: mot clé 'public'
it: parola chiave 'public'
ja: キーワード 'public'
ko: 'public' 키워드
pl: słowo kluczowe „public”
pt_br: palavra-chave 'public'
ru: ключевое слово "public"
tr: 'public' anahtar sözcüğü
zh_hans: 关键字“public”
zh_hant: 關鍵字 'public'

# Parser.TOKEN.PRIVATE
source: keyword 'private'
cs: klíčové slovo private
de: Schlüsselwort "private"
es: palabra clave 'private'
fr: mot clé 'private'
it: parola chiave 'private'
ja: キーワード 'private'
ko: 'private' 키워드
pl: słowo kluczowe „private”
pt_br: palavra-chave 'private'
ru: ключевое слово "private"
tr: 'private' anahtar sözcüğü
zh_hans: 关键字“private”
zh_hant: 關鍵字 'private'

# Parser.TOKEN.INTERNAL
source: keyword 'internal'
cs: klíčové slovo internal
de: Schlüsselwort "internal"
es: palabra clave 'internal'
fr: mot clé 'internal'
it: parola chiave 'internal'
ja: キーワード 'internal'
ko: 'internal' 키워드
pl: słowo kluczowe „internal”
pt_br: palavra-chave 'internal'
ru: ключевое слово "internal"
tr: 'internal' anahtar sözcüğü
zh_hans: 关键字“internal”
zh_hant: 關鍵字 'internal'

# Parser.TOKEN.FIXED
source: keyword 'fixed'
cs: klíčové slovo fixed
de: Schlüsselwort "fixed"
es: palabra clave "fixed"
fr: mot clé 'fixed'
it: parola chiave 'fixed'
ja: キーワード 'fixed'
ko: 키워드 '수정됨'
pl: słowo kluczowe „naprawione”
pt_br: palavra-chave 'fixo'
ru: ключевое слово "fixed"
tr: 'fixed' anahtar sözcüğü
zh_hans: 关键字 "fixed"
zh_hant: 關鍵字 'fixed'

# Parser.TOKEN.CONSTRAINT
source: keyword 'constraint'
cs: klíčové slovo constraint
de: Schlüsselwort "constraint"
es: palabra clave 'constraint'
fr: mot clé 'constraint'
it: parola chiave 'constraint'
ja: キーワード 'constraint'
ko: 'constraint' 키워드
pl: słowo kluczowe „constraint”
pt_br: palavra-chave 'constraint'
ru: ключевое слово "constraint"
tr: 'constraint' anahtar sözcüğü
zh_hans: 关键字“constraint”
zh_hant: 關鍵字 'constraint'

# Parser.TOKEN.INSTANCE
source: keyword 'instance'
cs: klíčové slovo instance
de: Schlüsselwort "instance"
es: palabra clave 'instance'
fr: mot clé 'instance'
it: parola chiave 'instance'
ja: キーワード 'instance'
ko: 'instance' 키워드
pl: słowo kluczowe „instance”
pt_br: palavra-chave 'instance'
ru: ключевое слово "instance"
tr: 'instance' anahtar sözcüğü
zh_hans: 关键字“instance”
zh_hant: 關鍵字 'instance'

# Parser.TOKEN.DELEGATE
source: keyword 'delegate'
cs: klíčové slovo delegate
de: Schlüsselwort "delegate"
es: palabra clave 'delegate'
fr: mot clé 'delegate'
it: parola chiave 'delegate'
ja: キーワード 'delegate'
ko: 'delegate' 키워드
pl: słowo kluczowe „delegate”
pt_br: palavra-chave 'delegate'
ru: ключевое слово "delegate"
tr: 'delegate' anahtar sözcüğü
zh_hans: 关键字“delegate”
zh_hant: 關鍵字 'delegate'

# Parser.TOKEN.INHERIT
source: keyword 'inherit'
cs: klíčové slovo inherit
de: Schlüsselwort "inherit"
es: palabra clave 'inherit'
fr: mot clé 'inherit'
it: parola chiave 'inherit'
ja: キーワード 'inherit'
ko: 'inherit' 키워드
pl: słowo kluczowe „inherit”
pt_br: palavra-chave 'inherit'
ru: ключевое слово "inherit"
tr: 'inherit' anahtar sözcüğü
zh_hans: 关键字“inherit”
zh_hant: 關鍵字 'inherit'

# Parser.TOKEN.CONSTRUCTOR
source: keyword 'constructor'
cs: klíčové slovo constructor
de: Schlüsselwort "constructor"
es: palabra clave 'constructor'
fr: mot clé 'constructor'
it: parola chiave 'constructor'
ja: キーワード 'constructor'
ko: 'constructor' 키워드
pl: słowo kluczowe „constructor”
pt_br: palavra-chave 'constructor'
ru: ключевое слово "constructor"
tr: 'constructor' anahtar sözcüğü
zh_hans: 关键字“constructor”
zh_hant: 關鍵字 'constructor'

# Parser.TOKEN.DEFAULT
source: keyword 'default'
cs: klíčové slovo default
de: Schlüsselwort "default"
es: palabra clave 'default'
fr: mot clé 'default'
it: parola chiave 'default'
ja: キーワード 'default'
ko: 'default' 키워드
pl: słowo kluczowe „default”
pt_br: palavra-chave 'default'
ru: ключевое слово "default"
tr: 'default' anahtar sözcüğü
zh_hans: 关键字“default”
zh_hant: 關鍵字 'default'

# Parser.TOKEN.OVERRIDE
source: keyword 'override'
cs: klíčové slovo override
de: Schlüsselwort "override"
es: palabra clave 'override'
fr: mot clé 'override'
it: parola chiave 'override'
ja: キーワード 'override'
ko: 'override' 키워드
pl: słowo kluczowe „override”
pt_br: palavra-chave 'override'
ru: ключевое слово "override"
tr: 'override' anahtar sözcüğü
zh_hans: 关键字“override”
zh_hant: 關鍵字 'override'

# Parser.TOKEN.ABSTRACT
source: keyword 'abstract'
cs: klíčové slovo abstract
de: Schlüsselwort "abstract"
es: palabra clave 'abstract'
fr: mot clé 'abstract'
it: parola chiave 'abstract'
ja: キーワード 'abstract'
ko: 'abstract' 키워드
pl: słowo kluczowe „abstract”
pt_br: palavra-chave 'abstract'
ru: ключевое слово "abstract"
tr: 'abstract' anahtar sözcüğü
zh_hans: 关键字“abstract”
zh_hant: 關鍵字 'abstract'

# Parser.TOKEN.CLASS
source: keyword 'class'
cs: klíčové slovo class
de: Schlüsselwort "class"
es: palabra clave 'class'
fr: mot clé 'class'
it: parola chiave 'class'
ja: キーワード 'class'
ko: 'class' 키워드
pl: słowo kluczowe „class”
pt_br: palavra-chave 'class'
ru: ключевое слово "class"
tr: 'class' anahtar sözcüğü
zh_hans: 关键字“class”
zh_hant: 關鍵字 'class'

# Parser.TOKEN.MEMBER
source: keyword 'member'
cs: klíčové slovo member
de: Schlüsselwort "member"
es: palabra clave 'member'
fr: mot clé 'member'
it: parola chiave 'member'
ja: キーワード 'member'
ko: 'member' 키워드
pl: słowo kluczowe „member”
pt_br: palavra-chave 'member'
ru: ключевое слово "member"
tr: 'member' anahtar sözcüğü
zh_hans: 关键字“member”
zh_hant: 關鍵字 'member'

# Parser.TOKEN.STATIC
source: keyword 'static'
cs: klíčové slovo static
de: Schlüsselwort "static"
es: palabra clave 'static'
fr: mot clé 'static'
it: parola chiave 'static'
ja: キーワード 'static'
ko: 'static' 키워드
pl: słowo kluczowe „static”
pt_br: palavra-chave 'static'
ru: ключевое слово "static"
tr: 'static' anahtar sözcüğü
zh_hans: 关键字“static”
zh_hant: 關鍵字 'static'

# Parser.TOKEN.NAMESPACE
source: keyword 'namespace'
cs: klíčové slovo namespace
de: Schlüsselwort "namespace"
es: palabra clave 'namespace'
fr: mot clé 'namespace'
it: parola chiave 'namespace'
ja: キーワード 'namespace'
ko: 'namespace' 키워드
pl: słowo kluczowe „namespace”
pt_br: palavra-chave 'namespace'
ru: ключевое слово "namespace"
tr: 'namespace' anahtar sözcüğü
zh_hans: 关键字“namespace”
zh_hant: 關鍵字 'namespace'

# Parser.TOKEN.OBLOCKBEGIN
source: start of structured construct
cs: začátek strukturovaného konstruktoru
de: Anfang des strukturierten Konstrukts
es: inicio de construcción estructurada
fr: début de la construction structurée
it: inizio costrutto strutturato
ja: 構造化コンストラクトの開始
ko: 구조적 구문의 시작
pl: początek konstrukcji strukturalnej
pt_br: início do constructo estruturado
ru: начало структурированной конструкции
tr: yapılandırılmış yapı başlangıcı
zh_hans: 结构化构造开始
zh_hant: 結構化建構開頭

# Parser.TOKEN.OBLOCKEND
source: incomplete structured construct at or before this point
cs: neúplný strukturovaný konstruktor na této pozici nebo před ní
de: Unvollständig strukturiertes Konstrukt vor oder bis zu diesem Punkt
es: Construcción estructurada incompleta en este punto o antes.
fr: construction structurée incomplète à cet emplacement ou avant
it: costrutto strutturato incompleto in questo punto o prima di esso
ja: このポイントまたはその前にある構造化コンストラクトが不完全です
ko: 이 지점 또는 이 지점 전의 불완전한 구조적 구문
pl: niepełna konstrukcja strukturalna w tym punkcie lub przed nim
pt_br: constructo estruturado incompleto neste ponto ou antes dele
ru: неполный структурированный конструктор в текущей точке или перед ней
tr: bu noktada veya daha önce eksik yapılandırılmış yapı
zh_hans: 此点或之前的结构化构造不完整
zh_hant: 在以下或以下之前有結構不完整的建構: 這一點

# BlockEndSentence
source: Incomplete structured construct at or before this point
cs: Neúplný strukturovaný konstruktor na této pozici nebo před ní
de: Unvollständig strukturiertes Konstrukt vor oder bis zu diesem Punkt
es: Construcción estructurada incompleta en este punto o antes.
fr: Construction structurée incomplète à cet emplacement ou avant
it: Costrutto strutturato incompleto in questo punto o prima di esso
ja: この場所またはその前にある構造化コンストラクトが不完全です
ko: 이 지점 또는 이 지점 전에서 구조적 구문이 완전하지 않습니다.
pl: Niepełna konstrukcja strukturalna w tym punkcie lub przed nim
pt_br: Constructo estruturado incompleto neste ponto ou antes dele
ru: Неполный структурированный конструктор в текущей точке или перед ней
tr: Bu noktada veya daha önce eksik yapılandırılmış yapı
zh_hans: 此点或之前的结构化构造不完整
zh_hant: 在這一點或之前有結構不完整的建構

# Parser.TOKEN.OTHEN
source: keyword 'then'
cs: klíčové slovo then
de: Schlüsselwort "then"
es: palabra clave 'then'
fr: mot clé 'then'
it: parola chiave 'then'
ja: キーワード 'then'
ko: 'then' 키워드
pl: słowo kluczowe „then”
pt_br: palavra-chave 'then'
ru: ключевое слово "then"
tr: 'then' anahtar sözcüğü
zh_hans: 关键字“then”
zh_hant: 關鍵字 'then'

# Parser.TOKEN.OELSE
source: keyword 'else'
cs: klíčové slovo else
de: Schlüsselwort "else"
es: palabra clave 'else'
fr: mot clé 'else'
it: parola chiave 'else'
ja: キーワード 'else'
ko: 'else' 키워드
pl: słowo kluczowe „else”
pt_br: palavra-chave 'else'
ru: ключевое слово "else"
tr: 'else' anahtar sözcüğü
zh_hans: 关键字“else”
zh_hant: 關鍵字 'else'

# Parser.TOKEN.OLET
source: keyword 'let' or 'use'
cs: klíčové slovo let nebo use
de: Schlüsselwort "let" oder "use"
es: palabra clave 'let' o 'use'
fr: mot clé 'let' ou 'use'
it: parola chiave 'let' o 'use'
ja: キーワード 'let' または 'use'
ko: 'let' 또는 'use' 키워드
pl: słowo kluczowe „let” lub „use”
pt_br: palavra-chave 'let' ou 'use'
ru: ключевое слово "let" или "use"
tr: 'let' veya 'use' anahtar sözcüğü
zh_hans: 关键字“let”或“use”
zh_hant: 關鍵字 'let' 或 'use'

# Parser.TOKEN.BINDER
source: binder keyword
cs: klíčové slovo vazače
de: Schlüsselwort "binder"
es: palabra clave de enlazador
fr: mot clé binder
it: parola chiave binder
ja: バインダー キーワード
ko: 바인더 키워드
pl: słowo kluczowe integratora
pt_br: palavra-chave de fichário
ru: ключевое слово binder
tr: binder anahtar sözcüğü
zh_hans: 联编程序关键字
zh_hant: 繫結器關鍵字

# Parser.TOKEN.ODO
source: keyword 'do'
cs: klíčové slovo do
de: Schlüsselwort "do"
es: palabra clave 'do'
fr: mot clé 'do'
it: parola chiave 'do'
ja: キーワード 'do'
ko: 'do' 키워드
pl: słowo kluczowe „do”
pt_br: palavra-chave 'do'
ru: ключевое слово "do"
tr: 'do' anahtar sözcüğü
zh_hans: 关键字“do”
zh_hant: 關鍵字 'do'

# Parser.TOKEN.CONST
source: keyword 'const'
cs: klíčové slovo const
de: Schlüsselwort "const"
es: palabra clave 'const'
fr: mot-clé 'const'
it: parola chiave 'const'
ja: キーワード 'const'
ko: 키워드 'const'
pl: słowo kluczowe „const”
pt_br: palavra-chave 'const'
ru: ключевое слово const
tr: 'const' anahtar sözcüğü
zh_hans: 关键字“const”
zh_hant: 關鍵字 'const'

# Parser.TOKEN.OWITH
source: keyword 'with'
cs: klíčové slovo with
de: Schlüsselwort "with"
es: palabra clave 'with'
fr: mot clé 'with'
it: parola chiave 'with'
ja: キーワード 'with'
ko: 'with' 키워드
pl: słowo kluczowe „with”
pt_br: palavra-chave 'with'
ru: ключевое слово "with"
tr: 'with' anahtar sözcüğü
zh_hans: 关键字“with”
zh_hant: 關鍵字 'with'

# Parser.TOKEN.OFUNCTION
source: keyword 'function'
cs: klíčové slovo function
de: Schlüsselwort "function"
es: palabra clave 'function'
fr: mot clé 'function'
it: parola chiave 'function'
ja: キーワード 'function'
ko: 'function' 키워드
pl: słowo kluczowe „function”
pt_br: palavra-chave 'function'
ru: ключевое слово "function"
tr: 'function' anahtar sözcüğü
zh_hans: 关键字“function”
zh_hant: 關鍵字 'function'

# Parser.TOKEN.OFUN
source: keyword 'fun'
cs: klíčové slovo fun
de: Schlüsselwort "fun"
es: palabra clave 'fun'
fr: mot clé 'fun'
it: parola chiave 'fun'
ja: キーワード 'fun'
ko: 'fun' 키워드
pl: słowo kluczowe „fun”
pt_br: palavra-chave 'fun'
ru: ключевое слово "fun"
tr: 'fun' anahtar sözcüğü
zh_hans: 关键字“fun”
zh_hant: 關鍵字 'fun'

# Parser.TOKEN.ORESET
source: end of input
cs: konec vstupu
de: Ende der Eingabe
es: fin de entrada
fr: entrée terminée
it: fine input
ja: 入力の終わり
ko: 입력의 끝
pl: koniec danych wejściowych
pt_br: fim de entrada
ru: конец входных данных
tr: girişin sonu
zh_hans: 输入结束
zh_hant: 輸入的結尾

# Parser.TOKEN.ODUMMY
source: internal dummy token
cs: interní fiktivní token
de: internes Platzhaltertoken
es: token ficticio interno
fr: jeton factice interne
it: token fittizio interno
ja: 内部ダミー トークン
ko: 내부 더미 토큰
pl: wewnętrzny token fikcyjny
pt_br: token fictício interno
ru: внутренняя лексема-заполнитель
tr: iç sahte belirteç
zh_hans: 内部虚拟标记
zh_hant: 內部虛擬語彙基元

# Parser.TOKEN.ODO.BANG
source: keyword 'do!'
cs: klíčové slovo do!
de: Schlüsselwort "do!"
es: palabra clave 'do!'
fr: mot clé 'do!'
it: parola chiave 'do!'
ja: キーワード 'do!'
ko: 'do!' 키워드
pl: słowo kluczowe „do!”
pt_br: palavra-chave 'do!'
ru: ключевое слово "do!"
tr: 'do!' anahtar sözcüğü
zh_hans: 关键字“do!
zh_hant: 關鍵字 'do!'

# Parser.TOKEN.YIELD
source: yield
es: producción
pt_br: rendimento

# Parser.TOKEN.YIELD.BANG
source: yield!
es: producción
pt_br: rendimento!

# Parser.TOKEN.OINTERFACE.MEMBER
source: keyword 'interface'
cs: klíčové slovo interface
de: Schlüsselwort "interface"
es: palabra clave 'interface'
fr: mot clé 'interface'
it: parola chiave 'interface'
ja: キーワード 'interface'
ko: 'interface' 키워드
pl: słowo kluczowe „interface”
pt_br: palavra-chave 'interface'
ru: ключевое слово "interface"
tr: 'interface' anahtar sözcüğü
zh_hans: 关键字“interface”
zh_hant: 關鍵字 'interface'

# Parser.TOKEN.ELIF
source: keyword 'elif'
cs: klíčové slovo elif
de: Schlüsselwort "elif"
es: palabra clave 'elif'
fr: mot clé 'elif'
it: parola chiave 'elif'
ja: キーワード 'elif'
ko: 'elif' 키워드
pl: słowo kluczowe „elif”
pt_br: palavra-chave 'elif'
ru: ключевое слово "elif"
tr: 'elif' anahtar sözcüğü
zh_hans: 关键字“elif”
zh_hant: 關鍵字 'elif'

# Parser.TOKEN.RARROW
source: symbol '->'
es: símbolo "->"
fr: symbole '->'
it: simbolo '->'
ja: シンボル '->'
ko: 기호 '->'
pt_br: símbolo '->'
ru: Обозначение '->'
tr: sembol '->'
zh_hans: 符号 "->"
zh_hant: 符號 '->'

# Parser.TOKEN.SIG
source: keyword 'sig'
cs: klíčové slovo sig
de: Schlüsselwort "sig"
es: palabra clave 'sig'
fr: mot clé 'sig'
it: parola chiave 'sig'
ja: キーワード 'sig'
ko: 'sig' 키워드
pl: słowo kluczowe „sig”
pt_br: palavra-chave 'sig'
ru: ключевое слово "sig"
tr: 'sig' anahtar sözcüğü
zh_hans: 关键字“sig”
zh_hant: 關鍵字 'sig'

# Parser.TOKEN.STRUCT
source: keyword 'struct'
cs: klíčové slovo struct
de: Schlüsselwort "struct"
es: palabra clave 'struct'
fr: mot clé 'struct'
it: parola chiave 'struct'
ja: キーワード 'struct'
ko: 'struct' 키워드
pl: słowo kluczowe „struct”
pt_br: palavra-chave 'struct'
ru: ключевое слово "struct"
tr: 'struct' anahtar sözcüğü
zh_hans: 关键字“struct”
zh_hant: 關鍵字 'struct'

# Parser.TOKEN.UPCAST
source: keyword 'upcast'
cs: klíčové slovo upcast
de: Schlüsselwort "upcast"
es: palabra clave 'upcast'
fr: mot clé 'upcast'
it: parola chiave 'upcast'
ja: キーワード 'upcast'
ko: 'upcast' 키워드
pl: słowo kluczowe „upcast”
pt_br: palavra-chave 'upcast'
ru: ключевое слово "upcast"
tr: 'upcast' anahtar sözcüğü
zh_hans: 关键字“upcast”
zh_hant: 關鍵字 'upcast'

# Parser.TOKEN.DOWNCAST
source: keyword 'downcast'
cs: klíčové slovo downcast
de: Schlüsselwort "downcast"
es: palabra clave 'downcast'
fr: mot clé 'downcast'
it: parola chiave 'downcast'
ja: キーワード 'downcast'
ko: 'downcast' 키워드
pl: słowo kluczowe „downcast”
pt_br: palavra-chave 'downcast'
ru: ключевое слово "downcast"
tr: 'downcast' anahtar sözcüğü
zh_hans: 关键字“downcast”
zh_hant: 關鍵字 'downcast'

# Parser.TOKEN.NULL
source: keyword 'null'
cs: klíčové slovo null
de: Schlüsselwort "null"
es: palabra clave 'null'
fr: mot clé 'null'
it: parola chiave 'null'
ja: キーワード 'null'
ko: 'null' 키워드
pl: słowo kluczowe „null”
pt_br: palavra-chave 'null'
ru: ключевое слово "null"
tr: 'null' anahtar sözcüğü
zh_hans: 关键字“null”
zh_hant: 關鍵字 'null'

# Parser.TOKEN.RESERVED
source: reserved keyword
cs: vyhrazené klíčové slovo
de: reserviertes Schlüsselwort
es: palabra clave reservada
fr: mot clé réservé
it: parola chiave riservata
ja: 予約済みのキーワード
ko: 예약된 키워드
pl: zastrzeżone słowo kluczowe
pt_br: palavra-chave reservada
ru: зарезервированное ключевое слово
tr: ayrılmış anahtar sözcük
zh_hans: 保留的关键字
zh_hant: 保留的關鍵字
