Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# HashReferenceNotAllowedInNonScript
source: #r directives may only occur in F# script files (extensions .fsx or .fsscript). Either move this code to a script file or replace this reference with the '-r' compiler option. If this directive is being executed as user input, you may delimit it with '#if INTERACTIVE'/'#endif'.
cs: Direktivy #r se můžou vyskytovat jenom v souborech skriptu F# (s příponou .fsx nebo .fsscript). Buď přesuňte tento kód do souboru skriptu, nebo nahraďte tento odkaz možností kompilátoru -r. Pokud se tato direktiva provádí jako uživatelský vstup, můžete ji ohraničit pomocí notace #if INTERACTIVE'/'#endif.
de: #r-Anweisungen dürfen nur in F#-Skriptdateien (Dateierweiterungen .fsx oder .fsscript) verwendet werden. Verschieben Sie entweder diesen Code in eine Skriptdatei, oder ersetzen Sie diesen Verweis durch die Compileroption "-r". Wenn diese Anweisung als Benutzereingabe ausgeführt wird, trennen Sie sie mit "#if INTERACTIVE"/"#endif" ab.
es: Las directivas #r pueden existir solo en archivos de script de F# (extensiones .fsx o .fsscript). Mueva este código a un archivo de script o sustituta esta referencia por la opción de compilador '-r'. Si esta directiva se ejecuta como entrada de usuario, puede delimitarla con '#if INTERACTIVE'/'#endif'.
fr: Les directives #r ne peuvent être présentes que dans les fichiers de script F# (extensions .fsx ou .fsscript). Déplacez ce code vers un fichier de script ou remplacez cette référence par l'option de compilateur '-r'. Si cette directive est exécutée en tant qu'entrée d'utilisateur, vous pouvez la délimiter avec '#if INTERACTIVE'/'#endif'.
it: Le direttive #r possono trovarsi solo in file di script F# (estensioni fsx o fsscript). Spostare il codice in un file di script oppure sostituire questo riferimento con l'opzione del compilatore '-r'. Se questa direttiva viene eseguita come input utente, è possibile delimitarla con '#if INTERACTIVE'/'#endif'.
ja: #r ディレクティブは F# スクリプト ファイル (拡張子は .fsx または .fsscript) 内でのみ使用できます。このコードをスクリプト ファイルに移動するか、この参照を '-r' コンパイラ オプションに置き換えてください。このディレクティブがユーザー入力として実行されている場合は、'#if INTERACTIVE'/'#endif' でディレクティブを区切ることができます。
ko: #r 지시문은 F# 스크립트 파일(확장명 .fsx 또는 .fsscript)에서만 발생할 수 있습니다. 이 코드를 스크립트 파일로 이동하거나 이 참조를 '-r' 컴파일러 옵션으로 바꾸세요. 이 지시문이 사용자 입력으로 실행되는 경우 지시문을 '#if INTERACTIVE'/'#endif'로 구분할 수 있습니다.
pl: Dyrektywy #r mogą występować tylko w plikach skryptu języka F# (rozszerzenie fsx lub fsscript). Przenieś ten kod do pliku skryptu lub zastąp to odwołanie za pomocą opcji kompilatora „-r”. Jeśli ta dyrektywa jest wykonywana jako dane wejściowe użytkownika, możesz ją ograniczyć przy użyciu elementu „#if INTERACTIVE”/„#endif”.
pt_br: Diretivas #r só podem ocorrer em arquivos de script F# (extensões .fsx ou .fsscript). Mova este código para um arquivo de script ou substitua essa referência com a opção do compilador '-r'. Se essa diretiva estiver sendo executada como uma entrada do usuário, você poderá delimitá-lo com '#if INTERACTIVE'/'#endif'.
ru: Директивы #r могут встречаться только в файлах сценариев F# (файлы с расширениями .fsx или .fsscript). Переместите этот код в файл сценария или замените эту ссылку параметром компилятора "-r". Если эта директива выполняется в качестве пользовательских входных данных, вы можете заключить ее в блок "#if INTERACTIVE"/"#endif".
tr: #r yönergeleri yalnızca F# betik dosyalarında (.fsx veya .fsscript uzantılı) görülebilir. Bu kodu bir betik dosyasına taşıyın veya bu başvuruyu '-r' derleyici seçeneği ile değiştirin. Yönerge kullanıcı girişi olarak yürütülüyorsa, yönergeyi '#if INTERACTIVE'/'#endif' ile sınırlandırabilirsiniz.
zh_hans: #r 指令只能出现在 F# 脚本文件(扩展名为 .fsx 或 .fsscript)中。请将此代码移动到脚本文件或使用 "-r" 编译器选项替换此引用。如果该指令作为用户输入执行，则可以使用 "#if INTERACTIVE'/'#endif" 分隔它。
zh_hant: #r 指示詞只能出現在 F# 指令碼檔案 (副檔名為 .fsx 或 .fsscript) 中。請將此程式碼移至指令碼檔案，或以 '-r' 編譯器選項取代此參考。若此指示詞要以使用者輸入的方式執行，可以使用 '#if INTERACTIVE'/'#endif' 加以分隔。

# HashDirectiveNotAllowedInNonScript
source: This directive may only be used in F# script files (extensions .fsx or .fsscript). Either remove the directive, move this code to a script file or delimit the directive with '#if INTERACTIVE'/'#endif'.
cs: Tato direktiva se dá použít jenom v souborech skriptu F# (s příponou .fsx nebo .fsscript). Buď direktivu odeberte, nebo tento kód přesuňte do souboru skriptu, anebo direktivu ohraničte pomocí notace #if INTERACTIVE/#endif.
de: Diese Direktive darf nur in F#-Skriptdateien (Dateierweiterungen .fsx oder .fsscript) verwendet werden. Entfernen Sie entweder die Direktive, verschieben Sie diesen Code in eine Skriptdatei, oder trennen Sie die Direktive mit "#if INTERACTIVE"/"#endif" ab.
es: Esta directiva se puede usar solo en archivos de script de F# (extensiones .fsx o .fsscript). Quite la directiva, mueva este código a un archivo de script o delimite la directiva con '#if INTERACTIVE'/'#endif'.
fr: Cette directive ne peut être utilisée que dans les fichiers de script F# (extensions .fsx ou .fsscript). Supprimez la directive, déplacez ce code vers un fichier de script ou délimitez la directive par '#if INTERACTIVE'/'#endif'.
it: Questa direttiva può essere utilizzata solo in file di script F# (estensioni fsx o fsscript). Rimuovere la direttiva, spostare il codice in un file di script oppure delimitarla con '#if INTERACTIVE'/'#endif'.
ja: このディレクティブを使用できるのは F# スクリプト ファイル (拡張子は .fsx または .fsscript) のみです。ディレクティブを削除するか、このコードをスクリプト ファイルに移動するか、ディレクティブを '#if INTERACTIVE'/'#endif' で区切ってください。
ko: 이 지시문은 F# 스크립트 파일(확장명 .fsx 또는 .fsscript)에서만 사용할 수 있습니다. 지시문을 제거하거나, 이 코드를 스크립트 파일로 이동하거나, 지시문을 '#if INTERACTIVE'/'#endif'로 구분하세요.
pl: Ta dyrektywa może być używana tylko w plikach skryptu języka F# (rozszerzenie fsx lub fsscript). Przenieś dyrektywę, przenieś jej kod do pliku skryptu lub rozdziel dyrektywę przy użyciu elementu „#if INTERACTIVE”/„#endif”.
pt_br: Esta diretiva só pode ser usada em arquivos de script F# (extensões .fsx ou .fsscript). Remova a diretiva e mova este código para um arquivo de script, ou então, delimite a diretiva com '#if INTERACTIVE'/'#endif'.
ru: Данная директива может использоваться только в файлах скриптов F# (расширения .fsx или .fsscript). Нужно либо удалить директиву, либо переместить данный код в файл скрипта, либо ограничить директиву с помощью "#if INTERACTIVE"/"#endif".
tr: Bu yönerge yalnızca F# betik dosyalarında (.fsx veya .fsscript uzantılı) kullanılabilir. Ya yönergeyi kaldırıp bu kodu betik dosyasına taşıyın ya da yönergeyi '#if INTERACTIVE'/'#endif' ile sınırlandırın.
zh_hans: 只能在 F# 脚本文件(扩展名为 .fsx 或 .fsscript)中使用此指令。请删除此指令、将此代码移动到脚本文件中或使用“#if INTERACTIVE”/“#endif”分隔此指令。
zh_hant: 這個指示詞只能用在 F# 指令碼檔案 (副檔名 .fsx 或 .fsscript) 中。請移除指示詞，或將這個程式碼移到指令碼檔案，或用 '#if INTERACTIVE'/'#endif' 分隔這個指示詞。

# FileNameNotResolved
source: Unable to find the file '{0}' in any of\n {1}
cs: Soubor {0} se nepovedlo najít v žádné(m)\n {1}.
de: Die Datei "{0}" kann nicht gefunden werden in:\n {1}
es: No se encuentra el archivo '{0}' en\n {1}
fr: Impossible de trouver le fichier '{0}' dans\n {1}
it: Il file '{0}' non è stato trovato in \n {1}
ja: 次の中からファイル '{0}' が見つかりませんでした\n {1}
ko: 다음에서 '{0}' 파일을 찾을 수 없습니다.\n {1}
pl: Nie można odnaleźć pliku „{0}” w żadnym z elementów\n {1}
pt_br: Não foi possível encontrar o arquivo '{0}' em qualquer um dos\n {1}
ru: Не удается найти файл "{0}" в любом из\n {1}
tr: {0}' dosyası şunların hiçbirinde bulunamıyor:\n {1}
zh_hans: 无法在任何 {1} 中找到\n 文件“{0}”
zh_hant: 在下列任何位置都找不到檔案 '{0}'\n {1}

# AssemblyNotResolved
source: Assembly reference '{0}' was not found or is invalid
cs: Odkaz na sestavení {0} se nenašel nebo je neplatný.
de: Der Assemblyverweis "{0}" wurde nicht gefunden oder ist ungültig.
es: No se encontró la referencia de ensamblado '{0}' o no es válida.
fr: La référence d'assembly '{0}' est introuvable ou non valide
it: Riferimento ad assembly '{0}' non trovato o non valido
ja: アセンブリ参照 '{0}' が見つからないか、無効です
ko: 어셈블리 참조 '{0}'이(가) 없거나 잘못되었습니다.
pl: Nie odnaleziono odwołania do zestawu „{0}” lub jest ono nieprawidłowe
pt_br: A referência de assembly '{0}' não foi localizada ou é inválida
ru: Ссылка на сборку "{0}" не была найдена либо является недопустимой
tr: Bütünleştirilmiş kod başvurusu '{0}' bulunamadı veya geçersiz
zh_hans: 程序集引用“{0}”未找到或无效
zh_hant: 找不到組件參考 '{0}'，或者無效

# HashLoadedSourceHasIssues1
source: One or more warnings in loaded file.\n
cs: V načteném souboru je nejmíň jedno upozornění.\n
de: Mindestens eine Warnung in geladener Datei.\n
es: Hay una varias advertencias en el archivo cargado.\n
fr: Un ou plusieurs avertissements dans le fichier chargé.\n
it: Uno o più avvisi nel file caricato.\n
ja: 読み込まれたファイルに 1 つまたは複数の警告があります。\n
ko: 로드된 파일에 하나 이상의 경고가 있습니다.\n
pl: Co najmniej jedno ostrzeżenie w załadowanym pliku.\n
pt_br: O arquivo carregado possui um ou mais avisos.\n
ru: Одно или несколько предупреждений в загруженном файле.\n
tr: Yüklenen dosyada bir veya daha fazla uyarı var.\n
zh_hans: 加载的文件中出现一个或多个警告。\n
zh_hant: 載入的檔案中有一個或多個警告。\n

# HashLoadedSourceHasIssues2
source: One or more errors in loaded file.\n
cs: V načteném souboru je nejmíň jedna chyba.\n
de: Mindestens ein Fehler in geladener Datei.\n
es: Hay uno o varios errores en el archivo cargado.\n
fr: Une ou plusieurs erreurs dans le fichier chargé.\n
it: Uno o più errori nel file caricato.\n
ja: 読み込まれたファイルに 1 つまたは複数のエラーがあります。\n
ko: 로드된 파일에 하나 이상의 오류가 있습니다.\n
pl: Co najmniej jeden błąd w załadowanym pliku.\n
pt_br: O arquivo carregado possui um ou mais erros\n
ru: Одна или несколько ошибок в загруженном файле.\n
tr: Yüklenen dosyada bir veya daha fazla hata var.\n
zh_hans: 加载的文件中出现一个或多个错误。\n
zh_hant: 載入的檔案中有一個或多個錯誤。\n

# HashLoadedScriptConsideredSource
source: Loaded files may only be F# source files (extension .fs). This F# script file (.fsx or .fsscript) will be treated as an F# source file
cs: Načtené soubory můžou být jenom zdrojové soubory F# (s příponou .fs). Tento soubor skriptu F# (s příponou .fsx nebo .fsscript) se zpracuje jako zdrojový soubor F#.
de: Geladene Dateien dürfen nur F#-Quellcodedateien (Dateierweiterung .fs) sein. Diese F#-Skriptdatei (.fsx oder .fsscript) wird wie eine F#-Quellcodedatei behandelt.
es: Los archivos cargados pueden ser solo archivos de código fuente de F# (extensión .fs). Este archivo de script de F# (.fsx o .fsscript) se tratará como un archivo de código fuente de F#.
fr: Les fichiers chargés ne peuvent être que des fichiers sources F# (extension .fs). Ce fichier de script F# (.fsx ou .fsscript) sera traité en tant que fichier source F#
it: I file caricati possono essere solo file di origine F# (estensione fs). Questo file di script F# (fsx o fsscript) verrà considerato come un file di origine F#
ja: 読み込むことができるファイルは F# ソース ファイル (拡張子は .fs) のみです。この F# スクリプト ファイル (.fsx または .fsscript) は F# ソース ファイルとして扱われます。
ko: 로드된 파일은 F# 소스 파일(확장명 .fs)일 수만 있습니다. 이 F# 스크립트 파일(.fsx 또는 .fsscript)은 F# 소스 파일로 처리됩니다.
pl: Ładowane mogą być tylko pliki źródłowe języka F# (rozszerzenie fs). Ten plik skryptu języka F# (rozszerzenie fsx lub fsscript) będzie traktowany jako plik źródłowy języka F#
pt_br: Arquivos carregados só podem ser arquivos de origem F# (extensão .fs). Este arquivo de script F# (.fsx ou .fsscript) será tratado como um arquivo de origem F#
ru: Загруженные файлы могут являться только исходными файлами F# (расширение .fs). Данный файл скрипта F# (.fsx или .fsscript) будет рассмотрен, как исходный файл F#
tr: Yüklenen dosyalar yalnızca F# kaynak dosyaları (.fs uzantılı) olabilir. Bu F# betik dosyasına (.fsx veya .fsscript) F# kaynak dosyası gibi işlem yapılacak
zh_hans: 加载的文件只能是 F# 源文件(扩展名为 .fs)。此 F# 脚本文件(.fsx 或 .fsscript)将被视为一个 F# 源文件
zh_hant: 載入的檔案只能是 F# 原始程式檔 (副檔名 .fs)。這個 F# 指令碼檔案 (.fsx 或 .fsscript) 將被視為 F# 原始程式檔

# InvalidInternalsVisibleToAssemblyName1
source: Invalid assembly name '{0}' from InternalsVisibleTo attribute in {1}
cs: Neplatný název sestavení {0} z atributu InternalsVisibleTo v {1}
de: Ungültiger Assemblyname "{0}" aus dem InternalsVisibleTo-Attribut in "{1}".
es: Nombre de ensamblado '{0}' no válido del atributo InternalsVisibleTo attribute en {1}.
fr: Nom d'assembly non valide '{0}' de l'attribut InternalsVisibleTo dans {1}
it: Nome assembly non valido '{0}' dall'attributo InternalsVisibleTo in {1}
ja: {1} の InternalsVisibleTo 属性のアセンブリ名 '{0}' が無効です
ko: {1}에 있는 InternalsVisibleTo 특성의 어셈블리 이름 '{0}'이(가) 잘못되었습니다.
pl: Nieprawidłowa nazwa zestawu „{0}” w atrybucie InternalsVisibleTo w elemencie {1}
pt_br: Nome de assembly inválido '{0}' do atributo InternalsVisibleTo em {1}
ru: Недопустимое имя сборки "{0}" из атрибута InternalsVisibleTo в {1}
tr: {1} içindeki InternalsVisibleTo özniteliğinden geçersiz bütünleştirilmiş kod adı '{0}'
zh_hans: 来自 {1} 中的 InternalsVisibleTo 特性的程序集名称“{0}”无效
zh_hant: {1} 中的 InternalsVisibleTo 屬性有無效的組件名稱 '{0}'

# InvalidInternalsVisibleToAssemblyName2
source: Invalid assembly name '{0}' from InternalsVisibleTo attribute (assembly filename not available)
cs: Neplatný název sestavení {0} z atributu InternalsVisibleTo (název souboru sestavení není dostupný)
de: Ungültiger Assemblyname "{0}" aus dem InternalsVisibleTo-Attribut (Assemblydateiname nicht verfügbar).
es: Nombre de ensamblado '{0}' no válido del atributo InternalsVisibleTo (nombre de archivo de ensamblado no disponible).
fr: Nom d'assembly non valide '{0}' de l'attribut InternalsVisibleTo (nom de fichier d'assembly non disponible)
it: Nome assembly non valido '{0}' dall'attributo InternalsVisibleTo (nome file di assembly non disponibile)
ja: InternalsVisibleTo 属性のアセンブリ名 '{0}' が無効です (アセンブリ ファイル名が使用できません)
ko: InternalsVisibleTo 특성의 어셈블리 이름 '{0}'이(가) 잘못되었습니다. 어셈블리 파일 이름을 사용할 수 없습니다.
pl: Nieprawidłowa nazwa zestawu „{0}” w atrybucie InternalsVisibleTo (nazwa pliku zestawu jest niedostępna)
pt_br: Nome de assembly inválido '{0}' do atributo InternalsVisibleTo (o nome de arquivo de assembly não está disponível)
ru: Недопустимое имя сборки "{0}" из атрибута InternalsVisibleTo (имя файла сборки недоступно)
tr: InternalsVisibleTo özniteliğinden geçersiz bütünleştirilmiş kod adı '{0}' (bütünleştirilmiş kod dosya adı kullanılamıyor)
zh_hans: 来自 InternalsVisibleTo 特性的程序集名称“{0}”无效(程序集文件名不可用)
zh_hant: InternalsVisibleTo 屬性中有無效的組件名稱 '{0}' (無法取得組件檔名)

# LoadedSourceNotFoundIgnoring
source: Could not load file '{0}' because it does not exist or is inaccessible
cs: Soubor {0} se nedal načíst, protože neexistuje nebo není dostupný.
de: Datei "{0}" konnte nicht geladen werden, weil sie nicht vorhanden oder nicht zugreifbar ist.
es: No se pudo cargar el archivo '{0}' porque no existe o no está accesible.
fr: Impossible de charger le fichier '{0}', car il n'existe pas ou n'est pas accessible
it: Non è stato possibile caricare il file '{0}' perché non esiste o non è accessibile
ja: ファイル '{0}' が存在しないか、アクセスできないため、ファイルを読み込むことができません
ko: '{0}' 파일이 없거나 이 파일에 액세스할 수 없으므로 파일을 로드할 수 없습니다.
pl: Nie można załadować pliku „{0}”, ponieważ nie istnieje lub jest niedostępny
pt_br: Não foi possível carregar o arquivo '{0}' porque ele não existe ou não está acessível
ru: Не удалось загрузить файл "{0}", так как он не существует или недоступен
tr: '{0}' dosyası olmadığı veya ona erişilemediği için yüklenemedi
zh_hans: 未能加载文件“{0}”，因为该文件不存在或无法访问
zh_hant: 無法載入檔案 '{0}'，因為它不存在或無法存取

# MSBuildReferenceResolutionError
source: {0} (Code={1})
cs: {0} (Kód={1})
es: {0} (código={1})
it: {0} (codice={1})
ja: {0} (コード={1})
ko: {0}(코드={1})
pl: {0} (Kod={1})
pt_br: {0} (código = {1})
ru: {0} (Код={1})
tr: {0} (Kod={1})
zh_hans: {0} (代码={1})
zh_hant: {0} (程式碼={1})

# TargetInvocationExceptionWrapper
source: internal error: {0}
cs: Vnitřní chyba: {0}
de: Interner Fehler: {0}
es: error interno: {0}
fr: erreur interne : {0}
it: errore interno: {0}
ja: 内部エラー: {0}
ko: 내부 오류: {0}
pl: błąd wewnętrzny: {0}
pt_br: erro interno: {0}
ru: внутренняя ошибка: {0}
tr: iç hata: {0}
zh_hans: 内部错误: {0}
zh_hant: 內部錯誤: {0}

# Parser.TOKEN.LBRACE.BAR
source: symbol '{|'
es: símbolo "{|"
fr: symbole '{|'
it: simbolo '{|'
ja: シンボル '{|'
ko: 기호 '{|'
pt_br: símbolo '{|'
ru: Обозначение '{|'
tr: sembol '{|'
zh_hans: 符号 "{|"
zh_hant: 符號 '{|'

# Parser.TOKEN.BAR.RBRACE
source: symbol '|}'
es: símbolo "|}"
fr: symbole '|}'
it: simbolo '|}'
ja: シンボル '|}'
ko: 기호 '|}'
pt_br: símbolo '|}'
ru: Обозначение '|}'
tr: sembol '|}'
zh_hans: 符号 "|}"
zh_hant: 符號 '|}'

# Parser.TOKEN.AND.BANG
source: keyword 'and!'
cs: klíčové slovo and!
de: Schlüsselwort "and!"
es: palabra clave 'and!'
fr: mot clé 'and!'
it: parola chiave 'and!'
ja: キーワード 'and!'
ko: 키워드 'and!'
pl: słowo kluczowe „and!”
pt_br: palavra-chave 'and!'
ru: ключевое слово "and!"
tr: 'and!' anahtar sözcüğü
zh_hans: 关键字 "and!"
zh_hant: 關鍵字 'and!'
