Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Parser.TOKEN.DOT.DOT.HAT
source: symbol '..^'
es: símbolo "..^"
fr: symbole '..^'
it: simbolo '..^'
ja: シンボル '..^'
ko: 기호 '..^'
pt_br: símbolo '..^'
ru: символ "..^"
tr: '..^' sembolü
zh_hans: 符号 "..^"
zh_hant: 符號 '..^'

# Parser.TOKEN.INTERP.STRING.BEGIN.END
source: interpolated string
cs: interpolovaný řetězec
de: Interpolierte Zeichenfolge
es: cadena interpolada
fr: chaîne interpolée
it: stringa interpolata
ja: 補間された文字列
ko: 보간 문자열
pl: ciąg interpolowany
pt_br: cadeia de caracteres interpolada
ru: интерполированная строка
tr: düz metin arasına kod eklenmiş dize
zh_hans: 内插字符串
zh_hant: 插補字串

# Parser.TOKEN.INTERP.STRING.BEGIN.PART
source: interpolated string (first part)
cs: interpolovaný řetězec (první část)
de: Interpolierte Zeichenfolge (erster Teil)
es: cadena interpolada (primera parte)
fr: chaîne interpolée (première partie)
it: stringa interpolata (prima parte)
ja: 補間された文字列 (最初の部分)
ko: 보간 문자열(첫 번째 부분)
pl: ciąg interpolowany (pierwsza część)
pt_br: cadeia de caracteres interpolada (primeira parte)
ru: интерполированная строка (первая часть)
tr: düz metin arasına kod eklenmiş dize (ilk parça)
zh_hans: 内插字符串(第一部分)
zh_hant: 插補字串 (第一個部分)

# Parser.TOKEN.INTERP.STRING.END
source: interpolated string (final part)
cs: interpolovaný řetězec (poslední část)
de: Interpolierte Zeichenfolge (letzter Teil)
es: cadena interpolada (parte final)
fr: chaîne interpolée (partie finale)
it: stringa interpolata (ultima parte)
ja: 補間された文字列 (最後の部分)
ko: 보간 문자열(마지막 부분)
pl: ciąg interpolowany (końcowa część)
pt_br: cadeia de caracteres interpolada (parte final)
ru: интерполированная строка (последняя часть)
tr: düz metin arasına kod eklenmiş dize (son parça)
zh_hans: 内插字符串(最终部分)
zh_hant: 插補字串 (最後部分)

# Parser.TOKEN.INTERP.STRING.PART
source: interpolated string (part)
cs: interpolovaný řetězec (část)
de: Interpolierte Zeichenfolge (Teil)
es: cadena interpolada (parte)
fr: chaîne interpolée (partie)
it: stringa interpolata (parte)
ja: 補間された文字列 (部分)
ko: 보간 문자열(부분)
pl: ciąg interpolowany (część)
pt_br: cadeia de caracteres interpolada (parte)
ru: интерполированная строка (часть)
tr: düz metin arasına kod eklenmiş dize (parça)
zh_hans: 内插字符串(部分)
zh_hant: 插補字串 (部分)

# SeeAlso
source: . See also {0}.
cs: . Viz taky {0}.
de: . Siehe auch "{0}".
es: . Vea también {0}.
fr: . Voir aussi {0}.
it: . Vedere anche {0}.
ja: 。{0} も参照してください。
ko: {0}도 참조하세요.
pl: . Zobacz też {0}.
pt_br: . Consulte também {0}.
ru: . См. также {0}.
tr: . Ayrıca bkz. {0}.
zh_hans: 。请参见 {0}。
zh_hant: 。請參閱 {0}。

# ConstraintSolverTupleDiffLengths
source: The tuples have differing lengths of {0} and {1}
cs: {0} a {1} mají v řazených kolekcích členů různou délku.
de: Die Tupel haben eine unterschiedliche Länge von {0} und {1}.
es: Las tuplas tienen longitudes diferentes de {0} y {1}.
fr: Les tuples ont des longueurs différentes de {0} et {1}
it: Le tuple sono di lunghezza diversa, ovvero {0} e {1}
ja: タプルには異なる長さの {0} と {1} があります
ko: 튜플의 길이가 {0}과(와) {1}(으)로 서로 다릅니다.
pl: Krotki mają różną długość ({0} i {1})
pt_br: As tuplas tem comprimentos diferentes de {0} e {1}
ru: Кортежи имеют различающиеся длины {0} и {1}
tr: Demetlerde farklı {0} ve {1} uzunlukları var
zh_hans: 元组具有不同长度的 {0} 和 {1}
zh_hant: 元組有 {0} 和 {1} 兩個不同長度

# ConstraintSolverInfiniteTypes
source: The types '{0}' and '{1}' cannot be unified.
cs: Typy {0} a {1} nemůžou být sjednocené.
de: Die Typen "{0}" und "{1}" können nicht vereinheitlicht werden.
es: Los tipos '{0}' y '{1}' no se pueden unificar.
fr: Impossible d'unifier les types '{0}' et '{1}'.
it: Non è possibile unificare i tipi '{0}' e '{1}'.
ja: 型 '{0}' と型 '{1}' は統合できません。
ko: 형식 '{0}' 및 '{1}'을(를) 통합할 수 없습니다.
pl: Typy „{0}” i „{1}” nie mogą zostać ujednolicone.
pt_br: Os tipos '{0}' e '{1}' não podem ser unificados.
ru: Невозможно объединить типы "{0}" и "{1}".
tr: {0}' ve '{1}' türleri birleştirilemez.
zh_hans: 类型“{0}”和“{1}”无法联合。
zh_hant: 無法整合類型 '{0}' 與 '{1}'。

# ConstraintSolverMissingConstraint
source: A type parameter is missing a constraint '{0}'
cs: V parametru typu chybí omezení {0}.
de: Einem Typparameter fehlt die Einschränkung "{0}".
es: Falta una restricción '{0}' en un parámetro de tipo.
fr: Contrainte manquante dans un paramètre de type '{0}'
it: Vincolo '{0}' mancante in un parametro di tipo
ja: 型パラメーターに制約 '{0}' がありません
ko: 형식 매개 변수에 제약 조건 '{0}'이(가) 없습니다.
pl: W parametrze typu brakuje ograniczenia „{0}”
pt_br: Um parâmetro de tipo não possui uma restrição '{0}'
ru: В параметре типа отсутствует ограничение "{0}"
tr: Bir tür parametresinde kısıtlama eksik '{0}'
zh_hans: 类型参数缺少约束“{0}”
zh_hant: 型別參數遺漏條件約束 '{0}'

# ConstraintSolverTypesNotInEqualityRelation1
source: The unit of measure '{0}' does not match the unit of measure '{1}'
cs: Měrná jednotka {0} se neshoduje s měrnou jednotkou {1}.
de: Die Maßeinheit "{0}" stimmt nicht mit der Maßeinheit "{1}" überein.
es: La unidad de medida '{0}' no coincide con la unidad de medida '{1}'.
fr: L'unité de mesure '{0}' ne correspond pas à l'unité de mesure '{1}'
it: L'unità di misura '{0}' non corrisponde all'unità di misura '{1}'
ja: 測定単位 '{0}' は測定単位 '{1}' と一致しません
ko: 측정 단위 '{0}'이(가) 측정 단위 '{1}'과(와) 일치하지 않습니다.
pl: Jednostka miary „{0}” nie jest zgodna z jednostką miary „{1}”
pt_br: A unidade de medida '{0}' não coincide com a unidade de medida '{1}'
ru: Единица измерения "{0}" не совпадает с единицей измерения "{1}"
tr: {0}' ölçü birimi '{1}' ölçü birimi ile eşleşmiyor
zh_hans: 度量单位“{0}”与度量单位“{1}”不匹配
zh_hant: 測量單位 '{0}' 不符合測量單位 '{1}'

# ConstraintSolverTypesNotInEqualityRelation2
source: The type '{0}' does not match the type '{1}'
cs: Typ {0} se neshoduje s typem {1}.
de: Der Typ "{0}" stimmt nicht mit dem Typ "{1}" überein.
es: El tipo '{0}' no coincide con el tipo '{1}'.
fr: Le type '{0}' ne correspond pas au type '{1}'
it: Il tipo '{0}' non corrisponde al tipo '{1}'
ja: 型 '{0}' は型 '{1}' と一致しません
ko: {0}' 형식이 '{1}' 형식과 일치하지 않습니다.
pl: Typ „{0}” nie jest zgodny z typem „{1}”
pt_br: O tipo '{0}' não coincide com o tipo '{1}'
ru: Тип "{0}" не совпадает с типом "{1}"
tr: {0}' türü '{1}' türü ile eşleşmiyor
zh_hans: 类型“{0}”与类型“{1}”不匹配
zh_hant: 類型 '{0}' 不符合類型 '{1}'

# ConstraintSolverTypesNotInSubsumptionRelation
source: The type '{0}' is not compatible with the type '{1}'{2}
cs: Typ {0} není kompatibilní s typem {1}{2}.
de: Der Typ "{0}" ist nicht mit dem Typ "{1}"{2} kompatibel.
es: El tipo '{0}' no es compatible con el tipo '{1}'{2}.
fr: Le type '{0}' n'est pas compatible avec le type '{1}'{2}
it: Il tipo '{0}' non è compatibile con il tipo '{1}'{2}
ja: 型 '{0}' は型 '{1}'{2} と互換性がありません
ko: {0}' 형식이 '{1}'{2} 형식과 호환되지 않습니다.
pl: Typ „{0}” nie jest zgodny z typem „{1}”{2}
pt_br: O tipo '{0}' não é compatível com o tipo '{1}'{2}
ru: Тип "{0}" несовместим с типом "{1}"{2}
tr: {0}' türü '{1}'{2} türüyle uyumlu değil
zh_hans: 类型“{0}”与类型“{1}”{2} 不兼容
zh_hant: 類型 '{0}' 與類型 '{1}'{2} 不相容

# ErrorFromAddingTypeEquation1
source: This expression was expected to have type\n '{1}' \nbut here has type\n '{0}' {2}
cs: U tohoto výrazu se očekával typ\n {1}, \nale tady je typu\n {0} {2}.
de: Dieser Ausdruck sollte den folgenden Typ aufweisen:\n "{1}" \nEr ist jedoch vom folgenden Typ:\n "{0}" {2}
es: Se esperaba que esta expresión tuviera el tipo\n '{1}' \npero aquí tiene el tipo\n '{0}' {2}
fr: Cette expression était censée avoir le type\n {1} \nmais elle a ici le type\n {0} {2}
it: Il tipo previsto di questa espressione è\n '{1}' \nma quello effettivo è\n '{0}' {2}
ja: この式に必要な型は\n '{1}' \nですが、ここでは次の型が指定されています\n '{0}' {2}
ko: 이 식에는\n '{1}' 형식이 필요하지만 \n여기에서는\n '{0}' 형식이 지정되었습니다. {2}
pl: Oczekiwany typ tego wyrażenia:\n „{1}” \nTyp w tym miejscu:\n „{0}” {2}
pt_br: Esperava-se que esta expressão tivesse o tipo\n '{1}' \n, mas aqui ela tem o tipo\n '{0}' {2}
ru: В данном выражении требовалось наличие типа\n "{1}" \n, но получен тип\n "{0}" {2}
tr: Bu ifadenin\n '{1}' \ntüründe olması bekleniyordu ancak buradaki tür\n '{0}' {2}
zh_hans: 此表达式应具有类型\n “{1}” \n而此处具有类型\n “{0}” {2}
zh_hant: 這個運算式必須為類型\n '{1}' \n但此處卻是類型\n '{0}' {2}

# ErrorFromAddingTypeEquation2
source: Type mismatch. Expecting a\n '{0}' \nbut given a\n '{1}' {2}\n
cs: Neshoda v typu. Očekávaný typ je \n {0}, \nale předávaný je\n {1} {2}.\n
de: Typenkonflikt. Erwartet:\n "{0}" \nErhalten:\n "{1}" {2}\n
es: No coinciden los tipos. Se esperaba\n '{0}' \npero se dio\n '{1}' {2}\n
fr: Incompatibilité de type. Attente de\n {0} \nmais obtention de\n {1} {2}\n
it: Tipo non corrispondente. Il tipo previsto è\n '{0}' \nma quello specificato è\n '{1}' {2}\n
ja: 型が一致しません。\n '{0}' \nという指定が必要ですが、\n '{1}' {2}\nが指定されました。
ko: 형식이 일치하지 않습니다.\n '{0}'이(가) \n필요하지만\n '{1}'이(가) 지정되었습니다. {2}\n
pl: Niezgodność typów. Oczekiwany typ:\n „{0}” \nOtrzymany typ:\n „{1}” {2}\n
pt_br: Tipos incompatíveis. Esperando um\n '{0}' \n, mas foi fornecido um\n '{1}' {2}\n
ru: Несоответствие типов. Требуется \n "{0}" \n, но получен\n "{1}" {2}\n
tr: Tür uyumsuzluğu. Beklenen şuydu:\n '{0}' \nancak şu sağlandı:\n '{1}' {2}\n
zh_hans: 类型不匹配。应为\n “{0}” \n而给定的是\n “{1}” {2}\n
zh_hant: 類型不符。必須是\n '{0}' \n但指定的是\n '{1}' {2}\n

# ErrorFromApplyingDefault1
source: Type constraint mismatch when applying the default type '{0}' for a type inference variable.
cs: Neshoda v omezení typu při použití výchozího typu {0} na proměnnou rozhraní typu
de: Typeinschränkungen stimmen nicht überein, wenn der Standardtyp "{0}" auf eine Typrückschlussvariable angewendet wird.
es: No coinciden las restricciones de tipo cuando se aplica el tipo predeterminado '{0}' para una variable de inferencia de tipos.
fr: Incompatibilité de contrainte de type lors de l'application du type par défaut '{0}' pour une variable d'inférence de type.
it: Vincolo di tipo non corrispondente all'applicazione del tipo predefinito '{0}' per una variabile di inferenza del tipo.
ja: 既定の型 '{0}' を型推論の変数に適用するときに、型の制約が一致しませんでした。
ko: 형식 유추 변수의 기본 형식 '{0}'을(를) 적용할 때 형식 제약 조건이 일치하지 않았습니다.
pl: Niezgodność ograniczeń podczas stosowania typu domyślnego „{0}” zmiennej wnioskowania typu.
pt_br: Restrições de tipo incompatíveis ao aplicar o tipo padrão '{0}' para uma variável de inferência de tipo.
ru: Несоответствие ограничений типов при применении типа по умолчанию "{0}" в качестве переменной определения типа.
tr: Tür çıkarma değişkeni için varsayılan '{0}' türü uygulanırken tür kısıtlaması uyuşmazlığı.
zh_hans: 在为类型推理变量应用默认类型“{0}”时，类型约束不匹配。
zh_hant: 套用類型推斷變數的預設類型 '{0}' 時，發生類型條件約束不符。

# ErrorFromApplyingDefault2
source: Consider adding further type constraints
cs: Zvažte přidání dalších omezení typu.
de: Fügen Sie ggf. weitere Typeinschränkungen hinzu.
es: Considere agregar más restricciones de tipo.
fr: Ajoutez des contraintes de type supplémentaires
it: Provare ad aggiungere ulteriori vincoli di tipo
ja: 型の制約を増やしてください
ko: 형식 제약 조건을 더 추가하세요.
pl: Rozważ dodanie kolejnych ograniczeń typów
pt_br: Considerar adicionar novas restrições de tipo
ru: Попробуйте добавить дополнительные ограничения типа
tr: Yeni tür kısıtlamaları eklemeyi düşünün
zh_hans: 请考虑添加更多类型约束
zh_hant: 請考慮加入進一步的類型條件約束

# ErrorsFromAddingSubsumptionConstraint
source: Type constraint mismatch. The type \n '{0}' \nis not compatible with type\n '{1}' {2}\n
cs: Neshoda v omezení typu. Typ \n {0} \nnení kompatibilní s typem\n {1}. {2}\n
de: Die Typeinschränkungen stimmen nicht überein. Der Typ \n "{0}" \nist nicht mit folgendem Typ kompatibel:\n "{1}" {2}\n
es: No coinciden las restricciones de tipo. El tipo \n '{0}' \nno es compatible con el tipo\n '{1}' {2}\n
fr: Incompatibilité de contrainte de type. Le type \n {0} \nn'est pas compatible avec le type\n {1} {2}\n
it: Vincolo di tipo non corrispondente. Il tipo \n '{0}' \nnon è compatibile con il tipo\n '{1}' {2}\n
ja: 型の制約が一致しません。次の型\n '{0}' \nは次の型と互換性がありません\n '{1}' {2}\n
ko: 형식 제약 조건이 일치하지 않습니다. \n '{0}' \n형식이\n '{1}' 형식과 호환되지 않습니다. {2}\n
pl: Niezgodność ograniczeń typów. Typ \n „{0}” \nnie jest zgodny z typem\n „{1}” {2}\n
pt_br: Restrições de tipo incompatíveis. O tipo \n '{0}' \nnão é compatível com o tipo\n '{1}' {2}\n
ru: Несоответствие ограничений типов. Тип \n "{0}" \nнесовместим с типом\n "{1}" {2}\n
tr: Tür kısıtlaması uyumsuzluğu. \n '{0}' \ntürü şu türle uyumlu değil:\n '{1}' {2}\n
zh_hans: 类型约束不匹配。类型 \n “{0}” \n与类型\n “{1}” {2} 不兼容\n
zh_hant: 類型條件約束不符。類型\n '{0}' \n不相容於類型\n '{1}' {2}\n

# UpperCaseIdentifierInPattern
source: Uppercase variable identifiers should not generally be used in patterns, and may indicate a missing open declaration or a misspelt pattern name.
cs: Identifikátory proměnných psané velkými písmeny se ve vzorech obecně nedoporučují. Můžou označovat chybějící otevřenou deklaraci nebo špatně napsaný název vzoru.
de: Variablenbezeichner in Großbuchstaben sollten im Allgemeinen nicht in Mustern verwendet werden und können ein Hinweis auf eine fehlende open-Deklaration oder einen falsch geschriebenen Musternamen sein.
es: En general, los identificadores de variables en mayúscula no deben usarse en patrones y pueden indicar una declaración abierta que falta o un nombre de patrón mal escrito.
fr: Les identificateurs de variables en majuscules ne doivent généralement pas être utilisés dans les modèles. Ils peuvent indiquer une absence de déclaration open ou un nom de modèle mal orthographié.
it: In genere è consigliabile non usare identificatori di variabili scritti in maiuscolo nei criteri perché potrebbero indicare una dichiarazione OPEN mancante o un nome di criterio con ortografia errata.
ja: 通常、大文字の変数識別子はパターンに使用できません。また、欠落している open 宣言か、つづりが間違っているパターン名を示す可能性があります。
ko: 일반적으로 대문자 변수 식별자는 패턴에 사용하지 말아야 합니다. 이러한 식별자는 열려 있는 선언이 없거나 철자가 잘못된 패턴 이름을 나타낼 수 있습니다.
pl: Identyfikatory zmiennych pisane wielkimi literami nie powinny być na ogół używane we wzorcach i mogą oznaczać brak deklaracji otwierającej lub błąd pisowni w nazwie wzorca.
pt_br: Identificadores de variáveis em maiúsculas geralmente não devem ser usados em padrões, podendo indicar uma declaração aberta ausente ou um nome de padrão escrito incorretamente.
ru: Идентификаторы переменных в верхнем регистре обычно не должны использоваться в шаблонах, и могут указывать на отсутствующую открытую декларацию или неправильно написанное имя шаблона.
tr: Büyük harfli değişken tanımlayıcıları desenlerde genel olarak kullanılmamalıdır. Bunlar, eksik bir açık bildirimin veya yanlış yazılmış bir desen adının göstergesi olabilirler.
zh_hans: 通常不得在模式中使用大写的变量标识符，存在它们可能表示缺少某个开放声明或某个模式名称拼写错误。
zh_hant: 通常不應在樣式中使用大寫的變數識別碼。這可能表示缺少公開宣告或樣式名稱拼字錯誤。

# NotUpperCaseConstructor
source: Discriminated union cases and exception labels must be uppercase identifiers
cs: Rozlišené případy typu union a popisky výjimek musí být identifikátory, které jsou psané velkými písmeny.
de: Diskriminierte Union-Fälle und Ausnahmebezeichnungen müssen Bezeichner in Großbuchstaben sein.
es: Las etiquetas de casos de unión discriminada y de excepciones deben ser identificadores en mayúscula.
fr: Les cas d'union discriminés et les étiquettes d'exception doivent être des identificateurs en majuscules
it: I case di unione discriminati e le etichette di eccezioni devono essere identificatori in lettere maiuscole
ja: 判別された共用体ケースと例外のラベルは、大文字の識別子にする必要があります
ko: 구분된 공용 구조체 케이스 및 예외 레이블은 대문자로 된 식별자여야 합니다.
pl: Rozróżniane przypadki unii i etykiety wyjątków muszą mieć postać identyfikatorów pisanych wielkimi literami
pt_br: Casos união discriminados e rótulos de exceção devem ser identificadores com maiúsculas
ru: Дискриминированные случаи объединения и метки исключений должны являться идентификаторами верхнего регистра
tr: Ayırt edici birleşim durumları ve özel durum etiketleri büyük harfli tanımlayıcılar olmalıdır
zh_hans: 可区分的联合用例和异常标签必须是大写的标识符
zh_hant: 差別聯集和例外狀況標籤必須是大寫的識別項

# FunctionExpected
source: This function takes too many arguments, or is used in a context where a function is not expected
cs: Tato funkce přebírá příliš mnoho argumentů, nebo se používá v kontextu, ve kterém se funkce neočekává.
de: Diese Funktion akzeptiert zu viele Argumente oder wird in einem Kontext verwendet, in dem keine Funktion erwartet wird.
es: Esta función toma demasiados argumentos o se usa en un contexto donde no se espera una función.
fr: Cette fonction accepte trop d'arguments ou est utilisée dans un contexte où aucune fonction n'est attendue
it: Questa funzione utilizza troppi argomenti oppure è utilizzata in un contesto in cui non è prevista una funzione
ja: この関数の引数が多すぎるか、関数を使用できない場所で関数が使用されています
ko: 이 함수는 너무 많은 인수를 사용하거나 함수가 필요하지 않은 컨텍스트에서 사용되었습니다.
pl: Ta funkcja akceptuje za dużo argumentów lub jest używana w kontekście, w którym funkcja nie jest oczekiwana
pt_br: Esta função obtém muitos argumentos, ou é usada em um contexto onde uma função não é esperada
ru: Эта функция принимает слишком много аргументов либо используется в контексте, где функции не допускаются
tr: Bu işlev çok fazla bağımsız değişken alıyor veya bir işlev beklenmeyen bağlamda kullanılıyor
zh_hans: 此函数采用的参数过多，或者用于不需要函数的上下文中
zh_hant: 這個函式接受太多引數，或是用在不需要函式的內容中

# BakedInMemberConstraintName
source: Member constraints with the name '{0}' are given special status by the F# compiler as certain .NET types are implicitly augmented with this member. This may result in runtime failures if you attempt to invoke the member constraint from your own code.
cs: Kompilátor F# udělil omezením člena s názvem {0} zvláštní statut, protože některé typy .NET jsou o tento člen implicitně rozšířené. Pokud se budete pokoušet vyvolat omezení člena z vlastního kódu, může to způsobit potíže za běhu.
de: Membereinschränkungen mit dem Namen "{0}" erhalten vom F#-Compiler einen Sonderstatus, da bestimmte .NET-Typen mit diesem Member implizit augmentiert werden. Dies kann Laufzeitfehler zur Folge haben, falls Sie versuchen, die Membereinschränkung in Ihrem eigenen Code aufzurufen.
es: El compilador de F# da un estado especial a las restricciones de miembro con el nombre '{0}' porque determinados tipos .NET aumentan de forma implícita con este miembro. Esto puede dar lugar a errores en tiempo de ejecución si intenta invocar la restricción de miembro desde su propio código.
fr: Les contraintes de membre portant le nom '{0}' reçoivent un état spécial de la part du compilateur F#, car certains types .NET sont augmentés implicitement avec ce membre. Cela peut entraîner des problèmes de runtime si vous tentez d'appeler la contrainte de membre à partir de votre propre code.
it: Ai vincoli di membro con nome '{0}' è assegnato uno stato speciale dal compilatore F# perché determinati tipi .NET sono aumentati in modo implicito con il membro. Ciò potrebbe causare errori di runtime se si prova a richiamare il vincolo del membro dal codice.
ja: '{0}' というメンバーである .NET 型が暗黙的に拡張される場合、このメンバーの制約には F# コンパイラーによって特殊な状態が付与されます。その結果、作成したコードからこのメンバーの制約を呼び出そうとすると、ランタイム エラーが発生します。
ko: 이름이 '{0}'인 멤버 제약 조건에는 F# 컴파일러에 의해 특수한 상태가 지정됩니다(특정 .NET 형식은 이 멤버를 사용하여 암시적으로 확대될 수 있음). 이로 인해 사용자 코드로부터 멤버 제약 조건을 호출할 경우 런타임 오류가 발생할 수 있습니다.
pl: Ograniczenia elementu członkowskiego o nazwie „{0}” mają specjalny stan określony przez kompilator języka F#, ponieważ pewne typy platformy .NET zostały niejawnie rozszerzone przy użyciu tego elementu członkowskiego. Może to powodować błędy środowiska uruchomieniowego, jeśli będziesz próbować wywołać ograniczenie elementu członkowskiego ze swojego kodu.
pt_br: O compilador de F# concedeu status especial às restrições de membros com o nome '{0}', pois certos tipos .NET são aumentados implicitamente com seus membros. Isto pode resultar em falhas em tempo de execução se você tentar chamar a restrição de membro de seu próprio código.
ru: Ограничения элементов с именем "{0}" получают особый статус в компиляторе F#, так как некоторые типы .NET неявно приращиваются к этим элементам. Результатом могут послужить сбои во время выполнения при попытке вызова ограничения элемента из собственного кода.
tr: Belirli .NET türleri örtük olarak bu üyeyle genişletildiği için '{0}' adlı üye kısıtlamalarına F# derleyicisi tarafından özel durum verildi. Üye kısıtlamasını kendi kodunuzdan çağırmayı denerseniz, bu, çalışma zamanı hatalarıyla sonuçlanabilir.
zh_hans: F# 编译器为名称为“{0}”的成员约束给定了特殊状态，因为使用此成员隐式扩大了某些 .NET 类型。如果您尝试从自己的代码中调用该成员约束，则可能会导致运行时失败。
zh_hant: F# 編譯器會為名稱為 '{0}' 的成員條件約束指定特殊狀態，因為某些 .NET 類型會隱含用這個成員增強。如果您試圖從您自己的程式碼叫用這個成員條件約束，可能導致執行階段失敗。

# BadEventTransformation
source: A definition to be compiled as a .NET event does not have the expected form. Only property members can be compiled as .NET events.
cs: Definice, která se má zkompilovat jako událost .NET, nemá očekávanou podobu. Jako události .NET se dají zkompilovat jenom členové vlastností.
de: Eine Definition, die als .NET-Ereignis kompiliert werden soll, weist nicht die erwartete Form auf. Nur Eigenschaftenmember können als .NET-Ereignisse kompiliert werden.
es: Una definición que debe compilarse como un evento .NET no tiene el formato esperado. Solo los miembros de propiedad se pueden compilar como eventos .NET.
fr: Une définition qui doit être compilée en tant qu'événement .NET n'a pas la forme attendue. Seuls les membres de propriété peuvent être compilés en tant qu'événements .NET.
it: Una definizione da compilare come evento .NET non è nel formato previsto. È possibile compilare come eventi .NET solo membri di proprietà.
ja: .NET イベントとしてコンパイルされる定義の形式に誤りがあります。.NET イベントとしてコンパイルできるのはプロパティ メンバーのみです。
ko: .NET 이벤트로 컴파일될 정의의 형식이 필요한 형식이 아닙니다. 속성 멤버만 .NET 이벤트로 컴파일될 수 있습니다.
pl: Definicja, która ma zostać skompilowana jako zdarzenie platformy .NET, nie ma oczekiwanej formy. Tylko elementy członkowskie właściwości mogą być kompilowane jako zdarzenia platformy .NET.
pt_br: Uma definição a ser compilada como um evento .NET não tem a forma esperada. Apenas membros de propriedade podem ser compilados como eventos .NET.
ru: Определение к компиляции в качестве события .NET не имеет требуемой формы. Только элементы свойств могут компилироваться как события .NET.
tr: .NET olayı olarak derlenecek bir tanım beklenen biçimde değil. Yalnızca özellik üyeleri .NET olayları olarak tanımlanabilir.
zh_hans: 要编译为 .NET 事件的定义不具有预期格式。只可以将属性成员编译为 .NET 事件。
zh_hant: 要編譯為 .NET 事件的定義不是採用需要的形式。只有屬性成員可以編譯為 .NET 事件。

# ParameterlessStructCtor
source: Implicit object constructors for structs must take at least one argument
cs: Implicitní konstruktory objektu pro struktury musí přebírat aspoň jeden argument.
de: Implizite Objektkonstruktoren für Strukturen müssen mindestens ein Argument akzeptieren.
es: Los constructores de objetos implícitos para structs deben tomar al menos un argumento.
fr: Les constructeurs d'objets implicites des structs doivent accepter au moins un argument
it: I costruttori di oggetto impliciti per gli struct devono utilizzare almeno un argomento
ja: 構造体の暗黙的なオブジェクト コンストラクターには、少なくとも 1 つの引数が必要です
ko: 구조체에 대한 암시적 개체 생성자는 하나 이상의 인수를 사용해야 합니다.
pl: Niejawne konstruktory obiektów struktur muszą akceptować co najmniej jeden argument
pt_br: Construtores de objetos implícitos para structs devem obter pelo menos um argumento
ru: Конструкторы неявных объектов для структур должны принимать по меньшей мере один аргумент
tr: Yapıların örtük nesne oluşturucuları en az bir bağımsız değişken almalıdır
zh_hans: 结构的隐式对象构造函数必须采用至少一个参数
zh_hant: 結構的隱含物件建構函式必須至少接受一個引數
