Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# RecursiveUseCheckedAtRuntime
source: This recursive use will be checked for initialization-soundness at runtime. This warning is usually harmless, and may be suppressed by using '#nowarn "21"' or '--nowarn:21'.
cs: U tohoto rekurzivního použití se bude kontrolovat stabilita inicializace za běhu. Toto upozornění je obvykle neškodné a pomocí #nowarn "21" nebo --nowarn:21 se dá potlačit.
de: Diese rekursive Verwendung wird zur Laufzeit auf ihre ordnungsgemäße Initialisierung geprüft. Diese Warnung ist in der Regel harmlos und kann mithilfe von "#nowarn "21"" oder "--nowarn 21" unterdrückt werden.
es: Este uso recursivo se comprobará para ver si tiene inicialización silenciosa en tiempo de ejecución. Esta advertencia suele ser inocua y se puede suprimir con '#nowarn "21"' o '--nowarn:21'.
fr: Cette utilisation récursive sera soumise à un contrôle de l'initialisation au moment de l'exécution. En règle générale, cet avertissement est sans danger et peut être supprimé à l'aide de '#nowarn "21"' ou '--nowarn:21'.
it: La correttezza dell'inizializzazione al runtime di questo utilizzo ricorsivo verrà verificata. Questo avviso non indica in genere un problema concreto e può essere disabilitato mediante '#nowarn "21"' o '--nowarn:21'.
ja: この再帰的な用法は、実行時に初期化の正常性がチェックされます。通常、この警告は害がないため、'#nowarn "21"' または '--nowarn:21' を使用して抑制することができます。
ko: 이러한 재귀적 사용은 런타임에 초기화 적합성이 확인됩니다. 이 경고는 일반적으로 무해하며 '#nowarn "21"' 또는 '--nowarn:21'을 사용하여 표시하지 않을 수 있습니다.
pl: To użycie cykliczne zostanie sprawdzone pod kątem poprawności inicjalizacji w środowisku uruchomieniowym. To ostrzeżenie zazwyczaj nie jest szkodliwe i można je pominąć przy użyciu elementu „#nowarn "21"” lub „--nowarn:21”.
pt_br: Este uso recursivo passará por verificação de solidez de inicialização no tempo de execução. Este aviso normalmente é inofensivo e pode ser suprimido usando '#nowarn "21"' ou '--nowarn:21'.
ru: Это рекурсивное использование будет проверено на правильность инициализации во время выполнения. Данное предупреждение обычно безвредно; его можно отменить, используя #nowarn "21" или --nowarn 21.
tr: Bu özyinelemeli kullanım çalışma zamanında başlatma sağlamlığı açısından denetlenecek. Bu uyarı genellikle zararsızdır ve '#nowarn "21"' veya '--nowarn:21' kullanılarak gizlenebilir.
zh_hans: 将检查此递归使用能否在运行时完整地进行初始化。此警告通常是无害的，可以使用“#nowarn "21"”或“--nowarn:21”来取消显示此警告。
zh_hant: 這個遞迴用途會在執行階段檢查初始化是否正確。這個警告通常是無害的，可以使用 '#nowarn "21"' 或 '--nowarn:21' 予以隱藏。

# LetRecUnsound1
source: The value '{0}' will be evaluated as part of its own definition
cs: Hodnota {0} se vyhodnotí v rámci její vlastní definice.
de: Der Wert "{0}" wird als Teil seiner eigenen Definition ausgewertet.
es: El valor '{0}' se evaluará como parte de su propia definición.
fr: La valeur '{0}' sera évaluée dans le cadre de sa propre définition
it: Il valore '{0}' verrà valutato come parte della propria definizione
ja: 値 '{0}' はその定義の一部として評価されます
ko: 값 '{0}'은(는) 자체 정의의 일부로 계산됩니다.
pl: Wartość „{0}” zostanie obliczona w ramach swojej definicji
pt_br: O valor '{0}' será avaliado como parte de sua própria definição
ru: Значение "{0}" будет оценено как часть его собственного определения
tr: '{0}' değeri kendi tanımının parçası olarak hesaplanacak
zh_hans: 值“{0}”将作为其自身定义的一部分进行计算
zh_hant: 值 '{0}' 將在它自己的定義內評估

# LetRecUnsound2
source: This value will be eventually evaluated as part of its own definition. You may need to make the value lazy or a function. Value '{0}'{1}.
cs: Tato hodnota se nakonec vyhodnotí v rámci její vlastní definice. Možná bude potřeba, abyste hodnotu změnili na opožděnou nebo na funkci. Hodnota {0}{1}.
de: Dieser Wert wird schließlich als Teil seiner eigenen Definition ausgewertet. Möglicherweise müssen Sie den Wert verzögern oder als Funktion festlegen. Wert "{0}"{1}.
es: Este valor se evaluará finalmente como parte de su propia definición. Puede ser necesario convertir el valor en Lazy o una función. Valor '{0}'{1}.
fr: Cette valeur sera finalement évaluée dans le cadre de sa propre définition. Vous pouvez en faire une valeur tardive ou une fonction. Valeur '{0}'{1}.
it: Questo valore verrà in seguito valutato come parte della propria definizione. Potrebbe essere necessario rendere il valore lazy o una funzione. Valore '{0}'{1}.
ja: 最終的に、この値はその定義の一部として評価されます。必要に応じて、値を 'lazy' にするか、関数にしてください。値 '{0}'{1}。
ko: 이 값은 결국 자체 정의의 일부로 계산됩니다. 값을 지연 값 또는 함수로 만들어야 할 수 있습니다. 값 '{0}'{1}입니다.
pl: Ta wartość zostanie ostatecznie obliczona w ramach swojej definicji. Może być konieczne ustawienie wartości jako wartości opóźnionej lub funkcji. Wartość: „{0}”{1}.
pt_br: Este valor será eventualmente avaliado como parte de sua própria definição. Talvez seja necessário tornar o valor ocioso ou transformá-lo em uma função. Valor '{0}'{1}.
ru: Это значение впоследствии будет оценено как часть его собственного определения. Может потребоваться сделать значение неактивным или функцией. Значение "{0}"{1}.
tr: Bu değer sonuç olarak kendi tanımının parçası olarak hesaplanacak. Bu değeri geç değer veya işlev yapmanız gerekebilir. Değer: '{0}'{1}.
zh_hans: 此值最终将作为其自身定义的一部分进行计算。您可能需要采用延迟值或函数。值“{0}”{1}。
zh_hant: 這個值最後將在它自己的定義內評估。您必須將這個值設為 Lazy 或函式。值 '{0}'{1}。

# LetRecUnsoundInner
source: will evaluate '{0}'
cs: se vyhodnotí jako {0}
de: wird zu "{0}" ausgewertet
es: evaluará '{0}'.
fr: va prendre la valeur '{0}'
it: valuterà '{0}'
ja: は '{0}' を評価します
ko: '{0}'을(를) 계산합니다.
pl: obliczy wartość „{0}”
pt_br: avaliará '{0}'
ru: вычислит "{0}"
tr: '{0}' sonucunu verecek
zh_hans: 将计算“{0}”
zh_hant: 將評估 '{0}'

# LetRecEvaluatedOutOfOrder
source: Bindings may be executed out-of-order because of this forward reference.
cs: Vazby se můžou kvůli tomuto dopřednému odkazu provádět ve špatném pořadí.
de: Bindungen werden aufgrund dieses Vorwärtsverweises möglicherweise in der falschen Reihenfolge ausgeführt.
es: Los enlaces se pueden ejecutar sin orden debido a esta referencia adelantada.
fr: Des liaisons peuvent être exécutées dans le désordre en raison de cette référence anticipée.
it: I binding potrebbero non essere eseguiti nell'ordine corretto a causa di questo riferimento in avanti.
ja: この前方参照があるため、束縛が順序どおりに実行されない可能性があります。
ko: 이 전방 참조로 인해 바인딩을 순서에 상관없이 실행할 수 있습니다.
pl: Powiązania mogą być wykonywane w niepoprawnej kolejności z powodu tego odwołania w przód.
pt_br: Associações podem ser executadas fora de ordem devido a esta referência de encaminhamento.
ru: Из-за этой короткой ссылки привязки могут выполняться с нарушением порядка.
tr: Bu ileriye doğru başvuru nedeniyle bağlamalar sırasız yürütülebilir.
zh_hans: 可以执行无序绑定，因为存在此前向引用。
zh_hant: 因為這個向前參考的關係，繫結可能未依序執行。

# LetRecCheckedAtRuntime
source: This and other recursive references to the object(s) being defined will be checked for initialization-soundness at runtime through the use of a delayed reference. This is because you are defining one or more recursive objects, rather than recursive functions. This warning may be suppressed by using '#nowarn "40"' or '--nowarn:40'.
cs: U tohoto a dalších rekurzivních odkazů na definované objekty se bude kontrolovat stabilita inicializace za běhu pomocí zpožděného odkazování. Je to kvůli tomu, že definujete rekurzivní objekty místo rekurzivních funkcí. Toto upozornění se dá pomocí #nowarn "40" nebo --nowarn:40 potlačit.
de: Dieser und andere rekursive Verweise auf das bzw. die definierte(n) Objekt(e) werden zur Laufzeit mithilfe eines verzögerten Verweises auf ihre ordnungsgemäße Initialisierung geprüft. Der Grund hierfür ist, dass Sie mindestens ein rekursives Objekt definieren, keine rekursiven Funktionen. Diese Warnung kann mithilfe von "#nowarn "40"" oder "--nowarn 40" unterdrückt werden.
es: Esta y otras referencias recursivas al objeto que se va a definir se comprobarán para ver si tienen inicialización silenciosa en tiempo de ejecución mediante el uso de una referencia retardada. Esto se debe a que está definiendo uno o varios objetos recursivos en lugar de funciones recursivas. Esta advertencia se puede suprimir con '#nowarn "40" o --nowarn:40'.
fr: Toutes les références récursives aux objets définis seront soumises à un contrôle de l'initialisation au moment de l'exécution via l'utilisation d'une référence différée. En effet, vous définissez un ou plusieurs objets récursifs à la place de fonctions récursives. Cet avertissement peut être supprimé à l'aide de '#nowarn "40"' ou '--nowarn:40'.
it: Questo e altri riferimenti ricorsivi a uno o più oggetti in fase di definizione verranno controllati per verificare la correttezza dell'inizializzazione al runtime tramite un riferimento ritardato. Tale verifica è necessaria perché si stanno definendo uno o più oggetti ricorsivi, invece di funzioni ricorsive. La visualizzazione di questo avviso può essere impedita mediante '#nowarn "40"' o '--nowarn:40'.
ja: 定義されるオブジェクトに対するこの再帰参照および他の再帰参照は、遅延参照を使用して、実行時に初期化の正常性がチェックされます。これは、再帰関数ではなく、1 つまたは複数の再帰オブジェクトを定義しているためです。この警告を抑制するには、'#nowarn "40"' または '--nowarn:40' を使用してください。
ko: 이 재귀 참조와 정의 대상 개체에 대한 기타 재귀 참조는 런타임에 지연된 참조를 사용하여 초기화 적합성이 확인됩니다. 이는 사용자가 재귀 함수 대신 하나 이상의 재귀적 개체를 정의하기 때문입니다. 이 경고는 '#nowarn "40"' 또는 '--nowarn:40'을 사용하여 표시하지 않을 수 있습니다.
pl: To i inne odwołania rekursywne do definiowanych obiektów zostaną sprawdzone pod kątem poprawności inicjalizacji w środowisku uruchomieniowym przy użyciu opóźnionego odwołania. Jest to spowodowane tym, że definiujesz co najmniej jeden obiekt rekursywny zamiast funkcji rekursywnych. To ostrzeżenie można pominąć przy użyciu elementu „#nowarn "40"” lub „--nowarn:40”.
pt_br: Esta e outras referências recursivas dos objetos que estão sendo definidos passarão por verificação de solidez de inicialização em tempo de execução através do uso de uma referência atrasada. Isto porque você está definindo um ou mais objetos recursivos ao invés de funções recursivas. Este aviso pode ser suprimido com o uso de '#nowarn "40"' ou '--nowarn:40'.
ru: Эта и другие рекурсивные ссылки на определяемый объект будут проверены на правильность инициализации во время выполнения посредством использования отложенной ссылки. Это происходит потому, что вы определяете один или несколько рекурсивных объектов, а не рекурсивных функций. Данное предупреждение можно отменить, используя #nowarn "40" или --nowarn 40.
tr: Tanımlanmakta olan nesnelere yönelik bu ve diğer özyinelemeli başvurular, gecikmeli başvuru kullanımı aracılığıyla başlatma sağlamlığı açısından çalışma zamanında denetlenecek. Bunun nedeni, özyinelemeli işlev yerine bir veya daha fazla özyinelemeli nesne tanımlamanızdır. Bu uyarı, '#nowarn "40"' veya '--nowarn:40' kullanılarak gizlenebilir.
zh_hans: 将检查对要定义的对象的此引用和其他递归引用，以查看其在运行时能否通过使用延迟的引用来完整地进行初始化。这是因为您定义的是一个或多个递归对象，而不是递归函数。可以使用“#nowarn "40"”或“--nowarn:40”来禁止显示此警告。
zh_hant: 這個和其他對所定義物件的遞迴參考，將在執行階段透過使用延遲參考來檢查初始化是否正確。這是因為您定義的是一個或多個遞迴物件，而不是遞迴函式。使用 '#nowarn "40"' 或 '--nowarn:40' 可以隱藏這個警告。

# SelfRefObjCtor1
source: Recursive references to the object being defined will be checked for initialization soundness at runtime through the use of a delayed reference. Consider placing self-references in members or within a trailing expression of the form '<ctor-expr> then <expr>'.
cs: U rekurzivních odkazů na definované objekty se bude kontrolovat stabilita inicializace za běhu pomocí zpožděného odkazování. Zvažte možnost přidat odkazy na sebe sama do členů nebo koncového výrazu v podobě <výraz-konstruktoru> then <výraz>.
de: Rekursive Verweise auf das definierte Objekt werden zur Laufzeit mithilfe eines verzögerten Verweises auf ihre ordnungsgemäße Initialisierung geprüft. Sie sollten in Membern oder innerhalb eines nachgestellten Ausdrucks Eigenverweise im Format "<ctor-expr> then <expr>" platzieren.
es: Las referencias recursivas al objeto que se está definiendo se verifican para determinar la solidez de la inicialización en el tiempo de ejecución mediante el uso de una referencia en diferido. Considere la colocación de autorreferencias en miembros o dentro de una expresión final con la forma "<ctor-expr> then <expr>".
fr: Les références récursives à l'objet en cours de définition sont soumises à un contrôle d'initialisation au moment de l'exécution à l'aide d'une référence différée. Placez des auto-références dans les membres ou dans une expression de fin de la forme '<ctor-expr> then <expr>'.
it: I riferimenti ricorsivi all'oggetto in fase di definizione verranno controllati per verificare la correttezza dell'inizializzazione al runtime tramite l'uso di un riferimento ritardato. Provare a inserire autoriferimenti nei membri o in un'espressione finale nel formato '<ctor-expr> then <expr>'.
ja: 定義しているオブジェクトへの再帰的参照は、遅延参照を使用して実行時に初期化の正常性がチェックされます。メンバー内、または '<ctor-expr> then <expr>' の後続の式内に自己参照を配置してください。
ko: 정의 대상 개체에 대한 재귀 참조는 런타임에 지연된 참조를 사용하여 초기화 적합성이 확인됩니다. 멤버 또는 '<ctor-expr> then <expr>' 형식의 후행 식 내에 자기 참조를 배치하세요.
pl: Odwołania cykliczne do definiowanego obiektu będą sprawdzane pod kątem poprawności inicjowania w czasie wykonywania przy użyciu opóźnionego odwołania. Rozważ umieszczenie odwołań własnych w składowych lub w wyrażeniu końcowym w postaci „<wyrażenie-konstruktora> then <wyrażenie>”.
pt_br: Referências recursivas ao objeto que está sendo definido serão verificadas quanto à integridade da inicialização no tempo de execução através do uso de uma referência atrasada. Coloque referências próprias em membros ou em uma expressão à direita do forma '< ctor-expr > then < expr >'.
ru: Правильная инициализация рекурсивных ссылок на определяемый объект будут проверяться во время выполнения с использованием отложенных ссылок. Разместите рекурсивные ссылки в членах или в завершающем выражении в виде '<ctor-expr> then <expr>'.
tr: Tanımlanmakta olan nesneye yönelik özyinelemeli başvurular, çalışma zamanında gecikmeli bir başvuru kullanılarak başlatma sağlamlığı açısından denetlenir. Üyelerin veya sondaki bir ifadenin içine '<ctor-expr> sonra <expr>' biçiminde kendi kendine başvurular yerleştirmeyi göz önünde bulundurun.
zh_hans: 将检查对要定义的对象的递归引用，以查看其在运行时能否通过使用延迟的引用来完整地进行初始化。请考虑在成员中或 "<ctor-expr> then <expr>" 格式的尾随表达式中放置自引用。
zh_hant: 在執行階段，會透過使用延遲參考來檢查所定義物件的遞迴參考初始設定是否正確。請考慮在成員或 '<ctor-expr> then <expr>' 形式的後置運算式中放置自我參考。

# SelfRefObjCtor2
source: Recursive references to the object being defined will be checked for initialization soundness at runtime through the use of a delayed reference. Consider placing self-references within 'do' statements after the last 'let' binding in the construction sequence.
cs: U rekurzivních odkazů na definované objekty se bude kontrolovat stabilita inicializace za běhu pomocí zpožděného odkazování. Zvažte možnost přidat do příkazů do za poslední vazbou let v sekvenci konstruktoru odkazy na sebe sama.
de: Rekursive Verweise auf das definierte Objekt werden zur Laufzeit mithilfe eines verzögerten Verweises auf ihre ordnungsgemäße Iniitalisierung geprüft. Sie sollten in do-Anweisungen hinter der letzten let-Bindung in der Konstruktionssequenz Eigenverweise platzieren.
es: Las referencias recursivas al objeto que se va a definir se comprobarán para ver si tienen inicialización silenciosa en tiempo de ejecución mediante el uso de una referencia retardada. Considere poner autorreferencias en instrucciones 'do' después del último enlace 'let' en la secuencia de construcción.
fr: Les références récursives à l'objet défini seront soumises à un contrôle de l'initialisation au moment de l'exécution via l'utilisation d'une référence différée. Placez des auto-références dans les instructions 'do' après la dernière liaison 'let' de la séquence de construction.
it: I riferimenti ricorsivi all'oggetto in fase di definizione verranno controllati per verificare la correttezza dell'inizializzazione al runtime tramite un riferimento ritardato. Provare a inserire autoriferimenti in istruzioni 'do' dopo l'ultimo binding 'let' nella sequenza di costruzione.
ja: 定義されるオブジェクトに対する再帰参照は、遅延参照を使用して、実行時に初期化の正常性がチェックされます。構築シーケンスの最後の 'let' 束縛の後にある 'do' ステートメント内に、自己参照を配置してください。
ko: 정의 대상 개체에 대한 재귀 참조는 런타임에 지연된 참조를 사용하여 초기화 적합성이 확인됩니다. 생성 시퀀스의 'do' 문 내에서 마지막 'let' 바인딩 다음에 자기 참조를 배치하세요.
pl: Odwołania cykliczne do definiowanego obiektu zostaną sprawdzone pod kątem poprawności inicjalizacji w środowisku uruchomieniowym przy użyciu opóźnionego odwołania. Rozważ umieszczenie odwołań własnych w instrukcjach „do” po ostatnim powiązaniu „let” w sekwencji konstrukcji.
pt_br: Referências recursivas ao objeto que está sendo definido terão sua solidez de inicialização verificada em tempo de execução, por meio do uso de uma referência atrasada. Considere colocar autorreferências em instruções 'do' após a última associação 'let' na sequência de construção.
ru: Рекурсивные ссылки на определяемый объект будут проверены на правильность инициализации во время выполнения посредством использования отложенной ссылки. Попробуйте разместить рекурсивные ссылки в операторах "do" после последнего "let" с привязкой к последовательности конструкторов.
tr: Tanımlanmakta olan nesneye yapılan özyinelemeli başvurular, geç başvuru kullanımı aracılığıyla çalışma zamanında başlatma sağlamlığı açısından denetlenecek. Kendine yapılan başvuruları yapı dizisindeki sonuncu 'let' bağlamasından sonra 'do' deyimlerinin içine yerleştirmeyi düşünün.
zh_hans: 将检查对要定义的对象的递归引用，以查看其在运行时能否通过使用延迟的引用来完整地进行初始化。请考虑在构造序列中的最后一个“let”绑定后的“do”语句中放置自引用。
zh_hant: 對所定義物件的遞迴參考，將在執行階段透過使用延遲參考來檢查初始化是否正確。請考慮將自我參考放在建構順序中最後一個 'let' 繫結後的 'do' 陳述式內。

# VirtualAugmentationOnNullValuedType
source: The containing type can use 'null' as a representation value for its nullary union case. Invoking an abstract or virtual member or an interface implementation on a null value will lead to an exception. If necessary add a dummy data value to the nullary constructor to avoid 'null' being used as a representation for this type.
cs: Nadřazený typ může použít null jako hodnotu reprezentace pro svůj prázdný případ typu union. Vyvolání abstraktního nebo virtuálního člena nebo implementace rozhraní u hodnoty null způsobí výjimku. Pokud je to nutné, přidejte do prázdného konstruktoru fiktivní datovou hodnotu, abyste předešli tomu, že se null použije jako reprezentace tohoto typu.
de: Der enthaltende Typ kann NULL als Darstellungswert für seinen nullären Union-Fall verwenden. Das Aufrufen eines abstrakten oder virtuellen Members oder einer Schnittstellenimplementierung für einen NULL-Wert verursacht eine Ausnahme. Fügen Sie dem nullären Konstruktor bei Bedarf einen Platzhalterdatenwert hinzu, damit NULL nicht als Darstellung für diesen Typ verwendet wird.
es: El tipo contenedor puede usar 'null' como valor de representación para el caso de unión que acepta valores NULL. Si se invoca un miembro abstracto o virtual, o una implementación de interfaz con un valor NULL, se producirá una excepción. Si es necesario, agregue un valor de datos ficticio al constructor que acepta valores NULL para evitar que se use 'null' como representación de este tipo.
fr: Le type conteneur peut utiliser 'null' en tant que valeur de représentation pour son cas d'union nullaire. L'appel d'un membre abstrait ou virtuel, ou d'une implémentation d'interface, sur une valeur null entraîne la levée d'une exception. Si nécessaire, ajoutez une valeur de données factice au constructeur nullaire pour éviter d'utiliser 'null' en tant que représentation pour ce type.
it: Il tipo contenitore può utilizzare 'null' come valore di rappresentazione per il relativo case di unione nullary. Se si richiama un membro astratto o virtuale oppure un'implementazione di interfaccia su un valore Null, verrà generata un'eccezione. Se necessario, aggiungere un valore di dati fittizio al costruttore nullary in modo da evitare che sia utilizzato 'null' come rappresentazione per il tipo.
ja: 含まれる型は、引数がない共用体ケースの表現値として 'null' を使用できます。null 値で抽象メンバー、仮想メンバー、またはインターフェイスの実装を呼び出すと、例外が発生します。必要に応じて、引数がないコンストラクターにダミーのデータ値を追加して、この型の表現として 'null' が使用されないようにしてください。
ko: 포함하는 형식은 'null'을 해당 nullary 공용 구조체 케이스에 대한 표현 값으로 사용할 수 있습니다. null 값에 대해 추상 또는 가상 멤버나 인터페이스 구현을 호출하면 예외가 발생합니다. 필요한 경우 nullary 생성자에 더미 데이터 값을 추가하여 'null'이 이 형식의 표현으로 사용되지 않게 하세요.
pl: Zawierający typ może używać wartości „null” jako wartości reprezentacji przypadku unii o wartości null. Wywołanie abstrakcyjnego lub wirtualnego elementu członkowskiego albo implementacji interfejsu z wartością null spowoduje wystąpienie wyjątku. Jeśli to konieczne, dodaj fikcyjną wartość danych do konstruktora o wartości null, aby wartość „null” nie była używana jako reprezentacja tego typu.
pt_br: O tipo recipiente pode usar 'null' como um valor de representação para seu caso união nulário. Chame um membro virtual ou abstrato, caso contrário, uma implementação de interface em um valor nulo levará a uma exceção. Se necessário, adicione um valor fictício ao construtor nulário para evitar que 'null' seja usado como uma representação para este tipo.
ru: Содержащийся тип может использовать для своего случая нулевого объединения "null". Вызов абстрактного или виртуального элемента, или же реализации интерфейса на нулевом значении приведет к исключению. При необходимости добавьте в нулевой конструктор значение-заполнитель, чтобы избежать использования "null" в качестве представления для данного типа.
tr: Kapsayıcı tür, kendisinin işlenensiz birleşim durumunun temsili değeri olarak 'null' kullanabilir. Null bir değerde soyut veya sanal bir üyeyi ya da bir arabirim uygulamasını çağırmak özel duruma neden olur. Gerekirse bu türün temsili olarak 'null' kullanılmasına engel olmak için işlenensiz oluşturucuya sahte veri değeri ekleyin.
zh_hans: 包含类型可以将“null”用作其空联合用例的表示形式值。对 null 值调用抽象/虚拟成员或接口实现将会导致出现异常。如有必要，可将虚拟数据值添加到空构造函数以避免将“null”用作此值的表示形式。
zh_hant: 包含類型可以使用 'null' 做為其零元聯集的表示值。叫用抽象或虛擬成員或 null 值的介面實作將產生例外狀況。如有必要，請將虛擬資料值加入零元建構函式，以免將 'null' 當做這種類型的表示。

# NonVirtualAugmentationOnNullValuedType
source: The containing type can use 'null' as a representation value for its nullary union case. This member will be compiled as a static member.
cs: Nadřazený typ může použít null jako hodnotu reprezentace pro svůj prázdný případ typu union. Tento člen se kompiluje jako statický.
de: Der enthaltende Typ kann NULL als Darstellungswert für seinen nullären Union-Fall verwenden. Dieser Member wird als statischer Member kompiliert.
es: El tipo contenedor puede usar 'null' como valor de representación para el caso de unión que acepta valores NULL. Este miembro se compilará como miembro estático.
fr: Le type conteneur peut utiliser 'null' en tant que valeur de représentation pour son cas d'union nullaire. Ce membre sera compilé en tant que membre statique.
it: Il tipo contenitore può utilizzare 'null' come valore di rappresentazione per il relativo case di unione nullary. Questo membro verrà compilato come membro statico.
ja: 含まれる型は、引数がない共用体ケースの表現値として 'null' を使用できます。このメンバーは静的メンバーとしてコンパイルされます。
ko: 포함하는 형식은 'null'을 해당 nullary 공용 구조체 케이스에 대한 표현 값으로 사용할 수 있습니다. 이 멤버는 정적 멤버로 컴파일됩니다.
pl: Typ zawierający ten element może używać wartości „null” jako wartości reprezentacji przypadku unii o wartości null. Ten element członkowski zostanie skompilowany jako statyczny element członkowski.
pt_br: O tipo de recipiente pode usar 'null' como um valor de representação para seu caso união nulário. Este membro será compilado como um membro estático.
ru: Содержащийся тип может использовать для своего случая нулевого объединения "null". Данный элемент будет скомпилирован, как статический.
tr: Kapsayıcı tür, kendisinin işlenensiz birleşim durumunun temsili değeri olarak 'null' kullanabilir. Bu üye, statik üye olarak derlenecek.
zh_hans: 包含类型可以将“null”用作其空联合用例的表示形式值。此成员将编译为静态成员。
zh_hant: 包含類型可以使用 'null' 做為其零元聯集的表示值。這個成員將編譯成靜態成員。
