Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# NonUniqueInferredAbstractSlot1
source: The member '{0}' doesn't correspond to a unique abstract slot based on name and argument count alone
cs: Člen {0} neodpovídá unikátní abstraktní datové oblasti založené jenom na názvu a počtu argumentů.
de: Der Member "{0}" kann anhand des Namens und der Anzahl der Argumente keinem eindeutigen abstrakten Umsetzungsplatz zugeordnet werden.
es: El miembro '{0}' no corresponde a una única ranura abstracta según el nombre y el número de argumentos.
fr: Le membre '{0}' ne correspond pas à un emplacement abstrait unique basé seulement sur le nom et le nombre d'arguments
it: Il membro '{0}' non corrisponde a uno slot astratto univoco in base al conteggio di argomenti e al nome
ja: 名前と引数の数だけに基づいて、メンバー '{0}' を一意の抽象スロットに対応付けることができません
ko: '{0}' 멤버는 이름 및 인수 수만 볼 때 고유한 추상 슬롯에 해당하지 않습니다.
pl: Element członkowski „{0}” nie odpowiada unikatowemu miejscu abstrakcyjnemu na podstawie samej nazwy i liczby argumentów
pt_br: O membro '{0}' não corresponde a um slot abstrato exclusivo baseado somente no nome e contagem do argumento
ru: Элемент "{0}" не соответствует с уникальным абстрактным слотом, основанным только на имени и числе аргументов
tr: '{0}' üyesi yalnızca ada ve bağımsız değişken sayısına dayalı olarak benzersiz bir soyut yuvaya karşılık gelmiyor
zh_hans: 成员“{0}”与只基于名称和参数数目的唯一抽象槽不对应
zh_hant: 只根據名稱和引數計數，成員 '{0}' 未對應到唯一的抽象位置

# NonUniqueInferredAbstractSlot2
source: . Multiple implemented interfaces have a member with this name and argument count
cs: . Víc implementovaných rozhraní má člena s tímto názvem a počtem argumentů.
de: . Mehrere implementierte Schnittstellen besitzen einen Member mit diesem Namen und dieser Anzahl von Argumenten.
es: . Varias interfaces implementadas tienen un miembro con este nombre y número de argumentos.
fr: . Plusieurs interfaces implémentées ont un membre portant ce nom et ayant ce nombre d'arguments
it: . Più interfacce implementate hanno un membro con questo conteggio di argomenti e nome
ja: 。実装された複数のインターフェイスに、この名前と引数の数を持つメンバーがあります
ko: 구현된 여러 인터페이스에 이 이름 및 인수 수가 지정된 멤버가 있습니다.
pl: . Wiele zaimplementowanych interfejsów ma element członkowski o tej nazwie i z tą liczbą argumentów
pt_br: . Interfaces múltiplas implementadas têm um membro com este nome e contagem de argumento
ru: . Несколько реализованных интерфейсов имеют элемент с этим именем и числом аргументов
tr: . Birden fazla sayıda uygulanmış arabirimde bu ada ve bağımsız değişken sayısına sahip üye var
zh_hans: 。多个实现的接口包含具有此名称和参数数目的成员
zh_hant: 。多個實作的介面具有這個名稱和引數計數的成員

# NonUniqueInferredAbstractSlot3
source: . Consider implementing interfaces '{0}' and '{1}' explicitly.
cs: . Zvažte explicitní implementaci rozhraní {0} a {1}.
de: . Implementieren Sie die {0}-Schnittstelle und die {1}-Schnittstelle explizit.
es: . Considere implementar las interfaces '{0}' y '{1}' de forma explícita.
fr: . Implémentez explicitement les interfaces '{0}' et '{1}'.
it: . Provare a implementare le interfacce '{0}' e '{1}' in modo esplicito.
ja: 。インターフェイス '{0}' と '{1}' を明示的に実装してください。
ko: '{0}' 및 '{1}' 인터페이스를 명시적으로 구현하세요.
pl: . Rozważ jawne zaimplementowanie interfejsów „{0}” i „{1}”.
pt_br: . Considere implementar interfaces '{0}' e '{1}' explicitamente.
ru: . Рекомендуется явно реализовать интерфейсы "{0}" и "{1}".
tr: . '{0}' ve '{1}' arabirimlerini açık olarak uygulamayı düşünün.
zh_hans: 。请考虑显式实现接口“{0}”和“{1}”。
zh_hant: 。請考慮明確實作介面 '{0}' 和 '{1}'。

# NonUniqueInferredAbstractSlot4
source: . Additional type annotations may be required to indicate the relevant override. This warning can be disabled using '#nowarn "70"' or '--nowarn:70'.
cs: . Můžou se vyžadovat další poznámky typu k určení příslušného přepsání. Toto upozornění se dá pomocí #nowarn "70" nebo --nowarn:70 vypnout.
de: . Möglicherweise sind zusätzliche Typanmerkungen erforderlich, um die relevante Überschreibung anzugeben. Diese Warnung kann mit "#nowarn "70"" oder "--nowarn 70" deaktiviert werden.
es: . Pueden ser necesarias anotaciones de tipo adicionales para indicar la invalidación relevante. Esta advertencia se puede deshabilitar con '#nowarn "70"' o '--nowarn:70'.
fr: . Des annotations de type supplémentaires peuvent être requises pour indiquer la substitution appropriée. Cet avertissement peut être désactivé à l'aide de '#nowarn "70"' ou '--nowarn:70'.
it: . Potrebbero essere necessarie ulteriori annotazioni di tipo per indicare l'override rilevante. Questo avviso può essere disabilitato mediante '#nowarn "70"' o '--nowarn:70'.
ja: 。場合によっては、関連するオーバーライドを示すために追加の型の参照が必要です。この警告を無効にするには、'#nowarn "70"' または '--nowarn:70' を使用してください。
ko: 관련 재정의를 나타내기 위해 추가 형식 주석이 필요할 수 있습니다. 이 경고는 '#nowarn "70"' 또는 '--nowarn:70'을 통해 사용할 수 없도록 설정할 수 있습니다.
pl: . Mogą być wymagane dodatkowe adnotacje typów w celu określenia odpowiedniego przesłonięcia. To ostrzeżenie można wyłączyć przy użyciu elementu „#nowarn "70"” lub „--nowarn:70”.
pt_br: . Anotações de tipo adicionais podem ser necessárias para indicar a substituição relevante. Este aviso pode ser desabilitado usando '#nowarn "70"' ou '--nowarn:70'.
ru: . Для указания соответствующего переопределения могут потребоваться дополнительные аннотации типа. Данное предупреждение можно отключить, используя #nowarn "70" или --nowarn 70.
tr: . İlgili geçersiz kılmayı belirtmek için yeni tür ek açıklamaları gerekebilir. Bu uyarı, '#nowarn "70"' veya '--nowarn:70' kullanılarak devre dışı bırakılabilir.
zh_hans: 。可能需要其他类型批注来指示相关重写。可以使用“#nowarn "70"”或“--nowarn:70”禁用此警告。
zh_hant: 。可能需要其他類型註釋，指示相關覆寫。使用 '#nowarn "70"' 或 '--nowarn:70' 可以停用這個警告。

# Failure1
source: parse error
cs: Chyba analýzy
de: Analysefehler
es: error de análisis
fr: erreur d'analyse
it: errore di analisi
ja: 解析エラー
ko: 구문 분석 오류
pl: błąd analizy
pt_br: erro de análise
ru: ошибка синтаксического анализа
tr: ayrıştırma hatası
zh_hans: 分析错误
zh_hant: 剖析錯誤

# Failure2
source: parse error: unexpected end of file
cs: Chyba analýzy: neočekávaný konec souboru
de: Analysefehler: Unerwartetes Ende der Datei.
es: error de análisis: final de archivo inesperado
fr: erreur d'analyse : fin de fichier inattendue
it: errore di analisi: fine del file non prevista
ja: 解析エラー: 予期しないファイルの終わりです
ko: 구문 분석 오류: 예기치 않은 파일의 끝입니다.
pl: błąd analizy: nieoczekiwany koniec pliku
pt_br: erro de análise: fim de arquivo inesperado
ru: ошибка синтаксического анализа: непредвиденный конец файла
tr: ayrıştırma hatası: beklenmeyen dosya sonu
zh_hans: 分析错误: 意外的文件尾
zh_hant: 剖析錯誤: 未預期的檔案結尾

# Failure4
source: internal error: {0}
cs: Vnitřní chyba: {0}
de: Interner Fehler: {0}
es: error interno: {0}
fr: erreur interne : {0}
it: errore interno: {0}
ja: 内部エラー: {0}
ko: 내부 오류: {0}
pl: błąd wewnętrzny: {0}
pt_br: erro interno: {0}
ru: внутренняя ошибка: {0}
tr: iç hata: {0}
zh_hans: 内部错误: {0}
zh_hant: 內部錯誤: {0}

# MatchIncomplete1
source: Incomplete pattern matches on this expression.
cs: Neúplné porovnávání vzorů u tohoto výrazu
de: Unvollständige Musterübereinstimmungen für diesen Ausdruck.
es: Detecciones de patrones incompletas en esta expresión.
fr: Critères spéciaux incomplets dans cette expression.
it: Criteri di ricerca incompleti in questa espressione.
ja: この式のパターン マッチが不完全です
ko: 이 식의 패턴 일치가 완전하지 않습니다.
pl: Niepełne dopasowania wzorca w tym wyrażeniu.
pt_br: Correspondências de padrão incompletas presentes nesta expressão.
ru: Незавершенный шаблон соответствует данному выражению.
tr: Bu ifadede eksik desen eşleşmeleri var.
zh_hans: 此表达式中的模式匹配不完整。
zh_hant: 這個運算式的模式比對不完整。

# MatchIncomplete2
source: For example, the value '{0}' may indicate a case not covered by the pattern(s).
cs: Třeba hodnota {0} může označovat případ, na který se vzor nevztahuje.
de: Beispielsweise kann der Wert "{0}" einen Fall kennzeichnen, der nicht von dem bzw. den Muster(n) abgedeckt wird.
es: Por ejemplo, el valor '{0}' puede indicar un caso no cubierto por los patrones.
fr: Par exemple, la valeur '{0}' peut indiquer un cas non traité par le ou les modèles.
it: Ad esempio, il valore '{0}' può indicare un caso non previsto dai criteri.
ja: たとえば、値 '{0}' はパターンに含まれないケースを示す可能性があります。
ko: 예를 들어, 값 '{0}'은(는) 패턴에 포함되지 않은 케이스를 나타낼 수 있습니다.
pl: Na przykład wartość „{0}” może wskazywać przypadek, który nie jest zgodny ze wzorcem.
pt_br: Por exemplo, o valor '{0}' pode indicar um caso que não é abrangido pelos padrões.
ru: К примеру, значение "{0}" может указывать на случай, не покрытый шаблоном(ами).
tr: Örneğin, '{0}' değeri desenlerin kapsamadığı bir duruma işaret edebilir.
zh_hans: 例如，值“{0}”可以指示模式未涵盖的用例。
zh_hant: 例如，值 '{0}' 可能表示模式未涵蓋的案例。

# MatchIncomplete3
source: For example, the value '{0}' may indicate a case not covered by the pattern(s). However, a pattern rule with a 'when' clause might successfully match this value.
cs: Třeba hodnota {0} může označovat případ, na který se vzor nevztahuje. Pravidlo vzoru s klauzulí with se ale s touto hodnotou úspěšně shodovat může.
de: Beispielsweise kann der Wert "{0}" einen Fall kennzeichnen, der nicht von dem bzw. den Muster(n) abgedeckt wird. Mit einer Musterregel mit einer when-Klausel kann dieser Wert allerdings unter Umständen erfolgreich abgeglichen werden.
es: Por ejemplo, el valor '{0}' puede indicar un caso no cubierto por los patrones. Sin embargo, una regla de patrón con una cláusula 'when' puede coincidir correctamente con este valor.
fr: Par exemple, la valeur '{0}' peut indiquer un cas non traité par le ou les modèles. Toutefois, une règle de modèle avec une clause 'when' peut correspondre à cette valeur.
it: Ad esempio, il valore '{0}' può indicare un caso non previsto dai criteri. Tuttavia, la corrispondenza con il valore potrebbe essere individuata mediante una regola criteri con clausola 'when'.
ja: たとえば、値 '{0}' はパターンに含まれないケースを示す可能性があります。ただし、'when' 句を含むパターン規則であれば、この値に一致する場合もあります。
ko: 예를 들어, 값 '{0}'은(는) 패턴에 포함되지 않은 케이스를 나타낼 수 있습니다. 그러나 'when' 절이 있는 패턴 규칙은 이 값과 성공적으로 일치할 수 있습니다.
pl: Na przykład wartość „{0}” może wskazywać przypadek, który nie jest zgodny ze wzorcem. Jednak reguła wzorca z klauzulą „when” może pomyślnie dopasować tę wartość.
pt_br: Por exemplo, o valor '{0}' pode indicar um caso não abrangido por tais padrões. Entretanto, uma regra de padrão com uma cláusula 'when' pode corresponder a este valor com êxito.
ru: К примеру, значение "{0}" может указывать на случай, не покрытый шаблоном(ами). Однако, правило шаблона с конструкцией "when" может совпасть с этим значением.
tr: Örneğin, '{0}' değeri desenlerin kapsamadığı bir duruma işaret edebilir. Ancak, 'when' yan tümcesinin olduğu bir desen kuralı bu değeri başarıyla eşleştirebilir.
zh_hans: 例如，值“{0}”可以指示模式未涵盖的用例。不过，包含“when”子句的模式规则可能会与此值成功匹配。
zh_hant: 例如，值 '{0}' 可能表示模式未涵蓋的案例。但是具有 'when' 子句的模式規則或許可以成功比對這個值。

# MatchIncomplete4
source: Unmatched elements will be ignored.
cs: Nespárované prvky se budou ignorovat.
de: Nicht zugeordnete Elemente werden ignoriert.
es: Los elementos que no coinciden se omitirán.
fr: Les éléments non appariés seront ignorés.
it: Gli elementi senza corrispondenza verranno ignorati.
ja: 一致しない要素は無視されます。
ko: 일치하지 않는 요소는 무시됩니다.
pl: Niedopasowane elementy zostaną zignorowane.
pt_br: Elementos incompatíveis serão ignorados.
ru: Элементы без соответствий будут проигнорированы.
tr: Eşleşmeyen öğeler yok sayılacak.
zh_hans: 将忽略不匹配的元素。
zh_hant: 無對應的項目將會被忽略。

# EnumMatchIncomplete1
source: Enums may take values outside known cases.
cs: Výčty můžou získávat hodnoty mimo známé případy.
de: Enumerationen können Werte außerhalb bekannter Fälle verwenden.
es: Las enumeraciones pueden tomar valores fuera de las clases conocidas.
fr: Les enums peuvent accepter des valeurs en dehors des cas connus.
it: Le enumerazioni possono accettare valori esterni a casi noti.
ja: 列挙型は既知のケースの外の値を使用する可能性があります。
ko: 열거형이 알려진 사례를 벗어난 값을 사용할 수 있습니다.
pl: Wyliczenia mogą przyjmować wartości spoza znanych przypadków.
pt_br: As enumerações pode usar valores fora de casos conhecidos.
ru: Перечисления могут принимать значения, выходящие за пределы известных случаев.
tr: Numaralandırmalar, bilinen durumlar dışından değerler alabilir.
zh_hans: 枚举可能使用已知用例外的值。
zh_hant: 列舉可能會採用來自已知案例之外的值。

# RuleNeverMatched
source: This rule will never be matched
cs: Pro toto pravidlo nebude nikdy existovat shoda.
de: Für diese Regel wird niemals eine Übereinstimmung gefunden.
es: Nunca se buscarán coincidencias con esta regla.
fr: Cette règle n'aura aucune correspondance
it: Questa regola non avrà mai alcuna corrispondenza
ja: この規則には一致しません
ko: 이 규칙은 일치시킬 수 없습니다.
pl: Ta reguła nigdy nie zostanie dopasowana
pt_br: Esta regra nunca será correspondida
ru: Данное правило никогда не будет сопоставлено
tr: Bu kural hiçbir zaman eşleştirilmeyecek
zh_hans: 从不与此规则匹配
zh_hant: 這個規則絕不會比對到

# ValNotMutable
source: This value is not mutable. Consider using the mutable keyword, e.g. 'let mutable {0} = expression'.
cs: Tato hodnota není proměnlivá. Zvažte použití proměnlivého klíčového slova, třeba let mutable {0} = expression.
de: Dieser Wert ist nicht änderbar. Verwenden Sie ggf. ein änderbares Schlüsselwort, z.B. "let mutable {0} = Ausdruck".
es: Este valor no es mutable. Considere la posibilidad de usar la palabra clave mutable, por ejemplo, "let mutable {0} = expression".
fr: Cette valeur n'est pas mutable. Utilisez le mot clé mutable, par exemple, 'let mutable {0} = expression'.
it: Questo valore non è modificabile. Provare a usare la parola chiave mutable, ad esempio 'let mutable {0} = espressione'.
ja: この値は変更可能ではありません。変更可能なキーワードを使用することを検討してください。例: 'let mutable {0} = expression'。
ko: 이 값은 변경할 수 없습니다. 변경 가능한 키워드(예: 'let mutable {0} = expression')를 사용하세요.
pl: Ta wartość nie jest modyfikowalna. Rozważ użycie modyfikowalnego słowa kluczowego, np. „let mutable {0} = expression”.
pt_br: Esse valor não é mutável. Considere usar a palavra-chave mutable, por exemplo, 'let mutable {0} = expression'.
ru: Это значение не является изменяемым. Рекомендуется использовать ключевое слово с возможностью изменения, например "let mutable {0} = expression".
tr: Bu değer değiştirilebilir değil. mutable anahtar sözcüğünü (örn. 'let mutable {0} = expression') kullanmayı düşünün.
zh_hans: 此值不是可变的。请考虑使用可变的关键字，如 "let mutable {0} = expression"。
zh_hant: 此值不可變動。請考慮使用可變動的關鍵字，例如 'let mutable {0} = expression'。

# ValNotLocal
source: This value is not local
cs: Tato hodnota není lokální.
de: Dieser Wert ist nicht lokal.
es: Este valor no es local.
fr: Cette valeur n'est pas locale
it: Questo valore non è locale
ja: この値はローカルではありません
ko: 로컬 값이 아닙니다.
pl: Ta wartość nie jest lokalna
pt_br: Este valor não é local
ru: Это значение не является локальным
tr: Bu değer yerel değil
zh_hans: 此值不是本地的
zh_hant: 這不是區域值

# Obsolete1
source: This construct is deprecated
cs: Tento konstruktor je zastaralý.
de: Dieses Konstrukt ist veraltet.
es: Esta construcción está en desuso
fr: Cette construction est déconseillée
it: Questo costrutto è deprecato
ja: このコンストラクトは使用されなくなりました
ko: 이 구문은 사용되지 않습니다.
pl: Ta konstrukcja jest przestarzała
pt_br: Este constructo foi preterido
ru: Такая конструкция не рекомендуется к использованию
tr: Bu yapı kullanım dışı
zh_hans: 此构造已弃用
zh_hant: 這個建構已被取代

# Experimental
source: {0}. This warning can be disabled using '--nowarn:57' or '#nowarn "57"'.
cs: {0}. Toto upozornění se dá pomocí --nowarn:57 nebo #nowarn "57" vypnout.
de: {0}. Diese Warnung kann mit "--nowarn 57" oder "#nowarn "57"" deaktiviert werden.
es: {0}. Esta advertencia se puede deshabilitar con '--nowarn:57' o '#nowarn "57"'.
fr: {0}. Cet avertissement peut être désactivé à l'aide de '--nowarn:57' ou '#nowarn "57"'.
it: {0}. Questo avviso può essere disabilitato mediante '--nowarn:57' o '#nowarn "57"'.
ja: {0}。この警告を無効にするには、'--nowarn:57' または '#nowarn "57"' を使用します。
ko: {0}. 이 경고는 '--nowarn:57' 또는 '#nowarn "57"'을 통해 사용할 수 없도록 설정할 수 있습니다.
pl: {0}. To ostrzeżenie można wyłączyć przy użyciu elementu „--nowarn:57” lub „#nowarn "57"”.
pt_br: {0}. Este aviso foi desabilitado com o uso de '--nowarn:57' ou '#nowarn "57"'.
ru: {0}. Данное предупреждение можно отключить, используя --nowarn 57 или #nowarn "57".
tr: {0}. Bu uyarı, '--nowarn:57' veya '#nowarn "57"' kullanılarak devre dışı bırakılabilir.
zh_hans: {0}。可以使用“--nowarn:57”或“#nowarn "57"”禁用此警告。
zh_hant: {0}。使用 '--nowarn:57' 或 '#nowarn "57"' 可以停用這個警告。

# PossibleUnverifiableCode
source: Uses of this construct may result in the generation of unverifiable .NET IL code. This warning can be disabled using '--nowarn:9' or '#nowarn "9"'.
cs: Použití tohoto konstruktoru může způsobit vygenerování neověřitelného kódu .NET IL. Toto upozornění se dá pomocí --nowarn:9 nebo #nowarn "9" vypnout.
de: Die Verwendung dieses Konstrukts kann die Erzeugung von nicht verifizierbarem .NET-IL-Code zur Folge haben. Diese Warnung kann mit "--nowarn 9" oder "#nowarn "9"" deaktiviert werden.
es: El uso de esta construcción puede dar lugar a que se genere código .NET de IL que no se puede comprobar. Esta advertencia se puede deshabilitar con '--nowarn:9' o '#nowarn "9"'.
fr: Les utilisations de cette construction peuvent entraîner la génération de code IL (Intermediate Language) .NET non vérifiable. Cet avertissement peut être désactivé à l'aide de '--nowarn:9' ou '#nowarn "9"'.
it: Gli utilizzi di questo costruttore potrebbero determinare la generazione di codice IL .NET non verificabile. Questo avviso può essere disabilitato mediante '--nowarn:9' o '#nowarn "9"'.
ja: このコンストラクトを使用すると、検証できない .NET IL コードが生成される可能性があります。この警告を無効にするには、'--nowarn:9' または '#nowarn "9"' を使用してください。
ko: 이 구문을 사용하면 확인할 수 없는 .NET IL 코드가 생성될 수 있습니다. 이 경고는 '--nowarn:9' 또는 '#nowarn "9"'를 통해 사용할 수 없도록 설정할 수 있습니다.
pl: Użycie tej konstrukcji może spowodować wygenerowanie kodu .NET IL, którego nie można zweryfikować. To ostrzeżenie można wyłączyć przy użyciu elementu „--nowarn:9” lub „#nowarn "9"”.
pt_br: O uso desse construto pode resultar na geração de código .NET IL não verificável. Este aviso pode ser desabilitado usando '--nowarn:9' ou '#nowarn "9"'.
ru: Использование данной конструкции может повлечь за собой создание непроверяемого кода .NET IL. Данное предупреждение можно отключить, используя --nowarn 9 или #nowarn "9".
tr: Bu yapının kullanılması doğrulanamayan .NET IL kodunun oluşturulmasıyla sonuçlanabilir. Bu uyarı, '--nowarn:9' veya '#nowarn "9"' kullanılarak devre dışı bırakılabilir.
zh_hans: 使用此构造可能会导致生成不可验证的 .NET IL 代码。可以使用“--nowarn:9”或“#nowarn "9"”禁用此警告。
zh_hant: 使用這個建構可能導致產生無法驗證的 .NET IL 程式碼。使用 '--nowarn:9' 或 '#nowarn "9"' 可以停用這個警告。

# Deprecated
source: This construct is deprecated: {0}
cs: Tento konstruktor je zastaralý: {0}
de: Dieses Konstrukt ist veraltet: {0}
es: Esta construcción está en desuso: {0}.
fr: Cette construction est déconseillée : {0}
it: Costrutto deprecato: {0}
ja: このコンストラクトは使用されなくなりました: {0}
ko: 이 구문은 사용되지 않습니다. {0}
pl: Ta konstrukcja jest przestarzała: {0}
pt_br: Este constructo foi preterido: {0}
ru: Такая конструкция не рекомендуется к использованию: {0}
tr: Bu yapı kullanım dışı: {0}
zh_hans: 此构造已弃用: {0}
zh_hant: 這個建構已被取代: {0}

# LibraryUseOnly
source: This construct is deprecated: it is only for use in the F# library
cs: Tento konstruktor je zastaralý: používá se jenom v knihovně F#.
de: Dieses Konstrukt ist veraltet: Es wird nur in der F#-Bibliothek verwendet.
es: Esta construcción está en desuso: es solo para usarla en la biblioteca de F#.
fr: Cette construction est déconseillée : elle ne doit être utilisée que dans la bibliothèque F#
it: Costrutto deprecato: è destinato esclusivamente all'uso nella libreria F#
ja: このコンストラクトは使用されなくなりました。これは F# ライブラリでのみ使用されます。
ko: 이 구문은 사용되지 않으며 F# 라이브러리에서만 사용할 수 있습니다.
pl: Ta konstrukcja jest przestarzała: może być używana tylko w bibliotece języka F#
pt_br: Este constructo foi preterido: ele somente pode ser usado na biblioteca F#
ru: Такая конструкция не рекомендуется к использованию: она используется только в библиотеке F#
tr: Bu yapı kullanım dışıdır: yalnızca F# kitaplığında kullanım içindir
zh_hans: 此构造已弃用: 只能在 F# 库中使用此构造
zh_hant: 這個建構已被取代: 它只用在 F# 程式庫中

# MissingFields
source: The following fields require values: {0}
cs: Následující pole vyžadují hodnoty: {0}
de: Für die folgenden Felder sind Werte erforderlich: {0}
es: Los campos siguientes requieren valores: {0}.
fr: Les champs suivants requièrent des valeurs : {0}
it: Immissione valori obbligatoria per i campi seguenti: {0}
ja: 次のフィールドには値が必要です: {0}
ko: 다음 필드에는 값이 필요합니다. {0}
pl: Następujące pola wymagają wartości: {0}
pt_br: Os campos a seguir requerem valores: {0}
ru: Для следующих полей требуются значения: {0}
tr: Aşağıdaki alanlar için değerler gerekiyor: {0}
zh_hans: 以下字段需要值: {0}
zh_hant: 下列欄位需要值: {0}

# ValueRestriction1
source: Value restriction. The value '{0}' has generic type\n {1} \nEither make the arguments to '{2}' explicit or, if you do not intend for it to be generic, add a type annotation.
cs: Omezení hodnoty. Hodnota {0} je obecného typu\n {1}. \nBuď změňte argumenty pro {2} na explicitní, nebo (pokud hodnota nemá být obecná) přidejte poznámku typu.
de: Werteinschränkung. Der Wert "{0}" hat den generischen Typ\n {1} \nLegen Sie die Argumente für "{2}" entweder als explizit fest, oder fügen Sie eine Typanmerkung hinzu, wenn der Typ nicht generisch sein soll.
es: Restricción de valor. El valor '{0}' tiene el tipo genérico\n {1} \nConvierta los argumentos de '{2}' en explícitos o, si su intención no es que sea genérico, agregue una anotación de tipo.
fr: Restriction de valeur. La valeur '{0}' a le type générique\n {1} \nRendez les arguments de '{2}' explicites ou, si votre but n'est pas d'utiliser un type générique, ajoutez une annotation de type.
it: Limitazione valore. Il valore '{0}' ha il tipo generico\n {1} \nRendere gli argomenti di '{2}' espliciti oppure, se non si intende renderlo generico, aggiungere un'annotazione di tipo.
ja: 値の制限。値 '{0}' は次のジェネリック型です。\n {1} \n明示的に引数を '{2}' にするか、ジェネリックにする意図がない場合は型の注釈を追加してください。
ko: 값 제한이 있습니다. 값 '{0}'에 제네릭 형식\n {1}이(가) 있습니다. \n'{2}'에 대한 인수를 명시적으로 만들거나, 제네릭 요소로 만들지 않으려는 경우 형식 주석을 추가하세요.
pl: Ograniczenie wartości. Wartość „{0}” jest wartością typu ogólnego\n {1} \nOkreśl argumenty elementu „{2}” jako jawne lub dodaj adnotację typu, jeśli nie chcesz, aby wartość była ogólna.
pt_br: Restrição de valor. O valor '{0}' tem um tipo genérico\n {1} \nTorne os argumentos '{2}' explícitos ou, se sua intenção não for deixá-los genéricos, adicione uma anotação de tipo.
ru: Ограничение значения. Значение "{0}" имеет универсальный тип\n {1} \nЛибо сделайте аргументы для "{2}" явными либо (если универсальный тип не требуется) добавьте аннотацию типа.
tr: Değer kısıtlaması. '{0}' değerinin genel türü:\n {1} \nYa '{2}' bağımsız değişkenlerini açık yapın ya da genel olmasını istemiyorsanız bir tür ek açıklaması ekleyin.
zh_hans: 值限制。值“{0}”具有泛型类型\n {1} \n使“{2}”的参数成为显式参数，或添加类型批注(如果您不希望它是泛型的)。
zh_hant: 值限制。值 '{0}' 具有泛型類型\n {1} \n請將 '{2}' 的引數設為明確的，或者如果不想將它設為泛型，請加入類型註釋。
