Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Parser.TOKEN.MODULE
source: keyword 'module'
cs: klíčové slovo module
de: Schlüsselwort "module"
es: palabra clave 'module'
fr: mot clé 'module'
it: parola chiave 'module'
ja: キーワード 'module'
ko: 'module' 키워드
pl: słowo kluczowe „module”
pt_br: palavra-chave 'module'
ru: ключевое слово "module"
tr: 'module' anahtar sözcüğü
zh_hans: 关键字“module”
zh_hant: 關鍵字 'module'

# Parser.TOKEN.AND
source: keyword 'and'
cs: klíčové slovo and
de: Schlüsselwort "and"
es: palabra clave 'and'
fr: mot clé 'and'
it: parola chiave 'and'
ja: キーワード 'and'
ko: 'and' 키워드
pl: słowo kluczowe „and”
pt_br: palavra-chave 'and'
ru: ключевое слово "and"
tr: 'and' anahtar sözcüğü
zh_hans: 关键字“and”
zh_hant: 關鍵字 'and'

# Parser.TOKEN.AS
source: keyword 'as'
cs: klíčové slovo as
de: Schlüsselwort "as"
es: palabra clave 'as'
fr: mot clé 'as'
it: parola chiave 'as'
ja: キーワード 'as'
ko: 'as' 키워드
pl: słowo kluczowe „as”
pt_br: palavra-chave 'as'
ru: ключевое слово "as"
tr: 'as' anahtar sözcüğü
zh_hans: 关键字“as”
zh_hant: 關鍵字 'as'

# Parser.TOKEN.ASSERT
source: keyword 'assert'
cs: klíčové slovo assert
de: Schlüsselwort "assert"
es: palabra clave 'assert'
fr: mot clé 'assert'
it: parola chiave 'assert'
ja: キーワード 'assert'
ko: 'assert' 키워드
pl: słowo kluczowe „assert”
pt_br: palavra-chave 'assert'
ru: ключевое слово "assert"
tr: 'assert' anahtar sözcüğü
zh_hans: 关键字“assert”
zh_hant: 關鍵字 'assert'

# Parser.TOKEN.ASR
source: keyword 'asr'
cs: klíčové slovo asr
de: Schlüsselwort "asr"
es: palabra clave 'asr'
fr: mot clé 'asr'
it: parola chiave 'asr'
ja: キーワード 'asr'
ko: 'asr' 키워드
pl: słowo kluczowe „asr”
pt_br: palavra-chave 'asr'
ru: ключевое слово "asr"
tr: 'asr' anahtar sözcüğü
zh_hans: 关键字“asr”
zh_hant: 關鍵字 'asr'

# Parser.TOKEN.DOWNTO
source: keyword 'downto'
cs: klíčové slovo downto
de: Schlüsselwort "downto"
es: palabra clave 'downto'
fr: mot clé 'downto'
it: parola chiave 'downto'
ja: キーワード 'downto'
ko: 'downto' 키워드
pl: słowo kluczowe „downto”
pt_br: palavra-chave 'downto'
ru: ключевое слово "downto"
tr: 'downto' anahtar sözcüğü
zh_hans: 关键字“downto”
zh_hant: 關鍵字 'downto'

# Parser.TOKEN.EXCEPTION
source: keyword 'exception'
cs: klíčové slovo exception
de: Schlüsselwort "exception"
es: palabra clave 'exception'
fr: mot clé 'exception'
it: parola chiave 'exception'
ja: キーワード 'exception'
ko: 'exception' 키워드
pl: słowo kluczowe „exception”
pt_br: palavra-chave 'exception'
ru: ключевое слово "exception"
tr: 'exception' anahtar sözcüğü
zh_hans: 关键字“exception”
zh_hant: 關鍵字 'exception'

# Parser.TOKEN.FALSE
source: keyword 'false'
cs: klíčové slovo false
de: Schlüsselwort "false"
es: palabra clave 'false'
fr: mot clé 'false'
it: parola chiave 'false'
ja: キーワード 'false'
ko: 'false' 키워드
pl: słowo kluczowe „false”
pt_br: palavra-chave 'false'
ru: ключевое слово "false"
tr: 'false' anahtar sözcüğü
zh_hans: 关键字“false”
zh_hant: 關鍵字 'false'

# Parser.TOKEN.FOR
source: keyword 'for'
cs: klíčové slovo for
de: Schlüsselwort "for"
es: palabra clave 'for'
fr: mot clé 'for'
it: parola chiave 'for'
ja: キーワード 'for'
ko: 'for' 키워드
pl: słowo kluczowe „for”
pt_br: palavra-chave 'for'
ru: ключевое слово "for"
tr: 'for' anahtar sözcüğü
zh_hans: 关键字“for”
zh_hant: 關鍵字 'for'

# Parser.TOKEN.FUN
source: keyword 'fun'
cs: klíčové slovo fun
de: Schlüsselwort "fun"
es: palabra clave 'fun'
fr: mot clé 'fun'
it: parola chiave 'fun'
ja: キーワード 'fun'
ko: 'fun' 키워드
pl: słowo kluczowe „fun”
pt_br: palavra-chave 'fun'
ru: ключевое слово "fun"
tr: 'fun' anahtar sözcüğü
zh_hans: 关键字“fun”
zh_hant: 關鍵字 'fun'

# Parser.TOKEN.FUNCTION
source: keyword 'function'
cs: klíčové slovo function
de: Schlüsselwort "function"
es: palabra clave 'function'
fr: mot clé 'function'
it: parola chiave 'function'
ja: キーワード 'function'
ko: 'function' 키워드
pl: słowo kluczowe „function”
pt_br: palavra-chave 'function'
ru: ключевое слово "function"
tr: 'function' anahtar sözcüğü
zh_hans: 关键字“function”
zh_hant: 關鍵字 'function'

# Parser.TOKEN.FINALLY
source: keyword 'finally'
cs: klíčové slovo finally
de: Schlüsselwort "finally"
es: palabra clave 'finally'
fr: mot clé 'finally'
it: parola chiave 'finally'
ja: キーワード 'finally'
ko: 'finally' 키워드
pl: słowo kluczowe „finally”
pt_br: palavra-chave 'finally'
ru: ключевое слово "finally"
tr: 'finally' anahtar sözcüğü
zh_hans: 关键字“finally”
zh_hant: 關鍵字 'finally'

# Parser.TOKEN.LAZY
source: keyword 'lazy'
cs: klíčové slovo lazy
de: Schlüsselwort "lazy"
es: palabra clave 'lazy'
fr: mot clé 'lazy'
it: parola chiave 'lazy'
ja: キーワード 'lazy'
ko: 'lazy' 키워드
pl: słowo kluczowe „lazy”
pt_br: palavra-chave 'lazy'
ru: ключевое слово "lazy"
tr: 'lazy' anahtar sözcüğü
zh_hans: 关键字“lazy”
zh_hant: 關鍵字 'lazy'

# Parser.TOKEN.MATCH
source: keyword 'match'
cs: klíčové slovo match
de: Schlüsselwort "match"
es: palabra clave 'match'
fr: mot clé 'match'
it: parola chiave 'match'
ja: キーワード 'match'
ko: 'match' 키워드
pl: słowo kluczowe „match”
pt_br: palavra-chave 'match'
ru: ключевое слово "match"
tr: 'match' anahtar sözcüğü
zh_hans: 关键字“match”
zh_hant: 關鍵字 'match'

# Parser.TOKEN.MATCH.BANG
source: keyword 'match!'
cs: klíčové slovo match!
de: Schlüsselwort "match!"
es: palabra clave 'match!'
fr: mot clé 'match!'
it: parola chiave 'match!'
ja: キーワード 'match!'
ko: 'match!' 키워드
pl: słowo kluczowe „match!”
pt_br: palavra-chave 'match!'
ru: ключевое слово "match!"
tr: 'match!' anahtar sözcüğü
zh_hans: 关键字“match!”
zh_hant: 關鍵字 'match!'

# Parser.TOKEN.MUTABLE
source: keyword 'mutable'
cs: klíčové slovo mutable
de: Schlüsselwort "mutable"
es: palabra clave 'mutable'
fr: mot clé 'mutable'
it: parola chiave 'mutable'
ja: キーワード 'mutable'
ko: 'mutable' 키워드
pl: słowo kluczowe „mutable”
pt_br: palavra-chave 'mutable'
ru: ключевое слово "mutable"
tr: 'mutable' anahtar sözcüğü
zh_hans: 关键字“mutable”
zh_hant: 關鍵字 'mutable'

# Parser.TOKEN.NEW
source: keyword 'new'
cs: klíčové slovo new
de: Schlüsselwort "new"
es: palabra clave 'new'
fr: mot clé 'new'
it: parola chiave 'new'
ja: キーワード 'new'
ko: 'new' 키워드
pl: słowo kluczowe „new”
pt_br: palavra-chave 'new'
ru: ключевое слово "new"
tr: 'new' anahtar sözcüğü
zh_hans: 关键字“new”
zh_hant: 關鍵字 'new'

# Parser.TOKEN.OF
source: keyword 'of'
cs: klíčové slovo of
de: Schlüsselwort "of"
es: palabra clave 'of'
fr: mot clé 'of'
it: parola chiave 'of'
ja: キーワード 'of'
ko: 'of' 키워드
pl: słowo kluczowe „of”
pt_br: palavra-chave 'of'
ru: ключевое слово "of"
tr: 'of' anahtar sözcüğü
zh_hans: 关键字“of”
zh_hant: 關鍵字 'of'

# Parser.TOKEN.OPEN
source: keyword 'open'
cs: klíčové slovo open
de: Schlüsselwort "open"
es: palabra clave 'open'
fr: mot clé 'open'
it: parola chiave 'open'
ja: キーワード 'open'
ko: 'open' 키워드
pl: słowo kluczowe „open”
pt_br: palavra-chave 'open'
ru: ключевое слово "open"
tr: 'open' anahtar sözcüğü
zh_hans: 关键字“open”
zh_hant: 關鍵字 'open'

# Parser.TOKEN.OR
source: keyword 'or'
cs: klíčové slovo or
de: Schlüsselwort "or"
es: palabra clave 'or'
fr: mot clé 'or'
it: parola chiave 'or'
ja: キーワード 'or'
ko: 'or' 키워드
pl: słowo kluczowe „or”
pt_br: palavra-chave 'or'
ru: ключевое слово "or"
tr: 'or' anahtar sözcüğü
zh_hans: 关键字“or”
zh_hant: 關鍵字 'or'

# Parser.TOKEN.VOID
source: keyword 'void'
cs: klíčové slovo void
de: Schlüsselwort "void"
es: palabra clave 'void'
fr: mot clé 'void'
it: parola chiave 'void'
ja: キーワード 'void'
ko: 'void' 키워드
pl: słowo kluczowe „void”
pt_br: palavra-chave 'void'
ru: ключевое слово "void"
tr: 'void' anahtar sözcüğü
zh_hans: 关键字“void”
zh_hant: 關鍵字 'void'

# Parser.TOKEN.EXTERN
source: keyword 'extern'
cs: klíčové slovo extern
de: Schlüsselwort "extern"
es: palabra clave 'extern'
fr: mot clé 'extern'
it: parola chiave 'extern'
ja: キーワード 'extern'
ko: 'extern' 키워드
pl: słowo kluczowe „extern”
pt_br: palavra-chave 'extern'
ru: ключевое слово "extern"
tr: 'extern' anahtar sözcüğü
zh_hans: 关键字“extern”
zh_hant: 關鍵字 'extern'

# Parser.TOKEN.INTERFACE
source: keyword 'interface'
cs: klíčové slovo interface
de: Schlüsselwort "interface"
es: palabra clave 'interface'
fr: mot clé 'interface'
it: parola chiave 'interface'
ja: キーワード 'interface'
ko: 'interface' 키워드
pl: słowo kluczowe „interface”
pt_br: palavra-chave 'interface'
ru: ключевое слово "interface"
tr: 'interface' anahtar sözcüğü
zh_hans: 关键字“interface”
zh_hant: 關鍵字 'interface'

# Parser.TOKEN.REC
source: keyword 'rec'
cs: klíčové slovo rec
de: Schlüsselwort "rec"
es: palabra clave 'rec'
fr: mot clé 'rec'
it: parola chiave 'rec'
ja: キーワード 'rec'
ko: 'rec' 키워드
pl: słowo kluczowe „rec”
pt_br: palavra-chave 'rec'
ru: ключевое слово "rec"
tr: 'rec' anahtar sözcüğü
zh_hans: 关键字“rec”
zh_hant: 關鍵字 'rec'

# Parser.TOKEN.TO
source: keyword 'to'
cs: klíčové slovo to
de: Schlüsselwort "to"
es: palabra clave 'to'
fr: mot clé 'to'
it: parola chiave 'to'
ja: キーワード 'to'
ko: 'to' 키워드
pl: słowo kluczowe „to”
pt_br: palavra-chave 'to'
ru: ключевое слово "to"
tr: 'to' anahtar sözcüğü
zh_hans: 关键字“to”
zh_hant: 關鍵字 'to'

# Parser.TOKEN.TRUE
source: keyword 'true'
cs: klíčové slovo true
de: Schlüsselwort "true"
es: palabra clave 'true'
fr: mot clé 'true'
it: parola chiave 'true'
ja: キーワード 'true'
ko: 'true' 키워드
pl: słowo kluczowe „true”
pt_br: palavra-chave 'true'
ru: ключевое слово "true"
tr: 'true' anahtar sözcüğü
zh_hans: 关键字“true”
zh_hant: 關鍵字 'true'

# Parser.TOKEN.TRY
source: keyword 'try'
cs: klíčové slovo try
de: Schlüsselwort "try"
es: palabra clave 'try'
fr: mot clé 'try'
it: parola chiave 'try'
ja: キーワード 'try'
ko: 'try' 키워드
pl: słowo kluczowe „try”
pt_br: palavra-chave 'try'
ru: ключевое слово "try"
tr: 'try' anahtar sözcüğü
zh_hans: 关键字“try”
zh_hant: 關鍵字 'try'

# Parser.TOKEN.TYPE
source: keyword 'type'
cs: klíčové slovo type
de: Schlüsselwort "type"
es: palabra clave 'type'
fr: mot clé 'type'
it: parola chiave 'type'
ja: キーワード 'type'
ko: 'type' 키워드
pl: słowo kluczowe „type”
pt_br: palavra-chave 'type'
ru: ключевое слово "type"
tr: 'type' anahtar sözcüğü
zh_hans: 关键字“type”
zh_hant: 關鍵字 'type'

# Parser.TOKEN.VAL
source: keyword 'val'
cs: klíčové slovo val
de: Schlüsselwort "val"
es: palabra clave 'val'
fr: mot clé 'val'
it: parola chiave 'val'
ja: キーワード 'val'
ko: 'val' 키워드
pl: słowo kluczowe „val”
pt_br: palavra-chave 'val'
ru: ключевое слово "val"
tr: 'val' anahtar sözcüğü
zh_hans: 关键字“val”
zh_hant: 關鍵字 'val'

# Parser.TOKEN.INLINE
source: keyword 'inline'
cs: klíčové slovo inline
de: Schlüsselwort "inline"
es: palabra clave 'inline'
fr: mot clé 'inline'
it: parola chiave 'inline'
ja: キーワード 'inline'
ko: 'inline' 키워드
pl: słowo kluczowe „inline”
pt_br: palavra-chave 'inline'
ru: ключевое слово "inline"
tr: 'inline' anahtar sözcüğü
zh_hans: 关键字“inline”
zh_hant: 關鍵字 'inline'

# Parser.TOKEN.WHEN
source: keyword 'when'
cs: klíčové slovo when
de: Schlüsselwort "when"
es: palabra clave 'when'
fr: mot clé 'when'
it: parola chiave 'when'
ja: キーワード 'when'
ko: 'when' 키워드
pl: słowo kluczowe „when”
pt_br: palavra-chave 'when'
ru: ключевое слово "when"
tr: 'when' anahtar sözcüğü
zh_hans: 关键字“when”
zh_hant: 關鍵字 'when'

# Parser.TOKEN.WHILE
source: keyword 'while'
cs: klíčové slovo while
de: Schlüsselwort "while"
es: palabra clave 'while'
fr: mot clé 'while'
it: parola chiave 'while'
ja: キーワード 'while'
ko: 'while' 키워드
pl: słowo kluczowe „while”
pt_br: palavra-chave 'while'
ru: ключевое слово "while"
tr: 'while' anahtar sözcüğü
zh_hans: 关键字“while”
zh_hant: 關鍵字 'while'

# Parser.TOKEN.WITH
source: keyword 'with'
cs: klíčové slovo with
de: Schlüsselwort "with"
es: palabra clave 'with'
fr: mot clé 'with'
it: parola chiave 'with'
ja: キーワード 'with'
ko: 'with' 키워드
pl: słowo kluczowe „with”
pt_br: palavra-chave 'with'
ru: ключевое слово "with"
tr: 'with' anahtar sözcüğü
zh_hans: 关键字“with”
zh_hant: 關鍵字 'with'

# Parser.TOKEN.IF
source: keyword 'if'
cs: klíčové slovo if
de: Schlüsselwort "if"
es: palabra clave 'if'
fr: mot clé 'if'
it: parola chiave 'if'
ja: キーワード 'if'
ko: 'if' 키워드
pl: słowo kluczowe „if”
pt_br: palavra-chave 'if'
ru: ключевое слово "if"
tr: 'if' anahtar sözcüğü
zh_hans: 关键字“if”
zh_hant: 關鍵字 'if'

# Parser.TOKEN.DO
source: keyword 'do'
cs: klíčové slovo do
de: Schlüsselwort "do"
es: palabra clave 'do'
fr: mot clé 'do'
it: parola chiave 'do'
ja: キーワード 'do'
ko: 'do' 키워드
pl: słowo kluczowe „do”
pt_br: palavra-chave 'do'
ru: ключевое слово "do"
tr: 'do' anahtar sözcüğü
zh_hans: 关键字“do”
zh_hant: 關鍵字 'do'

# Parser.TOKEN.GLOBAL
source: keyword 'global'
cs: klíčové slovo global
de: Schlüsselwort "global"
es: palabra clave 'global'
fr: mot clé 'global'
it: parola chiave 'global'
ja: キーワード 'global'
ko: 'global' 키워드
pl: słowo kluczowe „global”
pt_br: palavra-chave 'global'
ru: ключевое слово "global"
tr: 'global' anahtar sözcüğü
zh_hans: 关键字“global”
zh_hant: 關鍵字 'global'

# Parser.TOKEN.DONE
source: keyword 'done'
cs: klíčové slovo done
de: Schlüsselwort "done"
es: palabra clave 'done'
fr: mot clé 'done'
it: parola chiave 'done'
ja: キーワード 'done'
ko: 'done' 키워드
pl: słowo kluczowe „done”
pt_br: palavra-chave 'done'
ru: ключевое слово "done"
tr: 'done' anahtar sözcüğü
zh_hans: 关键字“done”
zh_hant: 關鍵字 'done'

# Parser.TOKEN.IN
source: keyword 'in'
cs: klíčové slovo in
de: Schlüsselwort "in"
es: palabra clave 'in'
fr: mot clé 'in'
it: parola chiave 'in'
ja: キーワード 'in'
ko: 'in' 키워드
pl: słowo kluczowe „in”
pt_br: palavra-chave 'in'
ru: ключевое слово "in"
tr: 'in' anahtar sözcüğü
zh_hans: 关键字“in”
zh_hant: 關鍵字 'in'

# Parser.TOKEN.HIGH.PRECEDENCE.PAREN.APP
source: symbol '('
es: símbolo '('
fr: symbole '('
it: simbolo '('
ja: シンボル '('
ko: '(' 기호
pt_br: símbolo '('
ru: символ "("
tr: '(' simgesi
zh_hans: 符号“(”
zh_hant: 符號 '('

# Parser.TOKEN.HIGH.PRECEDENCE.BRACK.APP
source: symbol'['
es: símbolo'['
fr: symbole '['
it: simbolo '['
ja: シンボル '['
ko: '[' 기호
pt_br: símbolo'['
ru: символ "["
tr: '[' simgesi
zh_hans: 符号“[”
zh_hant: 符號 '['

# Parser.TOKEN.BEGIN
source: keyword 'begin'
cs: klíčové slovo begin
de: Schlüsselwort "begin"
es: palabra clave 'begin'
fr: mot clé 'begin'
it: parola chiave 'begin'
ja: キーワード 'begin'
ko: 'begin' 키워드
pl: słowo kluczowe „begin”
pt_br: palavra-chave 'begin'
ru: ключевое слово "begin"
tr: 'begin' anahtar sözcüğü
zh_hans: 关键字“begin”
zh_hant: 關鍵字 'begin'

# Parser.TOKEN.END
source: keyword 'end'
cs: klíčové slovo end
de: Schlüsselwort "end"
es: palabra clave 'end'
fr: mot clé 'end'
it: parola chiave 'end'
ja: キーワード 'end'
ko: 'end' 키워드
pl: słowo kluczowe „end”
pt_br: palavra-chave 'end'
ru: ключевое слово "end"
tr: 'end' anahtar sözcüğü
zh_hans: 关键字“end”
zh_hant: 關鍵字 'end'

# Parser.TOKEN.HASH.ENDIF
source: directive
cs: direktiva
de: Direktive
es: directiva
it: direttiva
ja: ディレクティブ
ko: 지시문
pl: dyrektywa
pt_br: diretiva
ru: директива
tr: yönerge
zh_hans: 指令
zh_hant: 指示詞

# Parser.TOKEN.INACTIVECODE
source: inactive code
cs: neaktivní kód
de: inaktiver Code
es: código inactivo
fr: code inactif
it: codice inattivo
ja: 非アクティブ コード
ko: 비활성 코드
pl: nieaktywny kod
pt_br: código inativo
ru: неактивный код
tr: pasif kod
zh_hans: 非活动代码
zh_hant: 非作用中的程式碼

# Parser.TOKEN.LEX.FAILURE
source: lex failure
cs: selhání lex
de: Lexfehler
es: error de LEX
fr: erreur lex
it: errore lex
ja: lex エラー
ko: lex 실패
pl: błąd leksykonu
pt_br: falha de lex
ru: лексическая ошибка
tr: lex hatası
zh_hans: lex 失败
zh_hant: 語彙失敗

# Parser.TOKEN.WHITESPACE
source: whitespace
cs: prázdný znak
de: Leerzeichen
es: espacio en blanco
fr: espace blanc
it: spazio vuoto
ja: スペース
ko: 공백
pl: odstęp
pt_br: espaço em branco
ru: пустое пространство
tr: boşluk
zh_hans: 空白
zh_hant: 空白

# Parser.TOKEN.COMMENT
source: comment
cs: Komentář
de: Kommentar
es: comentario
fr: Commentaire
it: commento
ja: コメント
ko: 주석
pl: Komentarz
pt_br: Comentário
ru: Комментарий
tr: Açıklama
zh_hans: 注释
zh_hant: 註解

# Parser.TOKEN.LINE.COMMENT
source: line comment
cs: řádkový komentář
de: Zeilenkommentar
es: comentario de línea
fr: commentaire de ligne
it: commento riga
ja: 行コメント
ko: 줄 주석
pl: komentarz wiersza
pt_br: comentário de linha
ru: строчный комментарий
tr: satır açıklaması
zh_hans: 行注释
zh_hant: 行註解

# Parser.TOKEN.STRING.TEXT
source: string text
cs: text řetězce
de: Zeichenfolgentext
es: texto de cadena
fr: chaîne de texte
it: testo stringa
ja: 文字列テキスト
ko: 문자열 텍스트
pl: tekst ciągu
pt_br: texto de cadeia de caracteres
ru: строковый текст
tr: dize metni
zh_hans: 字符串文本
zh_hant: 字串文字

# Parser.TOKEN.KEYWORD_STRING
source: compiler generated literal
cs: literál generovaný kompilátorem
de: vom Compiler generiertes Literal
es: literal generado por el compilador
fr: littéral généré par le compilateur
it: valore letterale generato dal compilatore
ja: コンパイラーで生成されたリテラル
ko: 컴파일러 생성 리터럴
pl: wygenerowany literał kompilatora
pt_br: literal gerado por compilador
ru: сформированный компилятором литерал
tr: derleyicinin oluşturduğu sabit değer
zh_hans: 编译器生成的文本
zh_hant: 編譯器產生的常值

# Parser.TOKEN.BYTEARRAY
source: byte array literal
cs: literál bajtového pole
es: literal de matriz de bytes
fr: littéral de tableau d'octets
it: valore letterale della matrice di byte
ja: バイト配列リテラル
ko: 바이트 배열 리터럴
pl: literał tablicy bajtów
pt_br: literal de matriz de bytes
ru: литерал массива байтов
tr: bayt dizisi sabit değeri
zh_hans: 字节数组文本
zh_hant: 位元組陣列常值

# Parser.TOKEN.STRING
source: string literal
cs: řetězcový literál
de: Zeichenfolgenliteral
es: Literal de cadena
fr: littéral de chaîne
it: valore letterale stringa
ja: 文字列リテラル
ko: 문자열 리터럴
pl: literał ciągu
pt_br: literal de cadeia de caracteres
ru: строковый литерал
tr: dize sabit değeri
zh_hans: 字符串文本
zh_hant: 字串常值

# Parser.TOKEN.EOF
source: end of input
cs: konec vstupu
de: Ende der Eingabe
es: fin de entrada
fr: entrée terminée
it: fine input
ja: 入力の終わり
ko: 입력의 끝
pl: koniec danych wejściowych
pt_br: fim de entrada
ru: конец входных данных
tr: girişin sonu
zh_hans: 输入结束
zh_hant: 輸入的結尾

source: Unexpected end of input
cs: Neočekávaný konec vstupu
de: Unerwartetes Ende der Eingabe
es: Final de entrada inesperado.
fr: Fin d'entrée inattendue
it: Fine di input non prevista
ja: 予期しない入力の終わりです:
ko: 예기치 않은 입력의 끝입니다.
pl: Nieoczekiwany koniec danych wejściowych
pt_br: Final da entrada inesperado
ru: Непредвиденный конец входных данных
tr: Beklenmeyen giriş sonu
zh_hans: 意外的输入结束
zh_hant: 未預期的輸入結束

# Unexpected
source: Unexpected {0}
cs: Neočekávaný {0}
de: Unerwartete(s/r) {0}.
es: No se esperaba {0}.
fr: {0} inattendu
it: {0} imprevisto/a
ja: 予期しない {0} です
ko: 예기치 않은 {0}입니다.
pl: Nieoczekiwany element {0}
pt_br: {0} inesperado
ru: Недопустимый {0}
tr: Beklenmeyen {0}
zh_hans: 意外的 {0}
zh_hant: 未預期的 {0}

# NONTERM.interaction
source: in interaction
cs: v interakci
de: in Interaktion
es: en interacción
fr: dans l'interaction
it: durante l'interazione
ja: 相互作用内
ko: 상호 작용
pl: w interakcji
pt_br: em interação
ru: в взаимодействии
tr: etkileşimde
zh_hans: 在交互中
zh_hant: 在互動中

# NONTERM.hashDirective
source: in directive
cs: v direktivě
de: in Direktive
es: en directiva
fr: dans la directive
it: in una direttiva
ja: ディレクティブ内
ko: 지시문
pl: w dyrektywie
pt_br: em diretiva
ru: в директиве
tr: yönergede
zh_hans: 在指令中
zh_hant: 在指示詞中

# NONTERM.fieldDecl
source: in field declaration
cs: v deklaraci pole
de: in Felddeklaration
es: en declaración de campo
fr: dans la déclaration de champ
it: in una dichiarazione di campo
ja: フィールドの宣言内
ko: 필드 선언
pl: w deklaracji pola
pt_br: em declaração de campo
ru: в объявлении поля
tr: alan bildiriminde
zh_hans: 在字段声明中
zh_hant: 在欄位宣告中

# NONTERM.unionCaseRepr
source: in discriminated union case declaration
cs: v deklaracích rozlišených případů typu union
de: in diskriminierter Union-Falldeklaration
es: en declaración de caso de unión discriminada
fr: dans la déclaration de cas d'union discriminé
it: in una dichiarazione di case di unione discriminato
ja: 判別された共用体ケースの宣言内
ko: 구분된 공용 구조체 케이스 선언
pl: w deklaracji przypadku unii rozłącznej
pt_br: em declaração de caso união discriminada
ru: в объявлении ветви различаемого объединения
tr: ayırt edici birleşim durumu bildiriminde
zh_hans: 在可区分的联合用例声明中
zh_hant: 在差別聯集宣告中

# NONTERM.localBinding
source: in binding
cs: ve vazbě
de: in Bindung
es: en enlace
fr: dans la liaison
it: nel binding
ja: 束縛内
ko: 바인딩
pl: w powiązaniu
pt_br: em associação
ru: в привязке
tr: bağlamada
zh_hans: 在绑定中
zh_hant: 在繫結中

# NONTERM.hardwhiteLetBindings
source: in binding
cs: ve vazbě
de: in Bindung
es: en enlace
fr: dans la liaison
it: nel binding
ja: 束縛内
ko: 바인딩
pl: w powiązaniu
pt_br: em associação
ru: в привязке
tr: bağlamada
zh_hans: 在绑定中
zh_hant: 在繫結中

# NONTERM.classDefnMember
source: in member definition
cs: v definici člena
es: en definición de miembro
fr: dans la définition de membre
it: in una definizione di membro
ja: メンバー定義内
ko: 멤버 정의
pl: w definicji elementu członkowskiego
pt_br: em definição de membro
ru: в определении элемента
tr: üye tanımında
zh_hans: 在成员定义中
zh_hant: 在成員定義中

# NONTERM.defnBindings
source: in definitions
cs: v definicích
de: in Definitionen
es: en definiciones
fr: dans les définitions
it: in definizioni
ja: 定義内
ko: 정의
pl: w definicjach
pt_br: em definições
ru: в определениях
tr: tanımlarda
zh_hans: 在定义中
zh_hant: 在定義中

# NONTERM.classMemberSpfn
source: in member signature
cs: v signatuře člena
de: in Membersignatur
es: en signatura de miembro
fr: dans la signature de membre
it: in una firma di membro
ja: メンバーのシグネチャ内
ko: 멤버 시그니처
pl: w sygnaturze elementu członkowskiego
pt_br: em assinatura de membro
ru: в сигнатуре элемента
tr: üye imzasında
zh_hans: 在成员签名中
zh_hant: 在成員簽章中

# NONTERM.valSpfn
source: in value signature
cs: v signatuře hodnoty
de: in Wertsignatur
es: en signatura de valor
fr: dans la signature de valeur
it: in una firma di valore
ja: 値のシグネチャ内
ko: 값 시그니처
pl: w sygnaturze wartości
pt_br: em assinatura de valor
ru: в сигнатуре значения
tr: değer imzasında
zh_hans: 在值签名中
zh_hant: 在值簽章中

# NONTERM.tyconSpfn
source: in type signature
cs: v signatuře typu
de: in Typsignatur
es: en signatura de tipo
fr: dans la signature de type
it: in una firma di tipo
ja: 型のシグネチャ内
ko: 형식 시그니처
pl: w sygnaturze typu
pt_br: em assinatura de tipo
ru: в сигнатуре типа
tr: tür imzasında
zh_hans: 在类型签名中
zh_hant: 在類型簽章中

# NONTERM.anonLambdaExpr
source: in lambda expression
cs: ve výrazu lambda
de: in lambda-Ausdruck
es: en expresión lambda
fr: dans l'expression lambda
it: in un'espressione lambda
ja: ラムダ式内
ko: 람다 식
pl: w wyrażeniu lambda
pt_br: em expressão lambda
ru: в лямбда-выражении
tr: lambda ifadesinde
zh_hans: 在 lambda 表达式中
zh_hant: 在 Lambda 運算式中

# NONTERM.attrUnionCaseDecl
source: in union case
cs: v případu typu union
de: in Union-Fall
es: en caso de unión
fr: dans le cas d'union
it: in un case di unione
ja: 共用体ケース内
ko: 공용 구조체 케이스
pl: w przypadku unii
pt_br: em caso união
ru: в ветви объединения
tr: birleşim durumunda
zh_hans: 在联合用例中
zh_hant: 在聯集中

# NONTERM.cPrototype
source: in extern declaration
cs: v externí deklaraci
de: in externer Deklaration
es: en declaración externa
fr: dans la déclaration extern
it: in una dichiarazione extern
ja: extern 宣言内
ko: extern 선언
pl: w deklaracji zewnętrznej
pt_br: em declaração externa
ru: в объявлении extern
tr: dış bildirimde
zh_hans: 在外部声明中
zh_hant: 在外部宣告中

# NONTERM.objectImplementationMembers
source: in object expression
cs: v objektovém výrazu
de: in Objektausdruck
es: en expresión de objeto
fr: dans l'expression d'objet
it: in un'espressione dell'oggetto
ja: オブジェクト式内
ko: 개체 식
pl: w wyrażeniu obiektu
pt_br: em expressão de objeto
ru: в выражении объекта
tr: nesne ifadesinde
zh_hans: 在对象表达式中
zh_hant: 在物件運算式中

# NONTERM.ifExprCases
source: in if/then/else expression
cs: ve výrazu if/then/else
de: in if/then/else-Ausdruck
es: en expresión if/then/else
fr: dans l'expression if/then/else
it: in un'espressione if/then/else
ja: if/then/else 式内
ko: if/then/else 식
pl: w wyrażeniu if/then/else
pt_br: em expressão if/then/else
ru: в выражении if/then/else
tr: if/then/else ifadesinde
zh_hans: 在 if/then/else 表达式中
zh_hant: 在 if/then/else 運算式中

# NONTERM.openDecl
source: in open declaration
cs: v otevřené deklaraci
de: in open-Deklaration
es: en declaración abierta
fr: dans la déclaration open
it: in una dichiarazione aperta
ja: open 宣言内
ko: 열려 있는 선언
pl: w otwartej deklaracji
pt_br: em declaração aberta
ru: в объявлении open
tr: açık bildirimde
zh_hans: 在开放的声明中
zh_hant: 在公開宣告中
