Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# InterfaceNotRevealed
source: The type implements the interface '{0}' but this is not revealed by the signature. You should list the interface in the signature, as the interface will be discoverable via dynamic type casts and/or reflection.
cs: Typ implementuje rozhraní {0}, které ale signatura neposkytuje. Měli byste toto rozhraní uvést v signatuře, aby bylo prostřednictvím dynamického přetypování nebo reflexe zjistitelné.
de: Der Typ implementiert die {0}-Schnittstelle, das wird jedoch von der Signatur nicht offengelegt. Sie sollten die Schnittstelle in der Signatur auflisten, da die Schnittstelle durch dynamische Typumwandlungen und/oder Reflektion erkannt werden kann.
es: El tipo implementa la interfaz '{0}', pero la signatura no revela esto. Debe incluir la interfaz en la signatura, ya que se podrá detectar la interfaz mediante reflexión o conversiones de tipo dinámicas.
fr: Le type implémente l'interface '{0}' mais cela n'est pas révélé par la signature. Vous devez lister l'interface dans la signature, car l'interface est détectable via des casts et/ou une réflexion de type dynamic.
it: Il tipo implementa l'interfaccia '{0}', ma questo non è indicato dalla firma. È necessario elencare l'interfaccia nella firma, perché sarà individuabile tramite cast e/o reflection di tipi dinamici.
ja: この型はインターフェイス '{0}' を実装していますが、シグネチャでは公開されていません。シグネチャにこのインターフェイスを列挙してください。動的な型のキャストやリフレクションによってインターフェイスを検出できるようになります。
ko: 형식이 '{0}' 인터페이스를 구현하지만 이 사실이 시그니처에 의해 표시되지 않습니다. 시그니처에 인터페이스를 나열해야 합니다. 이렇게 하면 동적 형식 캐스팅 및/또는 리플렉션을 통해 인터페이스를 검색할 수 있게 됩니다.
pl: Typ zawiera implementację interfejsu „{0}”, ale nie uwzględniono tego w sygnaturze. Dodaj interfejs do sygnatury, ponieważ interfejs będzie wykrywalny przez rzutowanie i/lub dynamiczne odbicia typów.
pt_br: O tipo implementa a interface '{0}' mas isto não é revelado pela assinatura. Você deveria listar a interface na assinatura, uma vez que a interface será detectável via conversões de tipo dinâmico e/ou reflexão.
ru: Тип реализует интерфейс "{0}", но это не показывается сигнатурой. Следует указать список в сигнатуре, так как интерфейс можно будет найти через динамические приведения и (или) отражение типов.
tr: Bu tür '{0}' arabirimini uyguluyor ancak bu durum imza ile gösterilmiyor. Arabirim dinamik tür atamaları ve/veya yansıtma aracılığıyla bulunabileceği için arabirimi imzada listelemeniz gerekir.
zh_hans: 类型实现了接口“{0}”，而签名未显示此接口。您应在签名中列出此接口，因为通过动态类型强制转换和/或反射将可以发现此接口。
zh_hant: 類型實作了介面 '{0}'，但是未由簽章顯示。您應該在簽章中列出這個介面，因為透過動態類型轉型和/或反映即可瀏覽這個介面。

# TyconBadArgs
source: The type '{0}' expects {1} type argument(s) but is given {2}
cs: Počet argumentů typu, které typ {0} očekává, je {1}, ale počet předávaných je {2}.
de: Der Typ "{0}" erwartet {1} Typargument(e), erhält aber {2}.
es: El tipo '{0}' espera {1} argumentos de tipo, pero se proporcionaron {2}.
fr: Le type '{0}' attend {1} argument(s) de type mais en a reçu {2}
it: Il tipo '{0}' prevede {1} argomento/i tipo, tuttavia il numero di argomenti tipo specificati è pari a {2}
ja: 型 '{0}' には {1} 個の型引数が必要ですが、指定されたのは {2} 個です
ko: {0}' 형식에 {1}개의 형식 인수가 필요한데 {2}개를 받았습니다.
pl: Typ „{0}” oczekuje następującej liczby argumentów typu: {1}. Podana liczba argumentów: {2}
pt_br: O tipo '{0}' espera argumento(s) de tipo {1} mas é dado {2}
ru: Для типа "{0}" потребуется {1} аргументов типа, получено {2}
tr: {0}' türü {1} tür bağımsız değişkeni bekliyor ancak {2} verilmiş
zh_hans: 类型“{0}”需要 {1} 个类型参数，而给定了 {2} 个类型参数
zh_hant: 型別 '{0}' 需要 {1} 個型別引數，卻指定了 {2} 個

# IndeterminateType
source: Lookup on object of indeterminate type based on information prior to this program point. A type annotation may be needed prior to this program point to constrain the type of the object. This may allow the lookup to be resolved.
cs: Definovali jste vyhledávání u objektu neurčitého typu založeného na informacích před tímto místem v programu. Aby se typ objektu omezil, bude možná potřeba přidat před tímto místem v programu poznámku typu. Tím se problém s vyhledáváním pravděpodobně vyřeší.
de: Lookup für ein Objekt unbestimmten Typs, der auf Informationen vor diesem Programmpunkt basiert. Möglicherweise ist vor diesem Programmpunkt eine Typanmerkung erforderlich, um den Objekttyp einzuschränken. Dadurch kann das Lookup möglicherweise aufgelöst werden.
es: Búsqueda de un objeto de tipo indeterminado basado en información anterior a este punto del programa. Puede ser necesaria una anotación de tipo anterior a este punto del programa para restringir el tipo del objeto. Esto puede permitir que se resuelva la búsqueda.
fr: Recherche d'un objet de type indéterminé basé sur des informations situées avant ce point du programme. Une annotation de type peut être nécessaire avant ce point du programme pour contraindre le type de l'objet. Cela peut permettre la résolution de la recherche.
it: Ricerca in un oggetto di tipo non determinato basato su informazioni che si trovano prima di questo punto del programma. Potrebbe essere necessaria un'annotazione di tipo prima di questo punto del programma per vincolare il tipo dell'oggetto. Questa modifica potrebbe consentire la risoluzione della ricerca.
ja: このプログラムの場所の前方にある情報に基づく不確定の型のオブジェクトに対する参照です。場合によっては、オブジェクトの型を制約する型の注釈がこのプログラムの場所の前に必要です。この操作で参照が解決される可能性があります。
ko: 이 프로그램 지점 전의 정보를 기반으로 하는 확인할 수 없는 형식의 개체를 대상으로 조회를 수행합니다. 개체의 형식을 제한하기 위해 이 프로그램 지점 전에 형식 주석이 필요할 수 있습니다. 이를 통해 조회가 확인될 수도 있습니다.
pl: Odnośnik do obiektu nieokreślonego typu na podstawie informacji przed tym punktem programu. Może być wymagana adnotacja typu przed tym punktem programu w celu ograniczenia typu obiektu. Może to umożliwić rozpoznanie odnośnika.
pt_br: Pesquisa por um objeto de tipo indeterminado baseado em informações anteriores a este ponto do programa. Uma anotação de tipo pode ser necessária antes deste ponto do programa para restringir o tipo do objeto. Isto deverá permitir que a pesquisa seja resolvida.
ru: Поиск объекта неопределенного типа, основанного на информации до данной точки программы. Возможно, перед данной точкой программы потребуется аннотация типа, с целью ограничения типа объекта. Возможно, это позволит разрешить поиск.
tr: Bu program noktasından önceki bilgilere dayalı olarak belirsiz türdeki nesne araması. Bu program noktasından önce nesnenin türünü kısıtlamak için bir tür ek açıklaması gerekebilir. Bu, aramanın çözümlenmesine izin verebilir.
zh_hans: 查找基于此程序点之前的信息的不确定类型的对象。在此程序点之前可能需要类型批注来约束对象的类型。这可能允许解析查找。
zh_hant: 根據這個程式點之前的資訊，查詢是針對不定類型的物件。在這個程式點之前可能需要類型註釋，以限制物件的類型。這樣或許可以讓查詢能夠解析。

# NameClash1
source: Duplicate definition of {0} '{1}'
cs: Duplicitní definice: {0} {1}
de: Doppelte Definition von {0} "{1}"
es: Definición duplicada de {0} '{1}'
fr: Définition dupliquée de {0} '{1}'
it: Definizione duplicata di {0} '{1}'
ja: {0} '{1}' の定義が重複しています
ko: {0} '{1}'의 정의가 중복되었습니다.
pl: Zduplikowana definicja elementu {0} „{1}”
pt_br: Definição duplicada de {0} '{1}'
ru: Повторяющееся определение {0} "{1}"
tr: Yinelenen {0} '{1}' tanımı
zh_hans: {0}“{1}”的定义重复
zh_hant: 重複的 {0} '{1}' 定義

# NameClash2
source: The {0} '{1}' can not be defined because the name '{2}' clashes with the {3} '{4}' in this type or module
cs: {0} {1} se nedá definovat, protože název {2} a {3} {4} v tomto typu nebo modulu jsou v konfliktu.
de: {0} "{1}" kann nicht definiert werden, weil der Name "{2}" einen Konflikt mit {3} "{4}" in diesem Typ oder Modul verursacht.
es: No se puede definir el {0} '{1}' porque el nombre '{2}' está en conflicto con el {3} '{4}' de este tipo o módulo.
fr: Impossible de définir le {0} '{1}', car le nom '{2}' est en conflit avec le {3} '{4}' dans ce type ou module
it: Non è possibile definire {0} '{1}' perché il nome '{2}' è in conflitto con {3} '{4}' in questo tipo o modulo
ja: 名前 '{2}' がこの型またはモジュールの {3} '{4}' と競合するため、{0} '{1}' を定義できません
ko: 이름 '{2}'이(가) 이 형식 또는 모듈의 {3} '{4}'과(와) 충돌하므로 {0} '{1}'을(를) 정의할 수 없습니다.
pl: Nie można zdefiniować elementu {0} „{1}”, ponieważ nazwa „{2}” powoduje konflikt z elementem {3} „{4}” w tym typie lub module
pt_br: O {0} '{1}' não pode ser definido porque o nome '{2}' conflita com {3} '{4}' neste tipo ou módulo
ru: {0} "{1}" не удается определить, так как имя "{2}" конфликтует с {3} "{4}" в данном типе или модуле
tr: {2}' adı bu türde veya modülde {3} '{4}' ile çakıştığı için {0} '{1}' tanımlanamıyor
zh_hans: 无法定义 {0}“{1}”，因为名称“{2}”与此类型或模块中的 {3}“{4}”冲突
zh_hant: 無法定義 {0} '{1}'，因為名稱 '{2}' 與這個類型或模組中的 {3} '{4}' 相衝突

# Duplicate1
source: Two members called '{0}' have the same signature
cs: Dva členové s názvem {0} mají stejnou signaturu.
de: Zwei Member namens "{0}" weisen dieselbe Signatur auf.
es: Dos miembros denominados '{0}' tienen la misma signatura.
fr: Deux membres appelés '{0}' ont la même signature
it: Due membri denominati '{0}' hanno la stessa firma
ja: '{0}' という 2 つのメンバーが同じシグネチャを使用しています
ko: '{0}'(이)라는 두 멤버의 시그니처가 같습니다.
pl: Dwa elementy członkowskie o nazwie „{0}” mają taką samą sygnaturę
pt_br: Dois membros chamados '{0}' possuem a mesma assinatura
ru: Два элемента с именем "{0}" имеют одну и ту же сигнатуру
tr: '{0}' çağrısı yapan iki üye aynı imzaya sahip
zh_hans: 名为“{0}”的两个成员具有相同的签名
zh_hant: 名稱為 '{0}' 的兩個成員具有相同的簽章

# Duplicate2
source: Duplicate definition of {0} '{1}'
cs: Duplicitní definice: {0} {1}
de: Doppelte Definition von {0} "{1}"
es: Definición duplicada de {0} '{1}'
fr: Définition dupliquée de {0} '{1}'
it: Definizione duplicata di {0} '{1}'
ja: {0} '{1}' の定義が重複しています
ko: {0} '{1}'의 정의가 중복되었습니다.
pl: Zduplikowana definicja elementu {0} „{1}”
pt_br: Definição duplicada de {0} '{1}'
ru: Повторяющееся определение {0} "{1}"
tr: Yinelenen {0} '{1}' tanımı
zh_hans: {0}“{1}”的定义重复
zh_hant: 重複的 {0} '{1}' 定義

# UndefinedName2
source: A construct with this name was found in FSharp.PowerPack.dll, which contains some modules and types that were implicitly referenced in some previous versions of F#. You may need to add an explicit reference to this DLL in order to compile this code.
cs: Konstruktor s tímto názvem se našel v knihovně FSharp.PowerPack.dll, která obsahuje určité moduly a typy implicitně odkazované v některých dřívějších verzích F#. Abyste tento kód mohli zkompilovat, bude možná potřeba přidat explicitní odkaz na tuto knihovnu DLL.
de: Ein Konstrukt mit diesem Namen wurde in "FSharp.PowerPack.dll" gefunden; diese DLL enthält einige Module und Typen, auf die in früheren Versionen von F# implizit verwiesen wurde. Möglicherweise müssen Sie einen expliziten Verweis auf diese DLL hinzufügen, um den Code kompilieren zu können.
es: Se encontró una construcción con este nombre en FSharp.PowerPack.dll, que contiene algunos módulos y tipos a los que se hacía referencia de forma implícita en algunas versiones anteriores de F#. Puede ser necesario agregar una referencia explícita a este archivo DLL para compilar este código.
fr: Une construction portant ce nom a été trouvée dans FSharp.PowerPack.dll, qui contient certains modules et types implicitement référencés dans des versions antérieures de F#. Vous pouvez ajouter une référence explicite à cette DLL pour compiler ce code.
it: Trovato costrutto con questo nome in FSharp.PowerPack.dll, contenente alcuni moduli e tipi a cui viene fatto riferimento implicito in alcune versioni precedenti di F#. Potrebbe essere necessario aggiungere un riferimento esplicito a questa DLL per compilare il codice.
ja: この名前を持つコンストラクトが FSharp.PowerPack.dll に見つかりました。この DLL には、F# の以前のバージョンの一部で暗黙的に参照されていたモジュールおよび型がいくつか含まれます。場合によっては、このコードをコンパイルするために、この DLL への明示的な参照を追加する必要があります。
ko: 이 이름의 구문을 FSharp.PowerPack.dll에서 찾았습니다. 이 DLL에는 일부 이전 버전의 F#에서 암시적으로 참조된 모듈 및 형식이 일부 포함되어 있습니다. 이 코드를 컴파일하려면 이 DLL에 대한 명시적 참조를 추가해야 할 수 있습니다.
pl: Konstrukcję o tej nazwie odnaleziono w pliku FSharp.PowerPack.dll. Zawiera on pewne moduły i typy, których dotyczyły niejawne odwołania w niektórych wcześniejszych wersjach języka F#. Skompilowanie tego kodu może wymagać dodania jawnego odwołania do tego pliku DLL.
pt_br: Um constructo com esse nome foi encontrado em FSharp.PowerPack.dll, que contém alguns módulos e tipos que foram referenciados implicitamente em alguma versão prévia de F#. Talvez seja necessário adicionar uma referência explícita a esse DLL para compilar seu código.
ru: Конструкция с данным именем была найдена в FSharp.PowerPack.dll; она содержит некоторые модели и типы, на которые есть неявные ссылки в некоторых предыдущих версиях F#. Возможно, потребуется добавить явную ссылку на данный DLL, чтобы скомпилировать этот код.
tr: Bu adlı bir yapı, F# dilinin önceki bazı sürümlerinde örtük olarak başvurulan bazı modül ve türleri içeren FSharp.PowerPack.dll dosyasında bulundu. Bu kodu derleyebilmek için bu DLL'ye açık başvuru eklemeniz gerekebilir.
zh_hans: 在 FSharp.PowerPack.dll 中找到了同名构造，其中包含某些早期版本的 F# 中已隐式引用的一些模块和类型。您可能需要添加对此 DLL 的显式引用以编译此代码。
zh_hant: 在 FSharp.PowerPack.dll 中找到這個名稱的建構，它包含部分舊版 F# 中隱含參考的一些模組和類型。您可能必須加入這個 DLL 的明確參考，才能編譯這個程式碼。

# FieldNotMutable
source: This field is not mutable
cs: Toto pole není měnitelné.
de: Dieses Feld ist nicht änderbar.
es: Este campo no es mutable.
fr: Ce champ n'est pas mutable
it: Questo campo non è modificabile
ja: このフィールドは変更可能ではありません
ko: 이 필드는 변경할 수 없습니다.
pl: Nie można modyfikować tego pola
pt_br: Este campo não é mutável
ru: Это поле не является изменяемым
tr: Bu alan değiştirilebilir değil
zh_hans: 此字段是不可变的
zh_hant: 這個欄位不是可變動的欄位

# FieldsFromDifferentTypes
source: The fields '{0}' and '{1}' are from different types
cs: Pole {0} a {1} jsou odlišného typu.
de: Die Felder "{0}" und "{1}" stammen aus unterschiedlichen Typen.
es: Los campos '{0}' y '{1}' son de tipos diferentes.
fr: Les champs '{0}' et '{1}' sont de types différents
it: I campi '{0}' e '{1}' sono di tipi diversi
ja: フィールド '{0}' と '{1}' は異なる型です
ko: {0}' 필드와 '{1}' 필드의 소스 형식이 서로 다릅니다.
pl: Pola „{0}” i „{1}” są polami różnego typu
pt_br: Os campos '{0}' e '{1}' são de tipos diferentes
ru: Поля "{0}" и "{1}" принадлежат различным типам
tr: {0}' ve '{1}' alanları farklı türlerde
zh_hans: 字段“{0}”和“{1}”来自不同的类型
zh_hant: 欄位 '{0}' 和 '{1}' 來自不同類型

# VarBoundTwice
source: '{0}' is bound twice in this pattern
cs: {0} má v tomto vzoru dvě vazby.
de: {0} ist in diesem Muster doppelt gebunden.
es: '{0}' está enlazado dos veces en este patrón
fr: '{0}' est lié à deux reprises dans ce modèle
it: '{0}' è associato due volte in questo criterio
ja: このパターンで '{0}' が 2 回バインドされています
ko: '{0}'은(는) 이 패턴에서 두 번 바인딩되었습니다.
pl: Zmienna „{0}” została powiązana dwa razy w tym wzorcu
pt_br: '{0}' é associado duas vezes neste padrão
ru: {0} в данном шаблоне привязан дважды
tr: '{0}' bu desende iki kez bağlandı
zh_hans: “{0}”在此模式中绑定了两次
zh_hant: '{0}' 在這個模式中繫結兩次

# Recursion
source: A use of the function '{0}' does not match a type inferred elsewhere. The inferred type of the function is\n {1}. \nThe type of the function required at this point of use is\n {2} {3}\nThis error may be due to limitations associated with generic recursion within a 'let rec' collection or within a group of classes. Consider giving a full type signature for the targets of recursive calls including type annotations for both argument and return types.
cs: Použití funkce {0} neodpovídá typu, který se odvozuje na jiném místě. Odvozený typ funkce je\n {1}. \nTyp funkce, který se na tomto místě požaduje, je \n {2} {3}.\nTato chyba může být způsobená omezeními, která jsou přidružená k obecné rekurzi v kolekci let rec nebo ve skupině tříd. Zvažte možnost zadat úplnou signaturu typu pro cíle rekurzivních volání včetně poznámek typu pro argumenty i návratových typů.
de: Ein Vorkommen der Funktion "{0}" stimmt nicht mit einem an anderer Stelle per Rückschluss abgeleiteten Typ überein. Der abgeleitete Typ der Funktion ist:\n {1}. \nAn diesem Verwendungsort ist folgender Funktionstyp erforderlich:\n {2} {3}\nDieser Fehler kann auf Einschränkungen im Zusammenhang mit der generischen Rekursion innerhalb einer "let rec"-Sammlung oder innerhalb einer Gruppe von Klassen zurückzuführen sein. Definieren Sie ggf. eine vollständige Typsignatur für die Ziele von rekursiven Aufrufen, einschließlich Typanmerkungen für Argument- und Rückgabetyp.
es: Un uso de la función '{0}' no coincide con un tipo inferido en otro lugar. El tipo inferido de la función es\n {1}. \nEl tipo de la función necesaria en este punto del uso es\n {2} {3}\nEste error puede deberse a limitaciones asociadas con la recursión genérica en una colección 'let rec' o en un grupo de clases. Considere proporcionar una signatura de tipo completa para los destinos de las llamadas recursivas que incluyen anotaciones de tipo tanto para tipos de argumento como para tipos de valor devuelto.
fr: Une utilisation de la fonction '{0}' ne correspond pas à un type déduit ailleurs. Le type déduit de la fonction est\n {1}. \nLe type de la fonction nécessaire à ce stade de l'utilisation est\n {2} {3}\nCette erreur peut être due à des limitations associées à la récursivité générique dans une collection 'let rec' ou dans un groupe de classes. Fournissez une signature de type complète pour les cibles des appels récursifs en incluant les annotations de type des arguments et des types de retour.
it: Un utilizzo della funzione '{0}' non corrisponde a un tipo dedotto in un'altra posizione. Il tipo dedotto della funzione è\n {1}. \nIl tipo della funzione richiesto in questo punto dell'utilizzo è\n {2} {3}\nQuesto errore potrebbe essere dovuto a limitazioni associate alla ricorsione generica in una raccolta 'let rec' o in un gruppo di classi. Provare a specificare una firma di tipo completa per le destinazioni delle chiamate ricorsive con annotazioni di tipo per i tipi restituiti e di argomento.
ja: 関数 '{0}' の使用方法は、推論される型のいずれとも一致しません。この関数の推論される型は次のとおりです。\n {1} \nこの使用時点で必要な関数の型は次のとおりです。\n {2} {3}\nこのエラーの原因は、'let rec' コレクション内、またはクラスのグループ内のジェネリック再帰に関連する制限の可能性があります。引数と戻り値の型の両方に型の注釈を指定するなど、再帰呼び出しのターゲットに完全な型のシグネチャを指定してください。
ko: {0}' 함수의 사용이 다른 위치에서 유추된 형식과 일치하지 않습니다. 함수의 유추 형식은\n {1}입니다. \n여기서 필요한 함수의 형식은\n {2}입니다. {3}\n이 오류는 'let rec' 컬렉션 또는 클래스 그룹 내에서 제네릭 재귀와 관련된 제한으로 인해 발생할 수 있습니다. 인수 및 반환 형식 모두에 대한 형식 주석을 비롯하여 재귀적 호출의 대상에 전체 형식 시그니처를 지정하세요.
pl: Użycie funkcji „{0}” nie jest zgodne z typem wywnioskowanym w innym miejscu. Wywnioskowany typ funkcji:\n {1}. \nTyp funkcji wymagany w tym punkcie użycia:\n {2} {3}\nTen błąd może być spowodowany przez ograniczenia związane z ogólnym cyklem w kolekcji „let rec” lub grupie klas. Rozważ określenie pełnej sygnatury typu dla elementów docelowych wywołań cyklicznych, łącznie z adnotacjami typów dla typów argumentów i zwracanych typów.
pt_br: O uso da função '{0}' não corresponde a um tipo inferido em outro local. O tipo inferido da função é\n {1}. \nO tipo da função necessária neste ponto de uso é\n {2} {3}\nEste erro pode ocorrer devido a limitações associadas à recursão genérica em uma coleção 'let rec' ou em um grupo de classes. Considere fornecer uma assinatura de tipo completo para os destinos de chamadas recursivas incluindo anotações de tipo para tipos de argumento e de retorno.
ru: Использование функции "{0}" не совпадает с типом, логически выводимым где-то еще. Логически выводимым типом функции является \n {1}. \nТипом требуемой в данный момент использования функцией является \n {2} {3}\nДанная ошибка может происходить из-за ограничений, связанных с базовой рекурсией внутри коллекции "let rec", или внутри группы классов. Рекомендуется предоставить сигнатуру полного типа для целей рекурсивных вызовов, включая аннотации типов для типов возвращаемых значений и аргумента.
tr: {0}' işlevinin kullanımı başka bir yerde çıkarılmış türle eşleşmiyor. İşlevin çıkarılan türü\n {1}. \nBu kullanım noktasında gereken işlevin türü\n {2} {3}\nBu hata, 'let rec' koleksiyonu veya bir sınıf grubu içindeki genel özyineleme ile ilişkili sınırlamalar nedeniyle olabilir. Hem bağımsız değişken hem de dönüş türleri için tür ek açıklamaları ekleyerek özyinelemeli çağrıların hedefleri için tam tür imzası vermeyi düşünün.
zh_hans: 对函数“{0}”的使用与在其他位置推理出的类型不匹配。推理出的函数的类型为\n {1}。 \n此时需要使用的函数的类型为\n {2} {3}\n此错误可能是由于与一个“let rec”集合或一组类中的泛型递归相关联的限制所导致的。请考虑为递归调用的目标给定完整的类型签名，包括参数和返回类型的类型批注。
zh_hant: 函式 '{0}' 的使用方式不符合由他處推斷的類型。函式的推斷類型是\n {1}。 \n在這個使用點需要的函式類型是\n {2} {3}\n這個錯誤可能是 'let rec' 集合內或類別群組內泛型遞迴的相關限制所致。請考慮為遞迴呼叫的目標指定完整類型的簽章，包含引數和傳回型別兩者的類型註釋。

# InvalidRuntimeCoercion
source: Invalid runtime coercion or type test from type {0} to {1}\n{2}
cs: Neplatný test typu nebo konverze za běhu z typu {0} na {1}\n{2}
de: Ungültige Laufzeitkoersion oder ungültiger Typtest von Typ "{0}" in "{1}"\n{2}
es: Conversión o prueba de tipo en tiempo de ejecución no válida del tipo {0} a {1}\n{2}
fr: Forçage de type ou test de type au moment de l'exécution non valide, du type {0} en {1}\n{2}
it: Test di tipo o coercizione di runtime non valido del tipo {0} in {1}\n{2}
ja: 型 {0} から型 {1} への無効なランタイム型変換または型テストです\n{2}
ko: 런타임 강제 변환 또는 형식 테스트(소스: {0} 형식, 대상: {1} 형식)가 잘못되었습니다.\n{2}
pl: Nieprawidłowa koercja środowiska uruchomieniowego lub test typu z typu {0} w typ {1}\n{2}
pt_br: Teste de tipo ou coerção em tempo de execução inválido do tipo {0} para {1}\n{2}
ru: Недопустимое приведение или проверка типа во время выполнения от типа {0} к {1}\n{2}
tr: {0} türünden şu türe geçersiz çalışma zamanı zorlaması veya tür testi: {1}\n{2}
zh_hans: 从类型 {0} 到 {1} 的运行时强制或类型测试无效\n{2}
zh_hant: 從類型 {0} 到 {1} 的執行階段強制型轉或類型測試無效\n{2}
