Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# UseOfAddressOfOperator
source: The use of native pointers may result in unverifiable .NET IL code
cs: Použití nativních ukazatelů může způsobit vygenerování neověřitelného kódu .NET IL.
de: Durch die Verwendung von nativen Zeigern kann nicht verifizierbarer .NET-IL-Code entstehen.
es: El uso de punteros nativos puede dar lugar a código .NET de IL que no se puede comprobar.
fr: L'utilisation de pointeurs natifs peut rendre le code IL (Intermediate Language) .NET non vérifiable
it: L'utilizzo di puntatori nativi potrebbe rendere il codice IL .NET non verificabile
ja: ネイティブ ポインターを使用すると、.NET IL コードを検証できなくなる可能性があります
ko: 기본 포인터를 사용하면 확인할 수 없는 .NET IL 코드가 생성될 수 있습니다.
pl: Użycie wskaźników natywnych może spowodować utworzenie kodu .NET IL, którego nie można zweryfikować
pt_br: O uso de ponteiros nativos podem resultar em código .NET IL não verificável
ru: Использование собственных указателей может повлечь за собой непроверяемый код .NET IL
tr: Yerel işaretçilerin kullanılması doğrulanamayan .NET IL koduyla sonuçlanabilir
zh_hans: 使用本机指针可能会导致无法验证的 .NET IL 代码
zh_hant: 使用原生指標可能產生無法驗證的 .NET IL 程式碼

# DeprecatedThreadStaticBindingWarning
source: Thread static and context static 'let' bindings are deprecated. Instead use a declaration of the form 'static val mutable <ident> : <type>' in a class. Add the 'DefaultValue' attribute to this declaration to indicate that the value is initialized to the default value on each new thread.
cs: Vazby let, které jsou statické na úrovni vlákna nebo kontextu, jsou zastaralé. Použijte místo nich deklaraci ve třídě v podobě static val mutable <ident> : <typ>. Přidáním atributu DefaultValue do této deklarace můžete určit, že se bude hodnota v každém novém vláknu inicializovat na výchozí hodnotu.
de: Threadstatische und kontextstatische "let"-Bindungen sind veraltet. Verwenden Sie stattdessen eine Deklaration im Format "static val mutable <ident> : <type>" in einer Klasse. Fügen Sie dieser Deklaration das DefaultValue-Attribut hinzu, um anzugeben, dass der Wert bei jedem neuen Thread mit dem Standardwert initialisiert wird.
es: Los enlaces estáticos de subproceso y "let" estáticos de contexto están en desuso. En su lugar, utilice una declaración den el formato "static val mutable <ident> : <type>" en una clase. Agregue el atributo "DefaultValue" a esta declaración para indicar que el valor se inicializa al valor predeterminado en cada subproceso nuevo.
fr: Les liaisons static 'let' de thread et de contexte sont dépréciées. Utilisez plutôt une déclaration de la forme 'static val mutable <ident> : <type>' dans une classe. Ajoutez l'attribut 'DefaultValue' à cette déclaration pour indiquer que la valeur est initialisée sur la valeur par défaut sur chaque nouveau thread.
it: I binding 'let' statici a livello di thread e a livello di contesto sono deprecati. Usare invece una dichiarazione nel formato 'static val mutable <ident> : <type>' in una classe. Aggiungere l'attributo 'DefaultValue' alla dichiarazione per indicare che il valore deve essere inizializzato con il valore predefinito in ogni nuovo thread.
ja: Thread 静的および context 静的 'let' バインディングは使用されなくなりました。代わりに、クラスで 'static val mutable <ident> : <type>' という形式の宣言を使用します。新しいスレッドごとに値を既定値に初期化することを示すには、この宣言に 'DefaultValue' 属性を追加します。
ko: Thread 정적 및 Context 정적 'let' 바인딩은 사용되지 않습니다. 대신 클래스에 'static val mutable <ident> : <type>' 형식의 선언을 사용하세요. 값이 각 새 스레드에서 기본값으로 초기화됨을 나타내려면 'DefaultValue' 특성을 추가하세요.
pl: Powiązania „let” statyczne dla wątku i kontekstu są przestarzałe. Zamiast tego użyj deklaracji w postaci „static val mutable <identyfikator> : <typ>” w klasie. Dodaj atrybut „DefaultValue” do tej deklaracji, aby określić, że wartość jest inicjowana przy użyciu wartości domyślnej w każdym nowym wątku.
pt_br: As associações 'let' estáticas de contexto e estáticas de thread estão preteridas. Use uma declaração da forma 'static val mutable <ident> : <type>'em uma classe. Adicione o atributo 'DefaultValue' para esta declaração para indicar que o valor foi inicializado para o valor padrão em cada novo thread.
ru: Статические привязки потока и контекста 'let' являются устаревшими. Используйте объявление вида 'static val mutable <ident> : <type>' в классе. Добавьте атрибут 'DefaultValue' к этому объявлению, чтобы указать, что это значение инициализируется значением по умолчанию для каждого нового потока.
tr: İş parçacığı ve bağlam açısından statik 'let' bağlamaları kullanımdan kaldırılmıştır. Bunun yerine bir sınıfta 'static val mutable <ident> : <type>' biçiminde bir bildirim kullanın. Değerin her yeni iş parçacığında varsayılan değerle başlatıldığını belirtmek için bu bildirime 'DefaultValue' özniteliğini ekleyin.
zh_hans: 线程静态的和上下文静态的 "let" 绑定已弃用。请改为在类中使用 "static val mutable <ident> : <type>" 格式的声明。请将 "DefaultValue" 添加到此声明，以指示在每个新线程上将该值初始化为默认值。
zh_hant: 靜態執行緒和靜態環境 'let' 繫結已淘汰。請在類別中改用 'static val mutable <ident> : <type>' 形式的宣告。將 'DefaultValue' 屬性新增到此宣告，可指出值會在每個新的執行緒均初始化為預設值。

# FunctionValueUnexpected
source: This expression is a function value, i.e. is missing arguments. Its type is {0}.
cs: Tento výraz je hodnotou funkce, to znamená, že u něj chybí argumenty. Je typu {0}.
de: Dieser Ausdruck ist ein Funktionswert, d.h., es fehlen Argumente. Typ: {0}.
es: Esta expresión es un valor de función, es decir, le faltan argumentos. Es de tipo {0}.
fr: Cette expression est une valeur de fonction, c'est-à-dire qu'il lui manque des arguments. Son type est {0}.
it: Questa espressione è un valore di funzione, ovvero sono assenti argomenti. Il relativo tipo è {0}.
ja: この式は関数値です (つまり、引数が足りません)。型は {0} です。
ko: 이 식은 함수 값입니다. 즉, 인수가 없습니다. 해당 형식은 {0}입니다.
pl: To wyrażenie jest wartością funkcji, co oznacza, że brakuje argumentów. Typ wyrażenia: {0}.
pt_br: Esta expressão é um valor de função, isto é, faltam argumentos. Seu tipo é {0}.
ru: Данное выражение является значением функции, напр. в нем отсутствуют аргументы. Его тип - {0}.
tr: Bu ifade bir işlev değeri, yani bağımsız değişkenleri eksik. Türü: {0}.
zh_hans: 此表达式是一个函数值，也就是说，缺少参数。其类型为 {0}。
zh_hant: 這個運算式是函式值，也就是遺漏引數。它的類型是 {0}。

# UnitTypeExpected
source: The result of this expression has type '{0}' and is implicitly ignored. Consider using 'ignore' to discard this value explicitly, e.g. 'expr |> ignore', or 'let' to bind the result to a name, e.g. 'let result = expr'.
cs: Výsledek tohoto výrazu má typ {0} a implicitně se ignoruje. Zvažte možnost zahodit tuto hodnotu explicitně pomocí klíčového slova ignore (například výraz |> ignore) nebo vytvořit vazbu výsledku na název pomocí klíčového slova let (například let výsledek = výraz).
de: Das Ergebnis dieses Ausdrucks hat den Typ "{0}" und wird implizit ignoriert. Verwenden Sie "ignore", um diesen Wert explizit zu verwerfen, z.B. "expr |> ignore", oder "let", um das Ergebnis an einen Namen zu binden, z.B. "let result = expr".
es: El resultado de esta expresión tiene el tipo "{0}" y se ignora implícitamente. Considere usar "ignore" para descartar este valor explícitamente, por ejemplo, "'expr |> ignore" let" para vincular el resultado a un nombre, por ejemplo, "let result = expr".
fr: Le résultat de cette expression a le type '{0}' et est implicitement ignoré. Utilisez 'ignore' pour ignorer explicitement cette valeur, par ex. 'expr |> ignore', ou 'let' pour lier le résultat à un nom, par ex. 'let result = expr'.
it: Il risultato di questa espressione è di tipo '{0}' e viene ignorato in modo implicito. Provare a usare 'ignore' per rimuovere esplicitamente questo valore, ad esempio 'expr |> ignore', oppure 'let' per eseguire il binding del risultato a un nome, ad esempio 'let result = expr'.
ja: この式の結果の型は '{0}' で、暗黙的に無視されます。'ignore' を使用してこの値を明示的に破棄してください (例: 'expr |> ignore')。または 'let' を使用して結果を名前にバインドします (例: 'let result = expr')。
ko: 이 식의 결과는 '{0}' 형식이며 암시적으로 무시됩니다. 'ignore'를 사용하여 이 값을 명시적으로 버리거나(예: 'expr |> ignore'), 'let'을 사용하여 결과를 이름에 바인딩하세요(예: 'let result = expr').
pl: Wynik tego wyrażenia ma typ „{0}” i jest niejawnie ignorowany. Rozważ użycie elementu „ignore”, aby jawnie odrzucić tę wartość (np. „wyrażenie |> ignore”), lub elementu „let”, aby powiązać wynik z nazwą (np. „let wynik = wyrażenie”).
pt_br: O resultado dessa expressão tem o tipo '{0}' e implicitamente é ignorado. Use 'ignore' para descartar esse valor explicitamente, por exemplo, 'expr |> ignore', ou 'let' para associar o resultado a um nome, por exemplo, 'let result = expr'.
ru: Результат этого выражения имеет тип "{0}" и неявно игнорируется. Используйте "ignore", чтобы явно отклонить это значение, например, 'expr |> ignore', или используйте "let", чтобы привязать результат к имени, например, 'let result = expr'.
tr: Bu ifadenin sonucu '{0}' türüne sahip ve örtük olarak yoksayılıyor. Bu değeri açıkça atmak için 'ignore' öğesini (ör. 'expr |> ignore') veya sonucu bir ada bağlamak için 'let' öğesini (ör. 'let result = expr') kullanmayı göz önünde bulundurun.
zh_hans: 此表达式的结果具有类型“{0}”且已被隐式忽略。请考虑使用 "ignore" 以显式弃用此值(例如 "expr |> ignore")，或使用 "let" 将结果绑定到名称上(例如 "let result = expr")。
zh_hant: 這個運算式的結果有 '{0}' 類型，會隱含略過。請考慮使用 'ignore' 來明確捨棄這個值，例如 'expr |> ignore'，或使用 'let' 將結果繫結到名稱，例如 'let result = expr'。

# UnitTypeExpectedWithEquality
source: The result of this equality expression has type '{0}' and is implicitly discarded. Consider using 'let' to bind the result to a name, e.g. 'let result = expression'.
cs: Výsledek tohoto výrazu rovnosti má typ {0} a implicitně se zruší. Zvažte vytvoření vazby mezi výsledkem a názvem pomocí klíčového slova let, např. let výsledek = výraz.
de: Das Ergebnis dieses Gleichheitsausdrucks weist den Typ "{0}" auf und wird implizit verworfen. Verwenden Sie ggf. "let", um das Ergebnis an einen Namen zu binden. Beispiel: "let Ergebnis = Ausdruck".
es: El resultado de esta expresión de igualdad, de tipo "{0}", se descarta de forma implícita. Considere la posibilidad de usar "let" para enlazar el resultado a un nombre, por ejemplo "let resultado = expresión".
fr: Le résultat de cette expression d'égalité a le type '{0}' et est implicitement abandonné. Utilisez 'let' pour lier le résultat à un nom, par exemple 'let result = expression'.
it: Il risultato di questa espressione di uguaglianza è di tipo '{0}' e viene rimosso in modo implicito. Provare a usare 'let' per eseguire il binding del risultato a un nome, ad esempio 'let result = espressione'.
ja: この等式の結果は型 '{0}' を持ち、暗黙的に破棄されます。'let' を使用して結果を名前にバインドすることを検討してください。例: 'let result = expression'。
ko: 이 같음 식의 결과는 ‘{0}’ 형식이며 암시적으로 삭제됩니다. 결과를 이름에 바인딩하려면 'let'을 사용하세요(예: 'let result = expression').
pl: Wynik tego wyrażenia równości ma typ „{0}” i jest niejawnie odrzucany. Rozważ użycie słowa kluczowego „let” do powiązania wyniku z nazwą, np. „let wynik = wyrażenie”.
pt_br: O resultado dessa expressão de igualdade contém o tipo '{0}' e é descartado de forma implícita. Considere o uso de 'let' para associar o resultado a um nome, por exemplo, 'let result = expression'.
ru: Результат этого выражения равенства имеет тип "{0}" и неявно отбрасывается. Попробуйте использовать "let", чтобы привязать результат к имени, например: "let result = expression".
tr: Bu eşitlik ifadesinin sonucu '{0}' türüne sahip ve örtük olarak atılır. Sonucu bir ada bağlamak için 'let' kullanmayı düşünün (örneğin, 'let sonuc = deyim').
zh_hans: 此等式表达式的结果为类型“{0}”且被隐式放弃。请考虑使用 "let" 将结果绑定到名称，例如 "let result = expression"。
zh_hant: 這個等號比較運算式的結果類型為 '{0}'，已隱含捨棄。請考慮使用 'let' 將結果繫結至名稱，例如 'let result = expression'。

# UnitTypeExpectedWithPossiblePropertySetter
source: The result of this equality expression has type '{0}' and is implicitly discarded. Consider using 'let' to bind the result to a name, e.g. 'let result = expression'. If you intended to set a value to a property, then use the '<-' operator e.g. '{1}.{2} <- expression'.
cs: Výsledek tohoto výrazu rovnosti má typ {0} a implicitně se zruší. Zvažte vytvoření vazby mezi výsledkem a názvem pomocí klíčového slova let, například let výsledek = výraz. Pokud jste chtěli nastavit hodnotu na vlastnost, použijte operátor <-, například {1}.{2} <- výraz.
de: Das Ergebnis dieses Gleichheitsausdrucks weist den Typ "{0}" auf und wird implizit verworfen. Verwenden Sie ggf. "let", um das Ergebnis an einen Namen zu binden. Beispiel: "let Ergebnis = Ausdruck". Falls Sie einen Wert auf eine Eigenschaft festlegen möchten, verwenden Sie den Operator "<-". Beispiel: "{1}.{2} <- Ausdruck".
es: El resultado de esta expresión de igualdad tiene el tipo "{0}" y se descarta implícitamente. Considere el uso de "let" para enlazar el resultado a un nombre, por ejemplo, "let result = expression". Si pretende establecer un valor a una propiedad, utilice el operador "<-"; por ejemplo, "{1}.{2} <- expression".
fr: Le résultat de cette expression d'égalité a le type '{0}' et est implicitement ignoré. Utilisez 'let' pour lier le résultat à un nom, par ex. 'let result = expression'. Si vous voulez définir une valeur sur une propriété, utilisez l'opérateur '<-', par ex. '{1}.{2} <- expression'.
it: Il risultato di questa espressione di uguaglianza è di tipo '{0}' e viene rimosso in modo implicito. Provare a usare 'let' per eseguire il binding del risultato a un nome, ad esempio 'let result = espressione'. Se si intende impostare un valore su una proprietà, usare l'operatore '<-', ad esempio '{1}.{2} <- espressione'.
ja: この等式の結果の種類は '{0}' で、暗黙的に破棄されます。'let' を使用して結果を名前にバインドすることを検討してください。たとえば、'let result = expression' などとします。値をプロパティに設定する場合には、'<-' 演算子を使用して '{1}.{2} <- expression' などとします。
ko: 이 같음 식의 결과는 '{0}' 형식이며 암시적으로 삭제됩니다. 결과를 이름에 바인딩하려면 'let'을 사용하세요(예: 'let result = expression'). 값을 속성으로 설정하려면 '<-' 연산자를 사용하세요(예: '{1}.{2} <- expression').
pl: Wynik tego wyrażenia równości ma typ „{0}” i jest niejawnie odrzucany. Rozważ użycie słowa kluczowego „let” do powiązania wyniku z nazwą, np. „let wynik = wyrażenie”. Jeśli zamiarem było ustawienie wartości właściwości, użyj operatora „<-”, np. „{1}.{2} <- wyrażenie”.
pt_br: O resultado dessa expressão de igualdade tem o tipo '{0}' e é implicitamente descartado. Use 'let' para associar o resultado a um nome, por exemplo, 'let resultado = expressão'. Se você pretende modificar um valor, use o operador '<-', por exemplo, '{1}.{2} <- expressão'.
ru: Результат этого выражения равенства имеет тип '{0}' и неявно удаляется. Используйте 'let', чтобы привязать результат к имени, например, 'let result = expression'. Если вы хотите установить значение свойства, используйте оператор '<-', например, '{1}.{2} <- expression'.
tr: Bu eşitlik ifadesinin sonucu '{0}' türüne sahip ve örtük olarak atılıyor. Sonucu bir ada bağlamak için 'let' kullanmayı (ör. 'let result = expression') göz önünde bulundurun. Bir özelliğe yönelik bir değer ayarlamaya çalıştıysanız '<-' işlecini (ör. '{1}.{2} <- expression') kullanın.
zh_hans: 此相等表达式的结果具有类型“{0}”并被隐式丢弃。请考虑使用 "let" 将结果绑定到名称，例如 "let result = expression"。如果要将值设置为属性，请使用 "<-" 运算符(例如 "{1}.{2} <- expression")。
zh_hant: 這個等號運算式的結果有 '{0}' 類型，會隱含捨棄。請考慮使用 'let' 將結果繫結到名稱，例如 'let result = expression'。若您想要將值設為屬性，則請使用 '<-' 運算子，例如 '{1}.{2} <- expression'。

# UnitTypeExpectedWithPossibleAssignment
source: The result of this equality expression has type '{0}' and is implicitly discarded. Consider using 'let' to bind the result to a name, e.g. 'let result = expression'. If you intended to mutate a value, then mark the value 'mutable' and use the '<-' operator e.g. '{1} <- expression'.
cs: Výsledek tohoto výrazu rovnosti má typ {0} a implicitně se zruší. Zvažte vytvoření vazby mezi výsledkem a názvem pomocí klíčového slova let, například let výsledek = výraz. Pokud jste chtěli mutovat hodnotu, označte hodnotu jako mutable a použijte operátor <-, například {1} <- výraz.
de: Das Ergebnis dieses Gleichheitsausdrucks weist den Typ "{0}" auf und wird implizit verworfen. Verwenden Sie ggf. "let", um das Ergebnis an einen Namen zu binden. Beispiel: "let Ergebnis = Ausdruck". Falls Sie einen Wert mutieren möchten, markieren Sie ihn als "mutable", und verwenden Sie den Operator "<-" . Beispiel: "{1} <- Ausdruck".
es: El resultado de esta expresión de igualdad tiene el tipo "{0}" y se descarta implícitamente. Considere el uso de "let" para enlazar el resultado a un nombre, por ejemplo, "let result = expression". Si pretende mutar un valor, marque el valor "mutable" y use "<-' operator e.g. '{1} <- expression".
fr: Le résultat de cette expression d'égalité a le type '{0}' et est implicitement ignoré. Utilisez 'let' pour lier le résultat à un nom, par ex. 'let result = expression'. Si vous voulez muter une valeur, marquez la valeur avec 'mutable' et utilisez l'opérateur '<-', par ex. '{1} <- expression'.
it: Il risultato di questa espressione di uguaglianza è di tipo '{0}' e viene rimosso in modo implicito. Provare a usare 'let' per eseguire il binding del risultato a un nome, ad esempio 'let result = espressione'. Se si intende modificare un valore, contrassegnare il valore 'mutable' e usare l'operatore '<-', ad esempio '{1} <- espressione'.
ja: この等式の結果の型は '{0}' で、暗黙的に破棄されます。'let' を使用して結果に名前をバインドすることを検討してください。たとえば、'let result = expression' などとします。値を意図的に変更する場合には、値に 'mutable' というマークを付け、'<-' 演算子を使用して '{1} <- expression' などとします。
ko: 이 같음 식의 결과는 '{0}' 형식이며 암시적으로 삭제됩니다. 결과를 이름에 바인딩하려면 'let'을 사용하세요(예: 'let result = expression'). 값을 변경하려면 값을 'mutable'로 표시하고 '<-' 연산자를 사용하세요(예: '{1} <- expression').
pl: Wynik tego wyrażenia równości ma typ „{0}” i jest niejawnie odrzucany. Rozważ użycie słowa kluczowego „let” do powiązania wyniku z nazwą, np. „let wynik = wyrażenie”. Jeśli zamiarem było zmodyfikowanie wartości, oznacz ją za pomocą deklaratora „mutable” i użyj operatora „<-”, np. „{1} <- wyrażenie”.
pt_br: O resultado dessa expressão de igualdade tem o tipo '{0}' e é implicitamente descartado. Use 'let' para associar o resultado a um nome, por exemplo, 'let resultado = expressão'. Se você pretende modificar um valor, use o operador '<-', por exemplo, '{1} <- expressão'.
ru: Результат этого выражения равенства имеет тип "{0}" и неявно отбрасывается. Используйте "let" для привязки результата к имени, например, "let result = expression". Если вы собираетесь изменять значение, пометьте значение как 'mutable' и используйте оператор '<-', например, '{1} <- expression'.
tr: Bu eşitlik ifadesinin sonucu '{0}' türüne sahip ve örtük olarak atılıyor. Sonucu bir ada bağlamak için 'let' kullanmayı göz önünde bulundurun, ör. 'let result = expression'. Bir değeri değiştirmeye çalıştıysanız değeri 'mutable' olarak işaretleyin ve '<-' işlecini kullanın, ör. '{1} <- expression'.
zh_hans: 此等式表达式的结果具有类型“{0}”并被隐式丢弃。请考虑使用 "let" 将结果绑定到名称，例如 "let result = expression"。如果想要转变某个值，则将此值标记为 "mutable" 并使用 "<-" 运算符(例如 "{1} <- expression")。
zh_hant: 這個等號運算式的結果有 '{0}' 類型，會隱含略過。請考慮使用 'let' 將結果繫結到名稱，例如 'let result = expression'。若您想要變更值，請標示 'mutable' 值並使用 '<-' 運算子，例如 '{1} <- expression'。

# UnitTypeExpectedWithPossibleAssignmentToMutable
source: The result of this equality expression has type '{0}' and is implicitly discarded. Consider using 'let' to bind the result to a name, e.g. 'let result = expression'. If you intended to mutate a value, then use the '<-' operator e.g. '{1} <- expression'.
cs: Výsledek tohoto výrazu rovnosti má typ {0} a implicitně se zruší. Zvažte vytvoření vazby mezi výsledkem a názvem pomocí klíčového slova let, například let výsledek = výraz. Pokud jste chtěli mutovat hodnotu, použijte operátor <-, například {1} <- výraz.
de: Das Ergebnis dieses Gleichheitsausdrucks weist den Typ "{0}" auf und wird implizit verworfen. Verwenden Sie ggf. "let", um das Ergebnis an einen Namen zu binden. Beispiel: "let Ergebnis = Ausdruck". Falls Sie einen Wert mutieren möchten, verwenden Sie den Operator "<-". Beispiel: "{1} <- Ausdruck".
es: El resultado de esta expresión de igualdad tiene el tipo "{0}" y se descarta implícitamente. Considere el uso de "let" para vincular el resultado a un nombre, por ejemplo, "let result = expression". Si pretendía mutar un valor, use el operador "<-"; por ejemplo, "{1} <- expression".
fr: Le résultat de cette expression d'égalité a le type '{0}' et est implicitement ignoré. Utilisez 'let' pour lier le résultat à un nom, par ex. 'let result = expression'. Si vous voulez muter une valeur, utilisez l'opérateur '<-', par ex. '{1} <- expression'.
it: Il risultato di questa espressione di uguaglianza è di tipo '{0}' e viene rimosso in modo implicito. Provare a usare 'let' per eseguire il binding del risultato a un nome, ad esempio 'let result = espressione'. Se si intende modificare un valore, usare l'operatore '<-', ad esempio '{1} <- espressione'.
ja: この等式の結果の型は '{0}' で、暗黙的に破棄されます。'let' を使用して結果を名前にバインドすることを検討してください。たとえば、'let result = expression' などとします。意図的に値を変更する場合、'<-' 演算子を '{1} <- expression' などと使用します。
ko: 이 같음 식의 결과는 '{0}' 형식이며 암시적으로 삭제됩니다. 결과를 이름에 바인딩하려면 'let'을 사용하세요(예: 'let result = expression'). 값을 변경하려면 '<-' 연산자를 사용하세요(예: '{1} <- expression').
pl: Wynik tego wyrażenia równości ma typ „{0}” i jest niejawnie odrzucany. Rozważ użycie słowa kluczowego „let” do powiązania wyniku z nazwą, np. „let wynik = wyrażenie”. Jeśli zamiarem było zmodyfikowanie wartości, użyj operatora „<-”, np. „{1} <- wyrażenie”.
pt_br: O resultado dessa expressão de igualdade tem o tipo '{0}' e é implicitamente descartado. Use 'let' para associar o resultado a um nome, por exemplo, 'let resultado = expressão'. Se você pretende modificar um valor, use o operador '<-', por exemplo, '{1} <- expressão'.
ru: Результат этого выражения равенства имеет тип "{0}" и неявно удаляется. Рекомендуем использовать "let", чтобы привязать результат к имени, например, "let result = expression" . Если вы хотите изменять значение, используйте оператор '<-', например, '{1} <- expression'.
tr: Bu eşitlik ifadesinin sonucu '{0}' türüne sahip ve örtük olarak atılıyor. Sonucu bir ada bağlamak için 'let' kullanmayı (ör. 'let result = expression') göz önünde bulundurun. Bir değeri değiştirmeye çalıştıysanız '<-' işlecini (ör. '{1} <- expression') kullanın.
zh_hans: 此相等表达式的结果具有类型“{0}”并被隐式丢弃。请考虑使用 "let" 将结果绑定到名称，例如 "let result = expression"。如果要对值进行突变, 请使用 "<-" 运算符(例如 "{1} <- expression")。
zh_hant: 這個等號運算式的結果有 '{0}' 類型，會隱含捨棄。請考慮使用 'let' 將結果繫結到名稱，例如 'let result = expression'。若您想要變更值，則請使用 '<-' 運算子，例如 '{1} <- expression'。
