Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# NONTERM.fileModuleSpec
source: in module or namespace signature
cs: v signatuře oboru názvů nebo modulu
de: in Modul- oder Namespacesignatur
es: en signatura de módulo o espacio de nombres
fr: dans la signature du module ou de l'espace de noms
it: in una firma di modulo o spazio dei nomi
ja: モジュールまたは名前空間のシグネチャ内
ko: 모듈 또는 네임스페이스 시그니처
pl: w sygnaturze modułu lub przestrzeni nazw
pt_br: em assinatura de módulo ou namespace
ru: в сигнатуре модуля или пространства имен
tr: modül veya ad alanı imzasında
zh_hans: 在模块或命名空间签名中
zh_hant: 在模組或命名空間簽章中

# NONTERM.patternClauses
source: in pattern matching
cs: v porovnávání vzorů
de: in Mustervergleich
es: en detección de patrones
fr: dans les critères spéciaux
it: in criteri di ricerca
ja: パターン マッチ内
ko: 패턴 일치
pl: w dopasowaniu wzorca
pt_br: em correspondência padrão
ru: в сопоставлении шаблона
tr: desen eşleştirmede
zh_hans: 在模式匹配中
zh_hant: 在模式比對中

# NONTERM.beginEndExpr
source: in begin/end expression
cs: ve výrazu begin/end
de: in begin/end-Ausdruck
es: en expresión de principio o final
fr: dans l'expression begin/end
it: in un'espressione iniziale/finale
ja: begin/end 式内
ko: begin/end 식
pl: w wyrażeniu begin/end
pt_br: em expressão de início/fim
ru: в выражении begin/end
tr: begin/end ifadesinde
zh_hans: 在开始/结束表达式中
zh_hant: 在 begin/end 運算式中

# NONTERM.recdExpr
source: in record expression
cs: ve výrazu záznamu
de: in Datensatzausdruck
es: en expresión de registro
fr: dans l'expression d'enregistrement
it: in un'espressione di record
ja: レコード式内
ko: 레코드 식
pl: w wyrażeniu rekordu
pt_br: em expressão de registro
ru: в выражении записи
tr: kayıt ifadesinde
zh_hans: 在记录表达式中
zh_hant: 在記錄運算式中

# NONTERM.tyconDefn
source: in type definition
cs: v definici typu
de: in Typdefinition
es: en definición de tipo
fr: dans la définition de type
it: in una definizione di tipo
ja: 型定義内
ko: 형식 정의
pl: w definicji typu
pt_br: em definição de tipo
ru: в определении типа
tr: tür tanımında
zh_hans: 在类型定义中
zh_hant: 在類型定義中

# NONTERM.exconCore
source: in exception definition
cs: v definici výjimky
de: in Ausnahmedefinition
es: en definición de excepción
fr: dans la définition de l'exception
it: in una definizione di eccezione
ja: 例外の定義内
ko: 예외 정의
pl: w definicji wyjątku
pt_br: em definição de exceção
ru: в определении исключения
tr: özel durum tanımında
zh_hans: 在异常定义中
zh_hant: 在例外狀況定義中

# NONTERM.typeNameInfo
source: in type name
cs: v názvu typu
de: in Typname
es: en nombre de tipo
fr: dans le nom de type
it: in un nome di tipo
ja: 型名内
ko: 형식 이름
pl: w nazwie typu
pt_br: em nome de tipo
ru: в имени типа
tr: tür adında
zh_hans: 在类型名称中
zh_hant: 在類型名稱中

# NONTERM.attributeList
source: in attribute list
cs: v seznamu atributů
de: in Attributliste
es: en lista de atributos
fr: dans la liste d'attributs
it: in un elenco di attributi
ja: 属性リスト内
ko: 특성 목록
pl: na liście atrybutów
pt_br: em lista de atributo
ru: в списке атрибутов
tr: öznitelik listesinde
zh_hans: 在特性列表中
zh_hant: 在屬性清單中

# NONTERM.quoteExpr
source: in quotation literal
cs: v literálu citace
es: en literal de expresión de código delimitada
fr: dans le littéral de quotation
it: in valori letterali di quotation
ja: 引用リテラル内
ko: 인용구 리터럴
pl: w literale cytatu
pt_br: em literal de cotação
ru: в литерале цитирования
tr: alıntı sabit değerinde
zh_hans: 在引用文本中
zh_hant: 在引號常值中

# NONTERM.typeConstraint
source: in type constraint
cs: v omezení typu
de: in Typeinschränkung
es: en restricción de tipo
fr: dans la contrainte de type
it: in un vincolo di tipo
ja: 型制約内
ko: 형식 제약 조건
pl: w ograniczeniu typu
pt_br: em restrição de tipo
ru: в ограничении типа
tr: tür kısıtlamasında
zh_hans: 在类型约束中
zh_hant: 在類型條件約束中

# NONTERM.Category.ImplementationFile
source: in implementation file
cs: v souboru implementace
de: in Implementierungsdatei
es: en archivo de implementación
fr: dans le fichier d'implémentation
it: in un file di implementazione
ja: 実装ファイル内
ko: 구현 파일
pl: w pliku implementacji
pt_br: em arquivo de implementação
ru: в файле реализации
tr: uygulama dosyasında
zh_hans: 在实现文件中
zh_hant: 在實作檔中

# NONTERM.Category.Definition
source: in definition
cs: v definici
es: en definición
fr: dans la définition
it: in una definizione
ja: 定義内
ko: 정의
pl: w definicji
pt_br: em definição
ru: в определении
tr: tanımda
zh_hans: 在定义中
zh_hant: 在定義中

# NONTERM.Category.SignatureFile
source: in signature file
cs: v souboru signatury
de: in Signaturdatei
es: en archivo de signatura
fr: dans le fichier de signature
it: in un file di firma
ja: シグネチャ ファイル内
ko: 시그니처 파일
pl: w pliku sygnatury
pt_br: em arquivo de assinatura
ru: в файле сигнатуры
tr: imza dosyasında
zh_hans: 在签名文件中
zh_hant: 在簽章檔中

# NONTERM.Category.Pattern
source: in pattern
cs: ve vzoru
de: in Muster
es: en patrón
fr: dans le modèle
it: in un criterio
ja: パターン内
ko: 패턴
pl: we wzorcu
pt_br: em padrão
ru: в шаблоне
tr: desende
zh_hans: 在模式中
zh_hant: 在模式中

# NONTERM.Category.Expr
source: in expression
cs: ve výrazu
de: in Ausdruck
es: en expresión
fr: dans l'expression
it: in un'espressione
ja: 式内
ko: 식
pl: w wyrażeniu
pt_br: em expressão
ru: в выражении
tr: ifadede
zh_hans: 在表达式中
zh_hant: 在運算式中

# NONTERM.Category.Type
source: in type
cs: v typu
de: in Typ
es: en tipo
fr: dans le type
it: in un tipo
ja: 型内
ko: 형식
pl: w typie
pt_br: em tipo
ru: в типе
tr: türde
zh_hans: 在类型中
zh_hant: 在類型中

# NONTERM.typeArgsActual
source: in type arguments
cs: v argumentech typu
de: in Typargumenten
es: en argumentos de tipo
fr: dans les arguments de type
it: in argomenti tipo
ja: 型引数内
ko: 형식 인수
pl: w argumentach typu
pt_br: em argumentos de tipo
ru: в аргументах типа
tr: tür bağımsız değişkenlerinde
zh_hans: 在类型参数中
zh_hant: 在型別引數中

# FixKeyword
source: keyword
cs: klíčové slovo
de: Schlüsselwort
es: palabra clave
fr: mot clé
it: parola chiave
ja: キーワード
ko: 키워드
pl: słowo kluczowe
pt_br: Palavra-chave
ru: Ключевое слово
tr: anahtar sözcük
zh_hans: 关键字
zh_hant: 關鍵字

# FixSymbol
source: symbol
es: símbolo
fr: symbole
it: simbolo
ja: シンボル
ko: 기호
pt_br: símbolo
ru: символ
tr: simge
zh_hans: 符号
zh_hant: 符號

# FixReplace
source: (due to indentation-aware syntax)
cs: (kvůli syntaxi, která reflektuje odsazení)
de: (aufgrund der einzugsabhängigen Syntax)
es: (debido a sintaxis que tiene en cuenta la sangría)
fr: (en raison de la syntaxe de mise en retrait)
it: (a causa di sintassi dipendente dal rientro)
ja: (インデント対応構文のため)
ko: (들여쓰기 인식 구문 때문)
pl: (z powodu składni uwzględniającej wcięcia)
pt_br: (devido à sintaxe com reconhecimento de recuo)
ru: (из-за синтаксиса с учетом отступов)
tr: (girinti tanıyan sözdizimine bağlı olarak)
zh_hans: (因为可识别缩进的语法)
zh_hant: (因縮排感知的語法所致)

# TokenName1
source: . Expected {0} or other token.
cs: . Očekával se token {0} nebo nějaký jiný.
de: . "{0}" oder ein anderes Token wurde erwartet.
es: . Se esperaba {0} u otro token.
fr: . {0} ou autre jeton attendu.
it: . Previsto {0} o altro token.
ja: 。{0} または他のトークンを指定してください。
ko: {0} 또는 기타 토큰이 필요합니다.
pl: . Oczekiwany jest element {0} lub inny token.
pt_br: . {0} ou outro token são esperados.
ru: . Требуется {0} или другая лексема.
tr: . {0} veya başka bir belirteç bekleniyordu.
zh_hans: 。应为 {0} 或其他标记。
zh_hant: 。必須是{0} 或其他語彙基元。

# TokenName1TokenName2
source: . Expected {0}, {1} or other token.
cs: . Očekával se token {0}, {1} nebo nějaký jiný.
de: . "{0}", "{1}" oder ein anderes Token wurde erwartet.
es: . Se esperaba {0}, {1} un otro token.
fr: . {0}, {1} ou autre jeton attendu.
it: . Previsto {0}, {1} o altro token.
ja: 。{0}、{1}、または他のトークンを指定してください。
ko: {0}, {1} 또는 기타 토큰이 필요합니다.
pl: . Oczekiwany jest element {0}, {1} lub inny token.
pt_br: . {0}, {1} ou outro token são esperados.
ru: . Требуется {0}, {1} или другая лексема.
tr: . {0}, {1} veya başka bir belirteç bekleniyordu.
zh_hans: 。应为 {0}、{1} 或其他标记。
zh_hant: 。必須是 {0}、{1} 或其他語彙基元。

# TokenName1TokenName2TokenName3
source: . Expected {0}, {1}, {2} or other token.
cs: . Očekával se token {0}, {1}, {2} nebo nějaký jiný.
de: . "{0}", "{1}", "{2}" oder ein anderes Token wurde erwartet.
es: . Se esperaba {0}, {1}, {2} u otro token.
fr: . {0}, {1}, {2} ou autre jeton attendu.
it: . Previsto {0}, {1}, {2} o altro token.
ja: 。{0}、{1}、{2}、または他のトークンを指定してください。
ko: {0}, {1}, {2} 또는 기타 토큰이 필요합니다.
pl: . Oczekiwany jest element {0}, {1}, {2} lub inny token.
pt_br: . {0}, {1}, {2} ou outro token são esperados.
ru: . Требуется {0}, {1}, {2} или другая лексема.
tr: . {0}, {1}, {2} veya başka bir belirteç bekleniyordu.
zh_hans: 。应为 {0}、{1}、{2} 或其他标记。
zh_hant: 。必須是{0}、{1}、{2} 或其他語彙基元。

# RuntimeCoercionSourceSealed1
source: The type '{0}' cannot be used as the source of a type test or runtime coercion
cs: Typ {0} se jako zdroj testu typu nebo konverze za běhu použít nedá.
de: Der Typ "{0}" kann nicht als Quelle eines Typtests oder einer Laufzeitkoersion verwendet werden.
es: El tipo '{0}' no se puede usar como origen de una prueba de tipo o una conversión en tiempo de ejecución.
fr: Impossible d'utiliser le type '{0}' en tant que source d'un test de type ou d'un forçage de type au moment de l'exécution
it: Non è possibile usare il tipo '{0}' come origine di un test del tipo o di una coercizione di runtime
ja: 型 '{0}' は型テストまたはランタイム型変換のソースとして使用できません
ko: '{0}' 형식은 형식 테스트 또는 런타임 강제 변환의 소스로 사용할 수 없습니다.
pl: Typ „{0}” nie może być używany jako źródło testu typu lub koercji środowiska uruchomieniowego
pt_br: O tipo '{0}' não pode ser usado como a fonte de um teste de tipo ou coerção de tempo de execução
ru: Тип "{0}" не может быть использован, как источник типового теста или преобразование во время выполнения
tr: '{0}' türü bir tür testinin veya çalışma zamanı zorlamasının kaynağı olarak kullanılamaz
zh_hans: 类型“{0}”不能用作类型测试或运行时强制的源
zh_hant: 不能使用類型 '{0}' 做為類型測試或執行階段強制型轉的來源

# RuntimeCoercionSourceSealed2
source: The type '{0}' does not have any proper subtypes and cannot be used as the source of a type test or runtime coercion.
cs: Typ {0} nemá žádné správné podtypy a nedá se použít jako zdroj testu typu nebo konverze za běhu.
de: Der Typ "{0}" besitzt keine geeigneten Untertypen und kann nicht als Quelle eines Typtests oder einer Laufzeitkoersion verwendet werden.
es: El tipo '{0}' no tiene subtipos propios y no se puede usar como origen de una prueba de tipo o una conversión en tiempo de ejecución.
fr: Le type '{0}' n'a pas de sous-types appropriés et ne peut pas être utilisé en tant que source d'un test de type ou d'un forçage de type au moment de l'exécution.
it: Il tipo '{0}' non dispone di alcun sottotipo appropriato e non può essere utilizzato come origine di un test del tipo o di coercizione di runtime.
ja: 型 '{0}' には適切なサブタイプがないため、型テストまたはランタイム型変換のソースとして使用できません。
ko: '{0}' 형식에 적절한 하위 형식이 없으며 해당 형식을 형식 테스트 또는 런타임 강제 변환의 소스로 사용할 수 없습니다.
pl: Typ „{0}” nie ma żadnych właściwych podtypów i nie może być używany jako źródło testu typu lub koercji środowiska uruchomieniowego.
pt_br: O tipo '{0}' não tem nenhum subtipo apropriado e não pode ser usado como a fonte de um teste de tipo ou coerção em tempo de execução.
ru: Тип "{0}" не имеет подходящих подтипов и не может использоваться как источник проверки или приведения типов во время выполнения.
tr: '{0}' türünün herhangi bir uygun alt türü yok ve bir tür testinin veya çalışma zamanı zorlamasının kaynağı olarak kullanılamaz.
zh_hans: 类型“{0}”不具有任何适当的子类型，且不能用作类型测试或运行时强制的源。
zh_hant: 類型 '{0}' 沒有任何正確的子類型，不能做為類型測試或執行階段強制型轉的來源。

# CoercionTargetSealed
source: The type '{0}' does not have any proper subtypes and need not be used as the target of a static coercion
cs: Typ {0} nemá žádné správné podtypy a není potřeba ho používat jako cíl statické konverze.
de: Der Typ "{0}" besitzt keine geeigneten Untertypen und darf nicht als Ziel einer statischen Koersion verwendet werden.
es: El tipo '{0}' no tiene los subtipos adecuados y no debe usarse como destino de una conversión estática.
fr: Le type '{0}' n'a pas de sous-types appropriés et n'a pas à être utilisé en tant que cible d'un forçage de type statique
it: Il tipo '{0}' non dispone di alcun sottotipo appropriato e non deve essere utilizzato come destinazione di una coercizione statica
ja: 型 '{0}' には適切なサブタイプが含まれないため、この型は必ずしも静的型変換のターゲットとして使用されません
ko: '{0}' 형식에 적절한 하위 형식이 없으며 해당 형식을 정적 강제 변환의 대상으로 사용할 필요가 없습니다.
pl: Typ „{0}” nie zawiera żadnych poprawnych podtypów i nie może być używany jako element docelowy przekształcenia statycznego
pt_br: O tipo '{0}' não tem quaisquer subtipos adequados e não precisa ser usado como o destino de uma coerção estática
ru: Тип "{0}" не имеет каких-либо корректных подтипов и не должен использоваться в качестве цели статического преобразования
tr: '{0}' türünün herhangi bir uygun alt türü yok ve statik zorlama hedefi olarak kullanılması gerekmiyor
zh_hans: 类型“{0}”不具有任何适当的子类型，且无需用作静态强制的目标
zh_hant: 類型 '{0}' 沒有任何正確的子類型，不必做為靜態強制型轉的目標使用

# UpcastUnnecessary
source: This upcast is unnecessary - the types are identical
cs: Toto přetypování směrem nahoru není nutné: oba typy jsou identické.
de: Diese Typumwandlung nach oben (Upcast) ist nicht notwendig, da die Typen identisch sind.
es: Esta conversión hacia arriba es innecesaria, los tipos son idénticos.
fr: Ce cast d'un type dérivé en l'une de ses classes de base est inutile - les types sont identiques
it: Upcast non necessario: i tipi sono identici
ja: この upcast は不要です。型は同一です。
ko: 이 업캐스트는 불필요합니다. 형식이 동일합니다.
pl: To przypisanie elementu nadrzędnego jest niepotrzebne — typy są identyczne
pt_br: Este upcast é desnecessário - os tipos são idênticos
ru: Нет необходимости в данном повышении - типы идентичны
tr: Bu üst türe çevirme işlemi gereksiz, bu türler özdeş
zh_hans: 不需要此向上转换 - 类型都是相同的
zh_hant: 這個向上轉型是不必要的 - 類型一樣

# TypeTestUnnecessary
source: This type test or downcast will always hold
cs: Tento test typu nebo přetypování směrem dolů se vždycky uloží.
de: Dieser Typtest oder diese Typumwandlung nach unten (Downcast) ist immer erfolgreich.
es: Esta prueba de tipo o conversión hacia abajo siempre se llevará a cabo.
fr: Ce test de type ou ce cast d'une classe de base en une classe dérivée contiendra toujours
it: Questo downcast o test di tipo sarà sempre sospeso
ja: この型テストまたはダウンキャストは常に維持されます
ko: 이 형식 테스트 또는 다운캐스트는 항상 보류됩니다.
pl: Ten test typu lub to przypisanie elementu podrzędnego będą zawsze spełnione
pt_br: Este tipo de teste ou downcast sempre será mantido
ru: Данная проверка типа или понижение будет всегда сохраняться
tr: Bu tür testi veya alt türe çevirme işlemi her zaman tutar
zh_hans: 将始终保持此类型测试或向下转换
zh_hant: 這個類型測試或向下轉型永遠有效

# OverrideDoesntOverride1
source: The member '{0}' does not have the correct type to override any given virtual method
cs: Člen {0} není správného typu, aby mohl přepsat libovolné předané virtuální metody.
de: Der Member "{0}" weist nicht den richtigen Typ auf, um eine beliebige virtuelle Methode zu überschreiben.
es: El miembro '{0}' no tiene el tipo correcto para invalidar cualquier método virtual dado.
fr: Le membre '{0}' n'a pas le type approprié pour substituer une méthode virtuelle donnée
it: Il membro '{0}' non dispone del tipo corretto per eseguire l'override di eventuali metodi virtuali specificati
ja: メンバー '{0}' には、指定した仮想メソッドをオーバーライドする正しい型がありません
ko: '{0}' 멤버에 임의의 지정된 가상 메서드를 재정의하기 위한 올바른 형식이 없습니다.
pl: Element członkowski „{0}” nie ma poprawnego typu do przesłonięcia żadnej podanej metody wirtualnej
pt_br: O membro '{0}' não tem um tipo correto para substituir qualquer método virtual dado
ru: Элемент "{0}" не имеет корректного типа для переопределения какого-либо данного виртуального метода
tr: '{0}' üyesi, verilen herhangi bir metodu geçersiz kılmak için doğru türe sahip değil
zh_hans: 成员“{0}”不具有用于重写任何给定虚方法的正确类型
zh_hant: 成員 '{0}' 沒有正確的類型可覆寫任何指定的虛擬方法

# OverrideDoesntOverride2
source: The member '{0}' does not have the correct type to override the corresponding abstract method.
cs: Člen {0} není správného typu, aby mohl přepsat odpovídající abstraktní metodu.
de: Der Member "{0}" weist nicht den richtigen Typ auf, um die entsprechende abstrakte Methode zu überschreiben.
es: El miembro '{0}' no tiene el tipo correcto para invalidar el método abstracto correspondiente.
fr: Le membre '{0}' n'a pas le type approprié pour substituer la méthode abstraite correspondante.
it: Il membro '{0}' non dispone del tipo corretto per eseguire l'override del metodo astratto corrispondente.
ja: メンバー '{0}' には、対応する抽象メソッドをオーバーライドする正しい型がありません
ko: '{0}' 멤버에 해당하는 추상 메서드를 재정의하기 위한 올바른 형식이 없습니다.
pl: Element członkowski „{0}” nie ma poprawnego typu do przesłonięcia odpowiedniej metody abstrakcyjnej.
pt_br: O membro '{0}' não tem o tipo correto para substituir o método abstrato correspondente.
ru: Элемент "{0}" не имеет корректного типа для переопределения какого-либо данного абстрактного метода
tr: '{0}' üyesi, ilgili soyut metodu geçersiz kılmak için doğru türe sahip değil.
zh_hans: 成员“{0}”不具有用于重写相应的抽象方法的正确类型。
zh_hant: 成員 '{0}' 沒有正確的類型可覆寫對應的抽象方法。

# OverrideDoesntOverride3
source: The required signature is '{0}'.
cs: Požadovaná signatura je {0}.
de: Die erforderliche Signatur lautet "{0}".
es: La signatura necesaria es '{0}'.
fr: La signature requise est '{0}'.
it: La firma necessaria è '{0}'.
ja: 必要なシグネチャは '{0}' です。
ko: 필요한 시그니처는 '{0}'입니다.
pl: Wymagana sygnatura: „{0}”.
pt_br: A assinatura requerida é '{0}'.
ru: Необходимая сигнатура: {0}.
tr: Gereken imza: '{0}'.
zh_hans: 所需签名为“{0}”。
zh_hant: 需要的簽章是 '{0}'。

# OverrideDoesntOverride4
source: The member '{0}' is specialized with 'unit' but 'unit' can't be used as return type of an abstract method parameterized on return type.
cs: Člen {0} je specializovaný s typem unit, ale typ unit není možné použít jako návratový typ abstraktní metody parametrizované u návratového typu.
de: Der Member "{0}" ist mit "unit" spezialisiert, "unit" kann aber nicht als Rückgabetyp einer abstrakten Methode verwendet werden, die für den Rückgabetyp parametrisiert wird.
es: El miembro '{0}' está especializado con 'unit', pero 'unit' no se puede usar como tipo de valor devuelto de un método abstracto parametrizado en el tipo de valor devuelto.
fr: Le membre '{0}' est spécialisé avec 'unit' mais 'unit' ne peut pas être utilisé en tant que type de retour d'une méthode abstraite paramétrable sur le type de retour.
it: Il membro '{0}' è specializzato con 'unit' ma non è possibile usare 'unit' come tipo restituito di un metodo astratto con parametri basati sul tipo restituito.
ja: メンバー '{0}' は 'unit' で特定されますが、'unit' は、戻り値の型に関してパラメーター化された抽象メソッドの戻り値の型としては使用できません。
ko: '{0}' 멤버가 'unit'으로 특수화되었지만 'unit'은 반환 형식에 대한 매개 변수가 있는 추상 메서드의 반환 형식으로 사용될 수 없습니다.
pl: Element członkowski „{0}” jest wyspecjalizowany przy użyciu parametru „unit”, ale parametru „unit” nie można używać jako zwracanego typu metody abstrakcyjnej z parametrami zwracanego typu.
pt_br: O membro '{0}' é especializado com 'unit', mas 'unit' não pode ser usado como um tipo de retorno de um método abstrato parametrizado no tipo de retorno.
ru: Член "{0}" специализирован с помощью "unit", но "unit" нельзя использовать в качестве типа возвращаемого значения абстрактного метода, параметризованного по типу возвращаемого значения.
tr: '{0}' üyesi 'unit' ile özelleştirilmiş ancak 'unit', dönüş türünde parametreleştirilen bir özet metodunun dönüş türü olarak kullanılamaz.
zh_hans: 成员“{0}”已通过 "unit" 特例化，但 "unit" 不能用作针对返回类型参数化的抽象方法的返回类型。
zh_hant: 成員 '{0}' 以 'unit' 特製化，但無法用 'unit' 當作在傳回類型上參數化之抽象方法的傳回類型。

# UnionCaseWrongArguments
source: This constructor is applied to {0} argument(s) but expects {1}
cs: Počet argumentů, pro které se používá tento konstruktor, je {0}, ale očekávaný počet je {1}.
de: Dieser Konstruktor wird auf {0} Argument(e) angewendet, erwartet aber {1}.
es: Este constructor se ha aplicado a {0} argumentos, pero espera {1}.
fr: Ce constructeur est appliqué à {0} argument(s) mais en attend {1}
it: Questo costruttore è applicato a {0} argomento/i, tuttavia il numero di argomenti previsto è pari a {1}
ja: このコンストラクターには {0} 個の引数が適用されていますが、必要なのは {1} 個です
ko: 이 생성자는 {0}개의 인수에 적용되었지만 {1}개를 필요로 합니다.
pl: Ten konstruktor został zastosowany do następującej liczby argumentów: {0}. Oczekiwana liczba argumentów: {1}
pt_br: Este construtor é aplicado aos argumentos {0}, mas espera {1}
ru: Данный конструктор применен к {0} аргументам; требуется {1}
tr: Bu oluşturucu {0} bağımsız değişkene uygulandı ancak {1} bekliyor
zh_hans: 此构造函数应用于 {0} 个参数，但应为 {1} 个参数
zh_hant: 這個建構函式是套用到 {0} 個引數，但必須是 {1} 個

# UnionPatternsBindDifferentNames
source: The two sides of this 'or' pattern bind different sets of variables
cs: Obě strany tohoto vzoru or vážou jinou sadu proměnných.
de: Die beiden Seiten dieses or-Musters binden unterschiedliche Variablensätze.
es: Las dos partes de este patrón 'or' enlazan conjuntos de variables diferentes.
fr: Les deux faces de ce modèle 'or' lient des ensembles de variables différents
it: I due lati di questo criterio 'or' consentono di eseguire il binding di set di variabili diversi
ja: この 'or' パターンの両側は、異なる変数セットをバインドしています
ko: 이 'or' 패턴의 양쪽이 서로 다른 변수 집합을 바인딩합니다.
pl: Dwie strony tego wzorca „or” tworzą powiązanie różnych zestawów zmiennych
pt_br: Os dois lados deste padrão 'or' vinculam diferentes conjuntos de variáveis
ru: Две стороны данного шаблона "or" связывают различные наборы переменных
tr: Bu 'or' deseninin her iki tarafı farklı değişken kümelerini bağlıyor
zh_hans: 此“or”模式的两侧绑定了不同的变量组
zh_hant: 這個 'or' 模式的兩邊各繫結不同的變數集合

# ValueNotContained
source: Module '{0}' contains\n {1} \nbut its signature specifies\n {2} \n{3}.
cs: Modul {0} obsahuje hodnotu\n {1}, \nale jeho signatura definuje hodnotu\n {2}. \n{3}.
de: Das Modul "{0}" enthält\n {1} \nDie Signatur gibt aber Folgendes an:\n {2} \n{3}.
es: El módulo '{0}' contiene\n {1} \npero su signatura especifica \n {2} \n{3}.
fr: Le module '{0}' contient\n {1} \nmais sa signature spécifie\n {2} \n{3}.
it: Il modulo '{0}' contiene\n {1} \ntuttavia la relativa firma specifica\n {2} \n{3}.
ja: モジュール '{0}' には\n {1} \nが含まれますが、シグネチャには\n {2} \nを指定しています。{3}。
ko: {0}' 모듈에\n {1}이(가) 포함되어 있지만 \n해당 시그니처는\n {2}을(를) 지정합니다. \n{3}.
pl: Moduł „{0}” zawiera element\n {1} \nW podpisie modułu określono element\n {2} \n{3}.
pt_br: O módulo '{0}' contém\n {1} \n, mas sua assinatura especifica\n {2} \n{3}.
ru: Модуль "{0}" содержит\n {1} \nоднако его сигнатура задает\n {2} \n{3}.
tr: {0}' modülü\n {1} \niçeriyor ancak imzasında\n {2} \n{3} belirtiliyor.
zh_hans: 模块“{0}”包含\n {1} \n而其签名指定\n {2} \n{3}。
zh_hant: 模組 '{0}' 包含\n {1} \n但它的簽章卻指定\n {2} \n{3}。

# RequiredButNotSpecified
source: Module '{0}' requires a {1} '{2}'
cs: Modul {0} vyžaduje {1} {2}.
de: Das Modul "{0}" erfordert eine(n) {1} "{2}".
es: El módulo '{0}' requiere un {1} '{2}'.
fr: Le module '{0}' requiert un {1} '{2}'
it: Il modulo '{0}' richiede {1} '{2}'
ja: モジュール '{0}' には {1} '{2}' が必要です
ko: {0}' 모듈에는 {1} '{2}'이(가) 필요합니다.
pl: Moduł „{0}” wymaga elementu {1} „{2}”
pt_br: O módulo '{0}' requer um {1} '{2}'
ru: Для модуля "{0}" требуется {1} "{2}"
tr: {0}' modülü için {1} '{2}' gerekiyor
zh_hans: 模块“{0}”需要 {1}“{2}”
zh_hant: 模組 '{0}' 需要 {1} '{2}'
