Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# IndeterminateRuntimeCoercion
source: This runtime coercion or type test from type\n {0} \n to \n {1} \ninvolves an indeterminate type based on information prior to this program point. Runtime type tests are not allowed on some types. Further type annotations are needed.
cs: Tento test typu nebo konverze za běhu z typu\n {0} \n na \n {1} \nzahrnuje neurčitý typ založený na informacích před tímto místem v programu. Testy typu za běhu nejsou u některých typů povolené. Je potřeba, abyste k typu doplnili další poznámky.
de: Diese Laufzeitkoersion oder dieser Typtest vom Typ\n {0} \n in \n {1} \numfasst einen unbestimmten Typ, der auf Informationen vor diesem Programmpunkt basiert. Laufzeittyptests sind für einige Typen nicht zulässig. Weitere Typanmerkungen sind erforderlich.
es: Esta conversión o prueba de tipo en tiempo de ejecución del tipo\n {0} \n a \n {1} \nimplica un tipo indeterminado basado en información anterior a este punto del programa. En algunos tipos, no se permiten pruebas de tipo en tiempo de ejecución. Se necesitan más anotaciones de tipo.
fr: Ce forçage de type ou test de type au moment de l'exécution du type\n {0} \n en \n {1} \nimplique un type indéterminé basé sur des informations situées avant ce point du programme. Les tests de types au moment de l'exécution ne sont pas autorisés sur certains types. Des annotations de type supplémentaires sont nécessaires.
it: Questo test di tipo o coercizione di runtime del tipo \n {0} \n in \n {1} \nprevede un tipo non determinato basato su informazioni che si trovano prima di questo punto del programma. I test dei tipi di runtime non sono consentiti per alcuni tipi. Sono necessarie ulteriori annotazioni di tipo.
ja: この型\n {0} \nから型\n {1} \nへのランタイム型変換またはランタイム型テストには、このプログラムの場所の前方にある情報に基づく不確定の型が使用されています。ランタイム型テストが許可されていない型もあります。型の注釈を増やしてください。
ko: 이 런타임 강제 변환 또는 형식 테스트(소스:\n {0} 형식, \n대상: \n {1} 형식)를 \n수행하려면 이 프로그램 지점 전의 정보를 기반으로 하는 확인할 수 없는 형식이 필요합니다. 일부 형식의 경우 런타임 형식 테스트가 허용되지 않습니다. 형식 주석이 더 필요합니다.
pl: Ta koercja środowiska uruchomieniowego lub ten test typu z typu\n {0} \n w typ \n {1} \nobejmuje nieokreślony typ na podstawie informacji przed tym punktem programu. Testy typów środowiska uruchomieniowego nie są dozwolone w przypadku niektórych typów. Wymagane są dodatkowe adnotacje typów.
pt_br: Este teste de tipo ou coerção em tempo de execução do tipo\n {0} \n para \n {1} \nenvolve um tipo indeterminado com base na informação anterior a este ponto do programa. Testes de tipos em tempo de execução não são permitidos em alguns tipos. São necessárias novas anotações de tipo.
ru: Данное приведение или проверка типа во время выполнения от типа\n {0} \n к \n {1} \nвключает неопределенный тип, основанный на информации до данной точки программы. Проверки типов во время выполнения не разрешены для некоторых типов. Необходимы дополнительные примечания типа.
tr: Tür\n {0} \n ile \n {1} \narasındaki bu çalışma zamanı zorlaması veya tür testi, bu program noktasından önceki bilgilere dayalı olarak belirsiz bir tür içeriyor. Çalışma zamanı tür testlerine bazı türlerde izin verilmez. Yeni tür ek açıklamaları gereklidir.
zh_hans: 这个从类型\n {0} \n 到 \n {1} 的运行时强制或\n类型测试涉及一个基于此程序点之前的信息的不确定类型。不允许对某些类型执行运行时类型测试。需要更多的类型批注。
zh_hant: 根據這個程式點之前的資訊，這個從類型\n {0} \n 到 \n {1} \n的執行階段強制型轉或類型測試涉及不定的類型。不允許在某些類型上使用執行階段類型測試。需要進一步的類型註釋。

# IndeterminateStaticCoercion
source: The static coercion from type\n {0} \nto \n {1} \n involves an indeterminate type based on information prior to this program point. Static coercions are not allowed on some types. Further type annotations are needed.
cs: Statická konverze z typu\n {0} \nna typ \n {1} \n zahrnuje neurčitý typ založený na informacích před tímto místem v programu. Statické konverze nejsou u některých typů povolené. Je potřeba, abyste k typu doplnili další poznámky.
de: Die statische Koersion vom Typ\n {0} \nin \n {1} \n umfasst einen unbestimmten Typ, der auf Informationen vor diesem Programmpunkt basiert. Statische Koersionen sind für einige Typen nicht zulässig. Weitere Typanmerkungen sind erforderlich.
es: La conversión estática del tipo\n {0} \na \n {1} \n implica un tipo indeterminado basado en información anterior a este punto del programa. En algunos tipos, no se permiten conversiones estáticas. Se necesitan más anotaciones de tipo.
fr: Le forçage de type statique du type\n {0} \nen \n {1} \n implique un type indéterminé basé sur des informations situées avant ce point du programme. Les forçages de types statiques ne sont pas autorisés sur certains types. Des annotations de type supplémentaires sont nécessaires.
it: Questa coercizione statica del tipo\n {0} \nin \n {1} \n prevede un tipo non determinato basato su informazioni che si trovano prima di questo punto del programma. Le coercizioni statiche non sono consentite per alcuni tipi. Sono necessarie ulteriori annotazioni di tipo.
ja: 型\n {0} \nから型\n {1} \nへの静的型変換には、このプログラムの場所の前方にある情報に基づく不確定の型が使用されています。静的型変換が許可されていない型もあります。型の注釈を増やしてください。
ko: 정적 강제 변환(소스:\n {0} 형식, \n대상: \n {1} 형식)을 \n수행하려면 이 프로그램 지점 전의 정보를 기반으로 하는 확인할 수 없는 형식이 필요합니다. 일부 형식의 경우 정적 강제 변환이 허용되지 않습니다. 형식 주석이 더 필요합니다.
pl: Koercja statyczna z typu\n {0} \n w typ \n {1} \n obejmuje nieokreślony typ na podstawie informacji przed tym punktem programu. Koercje statyczne nie są dozwolone w przypadku niektórych typów. Wymagane są dodatkowe adnotacje typów.
pt_br: A coerção estática do tipo\n {0} \npara \n {1} \n requer um tipo indeterminado baseado nas informações anteriores a este ponto do programa. Coerções estáticas não são permitidas em alguns tipos e são necessárias novas anotações de tipo.
ru: Статическое приведение от типа \n {0} \nк \n {1} \n включает неопределенный тип, основанный на информации до данной точки программы. Статическое приведение не разрешено для некоторых типов. Необходимы дополнительные примечания типа.
tr: Bu program noktasından önceki bilgilere dayalı olarak\n {0} \ntüründen \n {1} \n türüne statik zorlama belirsiz bir tür içeriyor. Statik zorlamalara bazı türlerde izin verilmez. Yeni tür ek açıklamaları gereklidir.
zh_hans: 这个从类型\n {0} \n到 \n {1} \n的静态强制涉及一个基于此程序点之前的信息的不确定类型。不允许对某些类型进行静态强制。需要更多的类型批注。
zh_hant: 根據這個程式點之前的資訊，從類型\n {0} \n到 \n {1} \n的靜態強制型轉涉及不定的類型。不允許在某些類型上執行靜態強制型轉。需要進一步的類型註釋。

# StaticCoercionShouldUseBox
source: A coercion from the value type \n {0} \nto the type \n {1} \nwill involve boxing. Consider using 'box' instead
cs: Při konverzi z typu hodnoty \n {0} \nna typ \n {1} \nproběhne zabalení. Zvažte možnost použít místo toho klíčové slovo box.
de: Eine Koersion vom Werttyp \n {0} \nin den Typ \n {1} \nerfordert Boxing. Verwenden Sie stattdessen "box".
es: Una conversión del tipo de valor \n {0} \nal tipo \n {1} \nimplicará conversión boxing. Considere el uso de 'box' en su lugar
fr: Un forçage de type du type valeur \n {0} \nen type \n {1} \nimplique un boxing. Utilisez 'box' à la place
it: Una coercizione dal tipo di valore \n {0} \nal tipo \n {1} \nimplica una conversione boxing. Provare a utilizzare invece 'box'
ja: 次の値の型\n {0} \nから型\n {1} \nへの型変換はボックス化を伴います。代わりに 'box' を使用してください。
ko: 값 형식 \n {0}을(를) \n{1} 형식으로 \n 강제 변환하려면 \nboxing이 필요합니다. 대신 'box'를 사용하세요.
pl: Koercja typu wartości \n {0} \nw typ \n {1} \nobejmuje konwersję boxing. Zamiast tego rozważ użycie instrukcji „box”
pt_br: Uma coerção no tipo de valor \n {0} \npara o tipo \n {1} \nenvolverá conversão boxing. Considere usar 'box' em vez disso
ru: Приведение от типа-значения \n {0} \nк типу \n {1} \nвызовет упаковку. Рекомендуется вместо этого использовать "box"
tr: Zorlamanın \n {0} \ndeğer türünden \n {1} \ntürüne yapılması kutulama gerektirir. Bunun yerine 'box' kullanmayı düşünün
zh_hans: 从值类型 \n {0} \n到类型 \n {1} \n的强制将涉及装箱。请考虑改用“box”
zh_hant: 從實值類型 \n {0} \n到類型 \n {1} \n的強制型轉將涉及 Boxing。請考慮改用 'box'

# TypeIsImplicitlyAbstract
source: This type is 'abstract' since some abstract members have not been given an implementation. If this is intentional then add the '[<AbstractClass>]' attribute to your type.
cs: Tento typ je abstract, protože se neimplementovali někteří abstraktní členové. Pokud je to záměr, pak k typu přidejte atribut [<AbstractClass>].
de: Der Typ entspricht "abstract", da einige abstrakte Member nicht mit einer Implementierung versehen wurden. Wenn dies Ihre Absicht ist, fügen Sie das [<AbstractClass>]-Attribut zu Ihrem Typ hinzu.
es: Este tipo es "abstract" ya que a algunos miembros abstractos no se les ha dado una implementación. Si esto es intencional, agregue el atributo "[<AbstractClass>]"
fr: Ce type est 'abstract', car des membres abstraits n'ont pas reçu d'implémentation. Si cela est intentionnel, ajoutez l'attribut '[<AbstractClass>]' à votre type.
it: Questo tipo è 'abstract' perché non è stata specificata un'implementazione per alcuni membri astratti. Se questa scelta è intenzionale, aggiungere l'attributo '[<AbstractClass>]' al tipo.
ja: これは 'abstract' 型です。一部の抽象メンバーに実装がありません。意図的な場合には、型に '[<AbstractClass>]' 属性を追加してください。
ko: 일부 추상 멤버에 구현이 지정되지 않았으므로 이 형식은 'abstract'입니다. 의도적으로 구현을 지정하지 않은 경우에는 형식에 '[<AbstractClass>]' 특성을 추가하세요.
pl: Ten typ ma wartość „abstract”, ponieważ niektóre abstrakcyjne składowe nie mają określonej implementacji. Jeśli jest to zamierzone działanie, dodaj atrybut „[<AbstractClass>]” do typu.
pt_br: Esse tipo é 'abstrato', pois alguns membros abstratos não receberam uma implementação. Se isso for intencional, adicione o atributo '[<AbstractClass>]' ao seu tipo.
ru: Этот тип является абстрактным ('abstract'), так как для нескольких абстрактных членов не указана реализация. Если это сделано намеренно, добавьте атрибут '[<AbstractClass>]' к своему типу.
tr: Bazı soyut üyelere bir uygulama verilmediğinden bu tür 'soyut'. Bilerek yaptıysanız türünüze '[<AbstractClass>]' özniteliğini ekleyin.
zh_hans: 由于未向一些抽象成员提供实现，因此该类型为 "abstract"。如果是故意如此，请向你的类型添加 "[<AbstractClass>]" 属性。
zh_hant: 因為未提供實作給某些抽象成員，所以此類型為 'abstract'。如果這是預期的情況，則請將 '[<AbstractClass>]' 屬性新增到您的類型。

# NonRigidTypar1
source: This construct causes code to be less generic than indicated by its type annotations. The type variable implied by the use of a '#', '_' or other type annotation at or near '{0}' has been constrained to be type '{1}'.
cs: Konstruktor způsobuje, že kód je míň obecný, než udávají jeho poznámky typu. Proměnná typu odvozená pomocí #, _ nebo jiné poznámky typu na pozici {0} nebo blízko ní se omezila na typ {1}.
de: Durch dieses Konstrukt wird der Code weniger generisch, als aus den Typanmerkungen hervorgeht. Die durch die Verwendung von "#", "_" oder einer anderen Typanmerkung bei oder in der Nähe von "{0}" implizierte Typvariable wurde auf den Typ "{1}" eingeschränkt.
es: Esta construcción da lugar a que el código sea menos genérico que lo indicado por las anotaciones de tipo. La variable de tipo que implica el uso de '#', '_' u otra anotación de tipo en '{0}' o cerca se ha restringido al tipo '{1}'.
fr: Cette construction rend le code moins générique que ne l'indiquaient ses annotations de type. La variable de type impliquée par l'utilisation d'un '#', '_' ou de toute autre annotation de type à l'emplacement ou à proximité de '{0}' a été contrainte de représenter le type '{1}'.
it: Questo costrutto rende il codice meno generico di quanto indicato dalle relative annotazioni di tipo. La variabile di tipo prevista in base all'uso di un'annotazione di tipo '#', '_' o altra in corrispondenza o in prossimità di '{0}' è stata vincolata in modo da essere di tipo '{1}'.
ja: このコンストラクトによって、コードの総称性は型の注釈よりも低くなります。'{0}' またはその付近にある '#'、'_'、または他の型の注釈を使用して示された型変数は、型 '{1}' に制約されました。
ko: 이 구문을 사용하면 코드가 해당 형식 주석에 표시된 것보다 일반적이지 않게 됩니다. '{0}' 또는 이 근처에서 '#', '_' 또는 기타 형식 주석을 사용하여 암시된 형식 변수가 '{1}' 형식으로 제한되었습니다.
pl: Ta konstrukcja powoduje, że kod jest mniej ogólny niż określają to adnotacje typu. Zmienna typu implikowana przy użyciu znaku „#” lub „_” albo innej adnotacji typu w miejscu „{0}” lub w jego pobliżu została ograniczona do typu „{1}”.
pt_br: Esta construção faz com que o código seja menos genérico que o indicado por suas anotações de tipo. A variável de tipo implicada pelo uso de '#', '_' ou outra anotação de tipo em '{0}', ou próximo a ele, foi restrita a ser do tipo '{1}'.
ru: Данная конструкция служит причиной того, что код становится менее базовым, чем указано в аннотации его типа. Переменная типа, подразумеваемая использованием "#", "_" или другой аннотации типа в "{0}" или рядом, была ограничена до типа "{1}".
tr: Bu yapı, kodun kendi tür ek açıklamaları ile belirtilenden daha az genel olmasına neden olur. '#', '_' kullanılmasıyla veya '{0}' konumundaki ya da yakınındaki başka bir tür ek açıklamasıyla işaret edilen tür değişkeni '{1}' türü olacak şekilde kısıtlandı.
zh_hans: 此构造导致代码并不像其类型批注指明的那样通用。通过使用“{0}”处或其附近的“#”、“_”或其他类型批注暗示的类型变量已被约束为类型“{1}”。
zh_hant: 這個建構會導致程式碼的一般程度低於其類型註釋所指示的程度。在 '{0}' 或附近使用 '#'、'_' 或其他類型註釋所隱含的類型變數已被限於必須是類型 '{1}'。

# NonRigidTypar2
source: This construct causes code to be less generic than indicated by the type annotations. The unit-of-measure variable '{0} has been constrained to be measure '{1}'.
cs: Tento konstruktor způsobuje, že kód je míň obecný, než udávají jeho poznámky typu. Proměnná měrné jednotky {0} se omezila na měrnou jednotku {1}.
de: Durch dieses Konstrukt wird der Code weniger generisch, als aus den Typanmerkungen hervorgeht. Die Maßeinheitenvariable "{0}" wurde auf die Maßeinheit "{1}" eingeschränkt.
es: Esta construcción da lugar a que el código sea menos genérico que lo indicado por las anotaciones de tipo. La variable de unidad de medida '{0} se ha restringido a la medida '{1}'.
fr: Cette construction rend le code moins générique que ne l'indiquaient les annotations de type. La variable d'unité de mesure '{0} a été contrainte de représenter la mesure '{1}'.
it: Questo costrutto rende il codice meno generico di quanto indicato dalle annotazioni di tipo. La variabile di unità di misura '{0} è stata vincolata in modo da essere la misura '{1}'.
ja: このコンストラクトによって、コードの総称性は型の注釈よりも低くなります。単位変数 '{0}' は単位 '{1}' に制約されました。
ko: 이 구문을 사용하면 코드가 해당 형식 주석에 표시된 것보다 일반적이지 않게 됩니다. 측정 단위 변수 '{0}'은(는) 측정값 '{1}'(으)로 제한되었습니다.
pl: Ta konstrukcja powoduje, że kod jest mniej ogólny, niż określają to jego adnotacje typów. Zmienna jednostki miary „{0}” została ograniczona do miary „{1}”.
pt_br: Esta construção faz com que o código seja menos genérico que o indicado por suas anotações de tipo. A variável de unidade de medida '{0} foi restringida para ser medida '{1}'.
ru: Данная конструкция служит причиной того, что код становится менее базовым, чем указано в аннотациях типа. Переменная единицы измерения "{0}" была ограничена до измерения "{1}".
tr: Bu yapı, kodun kendi tür ek açıklamaları ile belirtilenden daha az genel olmasına neden olur. Ölçü birimi değişkeni '{0}, '{1}' ölçüsü olacak şekilde kısıtlandı.
zh_hans: 此构造导致代码并不像类型批注指明的那样通用。度量单位变量“{0}”已被约束为度量“{1}”。
zh_hant: 這個建構會導致程式碼的一般程度低於類型註釋所指示的程度。測量單位變數 '{0}' 已被限於必須是測量 '{1}'。

# NonRigidTypar3
source: This construct causes code to be less generic than indicated by the type annotations. The type variable '{0} has been constrained to be type '{1}'.
cs: Tento konstruktor způsobuje, že kód je míň obecný, než udávají jeho poznámky typu. Proměnná typu {0} se omezila na typ {1}.
de: Durch dieses Konstrukt wird der Code weniger generisch, als aus den Typanmerkungen hervorgeht. Die Typvariable "{0}" wurde auf den Typ "{1}" eingeschränkt.
es: Esta construcción da lugar a que el código sea menos genérico que lo indicado por las anotaciones de tipo. La variable de tipo '{0} se ha restringido al tipo '{1}'.
fr: Cette construction rend le code moins générique que ne l'indiquaient les annotations de type. La variable de type '{0} a été contrainte de représenter le type '{1}'.
it: Questo costrutto rende il codice meno generico di quanto indicato dalle annotazioni di tipo. La variabile di tipo '{0} è stata vincolata in modo da essere il tipo '{1}'.
ja: このコンストラクトによって、コードの総称性は型の注釈よりも低くなります。型変数 '{0}' は型 '{1}' に制約されました。
ko: 이 구문을 사용하면 코드가 해당 형식 주석에 표시된 것보다 일반적이지 않게 됩니다. 형식 변수 '{0}'은(는) '{1}' 형식으로 제한되었습니다.
pl: Ta konstrukcja powoduje, że kod jest mniej ogólny, niż określają to jego adnotacje typów. Zmienna typu „{0}” została ograniczona do typu „{1}”.
pt_br: Esta construção faz com que o código seja menos genérico que o indicado por suas anotações de tipo. A variável de tipo '{0} foi restringida a ser tipo '{1}'.
ru: Данная конструкция служит причиной того, что код становится менее базовым, чем указано в аннотациях типа. Переменная типа "{0}" была ограничена до типа "{1}".
tr: Bu yapı, kodun kendi tür ek açıklamaları ile belirtilenden daha az genel olmasına neden olur. Tür değişkeni '{0}, '{1}' türü olacak şekilde kısıtlandı.
zh_hans: 此构造导致代码并不像类型批注指明的那样通用。类型变量“{0}”已被约束为类型“{1}”。
zh_hant: 這個建構會導致程式碼的一般程度低於類型註釋所指示的程度。類型變數 '{0}' 已被限於必須是類型 '{1}'。

# Parser.TOKEN.IDENT
source: identifier
cs: identifikátor
de: Bezeichner
es: Identificador
fr: identificateur
it: identificatore
ja: 識別子
ko: 식별자
pl: identyfikator
pt_br: identificador
ru: идентификатор
tr: tanımlayıcı
zh_hans: 标识符
zh_hant: 識別碼

# Parser.TOKEN.INT
source: integer literal
cs: celočíselný literál
es: Literal de tipo Integer
fr: littéral d'entier
it: valore letterale Integer
ja: 整数リテラル
ko: 정수 리터럴
pl: literał całkowity
pt_br: literal de inteiro
ru: целочисленный литерал
tr: tamsayı sabit değeri
zh_hans: 整数文本
zh_hant: 整數常值

# Parser.TOKEN.FLOAT
source: floating point literal
cs: literál s plovoucí desetinnou čárkou
de: Gleitkommaliteral
es: literal de punto flotante
fr: littéral à virgule flottante
it: valore letterale a virgola mobile
ja: 浮動小数点リテラル
ko: 부동 소수점 리터럴
pl: literał zmiennoprzecinkowy
pt_br: ponto flutuante literal
ru: литерал с плавающей точкой
tr: kayan nokta sabit değeri
zh_hans: 浮点文本
zh_hant: 浮點常值

# Parser.TOKEN.DECIMAL
source: decimal literal
cs: desítkový literál
de: Dezimalliteral
es: literal decimal
fr: littéral décimal
it: valore letterale decimale
ja: 10 進リテラル
ko: 10진 리터럴
pl: literał dziesiętny
pt_br: literal decimal
ru: десятичный литерал
tr: ondalık sabit değeri
zh_hans: 十进制文本
zh_hant: 十進位常值

# Parser.TOKEN.CHAR
source: character literal
cs: znakový literál
de: Zeichenliteral
es: literal de carácter
fr: littéral de caractère
it: valore letterale carattere
ja: 文字リテラル
ko: 문자 리터럴
pl: literał znaków
pt_br: literal de caractere
ru: символьный литерал
tr: karakter sabit değeri
zh_hans: 字符文本
zh_hant: 字元常值

# Parser.TOKEN.BASE
source: keyword 'base'
cs: klíčové slovo base
de: Schlüsselwort "base"
es: palabra clave 'base'
fr: mot clé 'base'
it: parola chiave 'base'
ja: キーワード 'base'
ko: 'base' 키워드
pl: słowo kluczowe „base”
pt_br: palavra-chave 'base'
ru: ключевое слово "base"
tr: 'base' anahtar sözcüğü
zh_hans: 关键字“base”
zh_hant: 關鍵字 'base'

# Parser.TOKEN.LPAREN.STAR.RPAREN
source: symbol '(*)'
es: símbolo '(*)'
fr: symbole '(*)'
it: simbolo '(*)'
ja: シンボル '(*)'
ko: '(*)' 기호
pt_br: símbolo '(*)'
ru: символ "(*)"
tr: '(*)' simgesi
zh_hans: 符号“(*)”
zh_hant: 符號 '(*)'

# Parser.TOKEN.DOLLAR
source: symbol '$'
es: símbolo '$'
fr: symbole '$'
it: simbolo '$'
ja: シンボル '$'
ko: '$' 기호
pt_br: símbolo '$'
ru: символ "$"
tr: '$' simgesi
zh_hans: 符号“$”
zh_hant: 符號 '$'

# Parser.TOKEN.INFIX.STAR.STAR.OP
source: infix operator
cs: operátor vpony
es: operador de infijo
fr: opérateur infixe
it: operatore infisso
ja: 挿入演算子
ko: 중위 연산자
pl: operator infiksu
pt_br: operador infixo
ru: инфиксный оператор
tr: içtakı işleci
zh_hans: 中缀运算符
zh_hant: 中置運算子

# Parser.TOKEN.INFIX.COMPARE.OP
source: infix operator
cs: operátor vpony
es: operador de infijo
fr: opérateur infixe
it: operatore infisso
ja: 挿入演算子
ko: 중위 연산자
pl: operator infiksu
pt_br: operador infixo
ru: инфиксный оператор
tr: içtakı işleci
zh_hans: 中缀运算符
zh_hant: 中置運算子

# Parser.TOKEN.COLON.GREATER
source: symbol ':>'
es: símbolo ": >"
fr: symbole ':>'
it: simbolo ':>'
ja: シンボル ':>'
ko: 기호 ':>'
pt_br: símbolo ':>'
ru: Обозначение ':>'
tr: sembol ':>'
zh_hans: 符号 ":>"
zh_hant: 符號 ':>'

# Parser.TOKEN.COLON.COLON
source: symbol '::'
es: símbolo '::'
fr: symbole '::'
it: simbolo '::'
ja: シンボル '::'
ko: '::' 기호
pt_br: símbolo '::'
ru: символ "::"
tr: '::' simgesi
zh_hans: 符号“::”
zh_hant: 符號 '::'

# Parser.TOKEN.PERCENT.OP
source: symbol '{0}
es: símbolo '{0}
fr: symbole '{0}
it: simbolo '{0}
ja: シンボル'{0}'
ko: '{0}' 기호
pt_br: símbolo '{0}
ru: символ "{0}
tr: '{0} simgesi
zh_hans: 符号“{0}”
zh_hant: 符號 '{0}

# Parser.TOKEN.INFIX.AT.HAT.OP
source: infix operator
cs: operátor vpony
es: operador de infijo
fr: opérateur infixe
it: operatore infisso
ja: 挿入演算子
ko: 중위 연산자
pl: operator infiksu
pt_br: operador infixo
ru: инфиксный оператор
tr: içtakı işleci
zh_hans: 中缀运算符
zh_hant: 中置運算子

# Parser.TOKEN.INFIX.BAR.OP
source: infix operator
cs: operátor vpony
es: operador de infijo
fr: opérateur infixe
it: operatore infisso
ja: 挿入演算子
ko: 중위 연산자
pl: operator infiksu
pt_br: operador infixo
ru: инфиксный оператор
tr: içtakı işleci
zh_hans: 中缀运算符
zh_hant: 中置運算子

# Parser.TOKEN.PLUS.MINUS.OP
source: infix operator
cs: operátor vpony
es: operador de infijo
fr: opérateur infixe
it: operatore infisso
ja: 挿入演算子
ko: 중위 연산자
pl: operator infiksu
pt_br: operador infixo
ru: инфиксный оператор
tr: içtakı işleci
zh_hans: 中缀运算符
zh_hant: 中置運算子

# Parser.TOKEN.PREFIX.OP
source: prefix operator
cs: operátor předpony
de: Präfixoperator
es: operador de prefijo
fr: opérateur préfixé
it: operatore prefisso
ja: プレフィックス演算子
ko: 전위 연산자
pl: operator prefiksu
pt_br: operador pré-fixo
ru: префиксный оператор
tr: ön ek işleci
zh_hans: 前缀运算符
zh_hant: 前置運算子

# Parser.TOKEN.COLON.QMARK.GREATER
source: symbol ':?>'
es: símbolo ":?>"
fr: symbole ':?>'
it: simbolo ':?>'
ja: シンボル ':?>'
ko: 기호 ':?>'
pt_br: símbolo ':?>'
ru: Обозначение ':?>'
tr: sembol ':?>'
zh_hans: 符号 ":?>"
zh_hant: 符號 ':?>'

# Parser.TOKEN.INFIX.STAR.DIV.MOD.OP
source: infix operator
cs: operátor vpony
es: operador de infijo
fr: opérateur infixe
it: operatore infisso
ja: 挿入演算子
ko: 중위 연산자
pl: operator infiksu
pt_br: operador infixo
ru: инфиксный оператор
tr: içtakı işleci
zh_hans: 中缀运算符
zh_hant: 中置運算子

# Parser.TOKEN.INFIX.AMP.OP
source: infix operator
cs: operátor vpony
es: operador de infijo
fr: opérateur infixe
it: operatore infisso
ja: 挿入演算子
ko: 중위 연산자
pl: operator infiksu
pt_br: operador infixo
ru: инфиксный оператор
tr: içtakı işleci
zh_hans: 中缀运算符
zh_hant: 中置運算子

# Parser.TOKEN.AMP
source: symbol '&'
es: símbolo "&"
fr: symbole '&'
it: simbolo '&'
ja: シンボル '&'
ko: 기호 '&'
pt_br: símbolo '&'
ru: Обозначение '&'
tr: sembol '&'
zh_hans: 符号 "& amp;"
zh_hant: 符號 '&'

# Parser.TOKEN.AMP.AMP
source: symbol '&&'
es: símbolo "& &"
fr: symbole '&&'
it: simbolo '&&'
ja: シンボル '&&'
ko: 기호 '&&'
pt_br: símbolo '&&'
ru: Обозначение '&&'
tr: sembol '&&'
zh_hans: 符号 "&&"
zh_hant: 符號 '&&'

# Parser.TOKEN.BAR.BAR
source: symbol '||'
es: símbolo '||'
fr: symbole '||'
it: simbolo '||'
ja: シンボル '||'
ko: '||' 기호
pt_br: símbolo '||'
ru: символ "||"
tr: '||' simgesi
zh_hans: 符号“||”
zh_hant: 符號 '||'

# Parser.TOKEN.LESS
source: symbol '<'
es: símbolo "<"
fr: symbole '<'
it: simbolo '<'
ja: シンボル '<'
ko: 기호 '<'
pt_br: símbolo '<'
ru: Обозначение '<'
tr: sembol '<'
zh_hans: 符号 "<"
zh_hant: 符號 '<'

# Parser.TOKEN.GREATER
source: symbol '>'
es: símbolo ">"
fr: symbole '>'
it: simbolo '>'
ja: シンボル '>'
ko: 기호 '>'
pt_br: símbolo '>'
ru: Обозначение '>'
tr: sembol '>'
zh_hans: 符号 ">"
zh_hant: 符號 '>'

# Parser.TOKEN.QMARK
source: symbol '?'
es: símbolo '?'
fr: symbole '?'
it: simbolo '?'
ja: シンボル '?'
ko: '?' 기호
pt_br: símbolo '?'
ru: символ "?"
tr: '?' simgesi
zh_hans: 符号“?”
zh_hant: 符號 '?'

# Parser.TOKEN.QMARK.QMARK
source: symbol '??'
es: símbolo '??'
fr: symbole '??'
it: simbolo '??'
ja: シンボル '??'
ko: '??' 기호
pt_br: símbolo '??'
ru: символ "??"
tr: '??' simgesi
zh_hans: 符号“??”
zh_hant: 符號 '??'

# Parser.TOKEN.COLON.QMARK
source: symbol ':?'
es: símbolo ':?'
fr: symbole ':?'
it: simbolo ':?'
ja: シンボル ':?'
ko: ':?' 기호
pt_br: símbolo ':?'
ru: символ ":?"
tr: ':?' simgesi
zh_hans: 符号“:?”
zh_hant: 符號 ':?'
