Repository: dotnet/fsharp
Catalog: src/fsharp/xlf/FSStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ValueRestriction2
source: Value restriction. The value '{0}' has generic type\n {1} \nEither make '{2}' into a function with explicit arguments or, if you do not intend for it to be generic, add a type annotation.
cs: Omezení hodnoty. Hodnota {0} je obecného typu\n {1}. \nZměňte {2} na funkci s explicitními argumenty nebo (pokud hodnota nemá být obecná) přidejte poznámku typu.
de: Werteinschränkung. Der Wert "{0}" hat den generischen Typ\n {1} \nDefinieren Sie "{2}" entweder als Funktion mit expliziten Argumenten, oder fügen Sie eine Typanmerkung hinzu, wenn der Typ nicht generisch sein soll.
es: Restricción de valor. El valor '{0}' tiene el tipo genérico\n {1} \nConvierta '{2}' en una función con argumentos explícitos o, si su intención no es que sea genérico, agregue una anotación de tipo.
fr: Restriction de valeur. La valeur '{0}' a le type générique\n {1} \nChangez '{2}' en fonction avec des arguments explicites ou, si votre but n'est pas d'utiliser un type générique, ajoutez une annotation de type.
it: Limitazione valore. Il valore '{0}' ha il tipo generico\n {1} \nRendere '{2}' una funzione con argomenti espliciti oppure, se non si intende renderlo generico, aggiungere un'annotazione di tipo.
ja: 値の制限。値 '{0}' は次のジェネリック型です。\n {1} \n明示的な引数を使用して '{2}' を関数にするか、ジェネリックにする意図がない場合は型の注釈を追加してください。
ko: 값 제한이 있습니다. 값 '{0}'에 제네릭 형식\n {1}이(가) 있습니다. \n'{2}'을(를) 명시적 인수가 포함된 함수로 만들거나, 제네릭 요소로 만들지 않으려는 경우 형식 주석을 추가하세요.
pl: Ograniczenie wartości. Wartość „{0}” jest wartością typu ogólnego\n {1} \nUstaw element „{2}” jako funkcję z jawnymi argumentami lub dodaj adnotację typu, jeśli nie chcesz, aby wartość była ogólna.
pt_br: Restrição de valor. O valor '{0}' tem um tipo genérico\n {1} \nInsira '{2}' em uma função com argumentos explícitos ou, se você não desejar que ele seja genérico, adicione uma anotação de tipo.
ru: Ограничение значения. Значение "{0}" имеет универсальный тип\n {1} \nЛибо сделайте "{2}" функцией с явными аргументами, либо (если универсальный тип не требуется) добавьте аннотацию типа.
tr: Değer kısıtlaması. '{0}' değerinin genel türü:\n {1} \nYa açık bağımsız değişkenlerle '{2}' için işlev dönüşümü yapın ya da genel olmasını istemiyorsanız bir tür ek açıklaması ekleyin.
zh_hans: 值限制。值“{0}”具有泛型类型\n {1} \n使“{2}”成为具有显式参数的函数，或添加类型批注(如果您不希望它是泛型的)。
zh_hant: 值限制。值 '{0}' 具有泛型類型\n {1} \n請將 '{2}' 設為具有明確引數的函式，或者如果不想將它設為泛型，請加入類型註釋。

# ValueRestriction3
source: Value restriction. This member has been inferred to have generic type\n {0} \nConstructors and property getters/setters cannot be more generic than the enclosing type. Add a type annotation to indicate the exact types involved.
cs: Omezení hodnoty. Tento člen se odvodil jako člen obecného typu\n {0}. \nKonstruktory a metody getter nebo setter vlastnosti nemůžou být obecnější než nadřazený typ. Přidejte poznámku typu, abyste přesně určili, které typy se mají zahrnout.
de: Werteinschränkung. Dieser Member wurde per Rückschluss abgeleitet als generischer Typ\n {0} \nKonstruktoren und Eigenschaftengetter/-setter dürfen nicht generischer sein als der einschließende Typ. Fügen Sie eine Typanmerkung hinzu, um die genauen Typen anzugeben.
es: Restricción de valor. Se ha inferido que este miembro tiene el tipo genérico\n {0} \nLos constructores y los captadores y establecedores de propiedades no pueden ser más genéricos que el tipo envolvente. Agregue una anotación de tipo para indicar los tipos exactos implicados.
fr: Restriction de valeur. Il a été déduit que ce membre avait un type générique\n {0} \nLes constructeurs, ainsi que les méthodes getter/setter d'une propriété ne peuvent pas être plus génériques que le type englobant. Ajoutez une annotation de type pour indiquer les types exacts impliqués.
it: Restrizione relativa ai valori. È stato dedotto che il membro ha il tipo generico\n {0} \nI getter/setter di proprietà e i costruttori non possono essere più generici del tipo di inclusione. Aggiungere un'annotazione di tipo per indicare i tipi esatti previsti.
ja: 値の制限。このメンバーは次のジェネリック型を持つと推論されました。\n {0} \nコンストラクターとプロパティのゲッター/セッターは、それを囲む型よりも総称性を高くすることができません。関係する正確な型を示すために、型の注釈を追加してください。
ko: 값 제한이 있습니다. 이 멤버는 제네릭 형식\n {0}을(를) 가지는 것으로 유추되었습니다. \n생성자 및 속성 getter/setter는 바깥쪽 형식보다 일반적일 수 없습니다. 형식 주석을 추가하여 관련 형식을 정확히 나타내세요.
pl: Ograniczenie wartości. Wywnioskowano, że ten element członkowski jest elementem typu ogólnego\n {0} \nKonstruktory i metody pobierające/ustawiające właściwości nie mogą być bardziej ogólne niż typ otaczający. Dodaj adnotację typu, aby dokładnie wskazać uwzględnione typy.
pt_br: Restrição de valor. Este membro foi inferido para ter um tipo genérico\n {0} \nConstrutores e getters/setters de propriedade não podem ser mais genéricos que o tipo de delimitador. Adicione uma anotação de tipo para indicar os tipos exatos envolvidos.
ru: Ограничение значения. Данный выведенный элемент должен иметь универсальный тип\n {0} \nМетоды получения или задания свойств и конструкторов не могут быть более универсальными, чем вмещающий тип. Добавьте аннотацию типа, чтобы точно обозначить затрагиваемые типы.
tr: Değer kısıtlaması. Bu üyenin şu genel türü olduğu çıkarıldı\n {0} \nOluşturucular ve özellik alıcıları/ayarlayıcıları kapsayan türden daha genel olamaz. Söz konusu türleri tam olarak belirtmek için bir tür ek açıklaması ekleyin.
zh_hans: 值限制。已推理出此成员具有泛型类型\n {0} \n构造函数和属性 Getter/Setter 不能比封闭类型更通用。 添加类型批注以指示涉及到的确切类型。
zh_hant: 值限制。這個成員已被推斷為具有泛型類型\n {0} \n建構函式和屬性 getter/setter 不能比封入類型更為泛型。請加入類型註釋，以指示涉及的確切類型。

# ValueRestriction4
source: Value restriction. The value '{0}' has been inferred to have generic type\n {1} \nEither make the arguments to '{2}' explicit or, if you do not intend for it to be generic, add a type annotation.
cs: Omezení hodnoty. Hodnota {0} se odvodila jako hodnota obecného typu\n {1}. \nBuď změňte argumenty pro {2} na explicitní, nebo (pokud hodnota nemá být obecná) přidejte poznámku typu.
de: Werteinschränkung. Der Wert "{0}" wurde per Rückschluss abgeleitet als generischer Typ\n {1} \nLegen Sie die Argumente für "{2}" entweder als explizit fest, oder fügen Sie eine Typanmerkung hinzu, wenn der Typ nicht generisch sein soll.
es: Restricción de valor. Se ha inferido que el valor '{0}' tiene el tipo genérico\n {1} \nConvierta los argumentos de '{2}' en explícitos o, si su intención no es que sea genérico, agregue una anotación de tipo.
fr: Restriction de valeur. Il a été déduit que la valeur '{0}' avait le type générique\n {1} \nRendez les arguments de '{2}' explicites ou, si votre but n'est pas d'utiliser un type générique, ajoutez une annotation de type.
it: Limitazione valore. È stato dedotto che il valore '{0}' ha il tipo generico\n {1} \nRendere gli argomenti di '{2}' espliciti, oppure se non si intende renderlo generico, aggiungere un'annotazione di tipo.
ja: 値の制限。値 '{0}' は次のジェネリック型を持つと推論されました。\n {1} \n明示的に引数を '{2}' にするか、ジェネリックにする意図がない場合は型の注釈を追加してください。
ko: 값 제한이 있습니다. 값 '{0}'은(는) 제네릭 형식\n {1}을(를) 가지는 것으로 유추되었습니다. \n'{2}'에 대한 인수를 명시적으로 만들거나, 제네릭 요소로 만들지 않으려는 경우 형식 주석을 추가하세요.
pl: Ograniczenie wartości. Wywnioskowano, że wartość „{0}” jest wartością typu ogólnego\n {1} \nOkreśl argumenty elementu „{2}” jako jawne lub dodaj adnotację typu, jeśli nie chcesz, aby wartość była ogólna.
pt_br: Restrição de valor. O valor '{0}' foi inferido para ter um tipo genérico\n {1} \nTorne os argumentos '{2}' explícitos ou, se sua intenção não for deixá-los genéricos, adicione uma anotação de tipo.
ru: Ограничение значения. Выведенное значение "{0}" должно иметь универсальный тип\n {1} \nЛибо сделайте аргументы для "{2}" явными, либо (если универсальный тип не требуется) добавьте аннотацию типа.
tr: Değer kısıtlaması. '{0}' değerinin şu genel türü olduğu çıkarıldı:\n {1} \nYa '{2}' bağımsız değişkenlerini açık yapın ya da genel olmasını istemiyorsanız bir tür ek açıklaması ekleyin.
zh_hans: 值限制。已推理出值“{0}”具有泛型类型\n {1} \n使“{2}”的参数成为显式参数，或添加类型批注(如果您不希望它是泛型的)。
zh_hant: 值限制。值 '{0}' 已被推斷為具有泛型類型\n {1} \n請將 '{2}' 的引數設為明確的，或者如果不想將它設為泛型，請加入類型註釋。

# ValueRestriction5
source: Value restriction. The value '{0}' has been inferred to have generic type\n {1} \nEither define '{2}' as a simple data term, make it a function with explicit arguments or, if you do not intend for it to be generic, add a type annotation.
cs: Omezení hodnoty. Hodnota {0} se odvodila jako hodnota obecného typu\n {1}. \nDefinujte {2} jako jednoduchý datový výraz, změňte ji na funkci s explicitními argumenty nebo (pokud hodnota nemá být obecná) přidejte poznámku typu.
de: Werteinschränkung. Der Wert "{0}" wurde per Rückschluss abgeleitet als generischer Typ\n {1} \nDefinieren Sie "{2}" entweder als einfachen Ausdruck oder als Funktion mit expliziten Argumenten, oder fügen Sie eine Typanmerkung hinzu, wenn der Typ nicht generisch sein soll.
es: Restricción de valor. Se ha inferido que el valor '{0}' tiene el tipo genérico\n {1} \nDefina '{2}' como un término de datos simple, conviértalo en una función con argumentos explícitos o, si su intención no es que sea genérico, agregue una anotación de tipo.
fr: Restriction de valeur. Il a été déduit que la valeur '{0}' avait le type générique\n {1} \nDéfinissez '{2}' en tant que terme de données simple, faites-en une fonction avec des arguments explicites ou, si votre but n'est pas d'utiliser un type générique, ajoutez une annotation de type.
it: Limitazione valore. È stato dedotto che il valore '{0}' ha il tipo generico\n {1} \nDefinire '{2}' come termine di dati semplice, renderlo una funzione con argomenti espliciti oppure, se non si intende renderlo generico, aggiungere un'annotazione di tipo.
ja: 値の制限。値 '{0}' は次のジェネリック型を持つと推論されました。\n {1} \n単純なデータ用語として '{2}' を定義するか、明示的な引数を使用して関数にするか、ジェネリックにする意図がない場合は型の注釈を追加してください。
ko: 값 제한이 있습니다. 값 '{0}'은(는) 제네릭 형식\n {1}을(를) 가지는 것으로 유추되었습니다. \n'{2}'을(를) 단순 데이터 용어로 정의하거나, 명시적 인수가 포함된 함수로 만들거나, 제네릭 요소로 만들지 않으려는 경우 형식 주석을 추가하세요.
pl: Ograniczenie wartości. Wywnioskowano, że wartość „{0}” jest wartością typu ogólnego\n {1} \nZdefiniuj element „{2}” jako prosty termin danych, określ go jako funkcję z jawnymi argumentami lub dodaj adnotację typu, jeśli nie chcesz, aby wartość była ogólna.
pt_br: Restrição de valor. O valor '{0}' foi inferido para ter um tipo genérico\n {1} \nDefina '{2}' como um termo de dado simples e torne-o uma função com argumentos explícitos ou, se sua intenção for deixá-los genéricos, adicione uma anotação de tipo.
ru: Ограничение значения. Выведенное значение "{0}" должно иметь универсальный тип\n {1} \nЛибо определите "{2}" как простой член данных, либо сделайте его функцией с явными аргументами, либо (если универсальный тип не требуется) добавьте аннотацию типа.
tr: Değer kısıtlaması. '{0}' değerinin şu genel türü olduğu çıkarıldı:\n {1} \nYa '{2}' tanımını basit veri terimi olarak yaparak onu açık bağımsız değişkenlerle bir işlev yapın ya da genel olmasını istemiyorsanız bir tür ek açıklaması ekleyin.
zh_hans: 值限制。已推理出值“{0}”具有泛型类型\n {1} \n将“{2}”定义为简单的数据条目，使其成为具有显式参数的函数，或添加类型批注(如果您不希望它是泛型的)。
zh_hant: 值限制。值 '{0}' 已被推斷為具有泛型類型\n {1} \n請將 '{2}' 定義為簡單資料項、將它設為具有明確引數的函式，或者如果不想將它設為泛型，請加入類型註釋。

# RecoverableParseError
source: syntax error
cs: chyba syntaxe
de: Syntaxfehler
es: error de sintaxis
fr: erreur de syntaxe
it: errore di sintassi
ja: 構文エラーです
ko: 구문 오류입니다.
pl: błąd składni
pt_br: erro de sintaxe
ru: синтаксическая ошибка
tr: sözdizimi hatası
zh_hans: 语法错误
zh_hant: 語法錯誤

# OverrideInIntrinsicAugmentation
source: Override implementations in augmentations are now deprecated. Override implementations should be given as part of the initial declaration of a type.
cs: Implementace přepsání v rozšířeních jsou už zastaralé. Implementace přepsání by se měly provádět při počáteční deklaraci typu.
de: Überschreibungsimplementierungen in Augmentationen sind jetzt veraltet. Überschreibungsimplementierungen sollten als Teil der ersten Deklaration eines Typs angegeben werden.
es: Las implementaciones de invalidación en aumentos están en desuso. Las implementaciones de invalidación deben proporcionarse como parte de la declaración inicial de un tipo.
fr: Les implémentations de substitution dans les augmentations sont désormais déconseillées. Les implémentations de substitution doivent être fournies dans le cadre de la déclaration initiale d'un type.
it: Le implementazioni degli override negli aumenti sono ora deprecate. Le implementazioni degli override devono essere specificate all'interno della dichiarazione iniziale di un tipo.
ja: 拡張内のオーバーライドの実装は使用されなくなりました。オーバーライドの実装は、型の最初の宣言の一部として指定してください。
ko: 확대의 재정의 구현은 이제 사용되지 않습니다. 재정의 구현은 초기 형식 선언의 일부로 지정해야 합니다.
pl: Implementacje przesłonięć w rozszerzeniach są obecnie przestarzałe. Implementacje przesłonięć powinny występować w początkowej deklaracji typu.
pt_br: Implementações de substituições foram preteridas em aumentos. Implementações de substituições devem ser dadas como parte da declaração inicial de um tipo.
ru: Реализации переопределений в приращениях теперь не рекомендуются к использованию. Реализации переопределений должны быть даны при первичном объявлении типа.
tr: Genişletmelerdeki geçersiz kılma uygulamaları artık kullanım dışı bırakıldı. Geçersiz kılma uygulamaları bir türün ilk bildiriminin parçası olarak verilmelidir.
zh_hans: 扩大中的重写实现现已弃用。应将重写实现作为类型的初始声明的一部分提供。
zh_hant: 增強指定中的覆寫實作現在已被取代。應該在類型的初始宣告上指定覆寫實作。

# OverrideInExtrinsicAugmentation
source: Override implementations should be given as part of the initial declaration of a type.
cs: Implementace přepsání by se měly provádět při počáteční deklaraci typu.
de: Überschreibungsimplementierungen sollten als Teil der ersten Deklaration eines Typs angegeben werden.
es: Las implementaciones de invalidación deben proporcionarse como parte de la declaración inicial de un tipo.
fr: Les implémentations de substitution doivent être fournies dans le cadre de la déclaration initiale d'un type.
it: Le implementazioni degli override devono essere specificate all'interno della dichiarazione iniziale di un tipo.
ja: オーバーライドの実装は、型の最初の宣言の一部として指定してください。
ko: 재정의 구현은 초기 형식 선언의 일부로 지정해야 합니다.
pl: Implementacje przesłonięć powinny występować w początkowej deklaracji typu.
pt_br: Implementações de substituições devem ser dadas como parte de declaração inicial de um tipo.
ru: Реализации переопределений должны быть даны при первичном объявлении типа.
tr: Geçersiz kılma uygulamaları bir türün ilk bildiriminin parçası olarak verilmelidir.
zh_hans: 应将重写实现作为类型的初始声明的一部分提供。
zh_hant: 應該在類型的初始宣告上指定覆寫實作。

# IntfImplInIntrinsicAugmentation
source: Interface implementations in augmentations are now deprecated. Interface implementations should be given on the initial declaration of a type.
cs: Implementace rozhraní v rozšířeních jsou už zastaralé. Implementace rozhraní by se měly provádět při počáteční deklaraci typu.
de: Schnittstellenimplementierungen in Augmentationen sind jetzt veraltet. Schnittstellenimplementierungen sollten in der ersten Deklaration eines Typs angegeben werden.
es: Las implementaciones de interfaz en aumentos están en desuso. Las implementaciones de interfaz deben proporcionarse en la declaración inicial de un tipo.
fr: Les implémentations d'interfaces dans les augmentations sont désormais déconseillées. Les implémentations d'interfaces doivent être fournies dans la déclaration initiale d'un type.
it: Le implementazioni di interfaccia negli aumenti sono ora deprecate. Le implementazioni di interfaccia devono essere specificate nella dichiarazione iniziale di un tipo.
ja: 拡張内のインターフェイスの実装は使用されなくなりました。インターフェイスの実装は、型の最初の宣言で指定してください。
ko: 확대의 인터페이스 구현은 이제 사용되지 않습니다. 인터페이스 구현은 초기 형식 선언 시 지정해야 합니다.
pl: Implementacje interfejsów w powiększeniach są teraz przestarzałe. Implementacje interfejsów powinny występować w początkowej deklaracji typu.
pt_br: Implementações de interface em aumentos agora são preteridas. Implementações de interface devem ser dadas nas declarações de tipo iniciais.
ru: Реализации интерфейсов в приращениях теперь являются не рекомендуемыми к использованию. Реализации интерфейсов должны быть даны при первичном объявлении типа.
tr: Genişletmelerdeki arabirim uygulamaları artık kullanım dışı bırakıldı. Arabirim uygulamaları bir türün ilk bildiriminde verilmelidir.
zh_hans: 扩大中的接口实现现已弃用。应在类型的初始声明中提供接口实现。
zh_hant: 增強指定中的介面實作現在已被取代。應該在類型的初始宣告上指定介面實作。

# IntfImplInExtrinsicAugmentation
source: Interface implementations should be given on the initial declaration of a type.
cs: Implementace rozhraní by se měly provádět při počáteční deklaraci typu.
de: Schnittstellenimplementierungen sollten in der ersten Deklaration eines Typs angegeben werden.
es: Las implementaciones de interfaz deben proporcionarse en la declaración inicial de un tipo.
fr: Les implémentations d'interfaces doivent être fournies dans la déclaration initiale d'un type.
it: Le implementazioni di interfaccia devono essere specificate nella dichiarazione iniziale di un tipo.
ja: インターフェイスの実装は、型の最初の宣言で指定してください。
ko: 인터페이스 구현은 초기 형식 선언 시 지정해야 합니다.
pl: Implementacje interfejsów powinny występować w początkowej deklaracji typu.
pt_br: Implementações de interfaces devem ser dadas nas declarações de tipo iniciais.
ru: Реализации интерфейсов должны быть даны при первичном объявлении типа.
tr: Arabirim uygulamaları bir türün ilk bildiriminde verilmelidir.
zh_hans: 应在类型的初始声明中提供接口实现。
zh_hant: 應該在類型的初始宣告上指定介面實作。

# UnresolvedReferenceNoRange
source: A required assembly reference is missing. You must add a reference to assembly '{0}'.
cs: Chybí požadovaný odkaz na sestavení. Musíte k sestavení {0} přidat odkaz.
de: Ein erforderlicher Assemblyverweis fehlt. Sie müssen einen Verweis auf Assembly "{0}" hinzufügen.
es: Falta una referencia de ensamblado necesaria. Debe agregar una referencia al ensamblado '{0}'.
fr: Une référence d'assembly requise est manquante. Vous devez ajouter une référence à l'assembly '{0}'.
it: Riferimento ad assembly mancante. Aggiungere un riferimento all'assembly '{0}'.
ja: 必要なアセンブリ参照が見つかりません。アセンブリ '{0}' に参照を追加してください。
ko: 필요한 어셈블리 참조가 없습니다. '{0}' 어셈블리에 대한 참조를 추가해야 합니다.
pl: Brak wymaganego odwołania do zestawu. Musisz dodać odwołanie do zestawu „{0}”.
pt_br: Uma referência de assembly necessária está faltando. Você deve adicionar uma referência ao assembly '{0}'.
ru: Ссылка на требуемую сборку отсутствует. Необходимо добавить ссылку на сборку "{0}".
tr: Gerekli bir bütünleştirilmiş kod başvurusu eksik. '{0}' bütünleştirilmiş koduna başvuru eklemeniz gerekiyor.
zh_hans: 缺少所需的程序集引用。必须添加对程序集“{0}”的引用。
zh_hant: 遺漏需要的組件參考。您必須加入組件 '{0}' 的參考。

# UnresolvedPathReferenceNoRange
source: The type referenced through '{0}' is defined in an assembly that is not referenced. You must add a reference to assembly '{1}'.
cs: Typ odkazovaný pomocí {0} je definovaný v sestavení, na které se neodkazuje. Musíte přidat odkaz na sestavení {1}.
de: Der Typ, auf den über "{0}" verwiesen wird, wird in einer Assembly definiert, auf die nicht verwiesen wird. Sie müssen einen Verweis auf Assembly "{1}" hinzufügen.
es: El tipo al que se hace referencia a través de '{0}' está definido en un ensamblado al que no se hace referencia. Debe agregar una referencia al ensamblado '{1}'.
fr: Le type référencé via '{0}' est défini dans un assembly qui n'est pas référencé. Vous devez ajouter une référence à l'assembly '{1}'.
it: Il tipo a cui viene fatto riferimento tramite '{0}' è definito in un assembly a cui non viene fatto riferimento. Aggiungere un riferimento all'assembly '{1}'.
ja: {0}' によって参照される型が、参照されていないアセンブリで定義されています。アセンブリ '{1}' への参照を追加してください。
ko: {0}'을(를) 통해 참조되는 형식이 참조되지 않는 어셈블리에 정의되어 있습니다. '{1}' 어셈블리에 대한 참조를 추가해야 합니다.
pl: Typ, do którego utworzono odwołanie za pośrednictwem elementu „{0}”, jest zdefiniowany w zestawie, do którego nie utworzono odwołania. Musisz dodać odwołanie do zestawu „{1}”.
pt_br: O tipo referenciado através de '{0}' é definido no assembly não referenciado. Você deve adicionar uma referência ao assembly '{1}'.
ru: Тип, на который есть ссылка через "{0}", определен в сборке, ссылка на которую отсутствует. Необходимо добавить ссылку на сборку "{1}".
tr: {0}' aracılığıyla başvurulan tür başvurulmayan bir bütünleştirilmiş kodda tanımlanıyor. '{1}' bütünleştirilmiş koduna başvuru eklemeniz gerekiyor.
zh_hans: 通过“{0}”引用的类型是在一个未被引用的程序集中定义的。必须添加对程序集“{1}”的引用。
zh_hant: 透過 '{0}' 參考的類型是定義在未參考的組件中。您必須加入組件 '{1}' 的參考。

# HashIncludeNotAllowedInNonScript
source: #I directives may only occur in F# script files (extensions .fsx or .fsscript). Either move this code to a script file, add a '-I' compiler option for this reference or delimit the directive with delimit it with '#if INTERACTIVE'/'#endif'.
cs: Direktivy #I se můžou vyskytovat jenom v souborech skriptu F# (s příponou .fsx nebo .fsscript). Přesuňte tento kód do souboru skriptu nebo přidejte pro tento odkaz možnost kompilátoru -I anebo direktivu ohraničte pomocí notace #if INTERACTIVE/#endif.
de: #I-Direktiven dürfen nur in F#-Skriptdateien (Dateierweiterungen .fsx oder .fsscript) verwendet werden. Verschieben Sie entweder diesen Code in eine Skriptdatei, fügen Sie die Compileroption "-I" für diesen Verweis hinzu, oder trennen Sie die Direktive mit "#if INTERACTIVE"/"#endif" ab.
es: Las directivas #I pueden existir solo en archivos de script de F# (extensiones .fsx o .fsscript). Mueva este código a un archivo de script, agregue una opción de compilador '-I' para esta referencia o delimite la directiva con '#if INTERACTIVE'/'#endif'.
fr: Les directives #I ne peuvent être présentes que dans les fichiers de script F# (extensions .fsx ou .fsscript). Déplacez ce code vers un fichier de script, ajoutez une option de compilateur '-I' pour cette référence ou délimitez la directive par '#if INTERACTIVE'/'#endif'.
it: Le direttive #I possono trovarsi solo in file di script F# (estensioni fsx o fsscript). Spostare il codice in un file di script, aggiungere un'opzione di compilazione '-I' per questo riferimento oppure delimitare la direttiva con '#if INTERACTIVE'/'#endif'.
ja: #I ディレクティブを使用できるのは F# スクリプト ファイル (拡張子は .fsx または .fsscript) のみです。このコードをスクリプト ファイルに移動するか、この参照に '-I' コンパイラー オプションを追加するか、ディレクティブを '#if INTERACTIVE'/'#endif' で区切ってください。
ko: #I 지시문은 F# 스크립트 파일(확장명 .fsx 또는 .fsscript)에서만 발생할 수 있습니다. 이 코드를 스크립트 파일로 이동하거나, 이 참조에 대한 '-I' 컴파일러 옵션을 추가하거나, 지시문을 '#if INTERACTIVE'/'#endif'로 구분하세요.
pl: Dyrektywy #I mogą występować tylko w plikach skryptu języka F# (rozszerzenie fsx lub fsscript). Przenieś ten kod do pliku skryptu, dodaj opcję kompilatora „-I” dla tego odwołania lub rozdziel dyrektywę przy użyciu elementu „#if INTERACTIVE”/„#endif”.
pt_br: Diretivas #I só podem ocorrer em arquivos de script F# (extensões .fsx ou .fsscript). Mova este código para o arquivo de script e adicione uma opção de compilador '-I' para esta referência, ou então, delimite a diretiva com '#if INTERACTIVE'/'#endif'.
ru: Директивы #I могут встречаться только в файлах скриптов F# (расширения .fsx или .fsscript). Нужно либо переместить данный код в файл скрипта, либо добавить для данной ссылки параметр компилятора "-I", либо ограничить директиву с помощью "#if INTERACTIVE"/"#endif".
tr: #I yönergeleri yalnızca F# betik dosyalarında (.fsx veya .fsscript uzantılı) görülebilir. Ya bu kodu bir betik dosyasına taşıyıp bu başvuru için bir '-I' derleyici seçeneği ekleyin ya da yönergeyi '#if INTERACTIVE'/'#endif' ile sınırlandırın.
zh_hans: #I 指令只能出现在 F# 脚本文件(扩展名为 .fsx 或 .fsscript)中。请将此代码添加到脚本文件中、添加此引用的“-I”编译器选项或使用“#if INTERACTIVE”/“#endif”分隔此指令。
zh_hant: #I 指示詞只能出現在 F# 指令碼檔案 (副檔名 .fsx 或 .fsscript) 中。請將這個程式碼移到指令碼檔案、為這個參考加入 '-I' 編譯器選項，或用 '#if INTERACTIVE'/'#endif' 分隔這個指示詞。
