Repository: dotnet/fsharp
Catalog: vsintegration/ProjectTemplates/ConsoleProject/Template/xlf/AssemblyInfo.fs.*.xlf
Languages: de, pl

# GeneralInfo-Line1
source: General Information about an assembly is controlled through the following
de: Allgemeine Informationen über eine Assembly werden über die folgende
pl: Ogólne informacje o zestawie są kontrolowane poprzez następujący

# GeneralInfo-Line2
source: set of attributes. Change these attribute values to modify the information
de: Attributgruppe gesteuert. Ändern Sie diese Attributwerte, um die Informationen zu ändern,
pl: zbiór atrybutów. Zmień wartości tych atrybutów by zmodyfikować informacje

# GeneralInfo-Line3
source: associated with an assembly.
de: die einer Assembly zugeordnet sind.
pl: powiązane z zestawem.

# ComVisible-Line1
source: Setting ComVisible to false makes the types in this assembly not visible
de: Durch Festlegen von ComVisible auf 'false' werden die Typen in dieser Assembly unsichtbar
pl: Ustawienie wartości ComVisible na false sprawia, że typy w tym zestawie nie będą widoczne

# ComVisible-Line2
source: to COM components. If you need to access a type in this assembly from
de: für COM-Komponenten. Wenn Sie auf einen Typ in dieser Assembly von
pl: dla składników COM. Jeśli potrzebny jest dostęp do typu w tym zestawie z

# ComVisible-Line3
source: COM, set the ComVisible attribute to true on that type.
de: COM aus zugreifen müssen, sollten Sie das ComVisible-Attribut für diesen Typ auf "True" festlegen.
pl: COM, ustaw atrybut ComVisible na true dla danego typu.

# Guid-Line1
source: The following GUID is for the ID of the typelib if this project is exposed to COM
de: Die folgende GUID bestimmt die ID der Typbibliothek, wenn dieses Projekt für COM verfügbar gemacht wird
pl: Następujący GUID jest dla ID typelib jeśli ten projekt jest dostępny dla COM

# VersionInfo-Line1
source: Version information for an assembly consists of the following four values:
de: Versionsinformationen für eine Assembly bestehen aus den folgenden vier Werten:
pl: Informacje o wersji zestawu zawierają następujące cztery wartości:

source: Major Version
de: Hauptversion
pl: Wersja główna

source: Minor Version
de: Nebenversion
pl: Wersja pomocnicza

source: Build Number
de: Buildnummer
pl: Numer kompilacji

source: Revision
pl: Poprawka

# VersionInfo-Line2
source: You can specify all the values or you can default the Build and Revision Numbers
de: Sie können alle Werte angeben oder die standardmäßigen Build- und Revisionsnummern
pl: Można określać wszystkie wartości lub używać domyślnych numerów kompilacji i poprawki

# VersionInfo-Line3
source: by using the '*' as shown below:
de: übernehmen, indem Sie "*" eingeben:
pl: przy użyciu symbolu „*”, tak jak pokazano poniżej:
