Repository: dotnet/fsharp
Catalog: vsintegration/src/FSharp.Editor/xlf/FSharp.Editor.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AddMissingEqualsToTypeDefinition
source: Add missing '=' to type definition
cs: Přidejte do definice typu chybějící =.
de: Fehlende "=" zur Typdefinition hinzufügen
es: Agregar el carácter "=" que falta a la definición de tipo
fr: Ajouter un '=' manquant à la définition de type
it: Aggiungere il carattere '=' mancante alla definizione di tipo
ja: 不足している '=' を型定義に追加します
ko: 형식 정의에 누락된 '=' 추가
pl: Dodaj brakujący element znak „=” do definicji typu
pt_br: Adicionar o '=' ausente à definição de tipo
ru: Добавьте недостающий символ "=" к определению типа.
tr: Tür tanımına eksik '=' işaretini ekle
zh_hans: 将缺少的 "=" 添加到类型定义
zh_hant: 將缺少的 '=' 新增至類型定義

source: Add missing 'fun' keyword
cs: Přidat chybějící klíčové slovo fun
de: Fehlendes Schlüsselwort "fun" hinzufügen
es: Agregar la palabra clave "fun" que falta
fr: Ajouter le mot clé 'fun' manquant
it: Aggiungi la parola chiave mancante 'fun'
ja: 不足している 'fun' キーワードを追加する
ko: 누락된 'fun' 키워드 추가
pl: Dodaj brakujące słowo kluczowe „fun”
pt_br: Adicionar palavra-chave 'fun' ausente
ru: Добавить отсутствующее ключевое слово "fun"
tr: Eksik 'fun' anahtar sözcüğünü ekle
zh_hans: 添加缺少的 "fun" 关键字
zh_hant: 新增缺少的 'fun' 關鍵字

source: Add missing instance member parameter
cs: Přidat chybějící parametr člena instance
de: Fehlenden Instanzmemberparameter hinzufügen
es: Agregar parámetro de miembro de instancia que falta
fr: Ajouter un paramètre de membre d’instance manquant
it: Aggiungi parametro membro di istanza mancante
ja: 見つからないインスタンス メンバー パラメーターを追加する
ko: 누락된 인스턴스 멤버 매개 변수 추가
pl: Dodaj brakujący parametr składowej wystąpienia
pt_br: Adicionar parâmetro de membro de instância ausente
ru: Добавить отсутствующий параметр экземплярного элемента
tr: Eksik örnek üye parametresini ekleyin
zh_hans: 添加缺少的实例成员参数
zh_hant: 新增缺少的執行個體成員參數

source: Add 'new' keyword
cs: Přidejte klíčové slovo new.
de: Schlüsselwort "new" hinzufügen
es: Agregar "nueva" palabra clave
fr: Ajouter le mot clé 'new'
it: Aggiungi la parola chiave 'new'
ja: 'new' キーワードを追加する
ko: 'new' 키워드 추가
pl: Dodaj słowo kluczowe „new”
pt_br: Adicionar a palavra-chave 'new'
ru: Добавить ключевое слово "new"
tr: 'new' anahtar sözcüğünü ekleme
zh_hans: 添加“新”关键字
zh_hant: 新增 'new' 關鍵字

source: Add return type annotation
cs: Přidat anotaci návratového typu
es: Agregar una anotación de tipo
it: Aggiungere annotazione di tipo restituito
ja: 戻り値の型の注釈の追加
ko: 반환 형식 주석 추가
pt_br: Adicionar anotação de tipo de retorno
ru: Добавить аннотацию типа возвращаемого значения
tr: Dönüş türü ek açıklaması ekle
zh_hans: 添加返回类型批注
zh_hant: 新增傳回類型註釋

source: Add type annotation
cs: Přidat anotaci typu
de: Typanmerkung hinzufügen
es: Agregar una anotación de tipo
fr: Ajouter une annotation de type
it: Aggiungere l'annotazione di tipo
ja: 型の注釈の追加
ko: 형식 주석 추가
pl: Dodaj adnotację typu
pt_br: Adicionar uma anotação de tipo
ru: Добавить заметку типа
tr: Tür ek açıklaması ekle
zh_hans: 添加类型注释
zh_hant: 新增型別註解

# AdvancedPageKeywords
source: Block Structure Guides; Show structure guidelines for F# code; Outlining; Show outlining and collapsible nodes for F# code; Inline hints; Display inline type hints (preview); Display return type hints (preview); Display inline parameter name hints (preview); Use Transparent Compiler (experimental); Live Buffers; Use live (unsaved) buffers for analysis
cs: Vodítka pro strukturu bloku; Zobrazit pokyny ke struktuře pro kód F#; Osnova; Zobrazit osnovu a sbalitelné uzly kódu F#; Vložené tipy; Zobrazit tipy pro vložený typ (náhled); Zobrazit tipy pro návratový typ (náhled); Zobrazit nápovědy k názvům vložených parametrů (náhled); Použít transparentní kompilátor (experimentální); Živé vyrovnávací paměti; Použití živých (neuložených) vyrovnávacích pamětí pro analýzu
es: Guías de estructura de bloques; Mostrar guías de estructura para código F#; Esquema; Mostrar esquema y nodos colapsables para código F#; Sugerencias insertadas; Mostrar sugerencias de tipo insertadas (vista previa); Mostrar sugerencias de tipo de valor devuelto (vista previa); Mostrar sugerencias de nombres de parámetro insertadas (vista previa) Usar compilador transparente (experimental); Búferes activos; Usar búferes activos (no guardados) para el análisis
it: Guide per strutture a blocchi; Mostra le linee guida per la struttura per il codice F#; Struttura; Mostra i nodi struttura e comprimibili per il codice F#; Suggerimenti inline; Visualizza suggerimenti di tipo inline (anteprima); Visualizza suggerimenti di tipo restituito (anteprima); Visualizza suggerimenti per i nomi di parametro inline (anteprima); Usa il compilatore Transparent (sperimentale); Buffer in tempo reale; Usa buffer in tempo reale (non salvati) per l'analisi
ja: ブロック構造のガイド; F# コードの構造のガイドラインを表示; アウトライン表示; F# コードのアウトラインおよび折りたたみ可能なノードを表示する; インライン ヒント; インライン型のヒントを表示する (プレビュー); 戻り値型のヒントを表示する (プレビュー); インライン パラメーター名のヒントを表示 (プレビュー); Transparent Compiler を使用する (試験段階); ライブ バッファー; 分析にライブ (未保存) バッファーを使用する
ko: 블록 구조 가이드; F# 코드에 대한 구조 지침 표시; 개요; F# 코드에 대한 개요 및 축소 가능한 노드 표시; 인라인 힌트; 인라인 형식 힌트 표시(미리 보기); 반환 형식 힌트 표시(미리 보기); 인라인 매개 변수 이름 힌트 표시(미리 보기); 투명한 컴파일러 사용(실험적); 라이브 버퍼; 분석에 라이브(저장되지 않은) 버퍼 사용
pt_br: Guias de Estrutura de Bloco; Mostrar diretrizes de estrutura para código F#; Esboço; Mostrar nós de estrutura de tópicos e recolhíveis para código F#; Dicas em linha; Exibir as dicas de tipo em linha (versão prévia); Exibir as dicas de tipo de retorno (versão prévia); Exibir dicas de nome de parâmetro embutido (versão prévia); Use o Compilador Transparente (experimental); Buffers Dinâmicos; Usar buffers dinâmicos (não salvos) para análise
ru: Руководства по блочной структуре; Показать рекомендации по структуре кода F#; Структурирование; Показать структурные и сворачиваемые узлы кода F#; Встроенные подсказки; Отображать подсказки встроенного типа (предварительная версия); Отображать подсказки типа возвращаемого значения (предварительная версия); Отображать подсказки имен встроенных параметров (предварительная версия); Использовать прозрачный компилятор (экспериментальная функция); Динамические буферы; Использовать динамические (несохраненные) буферы для анализа
tr: Blok Yapısı Kılavuzları; F# kodu için yapı yönergelerini göster; Ana hat oluşturma; F# kodu için ana hattı ve daraltılabilir düğümleri göster; Satır içi ipuçları; Satır içi tür ipuçlarını görüntüle (önizleme); Dönüş türü ipuçlarını görüntüle (önizleme); Satır içi parametre adı ipuçlarını görüntüle (önizleme); Saydam Derleyiciyi kullan (deneysel); Canlı Arabellekler; Analiz için canlı (kaydedilmemiş) arabellekleri kullan
zh_hans: 块结构指南； 显示 F# 代码的结构指南； 概述； 显示 F# 代码的大纲显示节点和可折叠节点； 内联提示； 显示内联类型提示(预览)； 显示返回类型提示(预览)； 显示内联参数名称提示(预览版)； 使用透明编译器(实验性)； 实时缓冲区； 使用实时(未保存)缓冲区进行分析
zh_hant: 區塊結構指南; 顯示 F# 程式碼的結構指南; 大綱; 顯示 F# 程式碼的大綱與可摺疊的節點; 內嵌提示; 顯示內嵌類型提示 (預覽); 顯示傳回型別提示 (預覽); 顯示內嵌參數名稱提示 (預覽); 使用透明編譯器 (實驗性); 即時緩衝區; 使用即時 (未儲存) 緩衝區進行分析

# ChangeEqualsInFieldTypeToColon
source: Use ':' for type in field declaration
cs: Pro typ v deklaraci pole použijte „:“
es: Usar “:” para el tipo en la declaración de campo
it: Use ":" per il tipo nella dichiarazione di campo
ja: フィールド宣言の型に ':' を使用する
ko: 필드 선언의 형식에 ':' 사용
pt_br: Usar ":" para tipo na declaração de campo
ru: Использовать ":" для обозначения типа в объявлении поля
tr: Alan bildirimindeki tür için ':' kullan
zh_hans: 对字段声明中的类型使用 ":"
zh_hant: 請在欄位宣告中使用 ':' 作為類型

# CodeFixesPageKeywords
source: Simplify names (remove unnecessary qualifiers); Always place open statements at the top level; Remove unused open statements; Analyze and suggest fixes for unused values; Suggest names for unresolved identifiers;
cs: Zjednodušení názvů (odebrání nepotřebných kvalifikátorů); Vždy umístit otevřené příkazy na nejvyšší úrovni; Odebrat nepoužívané otevřené příkazy; Analyzovat a navrhovat opravy pro nepoužívané hodnoty; Navrhnout názvy pro nerozpoznané identifikátory;
es: Simplificar nombres (quitar calificadores innecesarios); Colocar siempre las instrucciones abiertas en el nivel superior; Quitar instrucciones abiertas sin usar; Analizar y sugerir correcciones para valores no usados; Sugerir nombres para identificadores sin resolver;
it: Semplifica i nomi (rimuovere qualificatori non necessari); Posiziona sempre le istruzioni open al primo livello; Rimuovi le istruzioni open non usate; Analizza e suggerisci le correzioni per i valori inutilizzati; Suggerisci i nomi per gli identificatori non risolti;
ja: 名前を簡略化します (不要な修飾子を削除する); 常に open ステートメントを最上位レベルに配置します。 未使用の open ステートメントを削除します。 未使用の値の修正を分析して提案します。 未解決の識別子の名前を提案します;
ko: 이름 간소화(불필요한 한정자 제거), 항상 최상위 수준에 open 문 배치, 사용되지 않는 열린 문을 제거, 사용되지 않는 값에 대한 수정 사항 분석 및 제안, 확인되지 않은 식별자의 이름 제안,
pt_br: Simplificar nomes (remover qualificadores desnecessários); Sempre colocar instruções abertas no nível superior; Remover instruções abertas não utilizadas; Analisar e sugerir correções para valores não utilizados; Sugerir nomes para identificadores não resolvidos;
ru: Упростить имена (удалить ненужные квалификаторы); Всегда располагать открытые операторы на верхнем уровне; Удалить неиспользуемые открытые операторы; Анализировать и предлагать исправления для неиспользуемых значений; Предлагать имена для неразрешенных идентификаторов;
tr: Adları basitleştir (gereksiz niteleyicileri kaldır); Açık deyimleri her zaman en üst düzeye yerleştir; Kullanılmayan açık deyimleri kaldır; Kullanılmayan değerleri analiz et ve bunlara düzeltmeler öner; Çözümlenmemiş tanımlayıcılar için ad öner;
zh_hans: 简化名称(移除不必要的限定符)； 始终将 open 语句置于顶层； 移除未使用的 open 语句； 分析未使用的值并提出修复建议； 建议适用于未解析标识符的名称；
zh_hant: 簡化名稱 (移除不必要的辨識符號); 一律將開啟語句放置在最上層; 移除未使用的開啟語句; 分析並建議未使用值的修正; 建議未解析識別碼的名稱;

# ConvertCSharpUsingToFSharpOpen
source: Convert C# 'using' to F# 'open'
cs: Převést C# „using“ na F# „open“
es: Convertir C# 'using' en F# 'open'
it: Convertire 'using' di C# in F# 'open'
ja: C# 'using' を F# 'open' に変換する
ko: C# 'using'을 F# 'open'으로 변환
pt_br: Converter 'using' de C# em 'open' de F#
ru: Преобразовать "using" C# в "open" F#
tr: C# 'using' sözcüğünü F# 'open' sözcüğüne dönüştür
zh_hans: 将 C# “using” 转换为 F# “open”
zh_hant: 將 C# 'using' 轉換為 F# 'open'

source: Convert to Anonymous Record
cs: Převést na anonymní záznam
de: In anonymen Datensatz konvertieren
es: Convertir en registro anónimo
fr: Convertir en enregistrement anonyme
it: Converti in record anonimo
ja: 匿名レコードに変換
ko: 익명 레코드로 변환
pl: Konwertuj na rekord anonimowy
pt_br: Converter em Registro Anônimo
ru: Преобразовать в анонимную запись
tr: Anonim Kayda Dönüştür
zh_hans: 转换为匿名记录
zh_hant: 轉換為匿名記錄

# ConvertToNotEqualsEqualityExpression
source: Use '<>' for inequality check
cs: Pro kontrolu nerovnosti použijte <>.
de: "<>" für die Überprüfung auf Ungleichheit verwenden
es: Usar "<>" para la comprobación de desigualdad
fr: Utiliser '<>' pour vérifier l'inégalité
it: Usare '<>' per il controllo di disuguaglianza
ja: 非等値のチェックには '<>' を使用します
ko: 같지 않음 검사에 '<>' 사용
pl: Użyj operatora „<>” do sprawdzenia nierówności
pt_br: Usar '<>' para a verificação de desigualdade
ru: Используйте "<>" для проверки на неравенство
tr: Eşitsizlik denetimi için '<>' kullanın
zh_hans: 使用 "<>" 进行不相等检查
zh_hant: 使用 '<>' 進行不等式檢查

# ConvertToSingleEqualsEqualityExpression
source: Use '=' for equality check
cs: Pro kontrolu rovnosti použijte =.
de: "=" für Gleichheitsüberprüfung verwenden
es: Usar "=" para la comprobación de igualdad
fr: Utiliser '=' pour vérifier l'égalité
it: Usare '=' per il controllo di uguaglianza
ja: 等値性のチェックには '=' を使用します
ko: 같음 검사에 '=' 사용
pl: Użyj znaku „=” w celu sprawdzenia równości
pt_br: Usar '=' para verificação de igualdade
ru: Используйте "=" для проверки равенства
tr: Eşitlik denetimi için '=' kullan
zh_hans: 使用 "=" 进行同等性检查
zh_hant: 使用 '=' 檢查是否相等

# ChangePrefixNegationToInfixSubtraction
source: Use subtraction instead of negation
cs: Použít místo negace odčítání
de: Subtraktion anstelle von Negation verwenden
es: Usar la resta en lugar de la negación
fr: Utiliser la soustraction à la place de la négation
it: Usare la sottrazione invece della negazione
ja: 否定の代わりに減算を使用する
ko: 부정 대신 빼기 사용
pl: Użyj odejmowania zamiast negacji
pt_br: Use a subtração em vez da negação
ru: Используйте вычитание вместо отрицания.
tr: Negatif yapma yerine çıkarmayı kullanın
zh_hans: 使用减法代替求反
zh_hant: 使用減號代替否定

# FSharpDisposableLocalValuesClassificationType
source: F# Disposable Values (locals)
cs: Uvolnitelné hodnoty jazyka F# (místní)
de: Disposable-Werte in F# (lokal)
es: Valores de F# descartables (locales)
fr: Valeurs F# pouvant être supprimées (variables locales)
it: Valori eliminabili F# (variabili locali)
ja: F# の破棄可能な値 (ローカル)
ko: F# 삭제 가능한 값(로컬)
pl: Wartości możliwe do likwidacji języka F# (lokalne)
pt_br: Valores F# Descartáveis (locais)
ru: Освобождаемые значения F# (локальные)
tr: F# Atılabilir Değerleri (yereller)
zh_hans: F# 可释放值(局部值)
zh_hant: F# 可處置的值 (區域)

# FSharpDisposableTopLevelValuesClassificationType
source: F# Disposable Values (top-level)
cs: Uvolnitelné hodnoty jazyka F# (nejvyšší úroveň)
de: F# Verfügbare Werte (oberste Ebene)
es: Valores desechables en F# (nivel superior)
fr: Valeurs F# pouvant être supprimées (niveau supérieur)
it: Valori eliminabili F# (primo livello)
ja: F# の破棄可能な値 (トップレベル)
ko: F# 삭제 가능한 값(최상위 수준)
pl: Wartości możliwe do likwidacji języka F# (najwyższy poziom)
pt_br: Valores F# Descartáveis (nível superior)
ru: Освобождаемые значения F# (верхний уровень)
tr: F# Atılabilir Değerleri (üst düzey)
zh_hans: F# 可释放值(顶级)
zh_hant: F# 可處置的值 (最上層)

# FSharpDisposableTypesClassificationType
source: F# Disposable Types
cs: Jednoúčelové typy jazyka F#
de: Verwerfbare F#-Typen
es: Tipos descartables de F#
fr: Types F# pouvant être supprimés
it: Tipi eliminabili F#
ja: F# 破棄可能な型
ko: F# 삭제 가능한 형식
pl: Typu możliwe do likwidacji w języku F#
pt_br: Tipos Descartáveis do F#
ru: Высвобождаемые типы F#
tr: F# Atılabilir Türleri
zh_hans: F# 可释放类型
zh_hant: F# 可處置的類型

# FSharpFunctionsClassificationType
source: F# Functions
cs: Funkce jazyka F#
de: F#-Funktionen
es: Funciones de F#
fr: Fonctions F#
it: Funzioni F#
ja: F# 関数
ko: F# 함수
pl: Funkcje języka F#
pt_br: Funções F#
ru: Функции F#
tr: F# İşlevleri
zh_hans: F# 函数
zh_hant: F# 函式

# FormattingPageKeywords
source: Re-format indentation on paste (Experimental)
cs: Znovu naformátovat odsazení při vložení (experimentální)
es: Volver a aplicar formato a la sangría al pegar (experimental)
it: Riformattar il rientro dopo operazione incolla (sperimentale)
ja: 貼り付け時にインデントを再フォーマットする (試験段階)
ko: 붙여넣을 때 들여쓰기 서식 다시 지정(실험적)
pt_br: Reformatar o recuo na pasta (Experimental)
ru: Повторно форматировать отступы при вставке (экспериментальная функция)
tr: Yapıştırırken girintiyi yeniden biçimlendir (Deneysel)
zh_hans: 粘贴时重新设置缩进格式(实验)
zh_hant: 在貼上時重新格式化縮排 (實驗性)

source: Implement interface
cs: Implementujte rozhraní.
de: Schnittstelle implementieren
es: Implementar interfaz
fr: Implémenter l'interface
it: Implementa l'interfaccia
ja: インターフェイスを実装します。
ko: 인터페이스 구현
pl: Zaimplementuj interfejs
pt_br: Implementar a interface
ru: Реализовать интерфейс
tr: Arabirimi uygula
zh_hans: 实现接口
zh_hant: 實作介面

source: Implement interface without type annotation
cs: Implementujte rozhraní bez anotace typu.
de: Schnittstelle ohne Typanmerkung implementieren
es: Implementar interfaz sin anotación de tipos
fr: Implémenter l'interface sans annotation de type
it: Implementa l'interfaccia senza annotazione di tipo
ja: 型の注釈を指定しないでインターフェイスを実装する
ko: 형식 주석 없이 인터페이스 구현
pl: Zaimplementuj interfejs bez adnotacji typu
pt_br: Implementar a interface sem a anotação de tipo
ru: Реализовать интерфейс без заметки с типом
tr: Tür ek açıklaması olmadan arabirim uygulama
zh_hans: 无类型批注的实现接口
zh_hant: 實作沒有類型註釋的介面

# IntelliSensePageKeywords
source: Completion Lists; Show completion list after a character is deleted; Show completion list after a character is typed; Show symbols in unopened namespaces; Enter key behavior; Never add new line on enter; Only add new line on enter after end of fully typed word; Always add new line on enter;
cs: Seznamy pro doplňování; Zobrazit seznam pro doplňování po odstranění znaku; Zobrazit seznam pro doplňování po zadání znaku; Zobrazit symboly v neotevřených názvových prostorech; Zadejte chování kláves; Nikdy nepřidávat nový řádek při stisknutí klávesy Enter; Přidat nový řádek pouze po zadání za konec plně zadaného slova; Vždy přidat nový řádek při stisknutí klávesy Enter;
es: Listas de finalización; Mostrar lista de finalización después de eliminar un carácter; Mostrar lista de finalización después de escribir un carácter; Mostrar símbolos en espacios de nombres sin abrir; Escribir el comportamiento de la tecla; No agregar nunca una nueva línea al pulsar Intro; Agregar solo una nueva línea al pulsar Intro después del final de la palabra totalmente escrita; Agregar siempre una nueva línea al pulsar Intro;
it: Elenchi di completamento; Mostra elenco di completamento dopo l'eliminazione di un carattere; Mostra elenco di completamento dopo la digitazione di un carattere; Mostra simboli negli spazi dei nomi non aperti; Immetti comportamento chiave; Non aggiungere mai una nuova riga su Invio; Aggiungi nuova riga su Invio solo dopo aver digitato la parola completa; Aggiungi sempre nuova riga su Invio;
ja: 入力候補リスト; 文字が削除された後に完了リストを表示します。 文字が入力された後に入力候補一覧を表示します。 開かれていない名前空間にシンボルを表示します。 キーの動作を入力します。 Enter キーで改行を追加しないでください。 完全に入力された単語の末尾の後に Enter キーで改行を追加します。 常に Enter キーを押して新しい行を追加します。
ko: 완료 목록, 문자가 삭제된 후 완성 목록 표시, 문자를 입력한 후 완성 목록 표시, 열지 않은 네임스페이스에 기호 표시, 키 동작 입력, <Enter> 키를 누를 때 새 줄을 추가하지 않음, 완전히 입력된 단어의 끝 뒤에 Enter 키를 누를 때만 새 줄 추가, Enter 키를 누를 때 항상 새 줄 추가,
pt_br: Listas de Conclusão; Mostrar a lista de conclusão após a exclusão de um caractere; Mostrar a lista de conclusão depois que um caractere for digitado; Mostrar símbolos em namespaces não abertos; Inserir o comportamento da tecla; Nunca adicionar uma nova linha ao pressionar Enter; Somente adicionar uma nova linha ao pressionar Enter após digitar toda a palavra; Sempre adicionar uma nova linha ao pressionar Enter;
ru: Списки завершения; Показывать список завершения после удаления символа; Показывать список завершения после ввода символа; Показывать символы в неоткрытых пространствах имен; Поведение при нажатии клавиши ВВОД; Никогда не добавлять новую строку при нажатии клавиши ВВОД; Добавлять новую строку при нажатии клавиши ВВОД только в конце полностью введенного слова; Всегда добавлять новую строку при нажатии клавиши ВВОД;
tr: Tamamlama Listeleri; Bir karakter silindikten sonra tamamlama listesini göster; Bir karakter yazıldıktan sonra tamamlama listesini göster; Açılmamış ad alanlarında simgeleri göster; Enter tuşu davranışı; Enter tuşunda hiçbir zaman yeni satır ekleme; Yalnızca tam olarak yazılan sözcükten sonra basılan Enter tuşunda için yeni satır ekle; Enter tuşunda her zaman yeni satır ekle;
zh_hans: 完成列表； 删除字符后显示完成列表； 键入字符后显示完成列表； 在未打开的命名空间中显示符号； Enter 键行为； 从不在 Enter 上添加新行； 仅在完全键入的单词结尾后在 Enter 上添加新行； 始终在 Enter 上添加新行；
zh_hant: 完成清單; 刪除字元後顯示完成清單; 輸入字元後顯示完成清單; 在未開啟的命名空間中顯示符號; 輸入金鑰行為; 在按 ENTER 時永不新增新行; 只在完整輸入文字的結尾之後才在按 ENTER 時新增新行; 按 ENTER 時一律新增新行;

source: Make declaration 'mutable'
cs: Nastavte deklaraci jako mutable.
de: Deklaration "änderbar" machen
es: Convertir la declaración en "mutable"
fr: Rendre la déclaration 'mutable'
it: Impostare la dichiarazione come 'mutable'
ja: 'mutable' を宣言する
ko: 선언을 '변경 가능'으로 지정
pl: Nadaj deklaracji właściwość „mutable”
pt_br: Fazer com que a declaração seja 'mutable'
ru: Сделайте объявление "изменяемым"
tr: Bildirimi 'mutable' yapın
zh_hans: 将声明设为“可变”
zh_hant: 將宣告設定為「可變動」

# MakeOuterBindingRecursive
source: Make '{0}' recursive
cs: Nastavit {0} jako rekurzivní
de: "{0}" als rekursiv festlegen
es: Convertir el elemento "{0}" en recursivo
fr: Rendre '{0}' récursif
it: Imposta '{0}' come ricorsivo
ja: '{0}' を再帰的にする
ko: '{0}'을(를) 재귀적으로 만들기
pl: Zmień element „{0}” w cykliczny
pt_br: Tornar '{0}' recursiva
ru: Сделать "{0}" рекурсивным
tr: '{0}' bağlamasını özyinelemeli yap
zh_hans: 使 "{0}" 递归
zh_hant: 將 '{0}' 設為遞迴

# PerformancePageKeywords
source: F# Project and Caching Performance Options; Enable in-memory cross project references; Enable_partial_type_checking; IntelliSense Performance Options; Enable stale data for IntelliSense features; Time until stale results are used (in milliseconds); Parallelization (requires restart); Enable parallel type checking with signature files; Enable parallel reference resolution; Enable fast find references & rename (restart required)
cs: Možnosti výkonu pro ukládání do mezipaměti a projekt F#; Povolit odkazy mezi projekty v paměti; Povolit_částečnou_kontrolu_typu; Možnosti výkonu pro IntelliSense; Povolit zastaralá data pro funkce IntelliSense; Doba, do kdy se budou používat zastaralé výsledky (v milisekundách); Paralelizace (vyžaduje restartování); Povolit paralelní kontrolu typů pomocí souborů podpisu; Povolit paralelní referenční rozlišení; Povolit odkazy rychlého hledání a přejmenování (vyžaduje se restartování); Výsledky analýzy mezipaměti (experimentální)
it: Opzioni per le prestazioni di memorizzazione nella cache e progetti F#; _Abilita i riferimenti tra progetti in memoria; Abilita il controllo parziale dei tipi; Opzioni per le prestazioni IntelliSense; Abilita dati non aggiornati per le funzionalità IntelliSense; Intervallo di utilizzo dei risultati non aggiornati (in millisecondi); Parallelizzazione (richiede il riavvio); Abilitare il controllo dei tipi paralleli con i file di firma; Abilitare risoluzione riferimenti paralleli; Abilitare i riferimenti di ricerca rapida > ridenominazione (riavvio necessario); Risultati dell'analisi della cache (sperimentale)
ru: Параметры производительности проекта и кэширования F#; Включить перекрестные ссылки проектов в памяти; Enable_partial_type_checking; Параметры производительности IntelliSense; Включите устаревшие данные для функций IntelliSense; Время до использования устаревших результатов (в миллисекундах); Распараллеливание (требуется перезагрузка); Включить параллельную проверку типов с файлами сигнатур; Включить параллельное разрешение ссылок; Включить быстрый поиск ссылок и переименование (требуется перезагрузка); Результаты анализа кэша (экспериментальная функция)
tr: F# Proje ve Önbelleğe Alma Performansı Seçenekleri; Bellek içi çapraz proje başvurularını etkinleştir; Kısmi_tür_denetlemeyi_etkinleştir; IntelliSense Performans Seçenekleri; IntelliSense özellikleri için eski verileri etkinleştir; Eski sonuçların kullanılması için geçecek süre (milisaniye cinsinden); Paralelleştirme (yeniden başlatma gerektirir); İmza dosyalarıyla paralel tür denetlemeyi etkinleştir; Paralel başvuru çözümlemeyi etkinleştir; Başvuruları hızlı bulmayı ve yeniden adlandırmayı etkinleştir (yeniden başlatma gerektirir); Ayrıştırma sonuçlarını önbelleğe al (deneysel)

# PrefixValueNameWithUnderscore
source: Prefix '{0}' with underscore
cs: Před {0} vložte podtržítko.
de: "{0}" einen Unterstrich voranstellen
es: Colocar un carácter de subrayado delante de "{0}"
fr: Faire précéder '{0}' d'un trait de soulignement
it: Anteponi a '{0}' un carattere di sottolineatura
ja: アンダースコアが含まれているプレフィックス '{0}'
ko: 밑줄이 있는 '{0}' 접두사
pl: Prefiks „{0}” ze znakiem podkreślenia
pt_br: Prefixo '{0}' sem sublinhado
ru: Добавить символ подчеркивания как префикс "{0}"
tr: '{0}' öğesinin önüne alt çizgi ekleme
zh_hans: 带下划线的前缀“{0}”
zh_hant: 有底線的前置詞 '{0}'
