Repository: dotnet/fsharp
Catalog: vsintegration/src/FSharp.Editor/xlf/FSharp.Editor.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# QuickInfoPageKeywords
source: Formatting; Preferred description width in characters; Format signature to the given width by adding line breaks conforming with F# syntax rules; Navigation links; Show navigation links as; Solid underline; Dot underline; Dash underline; Show remarks in Quick Info
cs: Formátování; Upřednostňovaná šířka popisu ve znacích; Umožňuje formátovat podpis na danou šířku přidáním konců řádků odpovídajících pravidlům syntaxe F#; Navigační odkazy; Zobrazit navigační odkazy jako; Plné podtržení; Tečkované podtržení; Čárkované podtržení; Zobrazit poznámky v Rychlých informacích
es: Formateando; Anchura preferida de la descripción en caracteres; Da formato a la firma al ancho dado agregando saltos de línea conforme a las reglas de sintaxis de F#; Vínculos de navegación; Mostrar vínculos de navegación como; Subrayado sólido; Subrayado de puntos; Subrayado guion; Mostrar comentarios en Información rápida
it: Formattazione; Larghezza descrizione preferita in caratteri; Consente di formattare la firma in base alla larghezza specificata aggiungendo interruzioni di riga conformi alle regole di sintassi F#; Collegamenti di navigazione; Mostra collegamenti di navigazione come; Sottolineatura continua; Sottolineatura punto; Sottolineatura tratteggiata; Mostra i commenti in Informazioni rapide
ja: 書式設定; 優先する説明の文字幅; F# 構文規則に準拠した改行を追加して、署名を指定された幅に書式設定する; ナビゲーション リンク; 次としてナビゲーション リンクを表示; 実線の下線; ドットの下線; 破線の下線; クイック ヒントに注釈を表示する
ko: 서식; 기본 설정 설명 너비(문자); F# 구문 규칙에 맞는 줄 바꿈을 추가하여 지정된 너비에 시그니처의 서식 지정; 탐색 링크; 탐색 링크를 다음으로 표시; 실선 밑줄; 점 밑줄; 대시 밑줄; 요약 정보에 설명 표시
pt_br: Formatação; Largura de descrição preferencial em caracteres; Formate a assinatura para a largura fornecida adicionando quebras de linha em conformidade com as regras de sintaxe de F#; Links de navegação; Exibir link de navegação como; Sublinhado sólido; Sublinhado pontilhado; Sublinhado tracejado; Mostrar os comentários nas Informações Rápidas
ru: Форматирование; Предпочтительная ширина описания в символах; Отформатируйте подпись до заданной ширины, добавив разрывы строк в соответствии с правилами синтаксиса F#; Навигационные ссылки; Показывать навигационные ссылки как; Сплошное подчеркивание; Точка подчеркивания; Подчеркивание тире; Показать заметки в кратких сведениях
tr: Biçimlendirme; Karakter olarak tercih edilen açıklama genişliği; F# söz dizimi kurallarına uyan satır sonları ekleyerek imzayı belirtilen genişliğe biçimlendir; Gezinti bağlantıları; Gezinti bağlantılarını farklı göster; Kesintisiz alt çizgi; Nokta alt çizgi; Tire alt çizgi; Açıklamaları Hızlı Bilgide göster
zh_hans: 格式设置； 以字符为单位的首选说明宽度； 通过添加符合 F# 语法规则的换行符，将签名设置为给定宽度的格式； 导航链接； 导航链接显示方式； 实线下划线； 点下划线； 短线下划线； 在快速信息中显示备注
zh_hant: 格式化; 慣用説明寬度 (以字元為單位); 透過新增符合 F# 語法規則的分行符號，將簽章格式設定為指定寬度; 導覽連結; 顯示導覽連結為; 實線底線; 點線底線; 虛點底線; 在快速諮詢中顯示備註

# RemarksHeader
source: Remarks:
cs: Poznámky:
es: Comentarios:
it: Note:
ja: 注釈:
ko: 설명:
pt_br: Comentários:
ru: Комментарии:
tr: Açıklamalar:
zh_hans: 注解:
zh_hant: 備註:

source: Remove 'return'
cs: Odebrat return
de: "return" entfernen
es: Quitar "return"
fr: Supprimer 'return'
it: Rimuovi 'return'
ja: 'return' の削除
ko: 'return' 제거
pl: Usuń element „return”
pt_br: Remover 'return'
ru: Удалить "return"
tr: 'return' öğesini kaldır
zh_hans: 删除 "return"
zh_hant: 移除 'return'

# RemoveReturnBang
source: Remove 'return!'
cs: Odebrat return!
de: "return!" entfernen
es: Quitar "return!"
fr: Supprimer 'return!'
it: Rimuovi 'return!'
ja: 'return!' の削除
ko: 'return!' 제거
pl: Usuń element „return!”
pt_br: Remover 'return!'
ru: Удалить "return!"
tr: 'return!' öğesini kaldır
zh_hans: 删除 "return!"
zh_hant: 移除 'return!'

source: Remove unnecessary parentheses
cs: Odebrat nadbytečné závorky
es: Quitar los paréntesis innecesarios
it: Rimuovi le parentesi non necessarie
ja: 不要なかっこの削除
ko: 불필요한 괄호 제거
pt_br: Remover os parênteses desnecessários
ru: Удалить ненужные круглые скобки
tr: Gereksiz parantezleri kaldır
zh_hans: 移除不必要的括号
zh_hant: 移除不必要的括號

source: Remove unused binding
cs: Odebrat nepoužívanou vazbu
de: Nicht verwendete Bindung entfernen
es: Quitar el enlace no usado
fr: Supprimer la liaison inutilisée
it: Rimuovi il binding inutilizzato
ja: 使用されていないバインドの削除
ko: 사용되지 않는 바인딩 제거
pl: Usuń nieużywane powiązanie
pt_br: Remover associação não usada
ru: Удалить неиспользуемую привязку
tr: Kullanılmayan bağlamayı kaldır
zh_hans: 删除未使用的绑定
zh_hant: 移除未使用的繫結

source: Remove 'yield'
cs: Odebrat yield
de: "yield" entfernen
es: Quitar "yield"
fr: Supprimer 'yield'
it: Rimuovi 'yield'
ja: 'yield' の削除
ko: 'yield' 제거
pl: Usuń element „yield”
pt_br: Remover 'yield'
ru: Удалить "yield"
tr: 'yield' öğesini kaldır
zh_hans: 删除 "yield"
zh_hant: 移除 'yield'

# RemoveYieldBang
source: Remove 'yield!'
cs: Odebrat yield!
de: "yield!" entfernen
es: Quitar "yield!"
fr: Supprimer 'yield!'
it: Rimuovi 'yield!'
ja: 'yield!' の削除
ko: 'yield!' 제거
pl: Usuń element „yield!”
pt_br: Remover 'yield!'
ru: Удалить "yield!"
tr: 'yield!' ifadesini kaldır
zh_hans: 删除 "yield!"
zh_hant: 移除 'yield!'

# RenameValueToUnderscore
source: Rename '{0}' to '_'
cs: Přejmenujte {0} na _.
de: "{0}" in "_" umbenennen
es: Cambiar nombre de "{0}" por "_"
fr: Renommer '{0}' en '_'
it: Rinomina '{0}' in '_'
ja: '{0}' から '_' に名前を変更する
ko: '{0}'의 이름을 '_'로 바꾸기
pl: Zmień nazwę z „{0}” na „_”
pt_br: Renomear '{0}' para '_'
ru: Переименовать "{0}" в "_"
tr: '{0}' öğesini '_' olarak yeniden adlandırma
zh_hans: 将“{0}”重命名为“_”
zh_hant: 將 '{0}' 重新命名為 '_'

# ReturnsHeader
source: Returns:
cs: Vrací:
es: Devuelve:
it: Restituisce:
ja: 戻り値:
ko: 반환 값:
pt_br: Retorna:
ru: Возврат:
tr: Şunu döndürür:
zh_hans: 返回:
zh_hant: 傳回:

source: Simplify name
cs: Zjednodušte název.
de: Namen vereinfachen
es: Simplificar nombre
fr: Simplifier le nom
it: Semplifica nome
ja: 名前を単純化する
ko: 이름 단순화
pl: Uprość nazwę
pt_br: Simplificar o nome
ru: Упростить имя
tr: Adı basitleştirme
zh_hans: 简化名称
zh_hant: 簡化名稱

source: Name can be simplified.
cs: Název může být zjednodušený.
de: Der Name kann vereinfacht werden.
es: El nombre se puede simplificar.
fr: Le nom peut être simplifié.
it: Il nome può essere semplificato.
ja: 名前を簡略化できます。
ko: 이름은 간단하게 줄일 수 있습니다.
pl: Nazwa może zostać uproszczona.
pt_br: Nome pode ser simplificado.
ru: Имя может быть упрощено.
tr: Ad basitleştirilebilir.
zh_hans: 可以简化名称。
zh_hant: 可以簡化名稱。

# FSharpMutableVarsClassificationType
source: F# Mutable Variables / Reference Cells
cs: Měnitelné proměnné / referenční buňky jazyka F#
de: Änderbare F#-Variablen/Verweiszellen
es: Variables mutables y celdas de referencia de F#
fr: Variables mutables / Cellules de référence F#
it: Variabili modificabili/Celle di riferimento F#
ja: F# 変更可能な変数 / 参照セル
ko: F# 변경할 수 있는 변수/참조 셀
pl: Zmienne modyfikowalne/komórki odwołania w języku F#
pt_br: Variações Mutáveis/Células de Referência do F#
ru: Изменяемые переменные и ссылочные ячейки F#
tr: F# Değiştirilebilir Değişkenleri / Başvuru Hücreleri
zh_hans: F# 可变变量/引用单元格
zh_hant: F# 可變動變數 / 參考儲存格

# FSharpPrintfFormatClassificationType
source: F# Printf Format
cs: Formát Printf jazyka F#
es: Formato Printf de F#
fr: Format Printf F#
it: Formato printf F#
ja: F# Printf 形式
ko: F# Printf 형식
pl: Format Printf w języku F#
pt_br: Formato de Impressão do F#
ru: Формат Printf в F#
tr: F# Printf Biçimi
zh_hans: F# Printf 格式
zh_hant: F# Printf 格式

# FSharpPropertiesClassificationType
source: F# Properties
cs: Vlastnosti jazyka F#
de: F#-Eigenschaften
es: Propiedades de F#
fr: Propriétés F#
it: Proprietà F#
ja: F# プロパティ
ko: F# 속성
pl: Właściwości w języku F#
pt_br: Propriedades do F#
ru: Свойства F#
tr: F# Özellikleri
zh_hans: F# 属性
zh_hant: F# 屬性

# RemoveUnusedOpens
source: Remove unused open declarations
cs: Odeberte nepoužité otevřené deklarace.
de: Nicht verwendete open-Deklarationen entfernen
es: Quitar declaraciones abiertas no usadas
fr: Supprimer les déclarations open inutilisées
it: Rimuovi dichiarazioni OPEN inutilizzate
ja: 未使用の Open 宣言を削除する
ko: 사용하지 않는 열려 있는 선언 제거
pl: Usuń nieużywane otwarte deklaracje
pt_br: Remover declarações abertas não usadas
ru: Удалить неиспользуемые открытые объявления
tr: Kullanılmayan açık bildirimleri kaldır
zh_hans: 删除未使用的 open 声明
zh_hant: 移除未使用的公開宣告

# UnexpectedEqualsInFieldExpectedColon
source: Unexpected symbol '=' in field declaration. Expected ':' or other token.
cs: Neočekávaný symbol „=“ v deklaraci pole. Očekával se token „:“ nebo nějaký jiný.
es: Símbolo inesperado “=” en la declaración de campo. Se esperaba “:” u otro token.
it: Simbolo "=" imprevisto nella dichiarazione di campo. Previsto ":" o altro token.
ja: フィールド宣言で予期しないシンボル '=' が発生しました。':' またはその他のトークンが必要です。
ko: 필드 선언에 예기치 않은 기호 '='가 있습니다. ':' 또는 다른 토큰이 필요합니다.
pt_br: Símbolo inesperado "=" na declaração de campo. "." ou outro token é esperado.
ru: Непредвиденный символ "=" в объявлении поля. Требуется ":" или другая лексема.
tr: Alan bildiriminde beklenmeyen '=' sembolü. ':' veya başka bir belirteç bekleniyordu.
zh_hans: 字段声明中出现意外的符号 "="。应为 ":" 或其他标记。
zh_hant: 欄位宣告中有未預期的符號 '='。必須是 ':' 或其他語彙基元。

# UnusedOpens
source: Open declaration can be removed.
cs: Otevřenou deklaraci nelze odebrat.
de: Open-Deklaration kann nicht entfernt werden.
es: Las declaraciones abiertas se pueden quitar.
fr: La déclaration open peut être supprimée.
it: La dichiarazione OPEN può essere rimossa.
ja: Open 宣言は削除できます。
ko: 열려 있는 선언을 제거할 수 있습니다.
pl: Otwarte deklaracje można usuwać.
pt_br: A declaração aberta pode ser removida.
ru: Открытое объявление можно удалить.
tr: Açık bildirim kaldırılabilir.
zh_hans: 可删除 open 声明。
zh_hant: 可以移除公開宣告。

source: QuickInfo
cs: Stručné informace
it: Informazioni rapide

# AddAssemblyReference
source: Add an assembly reference to '{0}'
cs: Přidejte do {0} odkaz na sestavení.
de: Assemblyverweis auf "{0}" hinzufügen
es: Agregar una referencia de ensamblado a "{0}"
fr: Ajouter une référence d'assembly à '{0}'
it: Aggiungi un riferimento all'assembly a '{0}'
ja: アセンブリ参照を '{0}' に追加する
ko: '{0}'에 어셈블리 참조 추가
pl: Dodaj odwołanie do zestawu do „{0}”
pt_br: Adicionar uma referência de assembly para '{0}'
ru: Добавить ссылку на сборку в "{0}"
tr: '{0}' öğesine bir bütünleştirilmiş kod başvurusu ekleme
zh_hans: 添加对“{0}”的程序集引用
zh_hant: 新增組件參考至 '{0}'

# AddProjectReference
source: Add a project reference to '{0}'
cs: Přidejte do {0} odkaz na projekt.
de: Projektverweis auf "{0}" hinzufügen
es: Agregar una referencia de proyecto a "{0}"
fr: Ajouter une référence de projet à '{0}'
it: Aggiungi un riferimento al progetto a '{0}'
ja: プロジェクト参照を '{0}' に追加する
ko: '{0}'에 프로젝트 참조 추가
pl: Dodaj odwołanie do projektu do „{0}”
pt_br: Adicionar uma referência de projeto para '{0}'
ru: Добавить ссылку на проект в "{0}"
tr: '{0}' öğesine bir proje başvurusu ekleme
zh_hans: 添加对“{0}”的项目引用
zh_hant: 新增專案參考至 '{0}'

source: Code Fixes
cs: Opravy kódu
de: Codefehlerbehebungen
es: Correcciones de código
fr: Correctifs du code
it: Correzioni del codice
ja: コード修正
ko: 코드 수정 사항
pl: Poprawki kodu
pt_br: Correções de Código
ru: Исправления кода
tr: Kod Düzeltmeleri
zh_hans: 代码修补程序
zh_hant: 程式碼修正

source: Performance
cs: Výkon
de: Leistung
es: Rendimiento
fr: Performances
it: Prestazioni
ja: パフォーマンス
ko: 성능
pl: Wydajność
pt_br: Desempenho
ru: Производительность
tr: Performans
zh_hans: 性能
zh_hant: 效能

source: The value is unused
cs: Tato hodnota se nepoužívá.
de: Der Wert wird nicht verwendet.
es: El valor no se usa
fr: La valeur est inutilisée
it: Il valore è inutilizzato
ja: 値は使用されていません
ko: 값이 사용되지 않습니다.
pl: Wartość nie jest używana
pt_br: O valor é não usado
ru: Значение не используется
tr: Değer kullanılmıyor
zh_hans: 未使用该值
zh_hant: 未使用該值

# CannotDetermineSymbol
source: Cannot determine the symbol under the caret
cs: Nelze určit symbol pod stříškou.
de: Das Symbol unter dem Caretzeichen kann nicht ermittelt werden.
es: No se puede determinar el símbolo bajo el símbolo de intercalación
fr: Impossible de déterminer le symbole sous le point d'insertion
it: Non è possibile determinare il simbolo sotto il cursore
ja: キャレットの下のシンボルを特定できません
ko: 캐럿에서 기호를 확인할 수 없습니다.
pl: Nie można określić symbolu pod karetką
pt_br: Não é possível determinar o símbolo sob o acento circunflexo
ru: Не удается определить символ под курсором
tr: İmlecin altındaki simge belirlenemiyor
zh_hans: 无法确定插入点下的符号
zh_hant: 無法決定插入點下的符號

# CannotNavigateUnknown
source: Cannot navigate to the requested location
cs: Nelze přejít na požadované umístění.
de: Die Navigation zum angeforderten Standort ist nicht möglich.
es: No se puede navegar a la ubicación solicitada
fr: Impossible de naviguer à l'emplacement demandé
it: Non è possibile passare alla posizione richiesta
ja: 要求された場所に移動できません
ko: 요청된 위치로 이동할 수 없습니다.
pl: Nie można przejść do żądanej lokalizacji
pt_br: Não é possível navegar para a localização solicitada
ru: Не удается перейти в запрошенное расположение
tr: İstenen konuma gidilemiyor
zh_hans: 无法转到到所需位置
zh_hant: 無法瀏覽至要求的位置

# LocatingSymbol
source: Locating the symbol under the caret...
cs: Vyhledává se symbol pod stříškou...
de: Das Symbol unter dem Caretzeichen wird gesucht...
es: Buscando el símbolo bajo el símbolo de intercalación...
fr: Localisation du symbole sous le point d'insertion...
it: Individuazione del simbolo sotto il cursore...
ja: キャレットの下のシンボルを検索しています...
ko: 캐럿에서 기호를 찾는 중...
pl: Trwa lokalizowanie symbolu pod karetką...
pt_br: Localizando o símbolo sob o acento circunflexo...
ru: Определяется символ под курсором...
tr: İmlecin altındaki simge bulunuyor...
zh_hans: 正在确定插入点下的符号...
zh_hant: 正在尋找插入點下的符號...

# NavigatingTo
source: Navigating to symbol...
cs: Přechází se na symbol...
de: Die Navigation zum Symbol wird durchgeführt...
es: Navegando al símbolo...
fr: Navigation vers le symbole...
it: Passaggio al simbolo...
ja: シンボルに移動しています...
ko: 기호로 이동 중...
pl: Trwa przechodzenie do symbolu...
pt_br: Navegando para o símbolo...
ru: Переход к символу...
tr: Simgeye gidiliyor...
zh_hans: 正在转到符号...
zh_hant: 正在瀏覽至符號...

# NavigateToFailed
source: Navigate to symbol failed: {0}
cs: Na symbol se nepodařilo přejít: {0}.
de: Fehler beim Navigieren zum Symbol: {0}
es: No se pudo navegar al símbolo: {0}
fr: Échec de la navigation vers le symbole : {0}
it: Il passaggio al simbolo non è riuscito: {0}
ja: シンボルへの移動に失敗しました: {0}
ko: 기호로 이동 실패: {0}
pl: Przejście do symbolu nie powiodło się: {0}
pt_br: Navegação para o símbolo com falha: {0}
ru: Не удалось перейти к символу: {0}
tr: Simgeye gidilemedi: {0}
zh_hans: 未能转到符号: {0}
zh_hant: 瀏覽至符號失敗: {0}

# ExceptionsHeader
source: Exceptions:
cs: Výjimky:
de: Ausnahmen:
es: Excepciones:
it: Eccezioni:
ja: 例外:
ko: 예외:
pl: Wyjątki:
pt_br: Exceções:
ru: Исключения:
tr: Özel Durumlar:
zh_hans: 异常:
zh_hant: 例外狀況:

# GenericParametersHeader
source: Generic parameters:
cs: Obecné parametry:
de: Generische Parameter:
es: Parámetros genéricos:
fr: Paramètres génériques :
it: Parametri generici:
ja: ジェネリック パラメーター:
ko: 제네릭 매개 변수:
pl: Parametry ogólne:
pt_br: Parâmetros genéricos:
ru: Универсальные параметры:
tr: Genel parametreler:
zh_hans: 泛型参数:
zh_hant: 泛型參數:

# RenameValueToDoubleUnderscore
source: Rename '{0}' to '__'
cs: Přejmenujte {0} na __.
de: "{0}" in "__" umbenennen
es: Cambiar nombre de "{0}" por "__"
fr: Renommer '{0}' en '__'
it: Rinomina '{0}' in '__'
ja: '{0}' から '__' に名前を変更する
ko: '{0}'의 이름을 '__'로 바꾸기
pl: Zmień nazwę z „{0}” na „__”
pt_br: Renomear '{0}' para '__'
ru: Переименовать "{0}" в "__"
tr: '{0}' öğesini '__' olarak yeniden adlandırma
zh_hans: 将“{0}”重命名为“__”
zh_hant: 將 '{0}' 重新命名為 '__'

source: Advanced
cs: Upřesnit
de: Erweitert
es: Opciones avanzadas
fr: Avancé
it: Avanzate
ja: 詳細
ko: 고급
pl: Zaawansowane
pt_br: Avançado
ru: Дополнительный
tr: Gelişmiş
zh_hans: 高级
zh_hant: 進階

source: Formatting
cs: Formátování
de: Formatierung
es: Formato
fr: Mise en forme
it: Formattazione
ja: 書式設定
ko: 서식
pl: Formatowanie
pt_br: Formatação
ru: Форматирование
tr: Biçimlendirme
zh_hans: 正在格式化
zh_hant: 格式化

# UseFSharpLambda
source: Use F# lambda syntax
cs: Použít syntaxi lambda jazyka F#
de: F#-Lambdasyntax verwenden
es: Usar la sintaxis lambda de F#
fr: Utiliser la syntaxe lambda F#
it: Usa la sintassi lambda di F#
ja: F# のラムダ構文を使用する
ko: F# 람다 구문 사용
pl: Użyj składni wyrażenia lambda języka F#
pt_br: Usar a sintaxe lambda F#
ru: Использовать синтаксис лямбда F#
tr: F# lambda söz dizimini kullan
zh_hans: 使用 F# lambda 语法
zh_hant: 使用 F# lambda 語法

# UseMutationWhenValueIsMutable
source: Use '<-' to mutate value
cs: Pokud chcete změnit hodnotu, použijte <-.
de: "<-" zum Ändern des Werts verwenden
es: Usar "<-" para mutar el valor
fr: Utiliser '<-' pour muter la valeur
it: Usare '<-' per modificare il valore
ja: '<-' を使用して値を変換する
ko: '<-'를 사용하여 값 변경
pl: Użyj znaku „<-” w celu zmodyfikowania wartości
pt_br: Usar '<-' para modificar o valor
ru: Используйте "<-", чтобы изменить значение
tr: Değeri değiştirmek için '<-' kullan
zh_hans: 使用 "<-" 来更改值
zh_hant: 使用 '<-' 來變動值

source: Use 'nameof'
cs: Použít nameof
de: "nameof" verwenden
es: Usar 'nameof'
fr: Utiliser « nameof »
it: Usa 'nameof'
ja: 'nameof' を使用する
ko: 'nameof' 사용
pl: Użyj wyrażenia "nameof"
pt_br: Usar 'nameof'
ru: Использовать "nameof"
tr: “Nameof” kullanın
zh_hans: 使用 "nameof"
zh_hant: 使用 'nameof'

# UseTripleQuotedInterpolation
source: Use triple quoted string interpolation.
cs: Použijte interpolaci řetězce v trojitých uvozovkách.
de: Verwenden Sie die Interpolation von dreifachen Zeichenfolgen in Anführungszeichen.
es: Use la interpolación de cadenas entre comillas triples.
it: Usare l'interpolazione di stringhe con virgolette triple.
ja: 三重引用符で囲まれた文字列補間を使用します。
ko: 삼중 따옴표로 묶인 분자열 보간을 사용합니다.
pl: Użyj interpolacji ciągu z potrójnym cudzysłowem.
pt_br: Usar interpolação de cadeia de caracteres entre aspas triplas.
ru: Использовать интерполяции строк в тройных кавычках.
tr: Üçlü tırnak içine alınmış dize ilişkilendirmesini kullanın.
zh_hans: 使用三引号字符串内插。
zh_hant: 使用三引號字串插補。

# UseUpcastKeyword
source: Use 'upcast'
cs: Použijte upcast
de: "upcast" verwenden
es: Usar "upcast"
fr: Utiliser 'upcast'
it: Usare 'upcast'
ja: 'upcast' を使用する
ko: 'upcast' 사용
pl: Użyj operatora „upcast”
pt_br: Usar 'upcast'
ru: Используйте "upcast"
tr: 'upcast' kullan
zh_hans: 使用“向上转换”
zh_hant: 使用「向上轉型」

# UseUpcastOperator
source: Use ':>' operator
cs: Použijte operátor :>.
de: Operator ":>" verwenden
es: Usar el operador ":>"
fr: Utiliser l'opérateur ':>'
it: Usare l'operatore ':>'
ja: ':>' 演算子を使用する
ko: ':>' 연산자 사용
pl: Użyj operatora „:>”
pt_br: Usar o operador ':>'
ru: Используйте оператор ":>"
tr: ':>' operatörünü kullan
zh_hans: 使用 ":>" 运算符
zh_hant: 使用 ':>' 運算子

# UseNotForNegation
source: Use 'not' to negate expression
cs: Negovat výraz pomocí not
de: "not" zum Negieren eines Ausdruck verwenden
es: Usar "not" para negar la expresión
fr: Utiliser 'not' pour annuler l'expression
it: Usare 'not' per negare l'espressione
ja: 式を否定するには 'not' を使用する
ko: 식을 부정하려면 'not' 사용
pl: Użyj operatora „not”, aby zanegować wyrażenie
pt_br: Use 'not' para negar a expressão
ru: Используйте "not" для отрицания выражения.
tr: İfadeyi negatif yapmak için 'not' kullanın
zh_hans: 使用 "not" 对表达式求反
zh_hant: 使用 'not' 來否定運算式

# UseValueInsteadOfDeref
source: Use '.Value' to dereference expression
cs: Pokud chcete k výrazu přistupovat přes ukazatel, použijte .Value.
de: ".Value" zum Dereferenzieren eines Ausdrucks verwenden
es: Usar ".Value" para desreferenciar la expresión
fr: Utilisez '.Value' pour déréférencer l'expression
it: Usa '.Value' per dereferenziare l'espressione
ja: '.Value' を使用して式を逆参照する
ko: 식을 역참조하려면 '.Value' 사용
pl: Użyj elementu „.Value”, aby wyłuskać wyrażenie
pt_br: Use '.Value' para desreferenciar a expressão
ru: Использовать синтаксис ".значение" для разыменования выражения
tr: İfadeye başvurmak için '.Value' kullanın
zh_hans: 对取消引用表达式使用 ".Value"
zh_hant: 使用 '.Value' 擷取運算式的值

source: Wrap expression in parentheses
cs: Uzavřít výraz do závorek
de: Ausdruck in Klammern einschließen
es: Encapsular la expresión entre paréntesis
fr: Mettre l'expression entre parenthèses
it: Racchiudere l'espressione tra parentesi
ja: 式をかっこで囲む
ko: 식을 괄호로 래핑
pl: Ujmij wyrażenie w nawiasy
pt_br: Coloque a expressão entre parênteses
ru: Заключите выражение в круглые скобки.
tr: İfadeyi parantez içinde sarmalayın
zh_hans: 将表达式用括号括起来
zh_hant: 使用括弧包裝運算式

# PerformancePageKeywords
source: F# Project and Caching Performance Options; Enable in-memory cross project references; Enable_partial_type_checking; IntelliSense Performance Options; Enable stale data for IntelliSense features; Time until stale results are used (in milliseconds); Parallelization (requires restart); Enable parallel type checking with signature files; Enable parallel reference resolution; Enable fast find references & rename (restart required); Cache parsing results (experimental)
es: Opciones de rendimiento de almacenamiento en caché y proyectos de F#; Habilitar referencias entre proyectos en memoria; Enable_partial_type_checking; Opciones de rendimiento de IntelliSense; Habilitar datos obsoletos para características de IntelliSense; Tiempo hasta que se utilizan los resultados obsoletos (en milisegundos); Paralelización (requiere reiniciar); Habilitar la comprobación de tipos paralelos con archivos de firma; Habilitar resolución de referencias paralelas; Habilitar referencias de búsqueda rápida y cambio de nombre (es necesario reiniciar); Resultados del análisis de la caché (experimental)
ja: F# プロジェクトとキャッシュのパフォーマンス オプション; メモリ内のプロジェクト間参照を有効にする; Enable_partial_type_checking; IntelliSense のパフォーマンス オプション; IntelliSense 機能に対して古いデータを有効にする; 古い結果が使用されるまでの時間 (ミリ秒); 並列化 (再起動が必要); 署名ファイルを使用して並列型チェックを有効にする; 並列参照解決を有効にする; 高速検索参照と名前の変更を有効にする (再起動が必要); キャッシュ解析の結果 (試験段階)
pt_br: Projeto em F# e opções de desempenho em cache; _Habilitar referências de projeto cruzado na memória; Habilitar verificação parcial de tipo; Opções de desempenho do IntelliSense; Habilitar dados obsoletos para os recursos do IntelliSense; Tempo até que os resultados obsoletos sejam utilizados (em milissegundos); Paralelização (requer reinicialização); Habilitar a verificação de tipo paralelo com arquivos de assinatura; Habilitar a resolução de referência paralela; Habilitar referências de localização rápida e renomear (reinicialização necessária); Resultados da análise de cache (experimental)
zh_hans: F# 项目和缓存性能选项； 启用内存中跨项目引用； Enable_partial_type_checking; IntelliSense 性能选项； 为 IntelliSense 功能启用过时数据； 使用过时结果前等待的时间(以毫秒计)； 并行化(需要重启)； 使用签名文件启用并行类型检查； 启用并行引用解析； 启用快速查找引用和重命名(需要重新启动)； 缓存分析结果(实验性)
zh_hant: F# 專案與快取效能選項; 允許記憶體內跨專案參考; 啟用部分型別檢查; IntelliSense 效能選項; 為 IntelliSense 功能啟用過時資料; 使用過時結果前等待的時間 (毫秒); 平行處理 (需要重新啟動); 啟用簽章檔案的平行類型檢查; 啟用平行參考解析; 啟用快速尋找參考和重新命名 (需要重新啟動); 快取剖析結果 (實驗性)
