Repository: dotnet/fsharp
Catalog: vsintegration/ProjectTemplates/TutorialProject/Template/xlf/Tutorial.fsx.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# PrintUnitsOfMeasure
source: Values using Units of Measure can be used just like the primitive numeric type for things like printing.
cs: Hodnoty s měrnými jednotkami je možné používat stejně jako primitivní číselný typ pro operace, jako je tisk.
de: Werte, die Maßeinheiten verwenden, können wie der primitive numerische Typ z.B. zum Drucken genutzt werden.
es: Los valores que usan unidades de medida se pueden usar simplemente como tipo numérico primitivo para cosas como la impresión.
fr: Les valeurs avec des unités de mesure s'utilisent de la même façon que le type numérique primitif dans des opérations comme l'impression.
it: I valori che usano unità di misura possono essere usati come il tipo numerico primitivo per elementi come la stampa.
ja: 測定単位を使用する値は、印刷などに対するプリミティブな数値型と同じように使用できます。
ko: 측정 단위를 사용하는 값은 인쇄와 같은 작업에 기본 숫자 형식처럼 사용할 수 있습니다.
pl: Wartości używające jednostek miary można dostosować tak jak pierwotny typ numeryczny, np. w przypadku drukowania.
pt_br: Valores que usam Unidades de Medida podem ser usados exatamente como o tipo numérico primitivo para coisas como impressão.
ru: Значения, использующие единицы измерения, можно применять как примитивные числовые типы для таких действий, как печать.
tr: Ölçü Birimleri kullanan değerler, yazdırma gibi işler için temel sayısal tür ile aynı şekilde kullanılabilir.
zh_hans: 使用度量单位的值可像基元数值类型用于打印等操作一样直接使用。
zh_hant: 使用測量單位之值的用法，就像是列印這類作業的基本數字類型一樣。

# Classes-Line1
source: Classes are a way of defining new object types in F#, and support standard Object-oriented constructs.
cs: Třídy představují způsob definice nových objektových typů v jazyce F# a podporují standardní objektově orientované konstrukce.
de: Klassen sind eine Möglichkeit zum Definieren neuer Objekttypen in F#. Sie unterstützen standardmäßige objektorientierte Konstrukte.
es: Las clases son una forma de definir tipos de objeto nuevos en F# y admiten construcciones orientadas a objetos estándar.
fr: Les classes sont un moyen de définir de nouveaux types d'objet en F#. Elles prennent en charge les constructions orientées objet standard.
it: Le classi sono un modo per definire nuovi tipi di oggetto in F# e supportano costrutti standard orientati a oggetti.
ja: クラスは、F# で新しいオブジェクト型を定義する方法であり、標準のオブジェクト指向のコンストラクトをサポートします。
ko: 클래스는 F#에서 새 개체 형식을 정의하는 방법이며 표준 개체 지향 구문을 지원합니다.
pl: Klasy są sposobem definiowania nowych typów obiektów w języku F# i obsługują standardowe konstrukcje zorientowane obiektowo.
pt_br: Classes são uma maneira de definir novos tipos de objetos em F# e dão suporte a constructos padrão Orientados a objeto.
ru: Классы — это способ определения новых типов объектов в F#. Они поддерживают стандартные объектно-ориентированные конструкции.
tr: Sınıflar, F# içinde yeni nesneleri tanımlamanın bir yoludur ve standart Nesne yönelimli yapıları destekler.
zh_hans: 类是 F# 中定义新对象类型的一种方式，且支持标准的面向对象的构造。
zh_hant: 類別是在 F# 中定義新物件類型的一種方式，且支援標準物件導向建構。

# Classes-Line2
source: They can have a variety of members (methods, properties, events, etc.)
cs: Můžou mít celou řadu členů (metody, vlastnosti, události atd.).
de: Sie können über verschiedene Member verfügen (Methoden, Eigenschaften, Ereignisse usw.)
es: Pueden tener una gran variedad de miembros (métodos, propiedades, eventos, etc.)
fr: Elles peuvent avoir différents membres (méthodes, propriétés, événements, etc.)
it: Possono includere numerosi membri (metodi, proprietà, eventi e così via)
ja: さまざまなメンバー (メンバー、プロパティ、イベントなど) を含めることができます
ko: 클래스는 다양한 멤버(메서드, 속성, 이벤트 등)를 포함할 수 있습니다.
pl: Mogą mieć różne elementy członkowskie (metody, właściwości, zdarzenia itp.)
pt_br: Elas podem ter uma variedade de membros (métodos, propriedades, eventos, etc.)
ru: Они могут содержать различные элементы (методы, свойства, события и т. д.)
tr: Çeşitli üyelere sahip olabilirler (metotlar, özellikler, olaylar vb.)
zh_hans: 它们可以有各种成员(如，方法、属性、事件等)
zh_hant: 它們可以有各式不同的成員 (方法、屬性、事件等等)

# Classes-Line3
source: To learn more about Classes, see: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/classes
cs: Další informace o třídách najdete tady: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/classes
es: Para obtener más información sobre las clases, consulte: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/classes
fr: Pour en savoir plus sur les Cours, consultez : https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/classes
pl: Aby dowiedzieć się więcej o klasach, zobacz: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/classes
ru: Подробности о классах: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/classes

# Classes-Line4
source: To learn more about Members, see: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/members
cs: Další informace o členech najdete tady: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/members
es: Para obtener más información sobre los miembros, consulte: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/members
fr: Pour en savoir plus sur les membres, consultez : https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/members
pl: Aby dowiedzieć się więcej o elementach członkowskich, zobacz: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/members
ru: Подробности об элементах: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/members

# Vector-Line1
source: A simple two-dimensional Vector class.
cs: Jednoduchá dvojrozměrná vektorová třída.
de: Eine einfache, zweidimensionale Vektorklasse.
es: Clase Vector bidimensional sencilla.
fr: Classe Vector à deux dimensions simple.
it: Semplice classe di vettore bidimensionale.
ja: 単純な 2 次元のベクター クラス。
ko: 단순한 2차원 벡터 클래스입니다.
pl: Prosta, dwuwymiarowa klasa Vector.
pt_br: Uma classe de vetor bidimensional simples.
ru: Простой двухмерный класс Vector.
tr: Basit bir iki boyutlu Vektör sınıfı.
zh_hans: 简单的二维矢量类。
zh_hant: 簡式二維向量類別。

# Vector-Line2
source: The class's constructor is on the first line,
cs: Konstruktor třídy je na prvním řádku
de: Der Konstruktor der Klasse befindet sich in der ersten Zeile
es: El constructor de la clase está en la primera línea
fr: Le constructeur de la classe est sur la première ligne
it: Il costruttore della classe si trova sulla prima riga
ja: クラスのコンストラクターは最初の行にあり、
ko: 클래스의 생성자는 첫 줄에 있고,
pl: Konstruktor klasy znajduje się w pierwszym wierszu
pt_br: O construtor da classe está na primeira linha,
ru: Конструктор класса находится в первой строке
tr: Sınıfın oluşturucusu ilk satırdadır
zh_hans: 该类的构造函数位于第一行，
zh_hant: 類別的建構函式位於第一行，

# Vector-Line3
source: and takes two arguments: dx and dy, both of type 'double'.
cs: a přebírá dva argumenty: dx a dy, oba typu double.
de: und akzeptiert zwei Argumente: dx und dy, beide vom Typ "double".
es: y toma dos argumentos: dx y dy, ambos de tipo "double".
fr: et accepte deux arguments : dx et dy (tous deux de type 'double').
it: e accetta due argomenti, dx e dy, entrambi di tipo 'double'.
ja: また、dx と dy の 2 つの引数を取ります。どちらも 'double' 型です。
ko: 'double' 형식의 두 인수 dx 및 dy를 사용합니다.
pl: i przyjmuje dwa argumenty: dx i dy, oba typu „double”.
pt_br: e leva dois argumentos: dx e dy, ambos do tipo 'duplo'.
ru: и принимает два аргумента: dx и dy, оба имеют тип double.
tr: ve ikisi de 'double' türünde olan iki bağımsız değişken alır: dx ve dy.
zh_hans: 并且采用两个参数: dx 和 dy，二者均属于类型 "double"。
zh_hant: 並接受兩種引數: dx 與 dy，兩者的類型都是 'double'。

# ClassInternalField-Line1
source: This internal field stores the length of the vector, computed when the
cs: Toto interní pole ukládá délku vektoru vypočítanou při
de: Dieses interne Feld speichert die Länge des Vektors, die berechnet wird, wenn
es: Este campo interno almacena la longitud del vector, que se calcula cuando
fr: Ce champ interne stocke la longueur du vecteur, calculée quand
it: In questo campo interno è archiviata la lunghezza del vettore, calcolata durante
ja: この内部フィールドはベクトルの長さを格納します。これは、次の時点でにコンピューティングされます:
ko: 이 내부 필드는 개체가 생성될 때 계산된 벡터 길이를
pl: To pole wewnętrzne przechowuje długość wektora obliczoną podczas
pt_br: Este campo interno armazena o comprimento do vetor, computado quando o
ru: В этом внутреннем поле хранится длина вектора, вычисляемая, когда
tr: Bu dahili alan, nesne oluşturulduğunda hesaplanan vektör
zh_hans: 此内部字段存储矢量的长度，当发生以下情况时进行计算
zh_hant: 這個內部欄位會儲存向量長度，計算時機為

# ClassInternalField-Line2
source: object is constructed
cs: zkonstruování objektu
de: das Objekt konstruiert wird.
es: se construye el objeto
fr: l'objet est construit
it: la costruzione dell'oggetto
ja: オブジェクトが構築されます
ko: 저장합니다.
pl: obiekt jest skonstruowany
pt_br: objeto é construído
ru: объект создается
tr: uzunluğunu depolar
zh_hans: 对象已构造
zh_hant: 物件已建構

# ThisKeyword-Line1
source: 'this' specifies a name for the object's self identifier.
cs: this určuje název identifikátoru samotného objektu.
de: "this" gibt einen Namen für den Selbstbezeichner des Objekts an.
es: 'this' especifica un nombre para el propio identificador del objeto.
fr: 'this' spécifie un nom pour l'auto-identificateur de l'objet.
it: 'this' specifica un nome per l'autoidentificatore dell'oggetto.
ja: 'this' は、オブジェクトの自己識別子の名前を指定します。
ko: 'this'는 개체 자체의 식별자에 대한 이름을 지정합니다.
pl: Wyraz „this” określa nazwę własnego identyfikatora obiektu.
pt_br: 'this' especifica um nome para o identificador automático do objeto.
ru: Ключевое слово this задает имя идентификатора самого объекта.
tr: 'this', nesnenin kendi tanımlayıcısı için bir ad belirtir.
zh_hans: “this”用于指定对象的自我标识符的名称。
zh_hant: 'this' 會為物件的自我識別碼指定名稱。

# ThisKeyword-Line2
source: In instance methods, it must appear before the member name.
cs: V metodách instancí se musí objevovat před názvem člena.
de: In Instanzmethoden muss dies vor dem Membernamen angegeben werden.
es: En los métodos de instancia, debe aparecer delante del nombre del miembro.
fr: Dans les méthodes d'instance, il doit apparaître avant le nom du membre.
it: Nei metodi di istanza, deve trovarsi prima del nome del membro.
ja: インスタンス メソッドでは、メンバー名の前に表示される必要があります。
ko: 인스턴스 메서드에서는 멤버 이름 앞에 와야 합니다.
pl: W metodach wystąpień musi on znajdować się przed nazwą elementu członkowskiego.
pt_br: Em métodos de instância, ele deve aparecer antes do nome do membro.
ru: В методах экземпляров оно должно находиться перед именем элемента.
tr: Örnek metotlarında üye adından önce gelmelidir.
zh_hans: 在实例方法中，它必须出现在成员名称之前。
zh_hant: 在執行個體方法中，它必須出現在成員名稱前面。

# MemberMethod
source: This member is a method. The previous members were properties.
cs: Tento člen je metoda. Předchozí členové představují vlastnosti.
de: Dieser Member ist eine Methode. Die vorherigen Member waren Eigenschaften.
es: Este miembro es un método. Los miembros anteriores eran propiedades.
fr: Ce membre est une méthode. Les membres précédents étaient des propriétés.
it: Questo membro è un metodo. I membri precedenti erano proprietà.
ja: このメンバーはメソッドです。前のメンバーはプロパティでした。
ko: 이 멤버는 메서드입니다. 이전 멤버는 속성이었습니다.
pl: Ten element członkowski jest metodą. Poprzednie elementy członkowskie były właściwościami.
pt_br: Esse membro é um método. Os membros anteriores eram propriedades.
ru: Этот элемент является методом. Предыдущие элементы были свойствами.
tr: Bu üye, bir metot. Önceki üyeler özellikti.
zh_hans: 该成员属于方法。以前的成员属于属性。
zh_hant: 此成員是方法。先前的成員是屬性。

# InstantiateClass
source: This is how you instantiate the Vector2D class.
cs: Toto je způsob, jak vytvořit instanci třídy Vector2D.
de: So instanziieren Sie die Vector2D-Klasse.
es: Así es cómo se crea una instancia de la clase Vector2D.
fr: Voici comment instancier la classe Vector2D.
it: In questo modo viene creata un'istanza della classe Vector2D.
ja: これは、Vector2D クラスのインスタンスを作成する方法です。
ko: Vector2D 클래스를 인스턴스화하는 방법은 다음과 같습니다.
pl: Jest to sposób tworzenia wystąpienia dla klasy Vector2D.
pt_br: É assim que você cria uma instância de classe Vector2D.
ru: Вот как выполняется создание экземпляра класса Vector2D.
tr: Vector2D sınıfının örneğini bu şekilde oluşturabilirsiniz.
zh_hans: 这就是你实例化 Vector2D 类的方式。
zh_hant: 這是 Vector2D 類別的具現化方式。

# ScaledVector
source: Get a new scaled vector object, without modifying the original object.
cs: Získá nový škálovaný vektorový objekt, aniž by se změnil původní objekt.
de: Rufen Sie ein neues skaliertes Vektorobjekt ab, ohne das ursprüngliche Objekt zu verändern.
es: Obtener un nuevo objeto de vector a escala sin modificar el objeto original.
fr: Obtenez un nouvel objet vector mis à l'échelle, sans modifier l'objet d'origine.
it: Consente di ottenere un nuovo oggetto vettore dimensionato senza modificare l'oggetto originale.
ja: 元のオブジェクトを変更せずに、新しくスケーリングされたベクター オブジェクトを取得します。
ko: 원래 개체를 수정하지 않고 비율이 조정된 새 벡터 개체를 가져옵니다.
pl: Pobierz nowy skalowany obiekt wektora bez modyfikowania obiektu oryginalnego.
pt_br: Obter um novo objeto de vetor escalado, sem modificar o objeto original.
ru: Получение нового объекта масштабируемого вектора без изменения исходного объекта.
tr: Özgün nesneyi değiştirmeden, yeni bir ölçekli vektör nesnesi alın.
zh_hans: 获取新的缩放矢量对象而不修改原始对象。
zh_hant: 取得全新且可縮放大小的向量物件，但不修改原始物件。

# GenericClasses-Line1
source: Generic classes allow types to be defined with respect to a set of type parameters.
cs: Obecné třídy umožňují definování typů s ohledem na sadu parametrů typu.
de: Generische Klassen ermöglichen das Definieren von Typen in Bezug auf eine Gruppe von Typparametern.
es: Las clases genéricas permiten definir tipos con respecto a un conjunto de parámetros de tipo.
fr: Les classes génériques autorisent la définition des types par rapport à un jeu de paramètres de type.
it: Le classi generiche consentono di definire tipi rispetto a un set di parametri di tipo.
ja: ジェネリック クラスでは、型パラメーターのセットに対して型を定義することができます。
ko: 제네릭 클래스를 통해 형식 매개변수 집합에 대해 형식을 정의할 수 있습니다.
pl: Klasy ogólne umożliwiają definiowanie typów z uwzględnieniem zestawu parametrów typu.
pt_br: Classes genéricas permitem que os tipos sejam definidos em relação a um conjunto de parâmetros de tipo.
ru: Универсальные классы позволяют определять типы с набором параметров типа.
tr: Genel sınıflar, türlerin bir tür parametreleri kümesine göre tanımlanmasına izin verir.
zh_hans: 通用类允许考虑使用一组类型参数来定义类型。
zh_hant: 泛型類別可定義關乎一組類型參數的類型。

# GenericClasses-Line2
source: In the following, 'T is the type parameter for the class.
cs: V následujícím příkladu „T“ představuje parametr typu pro třídu.
de: Im Folgenden ist 'T der Typparameter für die Klasse.
es: En el siguiente código, 'T es el parámetro de tipo para la clase.
fr: Dans ce qui suit, 'T est le paramètre de type pour la classe.
it: Nel codice seguente 'T è il parametro di tipo per la classe.
ja: 以下では、'T はクラスの型パラメーターです。
ko: 다음에서 'T는 클래스의 형식 매개 변수입니다.
pl: W następującym przykładzie 'T jest parametrem typu dla klasy.
pt_br: No exemplo a seguir, 'T é o parâmetro de tipo para a classe.
ru: В следующем примере 'T — это параметр типа для класса.
tr: Aşağıda, 'T', sınıf için tür parametresidir.
zh_hans: 以下示例中，"T" 表示类的类型参数。
zh_hant: 在下列範例中，'T 是類別的型別參數。

# GenericClasses-Line3
source: To learn more, see: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/generics/
cs: Další informace najdete v tématu: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/generics/
es: Para obtener más información, consulte: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/generics/
fr: Pour en savoir plus, consultez : https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/generics/
pl: Aby dowiedzieć się więcej, zobacz: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/generics/
ru: Подробности: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/generics/

# InternalField
source: This internal field store the states in a list.
cs: Toto interní pole ukládá stavy v seznamu.
de: Dieses interne Feld speichert die Zustände in einer Liste.
es: Este campo interno almacena los estados en una lista.
fr: Ce champ interne stocke les états dans une liste.
it: Questo campo interno archivia gli stati in un elenco.
ja: この内部フィールドは状態をリストに保存します。
ko: 이 내부 필드는 목록에 상태를 저장합니다.
pl: To wewnętrzne pole przechowuje stany na liście.
pt_br: Este campo interno armazena os estados em uma lista.
ru: В этом внутреннем поле хранятся состояния в списке.
tr: Bu dahili alan, bir listedeki durumları depolar.
zh_hans: 此内部字段将状态存储在列表中。
zh_hant: 此內部欄位會以清單形式儲存狀態。

# AddElement
source: Add a new element to the list of states.
cs: Přidá nový element do seznamu stavů.
de: Der Liste der Zustände ein neues Element hinzufügen
es: Agregar un nuevo elemento a la lista de estados.
fr: Ajoutez un nouvel élément à la liste d'états.
it: Aggiunge un nuovo elemento all'elenco degli stati.
ja: 状態のリストに新しい要素を追加します。
ko: 상태 리스트에 새 요소를 추가합니다.
pl: Dodaj nowy element do listy stanów.
pt_br: Adicione um novo elemento à lista de estados.
ru: Добавление нового элемента в список состояний.
tr: Durumlar listesine yeni bir öğe ekleyin.
zh_hans: 将新元素添加到状态列表中。
zh_hant: 新增項目至狀態清單。

# MutableAssignment
source: use the '<-' operator to mutate the value.
cs: Použije operátor <- ke změně (mutaci) hodnoty.
de: Den "<-"-Operator verwenden, um den Wert zu mutieren
es: Use el operador "<-" para mutar el valor.
fr: utilisez l'opérateur '<-' pour muter la valeur.
it: usare l'operatore '<-' per modificare il valore.
ja: '<-' 演算子を使用して、値を変換します。
ko: '<-' 연산자를 사용하여 값을 변경합니다.
pl: użyj operatora „<-”, aby zmodyfikować wartość.
pt_br: use o operador '<-' para modificar o valor.
ru: Оператор "<-" служит для изменения значения.
tr: değeri değiştirmek için '<-' işlecini kullanın.
zh_hans: 使用 "<-" 运算符改变值。
zh_hant: 使用 '<-' 運算子可變動值。

# History
source: Get the entire list of historical states.
cs: Získá celý seznam historických stavů.
de: Die gesamte Liste der Verlaufszustände abrufen
es: Obtener la lista completa de estados históricos.
fr: Obtenez la liste complète des états historiques.
it: Consente di ottenere l'intero elenco degli stati cronologici.
ja: 状態の履歴のリスト全体を取得します。
ko: 기록 상태의 전체 목록을 가져옵니다.
pl: Pobierz całą listę stanów historycznych.
pt_br: Obter a lista completa de estados históricos.
ru: Получение полного списка исторических состояний.
tr: Geçmiş durumların tam listesini alın.
zh_hans: 获取历史状态的完整列表。
zh_hant: 取得完整的歷程狀態清單。

# Current
source: Get the latest state.
cs: Získá nejnovější stav.
de: Den aktuellen Zustand abrufen
es: Obtener el último estado.
fr: Obtenez le dernier état.
it: Consente di ottenere l'ultimo stato.
ja: 最新の状態を取得します。
ko: 최신 상태를 가져옵니다.
pl: Pobierz najnowszy stan.
pt_br: Obter o estado mais recente.
ru: Получение последнего состояния.
tr: Son durumu alın.
zh_hans: 获取最新状态。
zh_hant: 取得最新狀態。

# InferredTypeParameter
source: An 'int' instance of the state tracker class. Note that the type parameter is inferred.
cs: Instance int třídy pro sledování stavů. Poznámka: Parametr typu je odvozený.
de: Eine int-Instanz der state tracker-Klasse. Beachten Sie, dass der Typ-Parameter abgeleitet wird.
es: Una instancia 'int' de la clase del rastreador de estados. Observe que se ha inferido el parámetro de tipo.
fr: Instance 'int' de la classe de suivi des états. Notez que le paramètre de type est déduit.
it: Istanza 'int' della classe di rilevamento stato. Si noti che il parametro di tipo è dedotto.
ja: 状態トラッカー クラスの 'int' インスタンス。型パラメーターは推論されていることに注意してください。
ko: 상태 추적기 클래스의 'int' 인스턴스입니다. 형식 매개 변수는 유추됩니다.
pl: Wystąpienie typu „int” klasy procedury śledzenia stanu. Należy zwrócić uwagę, że parametr typu jest wywnioskowany.
pt_br: Uma instância ' int' da classe de controlador do estado. Observe que o parâmetro de tipo é deduzido.
ru: Экземпляр int класса отслеживания состояний. Обратите внимание, что параметр типа подразумевается.
tr: Durum izleyicisi sınıfının bir 'int' örneği. Tür parametresinin algılandığını unutmayın.
zh_hans: 状态跟踪程序类的一个“int”实例。请注意，已推断类型参数。
zh_hant: 狀態追蹤器類別的 'int' 執行個體。請注意，型別參數是推斷出來的。

# AddState
source: Add a state
cs: Přidat stav
de: Einen Zustand hinzufügen
es: Agregar un estado
fr: Ajouter un état
it: Viene aggiunto uno stato
ja: 状態を追加します
ko: 상태를 추가합니다.
pl: Dodaj stan
pt_br: Adicionar um estado
ru: Добавление состояния
tr: Durum ekle
zh_hans: 添加状态
zh_hant: 加入狀態

# Interfaces-Line1
source: Interfaces are object types with only 'abstract' members.
cs: Rozhraní jsou typy objektů pouze s členy abstract.
de: Schnittstellen sind Objekttypen, die nur über abstrakte Member verfügen.
es: Las interfaces son tipos de objeto que solo tienen miembros "abstract".
fr: Les interfaces sont des types d'objet avec des membres 'abstract' uniquement.
it: Le interfacce sono tipi di oggetto contenenti solo membri 'abstract'.
ja: インターフェイスは 'abstract' メンバーのみを持つオブジェクト型です。
ko: 인터페이스는 '추상' 멤버만 있는 개체 형식입니다.
pl: Interfejsy to typy obiektu, których wszystkie elementy członkowskie są abstrakcyjne.
pt_br: As interfaces são tipos de objeto com apenas membros 'abstract'.
ru: Интерфейсы — это типы объектов, которые имеют только абстрактные члены.
tr: Arabirimler, yalnızca 'abstract' üyelere sahip olan nesne türleridir.
zh_hans: 接口是只有“抽象”成员的对象类型。
zh_hant: 介面為只有 'abstract' 成員的物件類型。

# Interfaces-Line2
source: Object types and object expressions can implement interfaces.
cs: Objektové typy a výrazy můžou implementovat rozhraní.
de: Objekttypen und Objektausdrücke können Schnittstellen implementieren.
es: Los tipos de objeto y las expresiones de objeto pueden implementar interfaces.
fr: Les types et expressions d'objet peuvent implémenter des interfaces.
it: I tipi di oggetto e le espressioni di oggetto possono implementare interfacce.
ja: オブジェクト型とオブジェクト式はインターフェイスを実装できます。
ko: 개체 형식 및 개체 식은 인터페이스를 구현할 수 있습니다.
pl: Typy obiektu i wyrażenia obiektu mogą implementować interfejsy.
pt_br: Tipos de objeto e expressões de objeto podem implementar interfaces.
ru: Типы объектов и выражения объектов могут реализовывать интерфейсы.
tr: Nesne türleri ve nesne ifadeleri arabirim uygulayabilir.
zh_hans: 对象类型和对象表达式可以实现接口。
zh_hant: 物件類型與物件運算式可以實作介面。

# Interfaces-Line3
source: To learn more, see: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/interfaces
cs: Další informace najdete v tématu: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/interfaces
es: Para obtener más información, consulte: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/interfaces
fr: Pour en savoir plus, consultez : https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/interfaces
pl: Aby dowiedzieć się więcej, zobacz: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/interfaces
ru: Подробности: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/interfaces

# IDisposable
source: This is a type that implements IDisposable.
cs: Toto je typ, který implementuje rozhraní IDisposable.
de: Dieser Typ implementiert "IDisposable".
es: Este es un tipo que implementa IDisposable.
fr: Type qui implémente IDisposable.
it: Questo è un tipo che implementa IDisposable.
ja: これは IDisposable を実装する型です。
ko: IDisposable를 구현하는 형식입니다.
pl: To jest typ implementujący interfejs IDisposable.
pt_br: Este é um tipo que implementa IDisposable.
ru: Это — тип, который реализует интерфейс IDisposable.
tr: Bu, IDisposable uygulayan bir türdür.
zh_hans: 它是实现 IDisposable 的类型。
zh_hant: 這是實作 IDisposable 的類型。
