Repository: dotnet/fsharp
Catalog: vsintegration/ProjectTemplates/TutorialProject/Template/xlf/Tutorial.fsx.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# TupleFunction-Line2
source: F# Type Inference will automatically generalize the function to have a generic type,
cs: Odvození typu proměnné v jazyce F# automaticky generalizuje funkci tak, aby byla obecného typu,
de: Der F#-Typrückschluss generalisiert die Funktion automatisch und erstellt einen generischen Typ,
es: La inferencia de tipos de F# generalizará la función de forma automática para que tenga un tipo genérico,
fr: L'inférence de type F# généralise automatiquement la fonction pour qu'elle soit de type générique,
it: L'inferenza del tipo di F# consentirà di generalizzare automaticamente la funzione in modo che il relativo tipo sia generico,
ja: F# 型の推定は、ジェネリック型を持つように関数を自動的に一般化し、
ko: F# 형식 유추에서는 자동으로 함수를 제너릭 형식으로 일반화하므로,
pl: Wnioskowanie o typie języka F# będzie automatycznie uogólniać funkcję do typu ogólnego,
pt_br: Inferência de Tipos F# generalizará automaticamente a função para ter um tipo genérico,
ru: Определение типа F# будет автоматически назначать функции универсальный тип,
tr: F# Tür Çıkarımı, işlevi genel türe sahip olacak şekilde otomatik olarak genelleştirir,
zh_hans: F# 类型推理可自动泛化函数，使其具有泛型类型，
zh_hant: F# 型別推斷會自動將函式一般化成泛型類型，

# TupleFunction-Line3
source: meaning that it will work with any type.
cs: což znamená, že bude fungovat s jakýmkoli typem.
de: d. h. er funktioniert mit jedem Typ.
es: lo que significa que funcionará con cualquier tipo.
fr: ce qui signifie qu'elle peut fonctionner avec n'importe quel type.
it: per indicare che funzionerà con qualsiasi tipo.
ja: 任意の型で動作することを意味します。
ko: 모든 형식에 사용할 수 있습니다.
pl: co oznacza, że będzie działać z dowolnym typem.
pt_br: significando que ele funcionará com qualquer tipo.
ru: что означает, что он будет работать с любым типом.
tr: yani, herhangi bir tür ile çalışabilir.
zh_hans: 意味着它可与任何类型兼容。
zh_hant: 表示其可與任何類型搭配運作。

# TupleMultiType-Line1
source: A tuple consisting of an integer, a string,
cs: Řazená kolekce členů skládající se z celého čísla, řetězce
de: Ein Tupel aus einem Integer, einer Zeichenfolge
es: Una tupla que consta de un entero, una cadena,
fr: Tuple constitué d'un entier, d'une chaîne
it: Tupla costituita da un intero, una stringa
ja: タプルを構成するのは、整数、文字列、
ko: 정수, 문자열 및 배정밀도 부동 소수점
pl: Krotka składająca się z liczby całkowitej, ciągu
pt_br: Uma tupla consistindo em um inteiro, uma cadeia de caracteres,
ru: Кортеж, состоящий из целого числа, строки
tr: Bir tamsayı, bir dize ve bir çift duyarlıklı kayan nokta sayısından
zh_hans: 一个整数，一个字符串以及
zh_hant: 元組，包含整數、字串、

# TupleMultiType-Line2
source: and a double-precision floating point number.
cs: a čísla s plovoucí desetinnou čárkou a dvojitou přesností
de: und einer Gleitkommazahl mit doppelter Genauigkeit.
es: y un número de punto flotante de doble precisión.
fr: et d'un nombre à virgule flottante à double précision.
it: e un numero a virgola mobile a precisione doppia.
ja: および倍精度浮動小数点数です。
ko: 숫자로 구성된 튜플입니다.
pl: i liczby zmiennoprzecinkowej podwójnej precyzji.
pt_br: e um número de ponto flutuante de precisão dupla.
ru: и числа двойной точности с плавающей запятой.
tr: oluşan bir demet.
zh_hans: 一个双精度浮点数字组成的元组。
zh_hant: 和雙精確度浮點數。

# TupleTypeAnnotation-Line1
source: A simple tuple of integers with a type annotation.
cs: Jednoduchá řazená kolekce členů celých čísel s anotací typu
de: Ein einfaches Tupel aus Integerwerten mit einer Typanmerkung.
es: Una tupla de enteros sencilla con una anotación de tipo.
fr: Tuple simple d'entiers avec une annotation de type.
it: Tupla di interi semplice con annotazione di tipo.
ja: 型の注釈が指定された整数のシンプルなタプル。
ko: 형식 주석이 포함된 단순한 정수 튜플입니다.
pl: Prosta krotka składająca się z liczb całkowitych z adnotacją typu.
pt_br: Uma tupla simples de números inteiros com uma anotação de tipo.
ru: Простой кортеж целых чисел с аннотацией типа.
tr: Tür ek açıklaması içeren basit bir tamsayı tanımlama grubu.
zh_hans: 一个具有类型批注的简单的整数元组。
zh_hant: 具有類型註釋之整數的簡單元組。

# TupleTypeAnnotation-Line2
source: Type annotations for tuples use the * symbol to separate elements
cs: Anotace typů pro řazené kolekce členů používají k oddělování elementů symbol *.
de: Typanmerkungen für Tupel trennen Elemente durch das *-Symbol.
es: Las anotaciones de tipo para las tuplas usan el símbolo * para separar los elementos
fr: Annotations de type pour les tuples qui utilisent le symbole * afin de séparer les éléments
it: Nelle annotazioni di tipo per le tuple si usa il simbolo * per separare gli elementi
ja: タプルの型の注釈では、要素を区切るために * の記号を使用します
ko: 튜플에 대한 형식 주석은 * 기호를 사용하여 요소를 구분합니다.
pl: Adnotacje typu w krotkach korzystają z symbolu * do oddzielania elementów
pt_br: As anotações de tipo para tuplas usam o símbolo * para separar elementos
ru: Аннотации типов для кортежей используют символ * для разделения элементов.
tr: Tanımlama grupları için tür ek açıklamaları öğeleri ayırmak için * sembolünü kullanır
zh_hans: 元组的类型批注使用 * 号来分隔元素
zh_hant: 元組的類型註釋會使用 * 符號分隔項目

# StructTuple-Line1
source: Tuples are normally objects, but they can also be represented as structs.
cs: Řazené kolekce členů jsou obvykle objekty, ale můžou být vyjádřeny i jako struktury.
de: Tupel sind normalerweise Objekte, sie können aber auch als Strukturen dargestellt werden.
es: Las tuplas suelen ser objetos, pero también se pueden representar como estructuras.
fr: Les tuples sont généralement des objets, mais peuvent aussi être représentés sous forme de structs.
it: Le tuple sono in genere oggetti, ma possono essere rappresentate anche come struct.
ja: タプルは通常はオブジェクトですが、構造体として表すこともできます。
ko: 튜플은 일반적으로 개체이지만 구조체로 나타낼 수도 있습니다.
pl: Krotki są zazwyczaj obiektami, niemniej mogą być również reprezentowane w formie struktur.
pt_br: Tuplas normalmente são objetos, mas também podem ser representados como structs.
ru: Кортежи обычно являются объектами, но они также могут быть представлены как структуры.
tr: Demetler, normalde nesnedir ancak yapı olarak da gösterilebilir.
zh_hans: 元组通常为对象，但也可表示为结构。
zh_hant: 元組一般是物件，但也可以用結構形式呈現。

# StructTuple-Line2
source: These interoperate completely with structs in C# and Visual Basic.NET; however,
cs: Ty zcela spolupracují se strukturami v jazycích C# a Visual Basic .NET. Platí ale, že
de: Sie arbeiten mit Strukturen in C# und Visual Basic.Net vollständig zusammen.
es: Interoperan completamente con estructuras de C# y Visual Basic.NET; sin embargo,
fr: Ils interagissent entièrement avec les structs en C# et Visual Basic .NET ; cependant,
it: Questi interagiscono completamente con gli struct in C# e Visual Basic.NET; tuttavia,
ja: C# と Visual Basic.NET では、これらは構造体と完全に相互運用されます。ただし、
ko: 이러한 구조체는 C# 및 Visual Basic.NET의 구조체와 완벽히 상호 운용되지만,
pl: Całkowicie współpracują ze strukturami w języku C# i Visual Basic.NET; niemniej
pt_br: Esses interoperam completamente com structs em C# e Visual Basic.NET; entretanto,
ru: Они полноценно взаимодействуют со структурами в C# и Visual Basic.NET; тем не менее
tr: Bunlar C# ve Visual Basic.NET ile tamamen uyumlu olarak birlikte çalışır ancak
zh_hans: 这些可在 C# 和 Visual Basic.NET 中与结构完全进行交互操作；然而，
zh_hant: 這些會與 C# 和 Visual Basic .NET 中的結構完全相互操作; 不過，

# StructTuple-Line3
source: struct tuples are not implicitly convertable with object tuples (often called reference tuples).
cs: řazené kolekce členů představující struktury nejsou implicitně převeditelné na řazené kolekce členů představující objekty (často označované jako řazené kolekce členů odkazů).
de: Strukturtupel sind jedoch nicht implizit mit Objekttupeln (häufig als Referenztupel bezeichnet) konvertierbar.
es: las tuplas de estructuras no son implícitamente convertibles con tuplas de objeto (a menudo denominadas tuplas de referencia).
fr: les tuples de type struct ne sont pas implicitement convertibles avec des tuples d'objet (souvent appelés tuples de référence).
it: le tuple di struct non sono convertibili in modo implicito con tuple di oggetto (spesso chiamate tuple di riferimento).
ja: 構造体のタプルは、オブジェクト タプル (参照タプルと呼ばれることが多い) と暗黙的に変換できません。
ko: 구조체 튜플은 개체 튜플(참조 튜플이라고도 함)로 암시적인 변환을 할 수 없습니다.
pl: krotki w formie struktur nie mogą być niejawnie konwertowane na krotki w formie obiektów (często zwane krotkami odwołań).
pt_br: tuplas de struct não são implicitamente conversíveis com tuplas de objeto (geralmente chamadas de tuplas de referência).
ru: кортежи структур нельзя явно преобразовать в кортежи объектов (часто называемые эталонными кортежами).
tr: yapı demetleri, nesne demetleri ile (genellikle başvuru demetleri olarak adlandırılır) örtük olarak dönüştürülebilir değildir.
zh_hans: 结构元组不隐式转换为对象元组(通常称为引用元组)。
zh_hant: 結構元組無法利用物件元組 (通常稱為參考元組) 進行隱含轉換。

# StructTuple-Line4
source: The second line below will fail to compile because of this. Uncomment it to see what happens.
cs: Kompilace druhého řádku uvedeného níže se z tohoto důvodu nezdaří. Odkomentujte ho a podívejte se, co se stane.
de: Die unten angezeigte zweite Zeile kann aus diesem Grund nicht kompiliert werden. Heben Sie die Auskommentierung auf, und sehen Sie, was passiert.
es: La segunda línea no se compilará por esto. Quite las marcas de comentario para ver qué ocurre.
fr: La compilation de la deuxième ligne ci-dessous échoue à cause de cela. Supprimez les marques de commentaire pour voir ce qui se passe.
it: A causa di questo problema la seconda riga sotto non verrà compilata. Rimuovere il commento per vedere cosa succede.
ja: このため、以下の 2 番目の行はコンパイルに失敗します。発生する事象を確認するには、コメントを解除します。
ko: 이로써 아래 두 번째 줄은 컴파일되지 않으며 결과를 확인하려면 이 줄의 주석 처리를 제거하세요.
pl: Z tego powodu nie będzie można skompilować drugiego wiersza poniżej. Usuń komentarz z tego wiersza, aby zobaczyć, co się stanie.
pt_br: A compilação da segunda linha abaixo falhará por causa disso. Remova a marca de comentário para ver o que acontece.
ru: Из-за этого произойдет сбой компиляции второй строки ниже. Раскомментируйте ее, чтобы увидеть, что произойдет.
tr: Bu nedenle aşağıdaki ikinci satırı derleme işlemi başarısız olacak. Ne olacağını görmek için açıklamayı kaldırın.
zh_hans: 下面的第二行将因此无法编译。取消注释观察将发生什么。
zh_hant: 因此，將無法編譯以下的第二行。請取消它的註解，看看會如何。

# TupleConvert-Line1
source: Although you cannot implicitly convert between struct tuples and reference tuples,
cs: Mezi řazenými kolekcemi členů představujícími struktury a řazenými kolekcemi členů odkazů nemůžete provést implicitní převod,
de: Sie können zwar nicht implizit zwischen Strukturtupeln und Verweistupeln konvertieren,
es: Aunque no puede convertir tuplas de struct en tuplas de referencia y viceversa de forma implícita,
fr: Bien que vous ne puissiez pas effectuer de conversion implicite entre les tuples de type struct et les tuples de type référence,
it: Anche se non è possibile eseguire la conversione in modo implicito tra tuple della struttura e tuple di riferimento,
ja: 構造体タプルと参照タプル間で暗黙的に変換することはできませんが、
ko: 구조체 튜플과 참조 튜플 간을 암시적으로 변환할 수 없지만,
pl: Mimo że nie możesz przeprowadzać niejawnej konwersji między krotkami struktury i krotkami odwołania,
pt_br: Embora não seja possível converter implicitamente entre tuplas de struct e tuplas de referência,
ru: Хотя кортежи-структуры и ссылочные кортежи невозможно преобразовывать неявно,
tr: Yapı demetleri ile başvuru demetleri arasında örtük dönüştürme gerçekleştiremezsiniz, ancak
zh_hans: 尽管不能在结构元组和引用元组之间进行隐式转换，
zh_hant: 雖然您不能隱含地在結構元組及參考元組間進行轉換，

# TupleConvert-Line2
source: you can explicitly convert via pattern matching, as demonstrated below.
cs: ale můžete převod provést explicitně přes porovnávání vzorů, jak je znázorněno níže.
de: Sie können aber wie unten gezeigt eine explizite Konvertierung über den Musterabgleich durchführen.
es: puede hacer la conversión de forma explícita mediante coincidencia de patrones, como se muestra a continuación.
fr: vous pouvez effectuer une conversion explicite à l'aide de critères spéciaux, comme indiqué ci-dessous.
it: è possibile eseguire la conversione in modo esplicito tramite i criteri di ricerca, come illustrato di seguito.
ja: 以下に示すように、パターン マッチングを使用して明示的に変換できます。
ko: 아래 설명된 것처럼 패턴 일치를 통해 명시적으로 변환할 수 있습니다.
pl: możesz konwertować jawnie za pośrednictwem dopasowywania do wzorców, jak pokazano poniżej.
pt_br: você pode converter explicitamente via correspondência de padrões, conforme demonstrado abaixo.
ru: вы можете явно преобразовывать их с помощью сопоставления шаблонов, как показано ниже.
tr: aşağıda gösterildiği gibi, desen eşleştirme aracılığıyla açık dönüştürme gerçekleştirebilirsiniz.
zh_hans: 可通过模式匹配进行显式转换，如下所示。
zh_hant: 但您可透過模式比對明確地轉換，如下所示。

# Pipes-Line1
source: The F# pipe operators ('|>', '<|', etc.) and F# composition operators ('>>', '<<')
cs: Operátory kanálu (|>, <| atd.) a operátory složení (>>, <<) v jazyce F#
de: Die F#-PipeOperatoren ("|>", "<|" usw.) und die F#-Zusammensetzungsoperatoren (">>", "<<")
es: Los operadores de canalización ("|>", "<|", etc.) y de composición (">>", "<<") de F#
fr: Les opérateurs de canal F# ('|>', '<|', etc.) et les opérateurs de composition F# ('>>', '<<')
it: Gli operatori pipe di F# ('|>', '<|' e così via) e gli operatori di composizione di F# ('>>', '<<')
ja: F# パイプ演算子 ('|>'、'<|' など) と F# 合成演算子 ('>>'、'<<')
ko: F# 파이프 연산자('|>', '<|' 등) 및 F# 합성 연산자('>>', '<<')는
pl: Operatory potoków języka F# („|>”, „<|” itp.) oraz operatory kompozycji języka F# („>>”, „<<”)
pt_br: Os operadores de pipe F# ('|>', '<|', etc.) e os operadores de composição F# ('>>', '<<')
ru: Операторы конвейера F# ("|>", "<|" и т. д.) и операторы объединения F# (">>", "<<")
tr: F# kanal işleçleri ('|>', '<|', vb.) ve F# birleştirme işleçleri ('>>', '<<')
zh_hans: F# 管道运算符("|>"、"<|" 等 )和 F# 组合运算符(">>"、"<<")
zh_hant: F# 管道運算子 ('|>'、'<|' 等) 與 F# 組合運算子 ('>>'、'<<')

# Pipes-Line2
source: are used extensively when processing data. These operators are themselves functions
cs: se při zpracovávání dat používají ve velkém měřítku. Tyto operátory představují samy o sobě funkce,
de: werden bei der Datenverarbeitung umfassend eingesetzt. Diese Operatoren sind Funktionen,
es: se utilizan mucho en el procesamiento de datos. Estos operadores son en sí mismos funciones.
fr: sont très utilisés de façon pour le traitement des données. Ces opérateurs sont eux-mêmes des fonctions
it: sono particolarmente usati durante l'elaborazione dati. Questi operatori sono di per sé funzioni
ja: は、データの処理時に幅広く使用されます。これらの演算子はそれ自体が関数であり、
ko: 데이터를 처리할 때 광범위하게 사용됩니다. 이러한 연산자는 자체가 함수이며
pl: są często używane podczas przetwarzania danych. Operatory te są funkcjami
pt_br: são usadas extensivamente durante o processamento de dados. Esses operadores são funções
ru: широко используются при обработке данных. Эти операторы сами по себе являются функциями,
tr: veriler işlenirken yaygın olarak kullanılır. Bu işleçler, başı başına birer işlevdir ve
zh_hans: 广泛用于数据处理。这些运算符本身就是函数，
zh_hant: 廣泛用於處理資料時。這些運算子本身就是函式

# Pipes-Line3
source: which make use of Partial Application.
cs: které využívají částečné použití argumentů.
de: die die partielle Anwendung nutzen.
es: que usan aplicación parcial.
fr: qui utilisent l'application partielle.
it: che usano l'applicazione parziale.
ja: 部分適用を利用します。
ko: 부분 애플리케이션을 사용합니다.
pl: wykorzystującymi częściową aplikację.
pt_br: que fazem uso do Aplicativo Parcial.
ru: использующими частичное применение.
tr: Kısmi Uygulamadan yararlanır.
zh_hans: 它使用偏函数应用。
zh_hant: 其會利用局部應用程式。

# Pipes-Line4
source: To learn more about these operators, see: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/functions/#function-composition-and-pipelining
cs: Další informace o těchto operátorech najdete tady: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/functions/#function-composition-and-pipelining
es: Para obtener más información sobre estos operadores, consulte: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/functions/#function-composition-and-pipelining
fr: Pour en savoir plus sur ces opérateurs, consultez : https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/functions/#function-composition-and-pipelining
pl: Aby dowiedzieć się więcej o tych operatorach, zobacz: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/functions/#function-composition-and-pipelining
ru: Подробности об этих операторах: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/functions/#function-composition-and-pipelining

# Pipes-Line5
source: To learn more about Partial Application, see: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/functions/#partial-application-of-arguments
cs: Další informace o částečném použití argumentů: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/functions/#partial-application-of-arguments
es: Para obtener más información sobre la aplicación parcial, consulte: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/functions/#partial-application-of-arguments
fr: Pour en savoir plus sur l'application partielle, consultez : https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/functions/#partial-application-of-arguments
pl: Aby dowiedzieć się więcej o częściowej aplikacji, zobacz: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/functions/#partial-application-of-arguments
ru: Подробности о частичном применении: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/functions/#partial-application-of-arguments

# Squares
source: Squares a value.
cs: Umocní hodnotu na druhou.
de: Quadriert einen Wert.
es: Eleva un valor la cuadrado.
fr: Met une valeur au carré.
it: Calcola il quadrato di un valore.
ja: 値を 2 乗します。
ko: 값을 제곱합니다.
pl: Podnosi wartość do potęgi drugiej.
pt_br: Eleva um valor ao quadrado.
ru: Возводит значение в квадрат.
tr: Bir değerin karesini alır.
zh_hans: 计算值的平方。
zh_hant: 產生值的平方。

# AddOne
source: Adds 1 to a value.
cs: Přičte 1 k hodnotě.
de: Addiert 1 zu einem Wert hinzu.
es: Suma 1 a un valor.
fr: Ajoute 1 à une valeur.
it: Aggiunge 1 a un valore.
ja: 値に 1 を追加します。
ko: 값에 1을 더합니다.
pl: Dodaje 1 do wartości.
pt_br: Adiciona 1 a um valor.
ru: Добавляет 1 к значению.
tr: Bir değere 1 ekler.
zh_hans: 将值加 1。
zh_hant: 將值加 1。

# TestOdd
source: Tests if an integer value is odd via modulo.
cs: Otestuje, jestli je celočíselná hodnota lichá na základě zbytku po dělení.
de: Testet mit Modulo, ob ein Integerwert gerade ist.
es: Comprueba si un valor entero es impar mediante un módulo.
fr: Teste si une valeur entière est impaire à l'aide d'une opération modulo.
it: Testa se un valore intero è dispari tramite modulo.
ja: 剰余を使って整数値が奇数であるかどうかをテストします。
ko: 모듈로를 통해 정수 값이 홀수인지 테스트합니다.
pl: Sprawdza, czy wartość liczby całkowitej jest nieparzysta za pomocą operacji modulo.
pt_br: Testa se um valor inteiro for ímpar por meio do módulo.
ru: Проверяет, является ли целое число нечетным по модулю.
tr: Mod aracılığıyla bir tamsayı değerinin tek sayı olup olmadığını test eder.
zh_hans: 通过取模测试整数是否为奇数。
zh_hant: 測試整數值是否為經過模數的奇數。

# NumberList1
source: A list of 5 numbers. More on lists later.
cs: Seznam 5 čísel. Více o seznamech později.
de: Eine Liste mit fünf Nummern. Weitere Informationen zu Listen finden Sie später.
es: Lista de 5 números. Más adelante, se proporciona más información sobre listas.
fr: Liste de 5 nombres. Nous reviendrons sur les listes plus tard.
it: Elenco di cinque numeri. Per altre informazioni sugli elenchi, vedere più avanti.
ja: 5 個の数値のリストです。リストの詳細については後述。
ko: 5개 숫자 목록입니다. 추가 숫자는 나중에 표시됩니다.
pl: Lista 5 liczb. Więcej informacji na temat list znajduje się dalej.
pt_br: Uma lista de cinco números. Mais sobre listas posteriormente.
ru: Список из 5 чисел. Дополнительно о списках позднее.
tr: 5 numaradan oluşan bir liste. Listeler hakkında daha fazla bilgiyi ilerleyen bölümlerde bulabilirsiniz.
zh_hans: 包含 5 个数字的列表。稍后列表上会有更多数字。
zh_hant: 5 個數字的清單。清單上稍後會有更多項目。

# FilterWithoutPipes-Line1
source: Given a list of integers, it filters out the even numbers,
cs: V daném seznamu celých čísel odfiltruje sudá čísla,
de: Aus einer Liste mit Integern werden die geraden Zahlen herausgefiltert,
es: Dada una lista de enteros, aplica un filtro para excluir los números pares,
fr: Pour une liste d'entiers donnée, élimine les nombres pairs par filtrage,
it: Dato un elenco di interi, filtra i numeri pari,
ja: 整数のリストを指定すると、偶数を除外し、
ko: 정수 목록인 경우 짝수를 필터링하고,
pl: W oparciu o podaną listę liczb całkowitych funkcja filtruje liczby parzyste,
pt_br: Dada uma lista de inteiros, ele filtra os números pares,
ru: При наличии списка целых чисел выполняет фильтрацию по номерам событий,
tr: Bir tamsayı listesinde, çift sayıları filtreler,
zh_hans: 如果是整数列表，它会筛选出偶数，
zh_hant: 提供整數清單，它會篩選出偶數，

# FilterWithoutPipes-Line2
source: squares the resulting odds, and adds 1 to the squared odds.
cs: umocní výsledná lichá čísla na druhou a přičte 1 k lichým číslům umocněným na druhou.
de: die sich ergebenden ungeraden Zahlen werden quadratiert, und zu dem Ergebnis wird 1 hinzuaddiert.
es: eleva al cuadrado los impares resultantes y les suma 1.
fr: met au carré les nombres impairs résultants, puis ajoute 1 au carré des nombres impairs.
it: calcola i quadrati dei numeri dispari risultati e aggiunge 1 ai numeri dispari quadrati.
ja: 結果の奇数を 2 乗し、2 乗した奇数に 1 を加算します。
ko: 결과 홀수를 제곱하고 제곱한 홀수에 1을 더합니다.
pl: podnosi nieparzyste wyniki do potęgi drugiej, a następnie dodaje 1 do podniesionych do potęgi drugiej liczb nieparzystych.
pt_br: eleva os ímpares resultantes ao quadrado e adiciona 1 aos ímpares elevados ao quadrado.
ru: возводит полученные нечетные в квадрат, а затем добавляет 1 к нечетным, возведенным в квадрат.
tr: kalan tek sayıların karesini alır ve karesi alınan tek sayılara 1 ekler.
zh_hans: 将产生的奇数平方，然后将奇数平方值加 1。
zh_hant: 取結果奇數的平方值，並對平方後的奇數加 1。

# FilterShorter-Line1
source: A shorter way to write 'squareOddValuesAndAddOne' is to nest each
cs: Kratší způsob, jak napsat squareOddValuesAndAddOne, je vnořit jednotlivé
de: Eine kürzere Möglichkeit zum Schreiben von "squareOddValuesAndAddOne" besteht im Verschachteln von jedem
es: Una forma más corta de escribir "squareOddValuesAndAddOne" es anidar cada
fr: Pour écrire plus rapidement 'squareOddValuesAndAddOne', imbriquez chaque
it: Uno dei modi più brevi per scrivere 'squareOddValuesAndAddOne' consiste nell'annidare ogni
ja: 'squareOddValuesAndAddOne' を記述するためのより簡単な方法は、
ko: 'squareOddValuesAndAddOne'을 더 짧게 작성하려면
pl: Krótszym sposobem zapisu „squareOddValuesAndAddOne” jest zagnieżdżenie każdego
pt_br: Uma maneira mais curta para gravar 'squareOddValuesAndAddOne' é aninhar cada
ru: Более короткий способ записи squareOddValuesAndAddOne — вложить каждый
tr: 'squareOddValuesAndAddOne' yazmanın daha kısa bir yolu, her bir
zh_hans: 编写 "squareOddValuesAndAddOne" 的简便方法是将每个
zh_hant: 撰寫 'squareOddValuesAndAddOne' 較簡短的方式是巢狀每個項目

# FilterShorter-Line2
source: sub-result into the function calls themselves.
cs: dílčí výsledky přímo do volání funkcí.
de: Teilergebnis im Funktionsaufruf selbst.
es: subresultado en las propias llamadas a la función.
fr: sous-résultat dans les appels de fonction.
it: risultato secondario nelle chiamate di funzione stesse.
ja: それぞれのサブ結果を関数呼び出し自体に入れ子にすることです。
ko: 각 하위 결과를 함수 호출 자체에 중첩합니다.
pl: wyniku podrzędnego w samych wywołaniach funkcji.
pt_br: sub-resultado em função invoca a si mesmo.
ru: вложенный результат в сами вызовы функции.
tr: alt sonucu işlev hücrelerinin kendisinde iç içe yerleştirmektir.
zh_hans: 子结果嵌入函数调用本身。
zh_hant: 子結果進入函式呼叫本身。
