Repository: dotnet/fsharp
Catalog: vsintegration/ProjectTemplates/TutorialProject/Template/xlf/Tutorial.fsx.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# printf-Line2
source: If 'result1' were not of type 'int', then the line would fail to compile.
cs: Pokud by result1 nebyl typu int, pak by se kompilace řádku nezdařila.
de: Wenn "result1" nicht vom Typ "int" wäre, käme es bei der Kompilierung der Zeile zu einem Fehler.
es: Si "result1" no fuese de tipo "int", la línea no se compilaría.
fr: Si 'result1' n'est pas de type 'int', la compilation de la ligne échoue.
it: Se il tipo di 'result1' non fosse 'int', la riga non verrebbe compilata.
ja: 'result1' が 'int' 型でなかった場合、行はコンパイルに失敗します。
ko: 'result1'이 'int' 형식이 아닌 경우 줄이 컴파일되지 않습니다.
pl: Jeśli element „result1” nie miałby typu „int”, kompilacja wiersza zakończyłaby się niepowodzeniem.
pt_br: Se 'result1' não fosse do tipo 'int', a linha falharia na compilação.
ru: Если бы result1 не принадлежал к типу int, при компиляции строки произошел бы сбой.
tr: 'Result1' 'int' türünde değilse, satır derleme işlemi başarısız olur.
zh_hans: 如果 "result1" 不是类型 "int"，则将无法编译该行。
zh_hant: 如果 'result1' 的類型不是 'int'，則無法編譯該行。

# TypeAnnotation
source: When needed, annotate the type of a parameter name using '(argument:type)'. Parentheses are required.
cs: V případě potřeby anotujte typ názvu parametru pomocí (argument:typ). Závorky jsou povinné.
de: Blenden Sie bei Bedarf den Typ eines Parameternamens mithilfe von "(argument:type)" ein. Klammern sind erforderlich.
es: Si es necesario, anote el tipo de un nombre de parámetro usando "(argument:type)". Los paréntesis son obligatorios.
fr: Si nécessaire, annotez le type d'un nom de paramètre en utilisant '(argument:type)'. Les parenthèses sont obligatoires.
it: Quando necessario, annotare il tipo di un nome di parametro usando '(argument:type)'. Le parentesi sono obbligatorie.
ja: 必要であれば、'(引数:型)' を使用してパラメーター名の型に注釈を付けます。かっこは必須です。
ko: 필요한 경우 '(argument:type)'을 사용하여 매개 변수 이름 형식에 대한 주석을 답니다. 괄호가 필요합니다.
pl: W razie potrzeby adnotuj typ nazwy parametru przy użyciu polecenia „(argument:typ)”. Nawiasy są wymagane.
pt_br: Quando necessário, anote o tipo de um nome de parâmetro usando '(argument:type)'. É necessário usar parênteses.
ru: При необходимости аннотируйте тип имени параметра при помощи "(argument:type)". Скобки обязательны.
tr: Gerekli olduğunda, '(argument:type)' kullanarak parametre adı türü için ek açıklama girin. Ayraçlar gereklidir.
zh_hans: 如有需要，可使用 "(argument:type)" 批注参数名称类型。括号是必需的。
zh_hant: 需要時，請使用 '(argument:type)' 為參數名稱的類型加上標註。需要使用括號。

# Conditionals-Line1
source: Conditionals use if/then/elid/elif/else.
cs: Podmíněné výrazy používají příkazy if, then, elid, elif, else.
de: Für Bedingungen wird Folgendes verwendet: if/then/elid/elif/else.
es: Los condicionales usan if/then/elid/elif/else.
fr: Les conditions utilisent if/then/elid/elif/else.
it: Nelle istruzioni condizionali si usano if/then/elid/elif/else.
ja: 条件は、if/then/elid/elif/else を使用します。
ko: 조건은 if/then/elid/elif/else를 사용합니다.
pl: Wyrażenia warunkowe używają słów kluczowych if/then/elid/elif/else.
pt_br: Condicionais usam if/then/elid/elif/else.
ru: В условных выражениях используются операторы if, then, elid, elif и else.
tr: Koşullu deyimlerde if/then/elid/elif/else kullanılır.
zh_hans: 条件语句使用 if/then/elid/elif/else。
zh_hant: 條件使用 if/then/elid/elif/else。

# Conditionals-Line2
source: Note that F# uses whitespace indentation-aware syntax, similar to languages like Python.
cs: Všimněte si, že F# používá syntaxi rozpoznávající odsazení pomocí mezer – je to podobné jako u jazyků, jako je Python.
de: Bei der Syntax von F# werden ebenso wie bei Sprachen wie Python leerzeichenbasierte Einzüge beachtet.
es: Tenga en cuenta que F# utiliza una sintaxis que tiene en cuenta la sangría de espacios en blanco, de forma parecida a lenguajes como Python.
fr: Notez que F# utilise une syntaxe prenant en charge la mise en retrait à l'aide d'espaces, comme Python.
it: Si noti che F# usa la sintassi con riconoscimento degli spazi vuoti di rientro, in modo analogo a linguaggi come Python.
ja: F# は Python などの言語のように、空白のインデント対応構文を使用することに注意してください。
ko: F#은 Python과 같은 언어처럼 공백 들여쓰기 인식 구문을 사용합니다.
pl: Należy zauważyć, że język F# używa składni uwzględniającej wcięcia w postaci odstępów, tak jak w przypadku języków podobnych do języka Python.
pt_br: Observe que F# usa sintaxe com reconhecimento de recuo de espaço em branco, semelhante a linguagens como Python.
ru: Обратите внимание, что в F# используется синтаксис с отступами в виде пробелов, аналогично таким языкам, как Python.
tr: F#'ın, Python gibi diller ile benzer şekilde, boşluk girintisini tanıyan söz dizimi kullandığını unutmayın.
zh_hans: 注意，F# 使用可识别空格缩进的语法，与 Python 等语言类似。
zh_hant: 請注意，F# 使用空白縮排感知語法，其與 Python 這類語言類似。

# printf-Line3
source: This line uses '%f' to print the result as a float. As with '%d' above, this is type-safe.
cs: Tento řádek používá %f k vytištění výsledku jako hodnoty s plovoucí desetinnou čárkou. Stejně jako u výše uvedeného parametru %d je to typově bezpečné.
de: Diese Zeile verwendet "%f", um das Ergebnis als float-Eigenschaft zu drucken. Wie auch zuvor bei "%d" ist dies typsicher.
es: Esta línea utiliza "%f" para imprimir el resultado como un valor float. Al igual que "%d", cuenta con seguridad de tipos.
fr: Cette ligne utilise '%f' pour imprimer le résultat comme float. Comme '%d' ci-dessus, cette opération est de type sécurisé.
it: Questa riga usa '%f' per stampare il risultato in formato float. Come con '%d' in precedenza, è indipendente dai tipi.
ja: この行は '%f' を使用して結果を浮動小数として出力します。上記の '%d' と同様に、これはタイプ セーフです。
ko: 이 줄은 '%f'을(를) 사용하여 결과를 float으로 인쇄합니다. 위의 '%d'처럼 이 코드는 형식이 안전합니다.
pl: Ten wiersz używa elementu „%f”, aby wydrukować wynik jako liczbę zmiennoprzecinkową. Podobnie jak w przypadku elementu „%d” powyżej jest to bezpieczne.
pt_br: Esta linha usa '%f' para imprimir o resultado como um float. Como em '%d' acima, isso é fortemente tipado.
ru: Эта строка использует "%f" для вывода результата в виде числа с плавающей запятой. Как и в случае с "%d" выше, это типобезопасно.
tr: Bu satır, sonucu kayan noktalı sayı olarak yazdırmak için '%f' kullanır. Yukarıdaki '%d' gibi bu da tür kullanımıyla uyumludur.
zh_hans: 此行使用 "%f" 将结果作为浮点打印。与上述 "%d" 情况一样，属于类型安全。
zh_hant: 此行使用 '%f' 以浮點形式列印結果。與上述 '%d' 相同，這是型別安全。

# Booleans-Line1
source: Booleans are fundamental data types in F#. Here are some examples of Booleans and conditional logic.
cs: Logické hodnoty představují základní datové typy v jazyce F#. Tady je několik příkladů logických hodnot a podmíněné logiky.
de: Boolesche Werte sind grundlegende Datentypen in F#. Hier finden Sie einige Beispiele für boolesche Werte und Bedingungen.
es: Los valores booleanos son tipos de datos fundamentales en F#. Estos son algunos ejemplos de valores booleanos y lógica condicional.
fr: Les booléens sont des types de données fondamentaux en F#. Voici quelques exemples illustrant des booléens et la logique conditionnelle.
it: I valori booleani sono tipi di dati fondamentali in F#. Ecco alcuni esempi di valori booleani e logica condizionale.
ja: ブール値は F# の基本のデータ型です。ブール値と条件ロジックの例をいくつか示します。
ko: 부울은 F#에서 기본적인 데이터 형식입니다. 다음은 부울 및 조건부 논리의 몇 가지 예입니다.
pl: Wartości logiczne są fundamentalnymi typami danych w języku F#. Oto kilka przykładów wartości logicznych i logiki warunkowej.
pt_br: Boolianos são tipos de dados fundamentais em F#. Aqui estão alguns exemplos de Boolianos e lógica condicional.
ru: Логические значения являются основными типами данных в F#. Ниже приведен ряд примеров логических типов данных и условной логики.
tr: Boole değerleri, F# içindeki temel veri türleridir. Aşağıda bazı Boole ve koşullu mantık örnekleri verilmiştir.
zh_hans: 布尔是 F# 中的基本数据类型。下面是一些布尔值和条件逻辑示例。
zh_hant: 布林值是 F# 中的基本資料類型。以下是一些布林值與條件式邏輯的範例。

# Booleans-Line2
source: To learn more, see:
cs: Další informace:
de: Weitere Informationen finden Sie unter:
es: Para obtener más información, vea:
fr: Pour en savoir plus, consultez :
it: Per altre informazioni, vedere:
ja: 詳細については、次を参照してください:
ko: 자세히 알아보려면 다음을 참조하세요:
pl: Aby dowiedzieć się więcej, zobacz:
pt_br: Para saber mais, acesse:
ru: Подробности:
tr: Daha fazla bilgi için bkz:
zh_hans: 有关详细信息，请参阅:
zh_hant: 若要深入了解，請參閱:

# Booleans-Line3
source: and
cs: a
de: Und
es: Y
fr: Et
it: e
ko: 그리고
pl: oraz
pt_br: E
ru: И
tr: ve
zh_hans: 和
zh_hant: 及

# BooleanValues
source: Booleans values are 'true' and 'false'.
cs: Logické hodnoty jsou true a false.
de: Boolesche Werte sind "true" und "false".
es: Los valores booleanos son "true" y "false".
fr: Les valeurs booléennes sont 'true' et 'false'.
it: I valori booleani sono 'true' e 'false'.
ja: ブール型の値は 'true' と 'false' です。
ko: 부울 값은 'true' 및 'false'입니다.
pl: Wartości logiczne przyjmują wartość „true” i „false”.
pt_br: Valores booliano são 'true' e 'false'.
ru: Логические значения — это true и false.
tr: Boole değerleri şunlardır: 'true' ve 'false'.
zh_hans: 布尔值为 "true" 和 "false"。
zh_hant: 布林值為 'true' 和 'false'。

# BooleanOperators
source: Operators on booleans are 'not', '&&' and '||'.
cs: Operátory u logických hodnot jsou not, && a ||.
de: Operatoren für boolesche Werte sind "not", "&&" und "||".
es: Los operadores de valores booleanos son "not", "&&" y "||".
fr: Les opérateurs sur les booléens sont 'not', '&&' et '||'.
it: Gli operatori su valori booleani sono 'not', '&&' e '||'.
ja: ブール値の演算子は 'not'、'&&'、および '||' です。
ko: 부울의 연산자는 'not', '&&' 및 '||'입니다.
pl: Operatory wartości logicznych to „not”, „&&” i „||”.
pt_br: Operadores em boolianos são 'not', '&&' e '||'.
ru: Операторы для логических значений — not, && и ||.
tr: Boole değerleri üzerindeki işleçler: 'not', '&&' ve '||'.
zh_hans: 布尔运算符为 "not"、"&&" 和 "||"。
zh_hant: 布林值上的運算子為 'not'、'&&' 和 '||'。

# BooleanPrintf
source: This line uses '%b'to print a boolean value. This is type-safe.
cs: Tento řádek používá %b k vytištění logické hodnoty. Je to typově bezpečné.
de: Diese Zeile verwendet "%b" zum Drucken eines booleschen Werts. Dies ist typsicher.
es: Esta línea utiliza "%b" para imprimir un valor booleano. Cuenta con seguridad de tipos.
fr: Cette ligne utilise '%b' pour imprimer une valeur booléenne. Cette opération est de type sécurisé.
it: Questa riga usa '%b' per stampare un valore booleano. È indipendente dai tipi.
ja: この行は '%b' を使用してブール値を出力します。これはタイプ セーフです。
ko: 이 줄은 '%b'을(를) 사용하여 부울 값을 인쇄합니다. 이 코드는 형식이 안전합니다.
pl: Ten wiersz używa elementu „%b”, aby wydrukować wartość logiczną. Jest to bezpieczne.
pt_br: Esta linha usa '%b' para imprimir um valor booliano. Isso é fortemente tipado.
ru: В этой строке "%b" используется для вывода логического значения. Это типобезопасно.
tr: Bu satır, bir boole değeri yazdırmak için '%b' kullanır. Tür kullanımıyla uyumludur.
zh_hans: 本行用 "%b" 打印布尔值。这属于类型安全。
zh_hant: 此行使用 '%b' 列印布林值。這是型別安全。

# Strings-Line1
source: Strings are fundamental data types in F#. Here are some examples of Strings and basic String manipulation.
cs: Řetězce představují základní datové typy v jazyce F#. Tady je několik příkladů řetězců a základní manipulace s nimi.
de: Zeichenfolgen sind grundlegende Datentypen in F#. Hier finden Sie einige Beispiele für Zeichenfolgen und Zeichenfolgenmanipulationen.
es: Las cadenas son tipos de datos fundamentales en F#. Estos son algunos ejemplos de cadenas y de manipulación básica de cadenas.
fr: Les chaînes sont des types de données fondamentaux en F#. Voici quelques exemples illustrant des chaînes et la manipulation de chaînes de base.
it: Le stringhe sono tipi di dati fondamentali in F#. Ecco alcuni esempi di stringhe e di manipolazione di base delle stringhe.
ja: 文字列は F# の基本のデータ型です。文字列と基本的な文字列操作の例をいくつか示します。
ko: 문자열은 F#에서 기본적인 데이터 형식입니다. 다음은 문자열 및 기본 문자열 조작의 몇 가지 예입니다.
pl: Ciągi są fundamentalnymi typami danych w języku F#. Oto kilka przykładów ciągów i podstawowych manipulacji ciągami.
pt_br: Cadeias de caracteres são tipos de dados fundamentais em F#. Aqui estão alguns exemplos de Cadeias de caracteres e a manipulação básicas de Cadeia de caracteres.
ru: Строки являются основными типами данных в F#. Ниже приведено несколько примеров строк и основных действий с ними.
tr: Dizeler, F# içindeki temel veri türleridir. Aşağıda bazı Dizeler ve temel dize işleme örnekleri verilmiştir.
zh_hans: 字符串是 F# 中的基本数据类型。下面是一些字符串和基本的字符串操作示例。
zh_hant: 字串在 F# 中是基本的資料類型。以下是一些字串與基本字串操作的範例。

# Strings-Line2
source: To learn more, see: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/strings
cs: Další informace najdete v tématu: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/strings
es: Para obtener más información, consulte: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/strings
fr: Pour en savoir plus, consultez : https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/strings
pl: Aby dowiedzieć się więcej, zobacz: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/strings
ru: Подробности: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/strings

# StringQuotes
source: Strings use double quotes.
cs: Pro řetězce se používají dvojité uvozovky.
de: Für Zeichenfolgen werden doppelte Anführungszeichen verwendet.
es: Las cadenas usan comillas dobles.
fr: Les chaînes utilisent des guillemets doubles.
it: Per le stringhe si usano le virgolette doppie.
ja: 文字列は二重引用符を使用します。
ko: 문자열은 큰따옴표를 사용합니다.
pl: Ciągi używają cudzysłowów.
pt_br: Cadeias de caracteres usam aspas duplas.
ru: В строках используются двойные кавычки.
tr: Dizeler çift tırnak kullanır.
zh_hans: 字符串使用双引号。
zh_hant: 字串使用雙引號。

# StringLiterals-Line1
source: Strings can also use @ to create a verbatim string literal.
cs: V řetězcích je také možné použít @ k vytvoření řetězcového literálu verbatim.
de: Mit "@" lassen sich ausführliche Zeichenfolgenliterale erstellen.
es: Las cadenas también pueden usar @ para crear un literal de cadena textual.
fr: Les chaînes peuvent également utiliser @ pour créer un littéral de chaîne textuelle.
it: Nelle stringhe si può anche usare @ per creare un valore letterale di stringa verbatim.
ja: 文字列は @ を使用して、verbatim 文字列リテラルを作成することもできます。
ko: 또한 문자열은 @을 사용하여 축자 문자열 리터럴을 만듭니다.
pl: W ciągach można także używać znaku @ do tworzenia dosłownych literałów ciągu.
pt_br: Cadeias de caracteres também podem usar @ para criar um literal de cadeia de caracteres textual.
ru: В строках также может использоваться @ для создания буквальных (verbatim) строковых литералов.
tr: Dizeler ayrıca, tam harf dizisi oluşturmak için @ kullanabilir.
zh_hans: 字符串也可使用 @ 创建逐字的字符串。
zh_hant: 字串也可使用 @ 來建立逐字字串常值。

# StringLiterals-Line2
source: This will ignore escape characters such as '\', '\n', '\t', etc.
cs: Tím se budou ignorovat řídicí znaky jako \, \n, \t apod.
de: Dadurch werden Escapezeichen wie "\", "\n", "\t" usw. ignoriert.
es: No tiene en cuenta los caracteres de escape, como "\", "\n", "\t", etc.
fr: Les caractères d'échappement tels que '\', '\n', '\t', etc. sont ainsi ignorés.
it: In questo modo i caratteri di escape, come '\', '\n', '\t' e così via, verranno ignorati.
ja: これは、'\'、'\n'、'\t' などのエスケープ文字を無視します。
ko: 이 경우 '\', '\n', '\t' 등과 같은 이스케이프 문자열을 무시합니다.
pl: Spowoduje to ignorowanie znaków ucieczki, np. „\”, „\n”, „\t” itp.
pt_br: Isso vai ignorar caracteres de escapada como '\', '\n', '\t', etc.
ru: Будут пропускаться escape-символы, такие как "\", "\n", "\t" и т. д.
tr: Bu; '\', '\n', '\t' vb. kaçış karakterlerini yoksayar.
zh_hans: 这将忽略转义字符，如 "\", "\n", "\t" 等。
zh_hant: 這將會忽略逸出字元，例如 '\'、'\n'、'\t' 等等。

# StringTripleQuotes
source: String literals can also use triple-quotes.
cs: Řetězcové literály můžou používat také trojité uvozovky.
de: Für Zeichenfolgen können auch dreifache Anführungszeichen verwendet werden.
es: Los literales de cadena también pueden usar comillas triples.
fr: Les littéraux de chaîne peuvent également utiliser des guillemets triples.
it: Nei valori letterali si possono usare anche virgolette triple.
ja: 文字列リテラルは三重引用符を使用することもできます。
ko: 또한 문자열 리터럴은 세 따옴표를 사용합니다.
pl: Literały ciągu mogą także używać potrójnych cudzysłowów.
pt_br: Literais de cadeia de caracteres também podem usar aspas triplas.
ru: В строковых литералах также используются тройные кавычки.
tr: Harf dizileri ayrıca üçlü tırnak da kullanabilir.
zh_hans: 字符串文本也可使用三重引号。
zh_hant: 字串常值也可使用三引號。

# StringConcatenation
source: String concatenation is normally done with the '+' operator.
cs: Zřetězení se obvykle provádí operátorem +.
de: Die Verkettung von Zeichenfolgen erfolgt in der Regel mit dem Operator "+".
es: La concatenación de cadenas suele hacerse con el operador "+".
fr: L'opérateur '+' est généralement utilisé pour la concaténation de chaînes.
it: Per la concatenazione di stringhe viene in genere usato l'operatore '+'.
ja: 通常、文字列の連結は '+' 演算子を使用して実行されます。
ko: 문자열 연결은 일반적으로 '+' 연산자로 합니다.
pl: Łączenie ciągów wykonuje się zazwyczaj przy użyciu operatora „+”.
pt_br: A concatenação de cadeia de caracteres normalmente é feita com o operador '+'.
ru: Сцепление строк обычно выполняется при помощи оператора "+".
tr: Dizi bitiştirme normalde '+' işleci ile yapılır.
zh_hans: 字符串串联通常是用 "+" 运算符完成的。
zh_hant: 串連字串通常使用 '+' 運算子進行。

# StringPrinting
source: This line uses '%s' to print a string value. This is type-safe.
cs: Tento řádek používá %s k vytištění řetězcové hodnoty. Je to typově bezpečné.
de: Diese Zeile verwendet "%s" zum Drucken eines Zeichenfolgewerts. Dies ist typsicher.
es: Esta línea utiliza "%s" para imprimir un valor de cadena. Cuenta con seguridad de tipos.
fr: Cette ligne utilise '%s' pour imprimer une valeur de chaîne. Cette opération est de type sécurisé.
it: Questa riga usa '%s' per stampare un valore stringa. È indipendente dai tipi.
ja: この行は、'%s' を使用して文字列値を出力します。これはタイプ セーフです。
ko: 이 줄은 '%s'을(를) 사용하여 문자열 값을 인쇄합니다. 이 코드는 형식이 안전합니다.
pl: Ten wiersz używa elementu „%s”, aby wydrukować wartość ciągu. Jest to bezpieczne.
pt_br: Esta linha usa '%s' para imprimir um valor de cadeia de caracteres. Isso é fortemente tipado.
ru: В этой строке "%s" используется для вывода строкового значения. Это типобезопасно.
tr: Bu satır, bir dize değeri yazdırmak için '%s' kullanır. Tür kullanımıyla uyumludur.
zh_hans: 本行用 "%s" 打印字符串值。这属于类型安全。
zh_hant: 此行使用 '%s' 列印字串值。這是型別安全。

# Substrings-Line1
source: Substrings use the indexer notation. This line extracts the first 7 characters as a substring.
cs: Podřetězce používají notaci indexeru. Tento řádek extrahuje prvních 7 znaků jako podřetězec.
de: Für Teilzeichenfolgen wird die Indexernotation verwendet. Diese Zeile extrahiert die ersten sieben Zeichen als Teilzeichenfolge.
es: Las subcadenas utilizan la notación del indexador. Esta línea extrae los 7 primeros caracteres como una subcadena.
fr: Les sous-chaînes utilisent la notation de l'indexeur. Cette ligne extrait les 7 premiers caractères comme sous-chaîne.
it: Nelle sottostringhe si usa la notazione dell'indicizzatore. Questa riga estrae i primi sette caratteri come sottostringa.
ja: サブ文字列はインデクサー表記を使用します。この行はサブ文字列として最初の 7 文字を抽出します。
ko: 부분 문자열은 인덱서 표기법을 사용합니다. 이 줄은 처음 7개 문자를 부분 문자열로 추출합니다.
pl: Podciągi używają notacji indeksatora. Ten wiersz wyodrębnia pierwsze 7 znaków w formie podciągu.
pt_br: Subcadeias de caracteres usam a notação de indexador. Essa linha extrai os sete primeiros caracteres como uma subcadeia de caracteres.
ru: Подстроки используют нотацию индексатора. Эта строка кода извлекает первые семь символов в виде подстроки.
tr: Alt dizeler dizin oluşturucu gösterimini kullanır. Bu satır, ilk 7 karakteri alt dize olarak ayıklar.
zh_hans: 子字符串使用索引表示法。此行提取前 7 个字符作为子字符串。
zh_hant: 子字串使用索引子標記法。此行會擷取前 7 個字元作為子字串。

# Substrings-Line2
source: Note that like many languages, Strings are zero-indexed in F#.
cs: Všimněte si, že jako v mnoha jiných jazycích mají řetězce v jazyce F# nulový index.
de: Im Gegensatz zu den meisten anderen Sprachen sind Zeichenfolgen in F# nullindiziert.
es: Tenga en cuenta que, al igual que en otros muchos lenguajes, las cadenas tienen índice 0 en F#.
fr: Comme dans bien d'autres langages, les chaînes ont un index de base zéro en F#.
it: Si noti che, analogamente a molti linguaggi, le stringhe presentano indice zero in F#.
ja: 多くの言語と同様に、F# では、文字列のインデックスは 0 から始まることに注意してください。
ko: 다른 여러 언어처럼 F#에서는 문자열이 0으로 인덱싱됩니다.
pl: Należy zauważyć, że w języku F# ciągi znaków są indeksowane od zera, podobnie jak w wielu innych językach.
pt_br: Observe que, como muitas linguagens, Cadeias de Caracteres são indexadas com zero em F#.
ru: Учтите, что, как и во многих других языках, в F# строки индексируются от нуля.
tr: Birçok dilde olduğu gibi F#'ta da Dizeler sıfır dizinlidir.
zh_hans: 注意，与许多语言相同，字符串在 F# 中从零开始编制索引。
zh_hant: 請注意，就像許多語言一樣，字串在 F# 中會以零為基底編製索引。

# Tuples-Line1
source: Tuples are simple combinations of data values into a combined value.
cs: Řazená kolekce členů představuje jedinou hodnotu vytvořenou jednoduchým zkombinováním hodnot dat.
de: Tupel sind einfache Datenwertkombinationen.
es: Las tuplas son combinaciones simples de valores de datos en un valor combinado.
fr: Les tuples sont des combinaisons simples de valeurs de données formant une valeur combinée.
it: Le tuple sono semplici combinazioni di valori dati in un valore combinato.
ja: タプルは、データ値と合計値の単純な組み合わせです。
ko: 튜플은 데이터 값을 조합된 값으로 만드는 간단한 조합입니다.
pl: Krotki to proste kombinacje wartości danych tworzące połączoną wartość.
pt_br: Tuplas são combinações simples de valores de dados em um valor combinado.
ru: Кортеж — это простое сочетание значений данных в виде объединенного значения.
tr: Demetler, veri değerlerinin birleşik bir değer halindeki basit bileşimleridir.
zh_hans: 元组是组合成组合值的简单数据值组合。
zh_hant: 元組是簡單的資料值合併為合併值。

# Tuples-Line2
source: To learn more, see: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/tuples
cs: Další informace najdete tady: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/tuples
es: Para obtener más información, consulte: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/tuples
fr: Pour en savoir plus, consultez : https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/tuples
pl: Aby dowiedzieć się więcej, zobacz: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/tuples
ru: Подробности: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/tuples

# TupleInteger
source: A simple tuple of integers.
cs: Jednoduchá řazená kolekce členů v podobě celých čísel.
de: Ein einfaches Tupel aus Integerwerten.
es: Tupla de enteros sencilla.
fr: Tuple simple d'entiers.
it: Tupla di interi semplice.
ja: 整数のシンプルなタプルです。
ko: 단순한 정수 튜플입니다.
pl: Prosta krotka liczb całkowitych.
pt_br: Uma tupla simples de inteiros.
ru: Простой кортеж целых чисел.
tr: Basit bir tamsayı demeti.
zh_hans: 一个包含整数的简单元组。
zh_hant: 簡式整數元組。

# TupleFunction-Line1
source: A function that swaps the order of two values in a tuple.
cs: Funkce, která zamění pořadí dvou hodnot v řazené kolekci členů
de: Eine Funktion, die die Reihenfolge von zwei Werten in einem Tupel austauscht.
es: Una función que intercambia el orden de dos valores en una tupla.
fr: Fonction qui inverse l'ordre de deux valeurs d'un tuple.
it: Funzione che scambia l'ordine di due valori in una tupla.
ja: タプルの 2 つの値の順序を入れ替える関数。
ko: 튜플에 있는 두 값의 순서를 바꾸는 함수입니다.
pl: Funkcja zamieniająca kolejność dwóch wartości w krotce.
pt_br: Uma função que troca a ordem de dois valores em uma tupla.
ru: Функция, меняющая местами два значения в кортеже.
tr: Bir demetteki iki değerin sırasını değiştiren bir işlev.
zh_hans: 一个用于交换两个值在元组中的顺序的函数。
zh_hant: 將元組中兩個值的順序互換的函式。
