Repository: dotnet/fsharp
Catalog: vsintegration/ProjectTemplates/TutorialProject/Template/xlf/Tutorial.fsx.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ParseHelpers
source: Define some more functions which parse with the helper function.
cs: Definujte pár dalších funkcí, které se analyzují s pomocnou funkcí.
de: Definieren Sie weitere Funktionen, die eine Analyse mithilfe der Hilfsfunktion durchführen.
es: Define algunas funciones más que se analizan con la función auxiliar.
fr: Définissez d'autres fonctions d'analyse avec la fonction d'assistance.
it: Consente di definire alcune altre funzioni che vengono analizzate con la funzione helper.
ja: ヘルパー関数で解析する別の関数をいくつか定義します。
ko: 도우미 함수를 사용하여 구문 분석하는 함수를 더 정의합니다.
pl: Zdefiniuj więcej funkcji, które będą analizować przy użyciu funkcji pomocniczej.
pt_br: Defina mais algumas funções que são analisadas com a função auxiliar.
ru: Определение некоторых других функций, которые выполняют анализ при помощи вспомогательной функции.
tr: Yardımcı işlev ile ayrıştırılan birkaç işlev daha tanımlayın.
zh_hans: 定义更多使用 helper 函数分析的函数。
zh_hant: 再額外定義一些使用 Helper 函式進行剖析的函式。

# ActivePatterns-Line1
source: Active Patterns are another powerful construct to use with pattern matching.
cs: Aktivní vzory představují další efektivní konstrukci pro použití s porovnáváním vzorů.
de: Aktive Muster sind ein weiteres leistungsstarkes Konstrukt, das beim Musterabgleich verwendet werden kann.
es: Los patrones activos son también una construcción muy eficaz para usarla con coincidencia de patrones.
fr: Les modèles actifs sont une autre construction efficace à utiliser avec les critères spéciaux.
it: I criteri attivi sono un altro costrutto efficace da usare con i criteri di ricerca.
ja: アクティブなパターンは、パターン マッチングで使用するもう 1 つの強力なコンストラクトです。
ko: 활성 패턴은 패턴 일치와 함께 사용하면 유용한 다른 구문입니다.
pl: Wzorce aktywne to kolejna zaawansowana konstrukcja do zastosowania podczas dopasowywania wzorców.
pt_br: Padrões Ativos são outro constructo avançado para usar com correspondência de padrões.
ru: Активные шаблоны — это еще одна эффективная конструкция, используемая при сопоставлении шаблонов.
tr: Etkin Desenler, desen eşleştirme ile kullanabileceğiniz diğer bir güçlü yapıdır.
zh_hans: 活动模式是另一个与模式匹配配合使用的强大构造。
zh_hant: 現用模式是另一項功能強大之建構，可與模式比對搭配使用。

# ActivePatterns-Line2
source: They allow you to partition input data into custom forms, decomposing them at the pattern match call site.
cs: Umožňují rozdělit vstupní data do vlastních forem, přičemž se rozkládají v místě volání porovnávání vzorů.
de: Sie ermöglichen eine Partitionierung der Eingabedaten in benutzerdefinierte Formen, wobei sie an der Musterabgleichs-Aufrufsite zerlegt werden.
es: Permiten particionar los datos de entrada en formas personalizadas, descomponiéndolos en el sitio de llamada de coincidencia de patrones.
fr: Ils permettent de partitionner des données d'entrée dans des formulaires personnalisés, en les décomposant au niveau du site d'appel de correspondance au modèle.
it: Consentono di partizionare i dati di input in form personalizzati, scomponendoli a livello del sito di chiamata dei criteri di ricerca.
ja: パターン マッチの呼び出しサイトで分解して、入力データをカスタム フォームにパーティション分割できるようにします。
ko: 활성 패턴을 사용하면 입력 데이터를 사용자 지정 폼으로 분할하고, 패턴 일치 호출 사이트에서 이 폼을 분해할 수 있습니다.
pl: Umożliwiają one partycjonowanie danych wejściowych do formularzy niestandardowych przez ich rozkładanie w lokacji wywołania dopasowania wzorca.
pt_br: Eles permitem particionar os dados de entrada em formulários personalizados, decompondo-os no local da chamada de correspondência de padrão.
ru: Они позволяют сегментировать входные данные в настраиваемые формы с декомпозицией в месте вызова сопоставления шаблонов.
tr: Giriş verilerini desen eşleştirme çağrı sitesinde bölerek özel formlara ayırmanıza olanak sağlar.
zh_hans: 它们使你能够将输入数据分区到自定义窗体，然后在模式匹配调用站点分解它们。
zh_hant: 它們可讓您將輸入資料分割到多個自訂表單，於模式比對呼叫網站進行分解。

# ActivePatterns-Line3
source: To learn more, see: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/active-patterns
cs: Další informace najdete v tématu: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/active-patterns
es: Para obtener más información, consulte: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/active-patterns
fr: Pour en savoir plus, consultez : https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/active-patterns
pl: Aby dowiedzieć się więcej, zobacz: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/active-patterns
ru: Подробности: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/active-patterns

# MatchActivePattern
source: Pattern Matching via 'function' keyword and Active Patterns often looks like this.
cs: Porovnávání vzorů přes klíčové slovo function a aktivní vzory často vypadá takto.
de: Der Musterabgleich mithilfe des Schlüsselworts "function" und das aktive Muster sehen häufig wie folgt aus.
es: La coincidencia de patrones con la palabra clave "function" y patrones activos suele ser similar a este código.
fr: Les critères spéciaux avec le mot clé 'function' et les modèles actifs ressemblent souvent à ceci.
it: I criteri di ricerca con parola chiave 'function' e criteri attivi sono spesso simili a questi.
ja: 'function' キーワードとアクティブ パターンによるパターン マッチングは、多くの場合、次のようになります。
ko: 'function' 키워드 및 활성 패턴을 통한 패턴 일치는 이처럼 보이는 경우가 많습니다.
pl: Dopasowywanie wzorców za pośrednictwem słowa kluczowego „function” i wzorców aktywnych często wygląda w następujący sposób.
pt_br: Correspondência de Padrões por meio de palavra-chave 'function' e Padrões Ativos geralmente têm essa aparência.
ru: Сопоставление шаблонов по ключевому слову function и активным шаблонам часто выглядит следующим образом.
tr: 'Function' anahtar sözcüğü ve Etkin Desenler aracılığıyla Desen Eşleştirme, genellikle böyle görünür.
zh_hans: 通过 "function" 关键字的匹配模式和活动模式通常如下所示。
zh_hant: 透過 'function' 關鍵字與現用模式進行模式比對，通常看來如下。

# PrintParse
source: Call the printer with some different values to parse.
cs: Volání tiskárny s nějakými jinými hodnotami k parsování
de: Rufen Sie den Drucker mit unterschiedlichen zu analysierenden Werten auf.
es: Llamar a la impresora con algunos valores diferentes para analizar.
fr: Appelez l'imprimante avec des valeurs différentes à analyser.
it: Chiama la stampante con alcuni valori diversi da analizzare.
ja: 解析するいくつかの異なる値でプリンターを呼び出します。
ko: 구문 분석할 다른 값을 사용하여 프린터를 호출합니다.
pl: Wywołaj drukarkę za pomocą innych wartości do przeanalizowania.
pt_br: Chamar a impressora com alguns valores diferentes para analisar.
ru: Вызов принтера с несколькими разными значениями для анализа.
tr: Ayrıştırılacak farklı değerlerle yazıcıyı çağırın.
zh_hans: 使用一些其他值调用打印机进行分析。
zh_hant: 透過解析一些不同的值來呼叫印表機。

# Option-Line1
source: Option values are any kind of value tagged with either 'Some' or 'None'.
cs: Hodnotami parametru můžou být hodnoty jakéhokoliv typu s označením Some (Nějaké) nebo None (Žádné).
de: Bei Optionswerten handelt es sich um eine beliebige Art von Werten, die entweder mit "Some" oder mit "None" markiert sind.
es: Los valores de opción son cualquier tipo de valor etiquetado como 'Some' o 'None'.
fr: Les valeurs d'option sont tout type de valeur marquée avec 'Some' ou 'None'.
it: Il valore dell'opzione è qualsiasi valore con tag 'Some' o 'None'.
ja: オプション値とは、'Some' または 'None' がタグされたあらゆる種類の値です。
ko: 옵션 값에는 'Some' 또는 'None'으로 태그 처리된 모든 종류의 값을 사용할 수 있습니다.
pl: Wartości opcji to dowolne wartości otagowane jako „Some” lub „None”.
pt_br: Os valores de opção são qualquer tipo de valor marcado com 'Algum' ou 'Nenhum'.
ru: Опциональные значения - это любой тип значений, отмеченных ключевым словом Some или None.
tr: Seçenek değerleri 'Some' veya 'None' ile etiketlenmiş herhangi bir değer türü olabilir.
zh_hans: 选项值是用“Some”或“None”标记的任何类型的值。
zh_hant: 選項值是以 'Some' 或 'None' 標記的任何一種值。

# Option-Line2
source: They are used extensively in F# code to represent the cases where many other
cs: Používají se často v kódu F#, kde reprezentují případy, ve kterých by se v řadě jiných
de: Sie werden in F#-Code umfassend verwendet, um die Fälle darzustellen, in denen viele
es: Se usan de forma exhaustiva en el código de F# para representar los casos en los que muchos otros
fr: Elles sont très utilisées dans le code F# pour représenter les cas où de nombreux autres
it: Questi valori sono ampiamente utilizzati nel codice F# per rappresentare i casi in cui molti altri
ja: F# コードで広く使用され、他の多くの言語で null 参照が使用される
ko: F# 코드에서 광범위하게 사용되어 다른 언어에서는 null 참조를 사용하는 케이스를
pl: Są one bardzo często używane w kodzie języka F# do reprezentowania przypadków, w których w wielu innych
pt_br: Eles são usados extensivamente no código F# para representar os casos em que muitos outros
ru: Они широко используются в коде F# для представления случаев, когда во многих
tr: Bunlar yaygın olarak diğer birçok dilin null başvurular kullandığı durumları temsil
zh_hans: 它们在 F# 代码中广泛用于表示许多其他
zh_hant: 它們廣泛用於 F# 程式碼中，來代表許多其他語言會

# Option-Line3
source: languages would use null references.
cs: jazyků používaly odkazy null.
de: Sprachen NULL-Verweise verwenden würden.
es: lenguajes usarían referencias NULL.
fr: langages utilisent des références null.
it: linguaggi utilizzerebbero riferimenti null.
ja: ケースを表します。
ko: 나타냅니다.
pl: językach użyte zostałyby odwołania o wartości null.
pt_br: idiomas usariam referências nulas.
ru: других языках используются пустые ссылки.
tr: etmek üzere F# kodunda kullanılır.
zh_hans: 语言使用 null 引用的用例。
zh_hant: 使用 null 參考的狀況。

# Option-Line4
source: To learn more, see: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/options
cs: Další informace najdete v tématu: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/options
es: Para obtener más información, consulte: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/options
fr: Pour en savoir plus, consultez : https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/options
pl: Aby dowiedzieć się więcej, zobacz: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/options
ru: Подробности: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/options

# ZipCode
source: First, define a zipcode defined via Single-case Discriminated Union.
cs: Nejprve definujte PSČ prostřednictvím rozlišovaného sjednocení s jedním případem.
de: Definieren Sie als Erstes eine Postleitzahl, die über eine diskriminierte Einzelfall-Union definiert ist.
es: En primer lugar, defina un código postal con una unión discriminada de un solo caso.
fr: Commencez par définir un code postal au moyen d'une union discriminée à cas unique.
it: Consente innanzitutto di definire un codice postale definito tramite l'unione discriminata a case singolo.
ja: まず、単一ケースの判別共用体を介して定義した郵便番号を定義します。
ko: 먼저 단일 케이스 구분된 공용 구조체를 통해 정의된 우편 번호를 정의합니다.
pl: Najpierw zdefiniuj kod pocztowy zdefiniowany za pośrednictwem unii rozłącznej o pojedynczym przypadku.
pt_br: Primeiro, determine um CEP definido por meio de União Discriminada de Único Caso.
ru: Во-первых, определите индекс при помощи размеченного объединения с одной ветвью.
tr: İlk olarak, Tek Durumlu Ayırt Edici Birleşim ile tanımlanan bir posta kodu tanımlayın.
zh_hans: 首先，定义通过单用例可区分联合定义的邮政编码。
zh_hant: 首先，定義透過單一案例差異聯集所定義的郵遞區號。

# Customer
source: Next, define a type where the ZipCode is optional.
cs: Dále definujte typ, kde je PSČ volitelné.
de: Definieren Sie als Nächstes einen Typ, bei dem "ZipCode" optional ist.
es: Después, defina un tipo donde ZipCode sea opcional.
fr: Définissez ensuite un type où ZipCode est facultatif.
it: Definire quindi un tipo in cui l'elemento ZipCode è facoltativo.
ja: 次に、郵便番号が省略可能である型を定義します。
ko: 다음으로 ZipCode가 선택 사항인 형식을 정의합니다.
pl: Następnie zdefiniuj typ, w którym element ZipCode jest opcjonalny.
pt_br: Em seguida, defina um tipo em que o CEP é opcional.
ru: Далее определите тип, в котором ZipCode является необязательным.
tr: Sonra, ZipCode’un isteğe bağlı olduğu bir tür tanımlayın.
zh_hans: 接下来，定义一个类型，其中 ZipCode 是可选项。
zh_hant: 接著，定義不一定需要 ZipCode 的類型。

# ShippingCalculator-Line1
source: Next, define an interface type that represents an object to compute the shipping zone for the customer's zip code,
cs: Potom definujte typ rozhraní, který bude představovat objekt pro výpočet expediční oblasti pro PSČ zákazníka
de: Definieren Sie dann einen Schnittstellentyp, der ein Objekt zum Berechnen der Versandkosten für die Postleitzahl des Kunden repräsentiert,
es: Después, defina un tipo de interfaz que represente un objeto para calcular la zona de envío del código postal del cliente,
fr: Ensuite, définissez un type d'interface qui représente un objet pour calculer la zone d'expédition correspondant au code postal du client,
it: Definire quindi un tipo di interfaccia che rappresenta un oggetto per calcolare la zona di spedizione per il codice postale del cliente,
ja: 次に、オブジェクトを表すインターフェイスの型を定義して、顧客の郵便番号の出荷ゾーンをコンピューティングし、
ko: 그리고 고객의 우편 번호에 대한 배송 영역을 계산하기 위해 개체를 나타내는 인터페이스 형식을 정의합니다.
pl: Następnie zdefiniuj typ interfejsu reprezentujący obiekt, aby obliczyć strefę wysyłki dla kodu pocztowego klienta
pt_br: Em seguida, defina um tipo de interface que representa um objeto para computar a zona de remessa para o CEP do cliente,
ru: Далее определите тип интерфейса, представляющий объект для вычисления зоны доставки по почтовому индексу заказчика,
tr: Sonra, müşterinin posta kodu için sevkiyat alanını hesaplayan bir nesneyi temsil eden arabirim türünü tanımlayın,
zh_hans: 接下来，定义表示对象的接口类型，用于计算客户邮政编码的送货区域，
zh_hant: 然後，定義代表物件的介面類型，以計算客戶郵遞區號的郵寄區域，

# ShippingCalculator-Line2
source: given implementations for the 'getState' and 'getShippingZone' abstract methods.
cs: se zohledněním implementací pro abstraktní metody getState a getShippingZone.
de: sofern Implementierungen für die abstrakten Methoden "getState" und "getShippingZone" vorhanden sind.
es: especificando implementaciones para los métodos abstractos 'getState' y 'getShippingZone'.
fr: en fonction des implémentations des méthodes abstraites 'getState' et 'getShippingZone'.
it: date le implementazioni per i metodi astratti 'getState' e 'getShippingZone'.
ja: 'getState' および 'getShippingZone' 抽象メソッドの実装が指定されています。
ko: 고객의 우편 번호에 대한 쇼핑 지역을 계산하는 추상 클래스입니다.
pl: przy użyciu danych implementacji metod abstrakcyjnych „getState” i „getShippingZone”.
pt_br: determinadas implementações para os métodos abstratos 'getState' e 'getShippingZone'.
ru: при заданных реализациях абстрактных методов getState и getShippingZone.
tr: 'getState' ve 'getShippingZone' soyut metotları uygulamalarından faydalanır.
zh_hans: 假定提供了“getState”和“getShippingZone”抽象方法的实现。
zh_hant: 'getState' 和 'getShippingZone' 抽象方法的指定實作。

# CalcShippingZone-Line1
source: Next, calculate a shipping zone for a customer using a calculator instance.
cs: Dále vypočítejte expediční oblast pro zákazníka pomocí instance kalkulačky.
de: Berechnen Sie nun mithilfe einer Rechnerinstanz die Versandkosten für einen Kunden.
es: Después, calcule una zona de envío para un cliente con una instancia de la calculadora.
fr: Ensuite, calculez une zone d'expédition pour un client à l'aide d'une instance de calculatrice.
it: Calcolare quindi una zona di spedizione per un cliente usando un'istanza della calcolatrice.
ja: 次に、電卓のインスタンスを使用して顧客の出荷ゾーンを計算します。
ko: 다음으로 계산기 인스턴스를 사용하여 고객의 배송 영역을 계산합니다.
pl: Następnie oblicz strefę wysyłki dla klienta za pomocą wystąpienia kalkulatora.
pt_br: Em seguida, calcule uma zona de remessa para um cliente usando uma instância da calculadora.
ru: Затем определите зону доставки для заказчика при помощи экземпляра калькулятора.
tr: Sonra, hesaplayıcı örneğini kullanarak müşteri için sevkiyat bölgesi hesaplayın.
zh_hans: 接下来，使用计算器实例计算客户的发货区域。
zh_hant: 接下來，為使用計算機執行個體的客戶計算出貨區。

# CalcShippingZone-Line2
source: This uses combinators in the Option module to allow a functional pipeline for
cs: Tady se používají kombinátory v modulu Option, pomocí kterých se povoluje funkční kanál pro
de: Dies verwendet Kombinatoren im Option-Modul für eine funktionale Pipeline zum
es: Aquí se utilizan combinadores en el módulo Option para permitir que una canalización funcional
fr: Des combinateurs du module Option sont utilisés pour permettre à un pipeline fonctionnel de
it: Usa i combinatori del modulo Option per consentire una pipeline funzionale per
ja: これは、オプション モジュール内の連結子を使用することにより、オプションを使用したデータ変換のために
ko: 여기서는 Option 모듈 내의 조합기를 사용하여 함수 파이프라인에서
pl: Operacja używa kombinatorów w module opcji, aby umożliwiać potokowi funkcjonalnemu
pt_br: Isso usa combinadores no módulo Option para permitir um pipeline funcional para
ru: При этом используются методы объединения в модуле Option, чтобы обеспечить работу функционального конвейера для
tr: Bu, Optionals ile veri dönüştürülmesini sağlamak için
zh_hans: 它在选项模块中使用连接符以允许功能管道
zh_hant: 這會在 Option 模組中使用結合器，以允許在執行下列功能時使用功能管線:

# CalcShippingZone-Line3
source: transforming data with Optionals.
cs: transformaci dat s volitelnými hodnotami.
de: Transformieren von Daten mit Optionen.
es: transforme datos con valores opcionales.
fr: transformer les données avec Optionals.
it: la trasformazione di dati con Optionals.
ja: 関数型パイプラインを使用できるようにします。
ko: Optionals를 통해 데이터를 변환할 수 있게 합니다.
pl: przekształcanie danych z wykorzystaniem elementów opcjonalnych.
pt_br: transformando dados com Opcionais.
ru: преобразования данных с помощью Optionals.
tr: Option modülünde birleştiricilerin kullanılmasını sağlar.
zh_hans: 用于使用可选项转换数据。
zh_hant: 使用選用項目來轉換資料。

# UnitsOfMeasure-Line1
source: Units of measure are a way to annotate primitive numeric types in a type-safe way.
cs: Měrné jednotky jsou způsob, jak anotovat primitivní číselné typy typově bezpečnou metodou.
de: Maßeinheiten sind eine Möglichkeit, um für primitive numerische Typen typsicher den Änderungsverlauf einzublenden.
es: Las unidades de medida son una forma de anotar tipos numéricos primitivos con seguridad de tipos.
fr: Les unités de mesure sont un moyen d'annoter les types numériques primitifs de manière sécurisée pour les types.
it: Le unità di misura consentono di annotare tipi numerici primitivi in modo indipendente dai tipi.
ja: 測定単位は、タイプ セーフな方法でプリミティブな数値型に注釈を付ける方法です。
ko: 측정 단위를 사용하면 형식이 안전한 방식으로 기본 숫자 형식에 주석을 달 수 있습니다.
pl: Jednostki miary są bezpiecznym sposobem dodawania adnotacji do pierwotnych typów numerycznych.
pt_br: Unidades de medida são uma forma de anotar tipos numéricos primitivos de um modo fortemente tipado.
ru: Единицы измерения — это способ аннотации примитивных числовых типов типобезопасным способом.
tr: Ölçü birimleri, basit sayısal türler için tür açısından güvenli bir şekilde ek açıklama girmenin bir yoludur.
zh_hans: 度量单位是一种以类型安全方式批注基元数值类型的方式。
zh_hant: 測量單位是以型別安全方式為基本數值類型加上註釋的方法。

# UnitsOfMeasure-Line2
source: You can then perform type-safe arithmetic on these values.
cs: Pak u těchto hodnot můžete provádět typově bezpečnou aritmetiku.
de: Anschließend können Sie für diese Werte die typsichere Arithmetik ausführen.
es: Después, puede realizar operaciones aritméticas con seguridad de tipos en estos valores.
fr: Vous pouvez ensuite effectuer des opérations arithmétiques de type sécurisé sur ces valeurs.
it: È quindi possibile eseguire operazioni aritmetiche indipendenti dai tipi su questi valori.
ja: 次に、これらの値に対してタイプ セーフの算術を実行できます。
ko: 그런 다음 이러한 값에 대해 형식이 안전한 산술 연산을 수행할 수 있습니다.
pl: Następnie możesz przeprowadzić bezpieczne operacje arytmetyczne dla tych wartości.
pt_br: Então, você pode executar a aritmética fortemente tipada nesses valores.
ru: Затем с этими значениями можно выполнять типобезопасные арифметические действия.
tr: Böylece bu değerler üzerinde tür açısından güvenli aritmetik gerçekleştirebilirsiniz.
zh_hans: 然后，你便可以对这些值执行类型安全算术。
zh_hant: 接著可以在這些值上執行型別安全算術。

# UnitsOfMeasure-Line3
source: To learn more, see: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/units-of-measure
cs: Další informace najdete v tématu: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/units-of-measure
es: Para obtener más información, consulte: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/units-of-measure
fr: Pour en savoir plus, consultez : https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/units-of-measure
pl: Aby dowiedzieć się więcej, zobacz: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/units-of-measure
ru: Подробности: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/units-of-measure

# CommonUnits
source: First, open a collection of common unit names
cs: Nejdříve otevřete kolekci běžných názvů jednotek.
de: Öffnen Sie zunächst eine Auflistung mit allgemeinen Einheitennamen.
es: Primero, abra una colección de nombres de unidad comunes
fr: Pour commencer, ouvrez une collection de noms d'unité courants
it: Aprire innanzitutto una raccolta di nomi di unità comuni
ja: まず、共通の単位名のコレクションを開きます
ko: 먼저 일반적인 단위 이름의 컬렉션을 엽니다.
pl: Najpierw otwórz kolekcję typowych nazw jednostek
pt_br: Primeiro, abra uma coleção de nomes comuns de unidade
ru: Сначала откройте коллекцию стандартных названий единиц измерения.
tr: İlk olarak, ortak birim adlarından oluşan bir koleksiyon açın
zh_hans: 首先，打开常用单位名称集合
zh_hant: 首先，開啟常用單位名稱的集合

# DefineUnitConstant
source: Define a unitized constant
cs: Definovat unifikovanou konstantu
de: Definieren Sie eine einheitliche Konstante.
es: Defina una constante dividida en unidades
fr: Définissez une constante unifiée
it: Definire una costante unificata
ja: 単位化された定数を定義します
ko: 결합된 상수 정의
pl: Definiuj stałą w jednostkach
pt_br: Definir uma constante unitizada
ru: Определите константу с единицей измерения.
tr: Birimlere ayrılmış bir sabit tanımlayın
zh_hans: 定义单元化常量
zh_hant: 定義 unitized 常數

# MileUnit
source: Next, define a new unit type
cs: Potom definujte nový typ jednotky
de: Definieren Sie als Nächstes einen neuen Einheitentyp.
es: Después, defina un nuevo tipo de unidad
fr: Ensuite, définissez un nouveau type d'unité
it: Definire quindi un nuovo tipo di unità
ja: 次に、新しい単位の種類を定義します
ko: 다음으로 새 단위 형식을 정의합니다.
pl: Następnie zdefiniuj nowy typ jednostki
pt_br: Em seguida, defina um novo tipo de unidade
ru: Далее определите новый тип единицы.
tr: Sonra, yeni bir birim türü tanımlayın
zh_hans: 接下来，定义新的单位类型
zh_hant: 接著，定義新單位類型

# MileToMeter
source: Conversion factor mile to meter.
cs: Přepočtový koeficient pro přepočet mílí na metry
de: Faktor für die Umrechnung von Meilen in Meter.
es: Factor de conversión de millas a metros.
fr: Facteur de conversion mile en mètre.
it: Fattore di conversione da miglia a metri.
ja: マイルからメートルへの変換係数。
ko: 마일 대 미터 변환 비율입니다.
pl: Współczynnik konwersji mil na metry.
pt_br: Fator de conversão de milha para metro.
ru: Коэффициент пересчета миль в метры.
tr: Milden metreye dönüştürme faktörü.
zh_hans: 英里到米的换算系数。
zh_hant: 英哩到公尺的轉換因數。

# DefineMileConstant
source: Define a unitized constant
cs: Definovat unifikovanou konstantu
de: Definieren Sie eine einheitliche Konstante.
es: Defina una constante dividida en unidades
fr: Définissez une constante unifiée
it: Definire una costante unificata
ja: 単位化された定数を定義します
ko: 결합된 상수 정의
pl: Definiuj stałą w jednostkach
pt_br: Definir uma constante unitizada
ru: Определите константу с единицей измерения.
tr: Birimlere ayrılmış bir sabit tanımlayın
zh_hans: 定义单元化常量
zh_hant: 定義 unitized 常數

# ComputeMileToMeter
source: Compute metric-system constant
cs: Vypočítat konstantu v metrickém systému
de: Berechnen Sie die Konstante für das metrische System.
es: Calcular constante del sistema métrico
fr: Calculez la constante de système métrique
it: Calcola la costante del sistema metrico
ja: メートル法の定数をコンピューティングします
ko: 미터 단위 상수를 계산합니다.
pl: Oblicz stałą systemu metryk
pt_br: Computar a constante de sistema métrico
ru: Вычислите константу в метрической системе.
tr: Metrik sistem sabitini hesaplayın
zh_hans: 计算公制常量
zh_hant: 計算計量系統常數
