Repository: dotnet/fsharp
Catalog: vsintegration/ProjectTemplates/TutorialProject/Template/xlf/Tutorial.fsx.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# IDisposableImplementation
source: This is the implementation of IDisposable members.
cs: Toto je implementace členů IDisposable.
de: Dies ist die Implementierung von IDisposable-Membern.
es: Esta es la implementación de los miembros de IDisposable.
fr: Implémentation de membres IDisposable.
it: Questa è l'implementazione dei membri di IDisposable.
ja: これは IDisposable メンバーの実装です。
ko: IDisposable 멤버의 구현입니다.
pl: To jest implementacja elementów członkowskich interfejsu IDisposable.
pt_br: Essa é a implementação de membros IDisposable.
ru: Это — реализация элементов интерфейса IDisposable.
tr: Bu, IDisposable üyelerinin uygulamasıdır.
zh_hans: 它是 IDisposable 成员的实现。
zh_hant: 這是 IDisposable 成員的實作。

# IDisposableObjectExpression-Line1
source: This is an object that implements IDisposable via an Object Expression
cs: Toto je objekt, který implementuje IDisposable pomocí výrazu objektu.
de: Dies ist ein Objekt, das IDisposable über einen Objektausdruck implementiert.
es: Este es un objeto que implementa IDisposable mediante una expresión de objeto
fr: Objet qui implémente IDisposable à l'aide d'une expression d'objet
it: Questo è un oggetto che implementa IDisposable tramite un'espressione di oggetto
ja: これは、オブジェクト式を使用して IDisposable を実装するオブジェクトです
ko: 개체 식을 통해 IDisposable을 구현하는 개체입니다.
pl: To jest obiekt implementujący interfejs IDisposable za pośrednictwem wyrażenia obiektu
pt_br: Este é um objeto que implementa IDisposable por meio de uma Expressão de Objeto
ru: Это — объект, реализующий интерфейс IDisposable через выражение объекта.
tr: Bu, bir Object İfadesi ile IDisposable uygulayan bir nesnedir
zh_hans: 该对象可通过对象表达式实现 IDisposable
zh_hant: 這是透過物件運算式實作 IDisposable 的物件

# IDisposableObjectExpression-Line2
source: Unlike other languages such as C# or Java, a new type definition is not needed
cs: Na rozdíl od jiných jazyků, jako jsou C# nebo Java, není nutná nová definice typu
de: Im Gegensatz zu anderen Sprachen wie C# oder Java ist keine neue Typendefinition erforderlich,
es: A diferencia de otros lenguajes, como C# o Java, no es necesaria una nueva definición de tipo
fr: Contrairement à d'autres langages tels que C# ou Java, une nouvelle définition de type n'est pas nécessaire
it: Diversamente da altri linguaggi, come C# o Java, non è necessaria una nuova definizione di tipo
ja: C# や Java などの他の言語とは異なり、インターフェイスを実装するために
ko: C# 또는 Java와 같은 다른 언어와 달리 인터페이스를 구현하기 위해 새 형식 정의가
pl: W przeciwieństwie do innych języków, np. C# lub Java, nowy typ definicji nie jest wymagany
pt_br: Diferentemente de outras linguagens, como C# ou Java, uma nova definição de tipo não é necessária
ru: В отличие от других языков, таких как C# или Java, новое определение типа не требуется
tr: C# veya Java gibi diğer dillerin aksine, bir arabirim uygulamak için yeni bir tür tanımı
zh_hans: 与 C# 或 Java 等其他语言不同，无需新的类型定义
zh_hant: 與 C# 或 Java 等其他這類語言不同，不需要新的類型定義

# IDisposableObjectExpression-Line3
source: to implement an interface.
cs: pro implementaci rozhraní.
de: um eine Schnittstelle zu implementieren.
es: para implementar una interfaz.
fr: pour implémenter une interface.
it: per implementare un'interfaccia.
ja: 新しい型定義は必要ありません。
ko: 필요하지 않습니다.
pl: do zaimplementowania interfejsu.
pt_br: para implementar uma interface.
ru: для реализации интерфейса.
tr: gerekli değildir.
zh_hans: 以实现接口。
zh_hant: 以實作介面。

# Parallel-Line1
source: The FSharp.Core library defines a range of parallel processing functions. Here
cs: Knihovna FSharp.Core definuje rozsah funkcí paralelního zpracování. Tady
de: Die Bibliothek "FSharp.Core" definiert eine Reihe paralleler Verarbeitungsfunktionen. Hier
es: La biblioteca FSharp.Core define un intervalo de funciones de procesamiento paralelo. Aquí
fr: La bibliothèque FSharp.Core définit une plage de fonctions de traitement parallèle. Ici
it: La libreria FSharp.Core definisce un intervallo di funzioni di elaborazione parallela. In questo caso
ja: FSharp.Core ライブラリは並列処理関数の範囲を定義します。ここでは
ko: FSharp.Core 라이브러리는 병렬 처리 함수 범위를 정의합니다.
pl: Biblioteka FSharp.Core definiuje zestaw funkcji przetwarzania równoległego. Tutaj
pt_br: A biblioteca FSharp.Core define várias funções de processamento paralelo. Aqui
ru: В библиотеке FSharp.Core определен ряд функций параллельной обработки. Здесь
tr: FSharp.Core kitaplığı bir paralel işleme işlevleri aralığı tanımlar. Burada
zh_hans: FSharp.Core 库定义了一系列并行处理函数。此处
zh_hant: FSharp.Core 程式庫定義一個範圍內的平行處理函式。這裡

# Parallel-Line2
source: you use some functions for parallel processing over arrays.
cs: použijete některé funkce pro paralelní zpracování polí.
de: verwenden Sie einige Funktionen zur parallelen Verarbeitung über Arrays.
es: se usan algunas funciones de procesamiento paralelo en matrices.
fr: vous utilisez des fonctions pour le traitement parallèle des tableaux.
it: si usano alcune funzioni per l'elaborazione parallela sulle matrici.
ja: アレイ全体で並列処理に対していくつかの関数を使用できます。
ko: 여기에서 배열에 대해 병렬 처리 함수를 사용합니다.
pl: niektóre funkcje są używane do równoległego przetwarzania tablic.
pt_br: você usa algumas funções para processamento paralelo por matrizes.
ru: вы используете определенные функции для параллельной обработки массивов.
tr: diziler üzerinde çeşitli paralel işleme işlevleri kullanırsınız.
zh_hans: 可使用某些函数对数组进行并行处理。
zh_hant: 您可以使用一些函式對陣列進行平行處理。

# Parallel-Line3
source: To learn more, see: https://msdn.microsoft.com/en-us/visualfsharpdocs/conceptual/array.parallel-module-%5Bfsharp%5D
cs: Další informace: https://msdn.microsoft.com/cs-cz/visualfsharpdocs/conceptual/array.parallel-module-%5Bfsharp%5D
de: Weitere Informationen finden Sie unter: https://msdn.microsoft.com/de-de/visualfsharpdocs/conceptual/array.parallel-module-%5Bfsharp%5D
es: Para obtener más información, vea: https://msdn.microsoft.com/en-us/visualfsharpdocs/conceptual/array.parallel-module-%5Bfsharp%5D
fr: Pour en savoir plus, consultez : https://msdn.microsoft.com/en-us/visualfsharpdocs/conceptual/array.parallel-module-%5Bfsharp%5D
it: Per altre informazioni, vedere: https://msdn.microsoft.com/it-it/visualfsharpdocs/conceptual/array.parallel-module-%5Bfsharp%5D
ja: 詳細については、次を参照してください: https://msdn.microsoft.com/ja-jp/visualfsharpdocs/conceptual/array.parallel-module-%5Bfsharp%5D
ko: 자세히 알아보려면 다음을 참조하세요. https://msdn.microsoft.com/en-us/visualfsharpdocs/conceptual/array.parallel-module-%5Bfsharp%5D
pl: Aby dowiedzieć się więcej, zobacz https://msdn.microsoft.com/en-us/visualfsharpdocs/conceptual/array.parallel-module-%5Bfsharp%5D
pt_br: Para saber mais, acesse: https://msdn.microsoft.com/en-us/visualfsharpdocs/conceptual/array.parallel-module-%5Bfsharp%5D
ru: Подробности: https://msdn.microsoft.com/ru-ru/visualfsharpdocs/conceptual/array.parallel-module-%5Bfsharp%5D.
tr: Daha fazla bilgi için bkz. https://msdn.microsoft.com/en-us/visualfsharpdocs/conceptual/array.parallel-module-%5Bfsharp%5D
zh_hans: 有关详细信息，请参阅: https://msdn.microsoft.com/zh-cn/visualfsharpdocs/conceptual/array.parallel-module-%5Bfsharp%5D
zh_hant: 若要深入了解，請參閱: https://msdn.microsoft.com/en-us/visualfsharpdocs/conceptual/array.parallel-module-%5Bfsharp%5D

# InputArray
source: First, an array of inputs.
cs: Nejdříve pole vstupů.
de: Definieren Sie zunächst ein Array mit Eingaben.
es: Primero, una matriz de entradas.
fr: Tout d'abord, un tableau d'entrées.
it: Definire innanzitutto una matrice di input.
ja: まず、入力の配列です。
ko: 먼저 입력 배열입니다.
pl: Najpierw tablica wartości wejściowych.
pt_br: Primeiro, uma matriz de entradas.
ru: Сначала — массив входных данных.
tr: İlk olarak, bir giriş dizisi.
zh_hans: 首先，输入一个数组。
zh_hant: 首先，輸入的陣列。

# ExpensiveFunction
source: Next, define a functions that does some CPU intensive computation.
cs: Dále definujte funkci, která bude provádět výpočty náročné na procesor.
de: Definieren Sie dann eine Funktion mit CPU-intensiven Berechnungen.
es: Después, defina una función que realice algunos cálculos con gran consumo de CPU.
fr: Ensuite, définissez une fonction qui effectue un calcul nécessitant une utilisation intensive du processeur.
it: Definire quindi una funzione che esegue alcuni calcoli intensivi della CPU.
ja: 次に、CPU 集約型の計算を実行する関数を定義します。
ko: 다음으로 CPU를 많이 사용하는 계산을 수행하는 함수를 정의합니다.
pl: Następnie zdefiniuj funkcje, które wykonują obliczenia intensywnie korzystające z procesora.
pt_br: Em seguida, defina uma função que realiza computação com uso intensivo de CPU.
ru: Далее определите функции, выполняющие ряд вычислений с интенсивным использованием ЦП.
tr: Sonra, yoğun CPU kullanarak hesaplama yapan bir işlev tanımlayın.
zh_hans: 接下来，定义执行某些 CPU 密集型计算的函数。
zh_hant: 接下來，定義執行某些 CPU 密集型計算的函式。

# ParallelMap
source: Next, do a parallel map over a large input array.
cs: Dále proveďte paralelní mapování přes velké vstupní pole.
de: Führen Sie als Nächstes eine parallele Zuordnung für ein umfangreiches Eingabearray durch.
es: Después, realice una asignación en paralelo en una matriz de entrada grande.
fr: Ensuite, effectuez un mappage parallèle sur un grand tableau d'entrée.
it: Eseguire quindi un mapping parallelo su una matrice di input di grandi dimensioni.
ja: 次に、大きい入力配列に対して並列マップを実行します。
ko: 다음으로 큰 입력 배열에 대해 병렬 맵을 수행합니다.
pl: Następnie wykonaj równoległe mapowanie dla dużej tablicy wejściowej.
pt_br: Em seguida, faça um mapa paralelo por uma grande matriz de entrada.
ru: Затем выполните параллельное сопоставление по большому входному массиву.
tr: Sonra, büyük bir giriş dizisi üzerinde paralel bir eşleme oluşturun.
zh_hans: 接下来，对大型输入数组执行并行映射。
zh_hant: 接下來，對大型輸入陣列執行平行對應。

# PrintParallel
source: Next, print the results.
cs: Potom vytiskněte výsledky.
de: Geben Sie die Ergebnisse aus.
es: Después, imprima los resultados.
fr: Ensuite, imprimez les résultats.
it: Stampare quindi i risultati.
ja: 次に、結果を印刷します。
ko: 다음으로 결과를 인쇄합니다.
pl: Następnie wyświetl wyniki.
pt_br: Em seguida, imprima os resultados.
ru: Далее напечатайте результаты.
tr: Sonra, sonuçları yazdırın.
zh_hans: 接下来，打印结果。
zh_hant: 接下來，列印結果。

# Events-Line1
source: Events are a common idiom for .NET programming, especially with WinForms or WPF applications.
cs: Události jsou běžné základní struktury programového kódu .NET, zejména s aplikacemi WinForms nebo WPF.
de: Ereignisse sind ein gängiger Begriff bei der .NET-Programmierung, v. a. bei WinForms oder WPF-Anwendungen.
es: Los eventos son algo habitual en la programación para .NET, especialmente con aplicaciones de WinForms o WPF.
fr: Les événements sont un idiome courant de la programmation .NET, en particulier avec les applications WinForms ou WPF.
it: Gli eventi sono un termine comune per la programmazione .NET, in particolare con le applicazioni Windows Form o WPF.
ja: イベントは、特に WinForms または WPF アプリケーションでの .NET プログラミングの一般的な用法です。
ko: 이벤트는 특히 WinForms 또는 WPF 애플리케이션을 사용하는 .NET 프로그래밍에서 일반적으로 사용되는 말입니다.
pl: Zdarzenia są wspólnym idiomem dla programowania na platformie .NET, zwłaszcza przy użyciu aplikacji WinForms lub WPF.
pt_br: Eventos são uma linguagem comum para programação em .NET, especialmente com aplicativos WinForms ou WPF.
ru: События представляют собой стандартные идиомы программирования .NET, особенно для приложений WinForms или WPF.
tr: Events, .NET programlamasında özellikle WinForms veya WPF uygulamaları ile yaygın olarak kullanılan bir deyimdir.
zh_hans: 事件是 .NET 编程的常见习惯用语，尤其是使用 WinForms 或 WPF 应用程序编程时。
zh_hant: 事件是 .NET 程式設計的常見慣用語，特別是使用 WinForms 或 WPF 應用程式時。

# Events-Line2
source: To learn more, see: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/members/events
cs: Další informace najdete tady: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/members/events
es: Para obtener más información, consulte: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/members/events
fr: Pour en savoir plus, consultez : https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/members/events
pl: Aby dowiedzieć się więcej, zobacz: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/members/events
ru: Подробности: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/members/events

# SimpleEvent
source: First, create instance of Event object that consists of subscription point (event.Publish) and event trigger (event.Trigger).
cs: Nejdříve vytvořte instanci objektu Event, který se bude skládat z bodu odběru (event.Publish) a aktivační události (event.Trigger).
de: Erstellen Sie zunächst eine Instanz des Event-Objekts mit Abonnementpunkt (event.Publish) und Ereignisauslöser (event.Trigger).
es: Primero, cree una instancia del objeto Event que conste de un punto de suscripción (event.Publish) y un desencadenador de eventos (event.Trigger).
fr: Pour commencer, créez une instance d'objet Event qui se compose d'un point d'abonnement (event.Publish) et d'un déclencheur d'événements (event.Trigger).
it: Creare innanzitutto un'istanza dell'oggetto Event costituito dal punto di sottoscrizione (event.Publish) e dal trigger di evento (event.Trigger).
ja: まず、サブスクリプション ポイント (event.Publish) およびイベント トリガー (event.Trigger) で構成されるイベント オブジェクトのインスタンスを作成します。
ko: 먼저 구독 지점(event.Publish)과 이벤트 트리거(event.Trigger)로 구성된 Event 개체의 인스턴스를 만듭니다.
pl: Najpierw utwórz wystąpienie obiektu Event, które składa się z punktu subskrypcji (event.Publish) i wyzwalacza zdarzenia (event.Trigger).
pt_br: Primeiro, crie a instância do objeto Evento que consiste em ponto de assinatura (event.Publish) e gatilho de eventos (event.Trigger).
ru: Сначала создайте экземпляр объекта Event, состоящий из точки подписки (event.Publish) и триггера события (event.Trigger).
tr: İlk olarak, abonelik noktası (event.Publish) ve olay tetikleyicisinden (event.Trigger) oluşan Olay nesnesi örneğini oluşturun.
zh_hans: 首先，创建包含订阅点(event.Publish)和事件触发器(event.Trigger)的事件对象实例。
zh_hant: 首先，建立由訂閱點 (event.Publish) 與事件觸發程序 (event.Trigger) 所組成之事件物件的執行個體。

# AddEventHandler1
source: Next, add handler to the event.
cs: Potom přidejte obslužnou rutinu pro událost.
de: Fügen Sie dem Ereignis einen Handler hinzu.
es: Después, agregue un controlador al evento.
fr: Ensuite, ajoutez un gestionnaire à l'événement.
it: Aggiungere quindi il gestore all'evento.
ja: 次に、ハンドラーをイベントに追加します。
ko: 다음으로 이벤트에 처리기를 추가합니다.
pl: Następnie dodaj procedurę obsługi do zdarzenia.
pt_br: Em seguida, adicione o manipulador ao evento.
ru: Затем добавьте обработчик для события.
tr: Sonra, olaya işleyici ekleyin.
zh_hans: 接下来，将处理程序添加到事件。
zh_hant: 接下來，將處理常式新增到事件。

# TriggerEvent
source: Next, trigger the event.
cs: Potom spusťte událost.
de: Lösen Sie das Ereignis aus.
es: Después, desencadene el evento.
fr: Ensuite, déclenchez l'événement.
it: Attivare quindi l'evento.
ja: 次に、イベントをトリガーします。
ko: 다음으로 이벤트를 트리거합니다.
pl: Następnie wyzwól zdarzenie.
pt_br: Em seguida, dispare o evento.
ru: Затем активируйте событие.
tr: Sonra, olayı tetikleyin.
zh_hans: 接下来，触发该事件。
zh_hant: 接下來，觸發該事件。

# EventWithArgs
source: Next, create an instance of Event that follows standard .NET convention: (sender, EventArgs).
cs: Potom vytvořte instanci objektu Event podle standardní konvence .NET: (sender, EventArgs).
de: Erstellen Sie als Nächstes eine Event-Instanz gemäß der .NET-Standardkonvention: (sender, EventArgs)
es: Después, cree una instancia de Event que siga la convención estándar de .NET: (sender, EventArgs).
fr: Ensuite, créez une instance d'événement qui respecte la convention .NET standard : (sender, EventArgs).
it: Creare quindi un'istanza dell'oggetto Event che segue la convenzione .NET standard: (sender, EventArgs).
ja: 次に、標準的な .NET 表記規則に従うイベントのインスタンスを作成します: (sender, EventArgs)。
ko: 다음으로 표준 .NET 규칙(sender, EventArgs)을 따르는 Event의 인스턴스를 만듭니다.
pl: Następnie utwórz wystąpienie zdarzenia zgodne ze standardową konwencją platformy .NET: (sender, EventArgs).
pt_br: Em seguida, crie uma instância do evento que segue a convenção padrão do .NET: (sender, EventArgs).
ru: Затем создайте экземпляр события в соответствии со стандартным соглашением .NET: (sender, EventArgs).
tr: Sonra, olayın standart .NET kuralını takip eden bir örneğini oluşturun: (sender, EventArgs).
zh_hans: 接下来，创建遵循标准 .NET 约定的事件的实例: (sender, EventArgs)。
zh_hant: 接下來，為遵循標準 .NET 慣例的事件建立執行個體: (sender, EventArgs)。

# AddEventHandler2
source: Next, add a handler for this new event.
cs: Dále přidejte obslužnou rutinu pro tuto novou událost.
de: Fügen Sie einen Handler für das neue Ereignis hinzu.
es: Después, agregue un controlador para este nuevo evento.
fr: Ensuite, ajoutez un gestionnaire à ce nouvel événement.
it: Aggiungere quindi un gestore per questo nuovo evento.
ja: 次に、この新しいイベントのハンドラーを追加します。
ko: 다음으로 이 새 이벤트에 대한 처리기를 추가합니다.
pl: Następnie dodaj procedurę obsługi dla tego nowego zdarzenia.
pt_br: Em seguida, adicione um manipulador para este novo evento.
ru: Затем добавьте обработчик для этого нового события.
tr: Sonra, bu yeni olay için bir işleyici ekleyin.
zh_hans: 接下来，为此新事件添加处理程序。
zh_hant: 接下來，為此新事件新增處理常式。

# TriggerEventWithArgs
source: Next, trigger this event (note that sender argument should be set).
cs: Potom spusťte tuto událost (poznámka: musí být nastavený argument odesílatele).
de: Lösen Sie das Ereignis aus. (Hinweis: das sender-Argument muss festgelegt sein.)
es: Después, desencadene este evento (tenga en cuenta que el argumento sender debe estar establecido).
fr: Ensuite, déclenchez cet événement (notez que l'argument sender doit être défini).
it: Attivare quindi questo evento (si noti che è necessario impostare l'argomento sender).
ja: 次に、このイベントをトリガーします (sender 引数を設定する必要があります)。
ko: 다음으로 이 이벤트를 트리거합니다(sender 인수를 설정해야 함).
pl: Następnie wyzwól to zdarzenie (zwróć uwagę, że argument elementu wysyłającego powinien być ustawiony).
pt_br: Em seguida, dispare esse evento (observe que o argumento do remetente deve ser definido).
ru: Затем вызовите событие (обратите внимание на то, что аргумент sender должен быть задан).
tr: Sonra, bu olayı tetikleyin (sender bağımsız değişkeninin ayarlanmış olması gerektiğine dikkat edin).
zh_hans: 接下来，触发此事件(请注意，应设置 sender 参数)。
zh_hant: 接下來，觸發此事件 (請注意，應該設定 sender 引數)。

# XmlComments-Line3
source: To learn more, see: https://docs.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/xml-documentation
de: Weitere Informationen finden Sie unter: https://docs.microsoft.com/de-de/dotnet/articles/fsharp/language-reference/xml-documentation.
it: Per altre informazioni, vedere: https://docs.microsoft.com/it-it/dotnet/articles/fsharp/language-reference/xml-documentation
ja: 詳細については、次を参照してください: https://docs.microsoft.com/ja-jp/dotnet/articles/fsharp/language-reference/xml-documentation
pt_br: Para saber mais, acesse: https://docs.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/xml-documentation
tr: Daha fazla bilgi için bkz. https://docs.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/xml-documentation
zh_hans: 有关详细信息，请参阅: https://docs.microsoft.com/zh-cn/dotnet/articles/fsharp/language-reference/xml-documentation
zh_hant: 若要深入了解，請參閱: https://docs.microsoft.com/zh-tw/dotnet/articles/fsharp/language-reference/xml-documentation

# LearnMore
source: To learn more, see: https://docs.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/import-declarations-the-open-keyword
de: Weitere Informationen finden Sie hier: https://docs.microsoft.com/de-de/dotnet/articles/fsharp/language-reference/import-declarations-the-open-keyword.
it: Per altre informazioni, vedere: https://docs.microsoft.com/it-it/dotnet/articles/fsharp/language-reference/import-declarations-the-open-keyword
ja: 詳細については、次を参照してください: https://docs.microsoft.com/ja-jp/dotnet/articles/fsharp/language-reference/import-declarations-the-open-keyword
pt_br: Para saber mais, acesse: https://docs.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/import-declarations-the-open-keyword
tr: Daha fazla bilgi için bkz. https://docs.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/import-declarations-the-open-keyword
zh_hans: 有关详细信息，请参阅: https://docs.microsoft.com/zh-cn/dotnet/articles/fsharp/language-reference/import-declarations-the-open-keyword
zh_hant: 若要深入了解，請參閱: https://docs.microsoft.com/zh-tw/dotnet/articles/fsharp/language-reference/import-declarations-the-open-keyword

# Module-Line3
source: To learn more, see: https://docs.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/modules
de: Weitere Informationen finden Sie unter: https://docs.microsoft.com/de-de/dotnet/articles/fsharp/language-reference/modules.
it: Per altre informazioni, vedere: https://docs.microsoft.com/it-it/dotnet/articles/fsharp/language-reference/modules
ja: 詳細については、次を参照してください: https://docs.microsoft.com/ja-jp/dotnet/articles/fsharp/language-reference/modules
pt_br: Para saber mais, acesse: https://docs.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/modules
tr: Daha fazla bilgi için bkz. https://docs.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/modules
zh_hans: 有关详细信息，请参阅: https://docs.microsoft.com/zh-cn/dotnet/articles/fsharp/language-reference/modules
zh_hant: 若要深入了解，請參閱: https://docs.microsoft.com/zh-tw/dotnet/articles/fsharp/language-reference/modules

# ValuesImmutable-Line3
source: To learn more, see: https://docs.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/values/index#why-immutable
de: Weitere Informationen finden Sie unter: https://docs.microsoft.com/de-de/dotnet/articles/fsharp/language-reference/values/index#why-immutable
it: Per altre informazioni, vedere: https://docs.microsoft.com/it-it/dotnet/articles/fsharp/language-reference/values/index#why-immutable
ja: 詳細については、次を参照してください: https://docs.microsoft.com/ja-jp/dotnet/articles/fsharp/language-reference/values/index#why-immutable
pt_br: Para saber mais, acesse: https://docs.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/values/index#why-immutable
tr: Daha fazla bilgi için bkz. https://docs.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/values/index#why-immutable
zh_hans: 有关详细信息，请参阅: https://docs.microsoft.com/zh-cn/dotnet/articles/fsharp/language-reference/values/index#why-immutable
zh_hant: 若要深入了解，請參閱: https://docs.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/values/index#why-immutable

# FunctionsModule-Line3
source: To learn more, see: https://docs.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/functions/
de: Weitere Informationen finden Sie unter: https://docs.microsoft.com/de-de/dotnet/articles/fsharp/language-reference/functions/
it: Per altre informazioni, vedere: https://docs.microsoft.com/it-it/dotnet/articles/fsharp/language-reference/functions/
ja: 詳細については、次を参照してください: https://docs.microsoft.com/ja-jp/dotnet/articles/fsharp/language-reference/functions/
pt_br: Para saber mais, acesse: https://docs.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/functions/
tr: Daha fazla bilgi için bkz. https://docs.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/functions/
zh_hans: 有关详细信息，请参阅: https://docs.microsoft.com/zh-cn/dotnet/articles/fsharp/language-reference/functions/
zh_hant: 若要深入了解，請參閱: https://docs.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/functions/
