Repository: dotnet/fsharp
Catalog: vsintegration/ProjectTemplates/TutorialProject/Template/xlf/Tutorial.fsx.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# FilterShorter-Line3
source: This makes the function much shorter, but it's difficult to see the
cs: Díky tomu může být funkce mnohem kratší, ale je obtížné sledovat
de: Dadurch wird die Funktion viel kürzer,
es: Esto hace la función mucho más corta, pero es difícil ver el
fr: La fonction est ainsi considérablement raccourcie, mais il est difficile de voir
it: In questo modo la funzione è molto più breve, ma risulta più difficile visualizzare
ja: これにより、関数は大幅に短くなりますが、データが処理される順序を
ko: 그러면 함수가 더 짧아지지만 데이터가 처리되는 순서를
pl: Dzięki temu funkcja będzie znacznie krótsza, ale trudno będzie zobaczyć
pt_br: Isso faz com que a função fique muito menor, mas é difícil ver a
ru: Это позволяет значительно сократить функцию, но будет сложно увидеть
tr: Bu, işlevi çok daha kısa hale getirir ancak
zh_hans: 这将使函数短得多，但难以查看
zh_hant: 這會將函式設成更短，但較難查看

# FilterShorter-Line4
source: order in which the data is processed.
cs: pořadí, v jakém se data zpracovávají.
de: die Reihenfolge der Datenverarbeitung ist jedoch schlechter sichtbar.
es: orden en el que se procesan los datos.
fr: l'ordre dans lequel les données sont traitées.
it: l'ordine in cui vengono elaborati i dati.
ja: 判別するのは難しくなります。
ko: 알아보기 어렵습니다.
pl: kolejność przetwarzania danych.
pt_br: ordem em que os dados são processados.
ru: порядок, в котором обрабатываются данные.
tr: verilerin işlenme sırasını görmek zordur.
zh_hans: 处理数据的顺序。
zh_hant: 資料的處理順序。

# FilterWithPipes-Line1
source: A preferred way to write 'squareOddValuesAndAddOne' is to use F# pipe operators.
cs: Preferovaným způsobem, jak napsat squareOddValuesAndAddOne, je použití operátorů kanálu v jazyce F#.
de: Eine bevorzugte Möglichkeit zum Schreiben von "squareOddValuesAndAddOne" besteht in der Verwendung von F#-Pipe-Operatoren.
es: Una forma recomendable de escribir "squareOddValuesAndAddOne" es usar operadores de canalización de F#.
fr: Pour écrire 'squareOddValuesAndAddOne', utilisez de préférence des opérateurs de canal F#.
it: Uno dei modi preferiti per scrivere 'squareOddValuesAndAddOne' consiste nell'usare gli operatori pipe di F#.
ja: 'squareOddValuesAndAddOne' を記述するための推奨される方法は、F# パイプ演算子を使用する方法です。
ko: 'squareOddValuesAndAddOne'을 작성하려면 기본적으로 F# 파이프 연산자를 사용합니다.
pl: Preferowanym sposobem zapisu funkcji „squareOddValuesAndAddOne” jest użycie operatorów potoków języka F#.
pt_br: Uma maneira preferencial para gravar 'squareOddValuesAndAddOne' é usar operadores de pipe F#.
ru: Предпочтительный способ записи squareOddValuesAndAddOne — использовать операторы конвейера F#.
tr: 'squareOddValuesAndAddOne' yazmanın tercih edilen bir yolu, F# kanal işleçlerini kullanmaktır.
zh_hans: 编写 "squareOddValuesAndAddOne" 的首选方法是使用 F# 管道运算符。
zh_hant: 撰寫 'squareOddValuesAndAddOne' 的慣用方式是使用 F# 管道運算子。

# FilterWithPipes-Line2
source: This allows you to avoid creating intermediate results, but is much more readable
cs: To vám umožní vyhnout se vytváření mezivýsledků, ale je to mnohem čitelnější
de: Dadurch können Sie verhindern, dass Zwischenergebnisse erstellt werden, dies ist jedoch besser lesbar
es: Esto permite evitar que se creen resultados intermedios, pero es mucho más fácil de leer
fr: Aucun résultat intermédiaire n'est créé, mais la syntaxe est beaucoup plus lisible
it: In tal modo sarà possibile evitare risultati intermedi, ma si migliora la leggibilità
ja: これにより、中間結果を作成しなくてもよくなります。また、
ko: 그러면 중간 결과를 생성하지 않아도 되며
pl: Dzięki temu unika się tworzenia wyników pośrednich, a całość jest znacznie bardziej czytelna
pt_br: Isso permite que você evite criar resultados intermediários, mas é muito mais legível
ru: Это позволяет избежать создания промежуточных результатов, и при этом более удобно для чтения,
tr: Bu, ara sonuçlar oluşturmaktan kaçınmanızı sağlar ancak
zh_hans: 这可使你避免产生中间结果，而且可读性更好
zh_hant: 這可讓您避免建立中繼結果，但比較容易閱讀

# FilterWithPipes-Line3
source: than nesting function calls like 'squareOddValuesAndAddOneNested'
cs: než vnoření volání funkcí, jak je vidět v squareOddValuesAndAddOneNested.
de: als verschachtelte Funktionsaufrufe wie "squareOddValuesAndAddOneNested".
es: que anidar las llamadas a la función como "squareOddValuesAndAddOneNested"
fr: que d'imbriquer des appels de fonction comme 'squareOddValuesAndAddOneNested'
it: rispetto all'annidamento di chiamate di funzione come 'squareOddValuesAndAddOneNested'
ja: 'squareOddValuesAndAddOneNested' のような関数呼び出しを入れ子にするよりもはるかに読みやすくすることができます
ko: 'squareOddValuesAndAddOneNested'와 같이 함수 호출을 중첩할 때보다 읽기도 쉽습니다.
pl: niż w przypadku zagnieżdżania wywołań funkcji, np. „squareOddValuesAndAddOneNested”
pt_br: que a função de aninhamento invoca como 'squareOddValuesAndAddOneNested'
ru: чем вложение вызовов функций, таких как squareOddValuesAndAddOneNested.
tr: 'squareOddValuesAndAddOneNested' gibi iç içe geçmiş işlev çağrılarından daha okunaklıdır
zh_hans: 嵌入式函数调用(如 "squareOddValuesAndAddOneNested")更具可读性
zh_hant: ，相較於 'squareOddValuesAndAddOneNested' 這類的巢狀函式呼叫

# PipeInLambda-Line1
source: You can shorten 'squareOddValuesAndAddOnePipeline' by moving the second `List.map` call
cs: Můžete zkrátit squareOddValuesAndAddOnePipeline přesunutím druhého volání List.map
de: Sie können "squareOddValuesAndAddOnePipeline" kürzen, indem Sie den zweiten "List.map"-Aufruf
es: No puede acortar "squareOddValuesAndAddOnePipeline" moviendo la segunda llamada de "List.map"
fr: Vous pouvez raccourcir 'squareOddValuesAndAddOnePipeline' en déplaçant le second appel 'List.map'
it: È possibile abbreviare 'squareOddValuesAndAddOnePipeline' spostando la seconda chiamata a `List.map`
ja: ラムダ関数を使用して、2 番目の `List.map` 呼び出しを先頭に移動することにより、
ko: 'squareOddValuesAndAddOnePipeline'을 줄이려면 두 번째 `List.map` 호출을
pl: Możesz skrócić wywołanie „squareOddValuesAndAddOnePipeline” przez przeniesienie drugiego wywołania „List.map”
pt_br: Você pode reduzir 'squareOddValuesAndAddOnePipeline' movendo a segunda chamada `List.map`
ru: squareOddValuesAndAddOnePipeline можно сократить, переместив второй вызов List.map
tr: 'squareOddValuesAndAddOnePipeline' öğesini kısaltmak için ikinci `List.map` çağrısını
zh_hans: 使用 Lambda 函数，通过将第二个 "List.map" 调用移动到第一个，
zh_hant: 您可以移動第二個 'List.map' 呼叫來縮短 'squareOddValuesAndAddOnePipeline'

# PipeInLambda-Line2
source: into the first, using a Lambda Function.
cs: do prvního, pomocí funkce lambda.
de: mithilfe einer Lambda-Funktion in den ersten verschieben.
es: a la primera, usando una función lambda.
fr: dans le premier en utilisant une fonction lambda.
it: nella prima usando una funzione lambda.
ja: 'squareOddValuesAndAddOnePipeline' を短くすることができます。
ko: 람다 함수를 사용하여 첫 번째로 이동합니다.
pl: do pierwszego, korzystając z funkcji lambda.
pt_br: no primeiro, usando uma Função Lambda.
ru: в первый, используя лямбда-функцию.
tr: bir Lambda İşlevi kullanarak birinciye taşıyabilirsiniz.
zh_hans: 可以缩短 "squareOddValuesAndAddOnePipeline"。
zh_hant: 到第一個項目，使用 Lambda 函式。

# PipeInLambda-Line3
source: Note that pipelines are also being used inside the lambda function. F# pipe operators
cs: Všimněte si, že kanály se používají i ve funkci lambda. Operátory kanálu v jazyce F#
de: Pipelines werden auch innerhalb der Lambda-Funktion verwendet. F#-Pipe-Operatoren
es: Tenga en cuenta que las canalizaciones se usan también en la función lambda. Los operadores de canalización de F#
fr: Notez que les pipelines sont également utilisés dans la fonction lambda. Les opérateurs de canal F#
it: Si noti che le pipeline vengono usate anche all'interno della funzione lambda. Gli operatori pipe di F#
ja: パイプラインはラムダ関数の内部でも使用されることに注意してください。F# パイプ演算子は、
ko: 파이프라인은 람다 함수 내에도 사용됩니다. F# 파이프 연산자는
pl: Należy zauważyć, że potoki są również używane w funkcji lambda. Operatorów potoków języka F#
pt_br: Observe que pipelines também estão sendo usados dentro da função lambda. Operadores de pipe F#
ru: Учтите, что конвейеры также используются внутри лямбда-функции. Операторы конвейера F#
tr: Komut zincirleri, lambda işlevi içinde de kullanılıyor. F# kanal işleçleri
zh_hans: 注意，管道也在 lambda 函数内使用。F# 管道运算符
zh_hant: 請注意，管線也會用於 lambda 函式內。F# 管道運算子

# PipeInLambda-Line4
source: can be used for single values as well. This makes them very powerful for processing data.
cs: se dají použít i pro jednotlivé hodnoty. Díky tomu jsou velmi efektivní při zpracovávání dat.
de: können auch für einzelne Werte verwendet werden. So ist eine leistungsstarke Datenverarbeitung möglich.
es: se puede usar también para valores individuales. Esto les confiere una gran capacidad para el procesamiento de datos.
fr: peuvent également être utilisés pour des valeurs uniques. Ils sont donc très efficaces dans le traitement des données.
it: possono essere usati anche per singoli valori, di conseguenza sono particolarmente efficaci per l'elaborazione dei dati.
ja: 単一の値にも使用できます。これにより、データ処理能力が向上します。
ko: 단일 값에도 사용할 수 있습니다. 따라서 데이터 처리에 매우 유용합니다.
pl: można również użyć w przypadku pojedynczych wartości. Dzięki temu jest to bardzo zaawansowane narzędzie do przetwarzania danych.
pt_br: podem ser usados para valores únicos também. Isso os torna muito eficientes para o processamento de dados.
ru: можно также использовать для отдельных значений. Это делает их очень эффективными при обработке данных.
tr: tek değerler için de kullanılabilir. Bu, işleçlerin veri işleme işlevlerini geliştirir.
zh_hans: 还可用于单个值。这使它们处理数据的功能很强大。
zh_hant: 也可以用於單一值。如此可讓它們在處理資料時功能極為強大。

# PipesComposition-Line1
source: Lastly, you can eliminate the need to explicitly take 'values' in as a parameter by using '>>'
cs: A konečně, můžete eliminovat nutnost explicitně převzít values jako parametr pomocí >>
de: Es ist nicht mehr erforderlich, "values" als Parameter aufzunehmen, indem Sie mithilfe von ">>"
es: Por último, puede eliminar la necesidad de tomar "valores" de forma explícita como parámetro usando ">>"
fr: Enfin, vous pouvez éliminer la nécessité d'accepter explicitement 'values' comme paramètre en utilisant '>>'
it: È infine possibile evitare di accettare in modo esplicito 'values' come parametro usando '>>'
ja: 最後に、'>>' を使用して次の 2 つのコア操作を作成すると、'values' をパラメーターとして
ko: 마지막으로 명시적으로 'values'를 매개 변수로 사용할 필요가 없습니다. '>>'를 사용하여
pl: W końcu możesz wyeliminować potrzebę jawnego przyjmowania elementu „values” jako parametru, używając wyrażenia „>>”,
pt_br: Por fim, você pode eliminar a necessidade de incluir explicitamente 'valores' como um parâmetro usando '>>'
ru: И наконец, можно исключить необходимость явного принятия значений в качестве параметра при помощи ">>"
tr: Son olarak, şu iki temel işlemi oluşturmak için '>>' kullanarak 'values' öğesini parametre olarak
zh_hans: 最后，无需再将 "value" 显式作为参数，你可使用 ">>"
zh_hant: 最後，您不需要使用 '>>' 來明確接受 'values' 作為參數

# PipesComposition-Line2
source: to compose the two core operations: filtering out even numbers, then squaring and adding one.
cs: s cílem sestavit dvě základní operace: odfiltrování sudých čísel a následné umocnění na druhou a přičtení jedné.
de: die beiden zentralen Vorgänge erstellen: Herausfiltern von geraden Zahlen, Quadratieren und Addieren von 1.
es: para componer las dos operaciones principales: aplicar un filtro para excluir los números pares, elevar al cuadrado y sumar uno.
fr: pour composer les deux opérations principales : élimination des nombres pairs par filtrage, puis mise au carré et ajout d'une unité.
it: per comporre le due operazioni di base, ovvero filtrare i numeri pari, calcolare il quadrato e aggiungere 1.
ja: 明示的に受け取る必要がなくなります: 偶数を除外してから、2 乗して 1 を加算する。
ko: 짝수를 필터링한 다음 제곱하고 1을 더하는 두 가지 핵심 작업을 작성하면 됩니다.
pl: aby zredagować dwie kluczowe operacje: odfiltrowywanie liczb parzystych, a następnie podnoszenie do potęgi drugiej i dodawanie jedynki.
pt_br: para compor as duas principais operações: filtrar números pares e, em seguida, elevar ao quadrado e adicionar um.
ru: для объединения двух основных операций: фильтрации четных чисел, а затем возведения в квадрат и добавления единицы.
tr: açıkça alma ihtiyacını ortadan kaldırabilirsiniz: çift sayıları filtreleme ve ardından karelerini alıp bir ekleme.
zh_hans: 以合成两个核心运算: 筛选出偶数，然后平方并加 1。
zh_hant: 以撰寫兩個核心作業: 篩選出偶數，然後取其平方值再加一。

# PipesComposition-Line3
source: Likewise, the 'fun x -> ...' bit of the lambda expression is also not needed, because 'x' is simply
cs: Obdobně není nutná část výrazu lambda „fun x -> ...“, protože x se jednoduše
de: Der Teil "fun x -> ..." des Lambdaausdrucks ist dementsprechend ebenfalls nicht erforderlich, da "x" lediglich
es: De igual modo, no se necesita tampoco la parte "fun x -> ..." de la expresión lambda, porque "x"
fr: De même, la partie 'fun x -> ...' de l'expression lambda n'est pas nécessaire, car 'x' est simplement
it: Analogamente, anche la parte 'fun x -> ...' dell'espressione lambda non è necessaria perché 'x' viene semplicemente
ja: 同様に、ラムダ式の 'fun x -> ...' ビットも必要ありません。 'x' は単に、
ko: 마찬가지로 'fun x -> ...' 람다 식도 필요하지 않습니다. 'x'를 해당 범위에서 간단히
pl: Podobnie fragment „fun x -> ...” wyrażenia lambda nie jest wymagany, ponieważ wartość „x” jest po prostu
pt_br: Da mesma forma, o bit 'fun x -> ...' da expressão lambda também não é necessário porque 'x' é simplesmente
ru: Аналогично, часть "fun x -> ..." лямбда-выражения также не требуется, так как x просто
tr: Benzer şekilde, 'x' bir işlevsel komut zincirine geçirilmek için bu kapsamda tanımlandığından
zh_hans: 同样，lambda 表达式的 "fun x -> ..." 也不需要了，因为 "x" 只是
zh_hant: 同樣地，也不需要 lambda 運算式的 'fun x -> ...' 位元，因為 'x' 只是

# PipesComposition-Line4
source: being defined in that scope so that it can be passed to a functional pipeline. Thus, '>>' can be used
cs: v tomto oboru definuje tak, aby ho bylo možné předat jako funkční kanál. Proto je tam >> možné použít
de: in dem Bereich definiert wird, damit es an eine Funktionspipeline übergeben werden kann. Daher kann ">>"
es: se define en ese ámbito para poderlo pasar a una canalización funcional. Por tanto, ">>" se pude usar
fr: défini dans cette portée pour pouvoir être passé à un pipeline fonctionnel. Vous pouvez donc utiliser '>>'
it: definito in tale ambito in modo che sia possibile passarlo a una pipeline funzionale. In questo punto è quindi possibile
ja: 関数型パイプラインに渡すことができるようにそのスコープ内で定義されているだけだからです。そのため、
ko: 정의하여 함수 파이프라인에 전달할 수 있기 때문입니다. 따라서 여기에서도 '>>'를
pl: definiowana w tym zakresie w celu przekazania do potoku funkcyjnego. Dlatego można również użyć wyrażenia „>>”
pt_br: sendo definido nesse escopo para que possa ser passada a um pipeline funcional. Portanto, '>>' pode ser usado
ru: определяется в этой области действия, чтобы его можно было передать в функциональный конвейер. Таким образом, здесь также можно
tr: lambda ifadesindeki 'fun x -> ...' bölümü de gerekli değildir. Bu nedenle, '>>'
zh_hans: 在该范围内定义，以便可传递到功能管道。因此，也可将 ">>"
zh_hant: 定義於該範圍內，以將它傳遞至功能管線。因此，可以使用 '>>'

# PipesComposition-Line5
source: there as well.
cs: také.
de: dort ebenfalls verwendet werden.
es: aquí también.
fr: ici aussi.
it: usare anche '>>'.
ja: そこでも同様に '>>' を使用できます。
ko: 사용할 수 있습니다.
pl: w tym miejscu.
pt_br: lá também.
ru: использовать ">>".
tr: burada da kullanılabilir.
zh_hans: 用在该处。
zh_hant: 也會在該處。

# PipesComposition-Line6
source: The result of 'squareOddValuesAndAddOneComposition' is itself another function which takes a
cs: Výsledek squareOddValuesAndAddOneComposition je sám o sobě další funkcí, která přebírá
de: Das Ergebnis von "squareOddValuesAndAddOneComposition" selbst ist eine andere Funktion, die eine
es: El resultado de "squareOddValuesAndAddOneComposition" es en sí mismo otra función que toma una
fr: Le résultat de 'squareOddValuesAndAddOneComposition' est une autre fonction qui accepte une
it: Il risultato di 'squareOddValuesAndAddOneComposition' è di per sé un'altra funzione che accetta come input un
ja: 'squareOddValuesAndAddOneComposition' の結果は、それ自体が別の関数です。その関数は、
ko: 'squareOddValuesAndAddOneComposition'의 결과 자체도 정수 목록을 입력으로 사용하는
pl: Wynikiem funkcji „squareOddValuesAndAddOneComposition” jest inna funkcja, która przyjmuje
pt_br: O resultado de 'squareOddValuesAndAddOneComposition' é em si outra função que leva um
ru: Результат squareOddValuesAndAddOneComposition сам по себе является другой функцией, которая принимает
tr: 'squareOddValuesAndAddOneComposition' sonucunun kendisi, giriş olarak bir tamsayı listesi alan
zh_hans: "squareOddValuesAndAddOneComposition" 的结果本身就是另一个函数，它
zh_hant: 'squareOddValuesAndAddOneComposition' 的結果本身是另一個函式，且該函式接受

# PipesComposition-Line7
source: list of integers as its input. If you execute 'squareOddValuesAndAddOneComposition' with a list
cs: jako vstup seznam celých čísel. Pokud provedete squareOddValuesAndAddOneComposition se seznamem
de: Liste von Integern als Eingabe verwendet. Wenn Sie "squareOddValuesAndAddOneComposition" mit einer Liste
es: lista de enteros como entrada. Si ejecuta "squareOddValuesAndAddOneComposition" con una lista
fr: liste d'entiers comme entrée. Si vous exécutez 'squareOddValuesAndAddOneComposition' avec une liste
it: elenco di interi. Se si esegue 'squareOddValuesAndAddOneComposition' con un elenco
ja: 整数のリストを入力として受け取ります。整数のリストを指定して 'squareOddValuesAndAddOneComposition' を
ko: 다른 함수입니다. 'squareOddValuesAndAddOneComposition'을 정수 목록을 사용하여
pl: listę liczb całkowitych w formie danych wejściowych. Jeśli wykonasz funkcję „squareOddValuesAndAddOneComposition” z listą
pt_br: lista de inteiros como sua entrada. Se você executar 'squareOddValuesAndAddOneComposition' com uma lista
ru: список целых чисел в качестве входных данных. Если squareOddValuesAndAddOneComposition выполняется со списком
tr: diğer bir işlevdir. 'squareOddValuesAndAddOneComposition' öğesini bir tamsayı listesi ile
zh_hans: 将整数列表作为其输入值。如果使用整数列表执行 "squareOddValuesAndAddOneComposition"，
zh_hant: 作為輸入的整數清單。如果您執行 'squareOddValuesAndAddOneComposition' 時搭配清單

# PipesComposition-Line8
source: of integers, you'll notice that it produces the same results as previous functions.
cs: celých čísel, všimnete si, že dává stejné výsledky jako předchozí funkce.
de: von Integern ausführen, erhalten Sie das gleiche Ergebnis wie bei vorherigen Funktionen.
es: de enteros, notará que produce los mismos resultados que las funciones anteriores.
fr: d'entiers, les résultats sont identiques à ceux des fonctions précédentes.
it: di interi, si noterà che consente di ottenere gli stessi risultati delle funzioni precedenti.
ja: 実行すると、前の関数と同じ結果が生成されることがわかります。
ko: 실행하는 경우 이전 함수와 동일한 결과를 생성합니다.
pl: liczb całkowitych, funkcja będzie podawać takie same wyniki jak poprzednie funkcje.
pt_br: de inteiros, você observará que ela produz os mesmos resultados que as funções anteriores.
ru: целых чисел, вы заметите, что результаты соответствуют результатам предыдущих функций.
tr: yürütürseniz, önceki işlevler ile aynı sonuçları ürettiğini fark görürsünüz.
zh_hans: 你将发现它与上述函数产生的结果相同。
zh_hant: (整數)，您將注意到它會產生與先前函式相同的結果。

# PipesComposition-Line9
source: This is using what is known as function composition. This is possible because functions in F#
cs: Označuje se to jako složení funkcí. Je to možné, protože funkce v jazyce F#
de: Dabei wird die so genannte Funktionskomposition verwendet. Das ist möglich, da Funktionen in F#
es: Aquí se utiliza lo que se conoce como composición de funciones. Es posible porque las funciones en F#
fr: C'est ce qui s'appelle la composition de fonctions. Cela vient du fait que les fonctions dans F#
it: Usa la cosiddetta composizione di funzione. Tale operazione è possibile perché in F# le funzioni
ja: これは、関数合成と呼ばれるものを使用しています。これが可能なのは、F# の関数が
ko: 여기서는 이른바 함수 컴퍼지션을 사용합니다. 이것이 가능한 이유는 F#의 함수가
pl: Używa się tu kompozycji funkcji. Jest to możliwe, ponieważ funkcje w języku F#
pt_br: Isso está usando o que é conhecido como composição de função. Isso é possível porque funções em F#
ru: Используется так называемая композиция функций. Это возможно, так как функции в F#
tr: Bu, işlev kompozisyonu olarak bilinen işlemi kullanır. Bu, F# içindeki işlevler Kısmi Uygulama kullandığı
zh_hans: 这使用的就是所谓的函数组合。这是可能的，因为 F# 中的函数
zh_hant: 這將使用所謂的函式組合。原因可能是 F# 中的函式

# PipesComposition-Line10
source: use Partial Application and the input and output types of each data processing operation match
cs: používají částečné použití argumentů a vstupní a výstupní typy každé operace zpracování dat odpovídají
de: die partielle Anwendung nutzen, und die Ein- und Ausgabetypen jedes Datenverarbeitungsvorgangs
es: utilizan aplicación parcial y los tipos de entrada y salida de cada operación de procesamiento de datos buscan
fr: utilisent l'application partielle et que les types d'entrée et de sortie de chaque opération de traitement de données correspondent
it: usano l'applicazione parziale e i tipi di input e output di ogni operazione di elaborazione dati corrispondono
ja: 部分適用を使用しており、各データ処理操作の入力と出力の型が、使用している
ko: 부분 애플리케이션을 사용하고 각 데이터 처리 작업의 입력 및 출력 형식이 사용 중인 함수의
pl: używają częściowej aplikacji, a typy danych wejściowych i wyjściowych dla każdej operacji przetwarzania danych są dopasowane do
pt_br: use Aplicativo Parcial e os tipos de entrada e saída de cada correspondência de operação de processamento de dados
ru: используют частичное применение, а входные и выходные типы каждой операции обработки данных соответствуют
tr: ve her bir bilgi işlem işleminin giriş ve çıkış türleri kullandığımız işlevlerin imzaları ile eşleştiği için
zh_hans: 使用偏函数应用，并且每个数据处理操作的输入和输出类型与
zh_hant: 使用局部應用程式，以及每個資料處理作業相符的輸入與輸出類型

# PipesComposition-Line11
source: the signatures of the functions we're using.
cs: signaturám funkcí, které používáme.
de: mit den Signaturen der verwendeten Funktionen übereinstimmen.
es: las signaturas de las funciones que estamos usando.
fr: aux signatures des fonctions que nous utilisons.
it: alle firme delle funzioni usate.
ja: 関数のシグネチャと一致するためです。
ko: 시그니처와 일치하기 때문입니다.
pl: podpisów funkcji, których używamy.
pt_br: as assinaturas das funções que estamos usando.
ru: сигнатурам функций, которые мы используем.
tr: mümkün olmaktadır.
zh_hans: 我们使用的函数签名。
zh_hant: 所使用之函式的簽章。

# Lists-Line1
source: Lists are ordered, immutable, singly-linked lists. They are eager in their evaluation.
cs: Seznamy jsou uspořádané, neměnné a jednorázově propojené. Velmi dynamicky se vyhodnocují.
de: Listen sind geordnete, unveränderliche, einfach verknüpfte Listen. Ihre Auswertung ist streng.
es: Las listas están ordenadas, son inmutables y están vinculadas individualmente. Son diligentes en su evaluación.
fr: Les listes sont ordonnées, non modifiables et liées individuellement. Elles font l'objet d'une évaluation stricte.
it: Gli elenchi sono elenchi a un solo collegamento ordinati e non modificabili la cui valutazione è di tipo eager.
ja: リストは、順序指定された、変更できない単方向リストです。 リストは集中評価されます。
ko: 순서가 지정되고 변경 불가능한 단일 연결 목록으로 즉시 평가됩니다.
pl: Listy są uporządkowane, niezmienne i jednokierunkowe. Są wartościowane przed przetworzeniem.
pt_br: As listas são listas ordenadas, imutáveis, vinculadas de modo único. Elas são adiantadas em sua avaliação.
ru: Списки — это упорядоченные, неизменяемые однонаправленные списки. При вычислении они являются безотложными.
tr: Listeler sıralı, sabit ve tek bağlantılıdır. Bu listelerde erken değerlendirme yapılır.
zh_hans: 列表属于有序、不可变、单向链接的列表。它们都采用主动求值方式。
zh_hant: 清單是已排序且不可變動的單向連結清單。它們於評估時會即刻進行運算。
