Repository: dotnet/fsharp
Catalog: vsintegration/ProjectTemplates/TutorialProject/Template/xlf/Tutorial.fsx.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# CheckRightSubtree
source: Check the right subtree.
cs: Zkontroluje pravý podstrom.
de: Prüfen Sie die rechte Unterstruktur.
es: Comprueba el subárbol de la derecha.
fr: Vérifiez le sous-arbre droit.
it: Verifica il sottoalbero di destra.
ja: 右側のサブツリーを確認します。
ko: 오른쪽 하위 트리를 확인합니다.
pl: Sprawdź prawe poddrzewo.
pt_br: Verifique a subárvore à direita.
ru: Проверка правого поддерева.
tr: Sağ alt ağacı denetleyin.
zh_hans: 检查右子树。
zh_hant: 請檢查右樹狀子結構。

# BinaryTreeInsert-Line1
source: Inserts an item in the Binary Search Tree.
cs: Vloží položku do binárního vyhledávacího stromu.
de: Fügt in die Struktur für die Binärsuche ein Element ein.
es: Inserta un elemento en el árbol de búsqueda binaria.
fr: Insère un élément dans l'arbre de recherche binaire.
it: Inserisce un elemento nell'albero della ricerca binaria.
ja: バイナリ検索ツリーにアイテムを挿入します。
ko: 이진 검색 트리에 항목을 삽입합니다.
pl: Wstawia element do binarnego drzewa wyszukiwania.
pt_br: Insere um item na Árvore de Pesquisa Binária.
ru: Вставляет элемент в двоичное дерево поиска.
tr: İkili Arama Ağacı'na bir öğe ekler.
zh_hans: 在二进制文件搜索树中插入项。
zh_hant: 在二進位搜尋樹狀結構中插入項目。

# BinaryTreeInsert-Line2
source: Finds the place to insert recursively using Pattern Matching, then inserts a new node.
cs: Najde místo pro rekurzivní vložení pomocí porovnávání vzorů a pak vloží nový uzel.
de: Findet die Position für das rekursive Einfügen mithilfe des Musterabgleichs und fügt anschließend einen neuen Knoten ein.
es: Busca dónde insertar de forma recursiva un nuevo nodo usando coincidencia de patrones y lo inserta.
fr: Recherche l'emplacement de l'insertion récursive à l'aide de critères spéciaux, puis insère un nouveau nœud.
it: Trova la posizione da inserire in modo ricorsivo con i criteri di ricerca, quindi inserisce un nuovo nodo.
ja: パターン マッチングを使用して再帰的に挿入する場所を検索し、新しいノードを挿入します。
ko: 패턴 일치를 사용하여 재귀적으로 삽입할 위치를 찾은 다음 새 노드를 삽입합니다.
pl: Znajduje miejsce do wstawienia rekursywnego przy użyciu dopasowania wzorca, a następnie wstawia nowy węzeł.
pt_br: Encontra o local para inserir recursivamente usando Correspondência de Padrões e, em seguida, insere um novo nó.
ru: Находит место для рекурсивной вставки при помощи сопоставления шаблонов, а затем вставляет новый узел.
tr: Desen Eşleştirme kullanarak özyinelemeli olarak eklenecek yeri bulur ve ardından yeni bir düğüm ekler.
zh_hans: 查找使用模式匹配递归插入的位置，然后插入新节点。
zh_hant: 尋找要使用模式比對遞迴插入的位置，然後插入新節點。

# BinaryTreeInsert-Line3
source: If the item is already present, it does not insert anything.
cs: Pokud je už položka přítomna, nevloží nic.
de: Wenn das Element bereits vorhanden ist, wird nichts eingefügt.
es: Si el elemento ya está presente, no inserta nada.
fr: Si l'élément est déjà présent, rien n'est inséré.
it: Se l'elemento è già presente, non inserisce nulla.
ja: アイテムが既に存在する場合は、何も挿入しません。
ko: 항목이 이미 있으면 아무 항목도 삽입하지 않습니다.
pl: Jeśli element jest już obecny, nie wstawia niczego.
pt_br: Se o item já estiver presente, ele não insere nada.
ru: Если элемент уже существует, ничего не вставляется.
tr: Öğe zaten varsa yeni bir öğe eklenmez.
zh_hans: 如果项已存在，则不会插入任何内容。
zh_hant: 如果該項目已經存在，就不會插入任何內容。

# BinaryTreeInsert-Line4
source: No need to insert, it already exists; return the node.
cs: Nemusí se vkládat, už existuje; vrátí se uzel.
de: Einfügen nicht erforderlich, da bereits vorhanden; Knoten zurückgeben.
es: No es necesario insertarlo, ya existe; devuelve el nodo.
fr: Insertion inutile, car l'élément existe déjà ; retournez le nœud.
it: Non è necessario inserirla perché esiste già; restituisce il nodo.
ja: 既に存在しているため、挿入する必要はありません。ノードを返します。
ko: 이미 항목이 있으므로 삽입할 필요가 없습니다. 노드를 반환합니다.
pl: Wstawianie nie jest konieczne, element już istnieje; zwróć węzeł.
pt_br: Não é preciso inseri-lo, ele já existe; retorne o nó.
ru: Нет необходимости вставки, так как она уже существует; возврат узла.
tr: Eklemeye gerek yok, öğe zaten var; düğümü döndürün.
zh_hans: 无需插入，该项已存在；返回节点。
zh_hant: 其已存在，所以無須插入; 傳回該節點。

# BinaryTreeInsert-Line5
source: Call into left subtree.
cs: Provede volání do levého podstromu.
de: Aufruf in linker Unterstruktur.
es: Llama al subárbol de la izquierda.
fr: Appelez le sous-arbre gauche.
it: Chiamata nel sottoalbero di sinistra.
ja: 左側のサブツリーに呼び出します。
ko: 왼쪽 하위 트리를 호출합니다.
pl: Wywołanie do lewego poddrzewa.
pt_br: Chamar subárvore à esquerda.
ru: Вызов левого поддерева.
tr: Sol alt ağaca çağırın.
zh_hans: 调入左子树。
zh_hant: 呼叫左樹狀子結構。

# BinaryTreeInsert-Line6
source: Call into right subtree.
cs: Provede volání do pravého podstromu.
de: Aufruf in rechter Unterstruktur.
es: Llama al subárbol de la derecha.
fr: Appelez le sous-arbre droit.
it: Chiamata nel sottoalbero di destra.
ja: 右側のサブツリーに呼び出します。
ko: 오른쪽 하위 트리를 호출합니다.
pl: Wywołanie do prawego poddrzewa.
pt_br: Chamar subárvore à direita.
ru: Вызов правого поддерева.
tr: Sağ alt ağaca çağırın.
zh_hans: 调入右子树。
zh_hant: 呼叫右樹狀子結構。

# DuStruct-Line1
source: Discriminated Unions can also be represented as structs via the 'Struct' attribute.
cs: Rozlišovaná sjednocení můžou být vyjádřena i jako struktury prostřednictvím atributu Struct.
de: Diskriminierte Unions können mithilfe des Attributs "Struct" auch als Struktur dargestellt werden.
es: Las uniones discriminadas se pueden representar también como estructuras con el atributo "Struct".
fr: Les unions discriminées peuvent également être représentées sous forme de structs au moyen de l'attribut 'Struct'.
it: Le unioni discriminate possono essere rappresentate anche come struct tramite l'attributo 'Struct'.
ja: 判別共用体は、'Struct' 属性を介して構造体として表すこともできます。
ko: 'Struct' 특성을 통해 구분된 공용 구조체를 구조체로 나타낼 수도 있습니다.
pl: Unie rozłączne mogą być również reprezentowane w formie struktur za pośrednictwem atrybutu „Struct”.
pt_br: Uniões Discriminadas também podem ser representadas como structs por meio do atributo 'Struct'.
ru: Размеченные объединения также могут быть представлены как структуры при помощи атрибута Struct.
tr: Ayırt Edici Birleşimler, 'Struct' özniteliği aracılığıyla yapı olarak da gösterilebilir.
zh_hans: 可区分联合也可通过 "Struct" 属性表示为结构。
zh_hant: 差異聯集也可透過 'Struct' 屬性以結構形式呈現。

# DuStruct-Line2
source: This is helpful in situations where the performance of structs outweighs
cs: To je užitečné v situacích, kdy má výkon struktur větší váhu než
de: Dies ist in Situationen hilfreich, in denen die Leistung der Strukturen wichtiger ist als
es: Esto es útil en situaciones donde el rendimiento de las estructuras es superior a
fr: Cela peut s'avérer utile dans les situations où le niveau de performance des structs l'emporte
it: Questo comportamento è utile in situazioni in cui la prestazioni degli struct sono prioritarie rispetto alla
ja: これは、構造体のパフォーマンスが参照型の柔軟性よりも
ko: 구조체 성능이 참조 형식의 유연성보다 중요한 경우에
pl: Jest to przydatne w sytuacjach, w których wydajność struktur przewyższa
pt_br: Isso é útil em situações em que o desempenho de structs é superior
ru: Это удобно в ситуациях, когда производительность структур важнее
tr: Bu, yapıların performansının, başvuru türlerinin esnekliğinden daha önemli
zh_hans: 这在结构性能更重要的情况下很有用
zh_hant: 它在結構效能較優的情況下很有用

# DuStruct-Line3
source: the flexibility of reference types.
cs: flexibilita odkazových typů.
de: die Flexibilität der Verweistypen.
es: la flexibilidad de los tipos de referencia.
fr: sur la flexibilité des types de référence.
it: flessibilità dei tipi di riferimento.
ja: 重要である場合に役立ちます。
ko: 유용합니다.
pl: elastyczność typów odwołań.
pt_br: a flexibilidade de tipos de referência.
ru: гибкости ссылочных типов.
tr: olduğu durumlarda kullanışlıdır.
zh_hans: 引用类型的灵活性。
zh_hant: 參考類型的彈性。

# DuStruct-Line4
source: However, there are two important things to know when doing this:
cs: Při tomto postupu je ale třeba vědět dvě důležité věci:
de: Dabei sind jedoch zwei Punkte zu beachten:
es: No obstante, hay dos cosas importantes que deben tenerse en cuenta cuando se hace esto:
fr: Cependant, retenez les deux points suivants si vous procédez de la sorte :
it: Quando si esegue questa operazione, è però importante conoscere due aspetti:
ja: ただし、これを行うときに理解しておく必要のある重要な点が 2 つあります:
ko: 하지만 이 작업을 수행할 때는 다음 두 가지 중요한 사항을 알고 있어야 합니다:
pl: Niemniej w przypadku tej operacji należy pamiętać o dwóch ważnych rzeczach:
pt_br: No entanto, existem duas coisas importantes a saber ao fazer isso:
ru: Но при этом следует помнить о следующих двух важных вещах:
tr: Ancak, bunu yaparken bilmeniz gereken iki önemli nokta vardır:
zh_hans: 然而，执行此操作时需了解两个重要事项:
zh_hant: 但執行這項作業時，需要知道兩件重要的事情:

# DuStruct-Line5
source: 1. A struct DU cannot be recursively-defined.
cs: 1. Rozlišované sjednocení typu struktura nemůže být definované rekurzivně.
de: 1. Eine Struktur-DU kann nicht rekursiv definiert werden.
es: 1. Una unión discriminada de estructura no se puede definir de forma recursiva.
fr: 1. Une union discriminée struct ne peut pas être définie de manière récursive.
it: 1. Un'unione discriminata di struct non può essere definita in modo ricorsivo.
ja: 1. 構造体 DU は再帰的に定義できません。
ko: 1. 구조체 DU는 재귀적으로 정의할 수 없습니다.
pl: 1. Unii rozłącznej w formie struktury nie można zdefiniować rekursywnie.
pt_br: 1. Uma UD struct não pode ser definida recursivamente.
ru: 1. Размеченное объединение структуры не может определяться рекурсивно.
tr: 1. Bir yapı DU'su, özyinelemeli olarak tanımlanamaz.
zh_hans: 1. 无法以递归方式定义结构 DU。
zh_hant: 1. 不可遞迴定義結構 DU。

# DuStruct-Line6
source: 2. A struct DU must have unique names for each of its cases.
cs: 2. Rozlišované sjednocení typu struktura musí mít jedinečné názvy pro každý ze svých případů.
de: 2. In einer Struktur-DU muss jeder Fall einen eindeutigen Namen haben.
es: 2. Una unión discriminada de estructura debe tener un nombre único para cada uno de sus casos.
fr: 2. Une union discriminée struct doit avoir des noms uniques pour chacun de ses cas.
it: 2. A ogni case di un'unione discriminata di struct deve essere assegnato un nome univoco.
ja: 2. 構造体 DU の名前は各ケースに対して一意である必要があります。
ko: 2. 각 케이스마다 구조체 DU의 이름이 고유해야 합니다.
pl: 2. Unia rozłączna w formie struktury musi mieć unikatowe nazwy dla każdego ze swoich przypadków.
pt_br: 2. Uma UD struct deve ter nomes exclusivos para cada um dos seus casos.
ru: 2. Каждой из ветвей размеченного объединения структуры должны быть присвоены уникальные названия.
tr: 2. Bir yapı DU'su, her bir durumu için benzersiz adlara sahip olmalıdır.
zh_hans: 2. 结构 DU 必须对其每个用例均有唯一名称。
zh_hant: 2. 結構 DU 的每個案例都必須要有唯一的名稱。

# PatternMatching-Line1
source: Pattern Matching is a feature of F# that allows you to utilize Patterns,
cs: Porovnávání vzorů je funkce jazyka F#, která umožňuje používat vzory,
de: Der Musterabgleich ist eine Funktion von F#, die Ihnen die Verwendung von Mustern ermöglicht,
es: La coincidencia de patrones es una característica de F# que permite utilizar patrones,
fr: Les critères spéciaux sont une fonctionnalité de F# qui vous permet d'utiliser des modèles
it: I criteri di ricerca sono una funzionalità di F# che consente di utilizzare i criteri,
ja: パターン マッチングはパターンを使用できるようにする F# の機能です。
ko: 패턴 일치는 패턴을 활용할 수 있는 F#의 기능이며,
pl: Dopasowywanie wzorca jest funkcją języka F# umożliwiającą wykorzystywanie wzorców,
pt_br: Correspondência de padrões é um recurso do F# que permite que você utilize Padrões,
ru: Сопоставление шаблонов — это возможность F#, которая позволяет использовать шаблоны,
tr: Desen Eşleştirme, Desenleri kullanmanızı sağlayan bir F# özelliğidir.
zh_hans: 模式匹配是 F# 的一个功能，使你能够利用模式，
zh_hant: 模式比對是讓您能利用模式的一項 F# 功能，

# PatternMatching-Line2
source: which are a way to compare data with a logical structure or structures,
cs: což představuje způsob, jak porovnávat data s logickou strukturou nebo strukturami,
de: die eine Möglichkeit sind, um Daten mit logischen Strukturen oder Strukturen zu vergleichen,
es: que son una forma de comparar datos con estructuras lógicas,
fr: pour comparer des données avec une ou plusieurs structures logiques,
it: che consentono di confrontare i dati con una o più strutture logiche,
ja: これは、データと 1 つまたは複数の論理構造を比較したり、
ko: 패턴을 사용하면 데이터를 논리 구조와 비교하거나,
pl: które są sposobem na porównywanie danych ze strukturami logicznymi lub strukturami,
pt_br: que são uma forma de comparar dados com uma estrutura lógica ou com estruturas,
ru: что представляет способ сравнения данных с логической структурой или структурами,
tr: Desenler, verileri mantıksal yapı veya yapılar ile karşılaştırmak,
zh_hans: 它们是将数据与逻辑结构或结构进行比较的方法，
zh_hant: 這是使用一或多個邏輯結構來比對資料的方式，

# PatternMatching-Line3
source: decompose data into constituent parts, or extract information from data in various ways.
cs: jak rozložit data na základní části nebo extrahovat informace z dat různými způsoby.
de: Daten in ihre Einzelteile zu zerlegen oder auf verschiedene Weise Informationen aus Daten zu extrahieren.
es: descomponer datos en partes constituyentes o extraer información de datos de varias formas.
fr: décomposer des données en parties constitutives ou extraire des informations à partir de données de plusieurs façons.
it: scomporre i dati nelle parti costituenti o estrarre le informazioni dai dati in diversi modi.
ja: データを構成要素部分に分解したり、さまざまな方法でデータから情報を抽出したりするための方法です。
ko: 데이터를 구성 부분으로 분해하거나, 다양한 방법으로 데이터에서 정보를 추출할 수 있습니다.
pl: rozkładanie danych na części składowe lub wyodrębnianie informacji z danych na różne sposoby.
pt_br: decompor os dados em partes constituintes ou extrair informações de dados de diversas maneiras.
ru: разложение данных на составные части или извлечение информации из данных различными способами.
tr: verileri bileşenlerine ayırmak veya verilerden bilgileri çeşitli şekillerde ayıklamak için harika bir yol sunar.
zh_hans: 将数据分解为各个构成部分，或通过各种方式从数据中提取信息。
zh_hant: 將資料分解為構成組件，或透過各種方式來擷取資料中的資訊。

# PatternMatching-Line4
source: You can then dispatch on the "shape" of a pattern via Pattern Matching.
cs: Odesílání pak můžete provádět na základě vzoru v rámci porovnávání vzorů.
de: Das Verteilen ist anschließend mithilfe des Musterabgleichs anhand der Form eines Musters möglich.
es: Después, puede hacer envíos en función de la "forma" de un patrón mediante coincidencia de patrones.
fr: Vous pouvez ensuite effectuer une répartition selon la "forme" d'un modèle à l'aide de critères spéciaux.
it: È quindi possibile intervenire sulla "forma" di un criterio tramite i criteri di ricerca.
ja: その後、パターン マッチングを介してパターンの "形" でディスパッチできます。
ko: 그런 다음 패턴 일치를 사용하여 패턴의 "모양"을 디스패치할 수 있습니다.
pl: Następnie możesz wysłać „kształt” wzorca za pośrednictwem funkcji dopasowywania wzorca.
pt_br: Em seguida, você pode expedir na "forma" de um padrão por meio da Correspondência de Padrões.
ru: Затем можно передать "форму" шаблона при помощи сопоставления шаблонов.
tr: Daha sonra Desen Eşleştirme ile bir desenin "şeklini" gönderebilirsiniz.
zh_hans: 然后，你便可以在模式的“形状”上通过模式匹配进行派遣。
zh_hant: 接著可根據透過比對模式之模式的「形狀」加以分派。

# PatternMatching-Line5
source: To learn more, see: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/pattern-matching
cs: Další informace najdete v tématu: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/pattern-matching
es: Para obtener más información, consulte: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/pattern-matching
fr: Pour en savoir plus, consultez : https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/pattern-matching
pl: Aby dowiedzieć się więcej, zobacz: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/pattern-matching
ru: Подробности: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/pattern-matching

# PersonRecord
source: A record for a person's first and last name
cs: Záznam pro jméno a příjmení daného člověka
de: Ein Datensatz für den Vor- und Nachnamen einer Person
es: Un registro para el nombre y los apellidos de una persona
fr: Enregistrement contenant le nom et le prénom d'une personne
it: Record per il nome e il cognome di una persona
ja: 個人の姓および名のレコード
ko: 사람의 성과 이름에 대한 레코드입니다.
pl: Rekord zawierający imię i nazwisko osoby
pt_br: Um registro de nome e sobrenome de uma pessoa
ru: Запись с именем и фамилией человека
tr: Bir kişinin ad ve soyadı kaydı
zh_hans: 人员的姓氏和名字的记录
zh_hant: 人員姓名的記錄

# EmployeeDu
source: A Discriminated Union of 3 different kinds of employees
cs: Rozlišované sjednocení se 3 různými typy zaměstnanců
de: Eine diskriminierte Union mit drei verschiedenen Arten von Mitarbeitern
es: Una unión discriminada de 3 tipos de empleados diferentes
fr: Union discriminée de 3 genres d'employés différents
it: Unione discriminata di tre diversi tipi di dipendenti
ja: 3 種類の社員の判別共用体
ko: 세 가지 다른 직원 유형이 있는 구분된 공용 구조체
pl: Unia rozłączna 3 różnych rodzajów pracowników
pt_br: Uma União Discriminada de 3 tipos diferentes de funcionários
ru: Размеченное соединение трех разных типов сотрудников
tr: 3 farklı çalışan türünden oluşan bir Ayırt Edici Birleşim
zh_hans: 具有 3 种不同员工的可区分联合
zh_hant: 3 種不同種類員工的差異聯集

# CountEmployees-Line1
source: Count everyone underneath the employee in the management hierarchy,
cs: Spočítají se všichni zaměstnanci pod daným zaměstnancem v hierarchii řízení,
de: Zählen Sie alle Personen unterhalb des Angestellten in der Verwaltungshierarchie,
es: Cuenta a todos por debajo del empleado en la jerarquía de administración,
fr: Comptez tout le monde sous l'employé dans la hiérarchie de gestion
it: Conta chiunque sotto il dipendente nella gerarchia di gestione,
ja: 管理階層構造の中で、ある社員の下にいる全員の数を数えます
ko: 관리 계층 구조에서 이 직원을 포함하여 이 아래에 있는 모든 직원의 수를
pl: Licz wszystkich podlegających pracownikowi w hierarchii zarządzania,
pt_br: Conta todos abaixo do funcionário na hierarquia de gerenciamento,
ru: Подсчет всех сотрудников на уровнях иерархии управления, следующих за этим сотрудником,
tr: Çalışan da dahil olmak üzere, yönetim hiyerarşisinde çalışanın altındaki
zh_hans: 在管理层次结构下对员工进行计数，
zh_hant: 計算管理階層中該員工下的每位人員，

# CountEmployees-Line2
source: including the employee.
cs: včetně tohoto zaměstnance.
de: einschließlich des Angestellten.
es: incluido el empleado.
fr: (employé inclus).
it: includendo il dipendente.
ja: (その社員自身を含む)。
ko: 셉니다.
pl: z uwzględnieniem pracownika.
pt_br: incluindo o funcionário.
ru: включая этого сотрудника.
tr: herkesi sayın.
zh_hans: 其中包括员工。
zh_hant: 包括員工。

# FindDave-Line1
source: Find all managers/executives named "Dave" who do not have any reports.
cs: Vyhledá všechny nadřízené/výkonné pracovníky se jménem Dave, kteří nemají žádné podřízené.
de: Suchen Sie alle Manager/Führungskräfte mit dem Namen "Dave", die über keine Berichte verfügen.
es: Buscar a todos los directores o ejecutivos que se llamen "Dave" que no tengan jefes.
fr: Recherchez tous les responsables ou cadres dont le prénom est "Dave" et qui ne disposent d'aucun rapport.
it: Trova tutti i manager/dirigenti il cui nome è "Dave" e per i quali non sono disponibili report.
ja: 名前が "Dave" で、レポートのないすべてのマネージャー/役員を検索します。
ko: 이름이 "Dave"이고 부하직원이 없는 모든 관리자/간부를 찾습니다.
pl: Znajdź wszystkich kierowników/dyrektorów o imieniu „Dave”, którzy nie mają żadnych podwładnych.
pt_br: Localize todos os gerentes/executivos chamados "Dave" que não têm nenhum relatório.
ru: Поиск всех менеджеров и руководителей с именем Dave, не имеющих отчетов.
tr: Herhangi bir raporu olmayan, "Dave" adlı tüm yöneticileri bulun.
zh_hans: 查找所有名为 "Dave" 且没有任何下属的经理/主管。
zh_hant: 尋找沒有任何報表且名為 "Dave" 的所有經理/主管。

# FindDave-Line2
source: This uses the 'function' shorthand to as a lambda expression.
cs: Tady se používá zkrácený název function jako výraz lambda.
de: Dies verwendet die Kurzform "function" als Lambdaausdruck.
es: Aquí se utiliza la forma abreviada "function" como una expresión lambda.
fr: Le raccourci 'function' est utilisé comme expression lambda.
it: Usa la sintassi abbreviata di 'function' come espressione lambda.
ja: これは、ラムダ式として 'function' の短縮形を使用します。
ko: 여기서는 'function' 약어를 람다 식으로 사용합니다.
pl: Operacja używa skrótu słowa „function” jako wyrażenia lambda.
pt_br: Isso usa a forma abreviada de 'function' como uma expressão lambda.
ru: При этом используется сокращение функции до лямбда-выражения.
tr: Bu, 'function' kısaltmasını bir lambda ifadesi olarak kullanır.
zh_hans: 这使用 "function" 简写为 lambda 表达式。
zh_hant: 這會使用 'function' 速記作為 lambda 運算式。

# MatchEmptyList
source: [] matches an empty list.
cs: [] odpovídá prázdnému seznamu.
de: [] entspricht einer leeren Liste.
es: [] coincide con una lista vacía.
fr: [] correspond à une liste vide.
it: [] corrisponde a un elenco vuoto.
ja: [] は空白のリストに一致します。
ko: []는 빈 목록과 일치합니다.
pl: [] dopasuje pustą listę.
pt_br: [] corresponde a uma lista vazia.
ru: [] соответствует пустому списку.
tr: [] boş bir liste ile eşleşir.
zh_hans: [] 匹配空列表。
zh_hant: [] 代表空的清單。

# MatchWildcard-Line1
source: '_' is a wildcard pattern that matches anything.
cs: „_“ je zástupný vzor, kterému odpovídá úplně všechno.
de: "_" ist ein Platzhaltermuster, das mit allem übereinstimmt
es: "_" es un patrón comodín que busca cualquier cosa.
fr: '_' est un modèle générique qui correspond à n'importe quel élément.
it: '_' è un carattere jolly che corrisponde a qualsiasi stringa.
ja: '_' は、任意のものに一致するワイルドカード パターンです。
ko: '_'는 모든 항목과 일치하는 와일드카드 패턴입니다.
pl: „_” to wzorzec wieloznaczny, który pasuje do wszystkiego.
pt_br: '_' é um padrão de caractere curinga que coincide com qualquer coisa.
ru: "_" — подстановочный знак, обозначающий любой набор символов.
tr: '_' herhangi bir öğeyle eşleşen bir joker karakter desenidir.
zh_hans: "_" 是与任何对象均匹配的通配符模式。
zh_hant: '_' 是符合所有項目的萬用字元模式。

# MatchWildCard-Line2
source: This handles the "or else" case.
cs: Toto řeší případ „or else“
de: Dies behandelt den "or else"-Fall.
es: Este código controla el caso "or else".
fr: Ceci permet de gérer le cas "or else".
it: Gestisce il caso "or else".
ja: これは "or else" ケースを処理します。
ko: 이 와일드카드 패턴은 "or else" 케이스를 처리합니다.
pl: Obsługuje przypadek „w przeciwnym razie”.
pt_br: Isso identifica o caso "ou também".
ru: Обрабатывается ветвь "or else".
tr: Bu, "or else" durumunu ele alır.
zh_hans: 它处理 "or else" 情况。
zh_hant: 這會處理 "or else" 案例。

# MatchShorthand-Line1
source: You can also use the shorthand function construct for pattern matching,
cs: Můžete také použít zkrácenou konstrukci function pro porovnávání vzorů,
de: Sie können das Kurzform-Funktionskonstrukt auch für den Musterabgleich verwenden,
es: También puede usar la construcción abreviada de funciones para la coincidencia de patrones,
fr: Vous pouvez également utiliser la construction de fonction raccourcie pour les critères spéciaux,
it: Per i criteri di ricerca è anche possibile usare il costrutto di funzione a sintassi abbreviata,
ja: パターン マッチングのために、短縮形の関数コンストラクトを使用することもできます。
ko: 패턴 일치에 약어 형식 함수 구문을 사용할 수도 있습니다.
pl: Możesz również użyć konstrukcji funkcji skrótu w przypadku dopasowywania wzorców,
pt_br: Você também pode usar o constructo da função abreviada para correspondência de padrões,
ru: Для сопоставления шаблонов можно также использовать краткую форму конструкции функции,
tr: Kısaltma özellik yapısını desen eşleştirme için de kullanabilirsiniz,
zh_hans: 你也可将简写函数构造用于模式匹配，
zh_hant: 您也可以使用速記函式建構來進行模式比對，

# MatchShorthand-Line2
source: which is useful when you're writing functions which make use of Partial Application.
cs: což je užitečné při psaní funkcí, které využívají částečné použití argumentů.
de: was beim Schreiben von Funktionen, die die partielle Anwendung nutzen, hilfreich ist.
es: que es muy útil cuando se escriben funciones que utilizan aplicación parcial.
fr: ce qui peut s'avérer utile quand vous écrivez des fonctions qui utilisent l'application partielle.
it: che risulta utile quando si scrivono funzioni che usano l'applicazione parziale.
ja: これは、部分適用を利用する関数を記述している場合に役立ちます。
ko: 이 구문은 부분 애플리케이션을 사용하는 함수를 작성할 때 유용합니다.
pl: co jest przydatne podczas pisania funkcji wykorzystujących częściową aplikację.
pt_br: que é útil quando você está gravando funções que fazem uso do Aplicativo Parcial.
ru: что удобно при написании функций, использующих частичное применение.
tr: bu Kısmi Uygulamayı kullanan işlevler yazarken kullanışlıdır.
zh_hans: 这在编写使用偏函数应用的函数时很有用。
zh_hant: 適用於撰寫可利用局部應用程式的函式時。
