Repository: dotnet/fsharp
Catalog: vsintegration/ProjectTemplates/TutorialProject/Template/xlf/Tutorial.fsx.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# RecRunDef-Line2
source: integer. It uses 'let rec' to define a recursive function.
cs: integer. Pomocí let rec se definuje rekurzivní funkce.
de: Zahl berechnet. Zum Definieren einer rekursiven Funktion wird "let rec" verwendet.
es: entero. Usa "let rec" para definir una función recursiva.
fr: entier. Il utilise 'let rec' pour définir une fonction récursive.
it: numero intero. Usa 'let rec' per definire una funzione ricorsiva.
ja: 整数。'let rec' を使用して、再帰関数を定義します。
ko: 'let rec'를 사용하여 재귀 함수를 정의합니다.
pl: liczba całkowita. Używa deklaratora „let rec” do zdefiniowania funkcji rekursywnej.
pt_br: inteiro. Ele usa 'let gra' para definir uma função recursiva.
ru: целое число. В нем используется "let rec" для определения рекурсивной функции.
tr: gösterir. Özyinelemeli işlevi tanımlamak için 'let rec' kullanır.
zh_hans: 整数。它使用 "let rec" 来定义递归函数。
zh_hant: 整數。其使用 'let rec' 來定義遞迴函式。

# RecGcd-Line1
source: Computes the greatest common factor of two integers.
cs: Vypočítá největšího společného dělitele dvou celých čísel.
de: Berechnet den höchsten gemeinsamen Faktor von zwei Integern.
es: Calcula el mayor factor común de dos enteros.
fr: Calcule le plus grand commun diviseur de deux entiers.
it: Calcola il fattore comune maggiore di due interi.
ja: 2 つの整数の最大公約数をコンピューティングします。
ko: 두 정수의 최대 공약수를 계산합니다.
pl: Oblicza największy wspólny dzielnik dwóch liczb całkowitych.
pt_br: Calcula o máximo divisor comum de dois inteiros.
ru: Вычисляет наибольший общий делитель двух целых чисел.
tr: İki tamsayının en büyük ortak çarpanını hesaplar.
zh_hans: 计算两个整数的最大公因数。
zh_hant: 計算兩個整數的最大公因數。

# RecGcd-Line2
source: Since all of the recursive calls are tail calls,
cs: Vzhledem k tomu, že všechna rekurzivní volání jsou volání funkce Tail,
de: Da alle rekursiven Aufrufe Endeaufrufe sind,
es: Puesto que todas las llamadas recursivas son llamadas de cola,
fr: Comme tous les appels récursifs sont des appels terminaux,
it: Dal momento che tutte le chiamate ricorsive sono chiamate tail,
ja: すべての再帰呼び出しは末尾呼び出しであるため、
ko: 모든 재귀 호출은 마무리 호출이므로,
pl: Jako że wszystkie wywołania rekurencyjne są wywołaniami ogonowymi,
pt_br: Como todas as chamadas recursivas são chamadas tail,
ru: Так как все рекурсивные вызовы являются хвостовыми вызовами,
tr: Özyinelemeli tüm çağrılar tail çağrısı olduğundan,
zh_hans: 由于所有递归调用都是尾调用，
zh_hant: 因為所有遞迴呼叫都是先計算細項的呼叫 (tail call)，所以

# RecGcd-Line3
source: the compiler will turn the function into a loop,
cs: kompilátor změní funkci na smyčku,
de: wandelt der Compiler die Funktion in eine Schleife um,
es: el compilador devolverá la función en un bucle,
fr: le compilateur transforme la fonction en boucle,
it: il compilatore convertirà la funzione in un ciclo,
ja: コンパイラは関数をループにします
ko: 컴파일러에서는 함수를 루프로 전환합니다.
pl: kompilator zamieni funkcję w pętlę,
pt_br: o compilador transformará a função em um loop,
ru: компилятор сделает из функции цикл,
tr: derleyici, işlevi bir döngüye dönüştürür,
zh_hans: 因此编译器会将该函数转变成一个循环，
zh_hant: 編譯器會將函式轉換為迴圈，

# RecGcd-Line4
source: which improves performance and reduces memory consumption.
cs: což zvyšuje výkon a snižuje spotřebu paměti.
de: was die Leistung verbessert und die Arbeitsspeicherbedarf reduziert.
es: lo que mejora el rendimiento y reduce el consumo de memoria.
fr: ce qui améliore le niveau de performance et réduit la consommation de mémoire.
it: in modo da migliorare le prestazioni e ridurre il consumo di memoria.
ja: これによりパフォーマンスが向上し、メモリの消費を抑えることができます。
ko: 루프는 성능을 향상시키고 메모리 소비량을 줄여 줍니다.
pl: która umożliwi zwiększenie wydajności i zmniejszenie zużycia pamięci.
pt_br: que melhora o desempenho e reduz o consumo de memória.
ru: что повысит производительность и снизит потребление памяти.
tr: bu da performansı artırır ve bellek tüketimini azaltır.
zh_hans: 这可提高性能并减少内存消耗。
zh_hant: 以改善效能並降低記憶體耗用。

# RecSumList
source: This example computes the sum of a list of integers using recursion.
cs: Tento příklad zjistí součet seznamu celých čísel pomocí rekurze.
de: Dieses Beispiel berechnet mithilfe von Rekursion die Summe einer Liste von Integern.
es: Este ejemplo calcula la suma de una lista de enteros con recursión.
fr: Cet exemple calcule la somme d'une liste d'entiers à l'aide de la récursivité.
it: Questo esempio consente di calcolare la somma di un elenco di interi usando la ricorsione.
ja: この例では、再帰を使用して整数のリストの合計をコンピューティングします。
ko: 이 예제에서는 재귀를 사용하여 정수 목록의 합을 계산합니다.
pl: Ten przykład oblicza sumę listy liczb całkowitych przy użyciu rekursji.
pt_br: Este exemplo calcula a soma de uma lista de inteiros usando recursão.
ru: Этот пример вычисляет сумму списка целых чисел при помощи рекурсии.
tr: Bu örnek, özyineleme kullanarak bir tamsayılar listesinin toplamını hesaplar.
zh_hans: 本示例使用递归计算整数列表的总和。
zh_hant: 此範例會計算使用遞迴之整數清單的總和。

# RecSumListTail
source: This makes 'sumList' tail recursive, using a helper function with a result accumulator.
cs: Tím se funkce Tail sumList stane rekurzivní, a to s použitím pomocné funkce s akumulátorem výsledků.
de: Mithilfe einer Hilfsfunktion mit einem Ergebnisakkumulator wird "sumList" endrekursiv.
es: Esto convierte la función "sumList" en recursiva de cola, usando una función auxiliar con un acumulador de resultados.
fr: 'sumList' est converti en fonction à récursivité terminale, en utilisant une fonction d'assistance avec accumulateur de résultats.
it: In questo modo la funzione tail 'sumList' viene resa ricorsiva, usando una funzione helper con un accumulatore di risultati.
ja: これは、ヘルパー関数を結果アキュムレータと共に使用して 'sumList' を末尾再帰にします。
ko: 도우미 함수와 결과 누적기를 사용하여 'sumList'를 마무리 재귀 함수로 만듭니다.
pl: Operacja zamieni listę „sumList” w listę z rekursją ogonową przy użyciu funkcji pomocniczej z akumulatorem wyników.
pt_br: Isso torna a cauda de 'sumList' recursiva usando uma função auxiliar com um acumulador de resultado.
ru: При этом sumList становится функцией с хвостовой рекурсией, использующей вспомогательную функцию с аккумулятором результатов.
tr: Bu, bir sonuç biriktirici ile bir yardımcı işlev kullanarak 'sumList' tail öğesini özyinelemeli yapar.
zh_hans: 通过将 Helper 函数与结果累加器一起使用，使 "sumList" 成为尾递归函数。
zh_hant: 這會將 'sumList' 設成尾遞迴，使用內含結果累加器的 Helper 函式。

# RecSumListTailInvoke-Line1
source: This invokes the tail recursive helper function, providing '0' as a seed accumulator.
cs: Tím se vyvolá rekurzivní pomocná funkce Tail, poskytující 0 jako zdrojový akumulátor.
de: Dies ruft die endrekursive Hilfsfunktion auf und verwendet "0" als Startwertakkumulator.
es: Este código invoca la función auxiliar recursiva de cola, proporcionando "0" como acumulador de valores de inicialización.
fr: La fonction d'assistance de récursivité terminale est appelée et fournit '0' comme accumulateur de valeurs initiales.
it: Viene chiamata la funzione helper tail ricorsiva, fornendo '0' come accumulatore di seeding.
ja: これは、シード アキュムレータとして '0' を指定して、末尾再帰的なヘルパー関数を呼び出します。
ko: '0'을 시드 누적기로 제공하여 마무리 재귀 도우미 함수를 호출합니다.
pl: Spowoduje to wywołanie funkcji pomocniczej z rekursją ogonową, z wartością „0” jako akumulatorem początkowym.
pt_br: Isso invoca a cauda da função auxiliar recursiva, fornecendo '0' como um acumulador de semente.
ru: Вызывается вспомогательная функция хвостовой рекурсии, предоставляющая "0" в качестве аккумулятора начальных значений.
tr: Bu, çekirdek biriktirici olarak '0' sağlayarak özyinelemeli tail yardımcı işlevini çağırır.
zh_hans: 假如 "0" 作为种子累加器，这将调用尾递归 helper 函数。
zh_hant: 這會叫用尾遞迴 helper 函式，提供 '0' 作為種子累加器。

# RecSumListTailInvoke-Line2
source: An approach like this is common in F#.
cs: Takový postup je v jazyce F# běžný.
de: Dies ist eine häufige Vorgehensweise in F#.
es: Este método es habitual en F#.
fr: Une telle approche est courante en F#.
it: Un approccio di questo tipo è comune in F#.
ja: F# では、このようなアプローチは一般的です。
ko: F#에서 이와 같은 접근 방식이 일반적입니다.
pl: Takie podejście jest typowe dla języka F#.
pt_br: Uma abordagem como essa é comum em F#.
ru: Подобный подход широко распространен в F#.
tr: Benzer yaklaşımlar F# içinde yaygındır.
zh_hans: 此类方法在 F# 中很常见。
zh_hant: 在 F# 中，這類方式十分常見。

# Records-Line1
source: Records are an aggregate of named values, with optional members (such as methods).
cs: Záznamy jsou agregátem pojmenovaných hodnot s volitelnými členy (jako jsou metody).
de: Datensätze sind ein Aggregat aus benannten Werten mit optionalen Membern (wie etwa Methoden).
es: Los registros son un agregado de valores con nombre, con miembros opcionales (como los métodos).
fr: Les enregistrements sont des agrégats de valeurs nommées, avec des membres facultatifs (comme des méthodes).
it: I record sono un aggregato di valori denominati, con membri facoltativi, ad esempio metodi.
ja: レコードは、オプションのメンバー (メソッドなど) を含む名前付きの値の集約です。
ko: 레코드는 명명된 값의 집계이며, 필요에 따라 메서드와 같은 선택적 멤버도 포함합니다.
pl: Rekordy są agregacjami nazwanych wartości z opcjonalnymi elementami członkowskimi (np. metodami).
pt_br: Registros são uma agregação de valores nomeados com membros opcionais (como métodos).
ru: Записи являются агрегатами именованных значений с необязательными элементами (такими как методы).
tr: Kayıtlar, isteğe bağlı üyeleri (örneğin, metotlar) içeren adlandırılmış değerlerin kümesidir.
zh_hans: 记录是已命名值的聚合，同时具有可选成员(例如，方法)。
zh_hant: 記錄是具有選擇性成員 (例如方法) 之具名值的彙總。

# Records-Line2
source: They are immutable and have structural equality semantics.
cs: Jsou neměnné a mají sémantiku se strukturální rovností.
de: Sie sind nicht veränderlich und verfügen über eine strukturelle Gleichheitssemantik.
es: Son inmutables y tienen semántica de igualdad estructural.
fr: Ils ne sont pas modifiables et ont une sémantique d'égalité structurelle.
it: Non sono modificabili e includono la semantica di uguaglianza strutturale.
ja: これらは変更できず、構造上の等価セマンティクスを持ちます。
ko: 레코드는 변경 불가능하며 구조적으로 같음 의미 체계가 있습니다.
pl: Są niezmienne i mają semantykę równości strukturalnej.
pt_br: Eles são imutáveis e têm semântica de igualdade estrutural.
ru: Они являются неизменяемыми и обладают семантикой структурного равенства.
tr: Bunlar sabittir ve yapısal eşitlik semantiğine sahiptir.
zh_hans: 它们不可变且具有结构相等性语义。
zh_hant: 它們不可變動，且具有結構相等的語意。

# Records-Line3
source: To learn more, see: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/records
cs: Další informace najdete v tématu: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/records
es: Para obtener más información, consulte: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/records
fr: Pour en savoir plus, consultez : https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/records
pl: Aby dowiedzieć się więcej, zobacz: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/records
ru: Подробности: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/records

# RecordDefinition
source: This example shows how to define a new record type.
cs: Tento příklad ukazuje, jak definovat nový typ záznamu.
de: Dieses Beispiel zeigt, wie ein neuer Datensatztyp definiert wird.
es: Este ejemplo muestra cómo definir un nuevo tipo de registro.
fr: Cet exemple montre comment définir un nouveau type d'enregistrement.
it: Questo esempio mostra come definire un nuovo tipo di record.
ja: この例では、新しいレコード型を定義する方法を示します。
ko: 이 예에서는 새 레코드 형식을 정의하는 방법을 보여 줍니다.
pl: Ten przykład przedstawia sposób definiowania nowego typu rekordu.
pt_br: Este exemplo mostra como definir um novo tipo de registro.
ru: В этом примере показано, как определить новый тип записи.
tr: Bu örnek yeni bir kayıt türü tanımlamayı gösterir.
zh_hans: 此示例演示如何定义新记录类型。
zh_hant: 此範例示範如何定義新記錄類型。

# RecordInstantiation1
source: This example shows how to instantiate a record type.
cs: Tento příklad ukazuje, jak vytvořit instanci typu záznamu.
de: In diesem Beispiel erfahren Sie, wie Sie einen Datensatztyp instanziieren.
es: Este ejemplo muestra cómo crear una instancia de un tipo de registro.
fr: Cet exemple montre comment instancier un type d'enregistrement.
it: Questo esempio mostra come creare un'istanza di un tipo di record.
ja: この例では、レコードの種類をインスタンス化する方法を示します。
ko: 이 예제에서는 레코드 형식을 인스턴스화하는 방법을 보여 줍니다.
pl: W tym przykładzie pokazano sposób tworzenia wystąpienia typu rekordu.
pt_br: Este exemplo mostra como criar uma instância de um tipo de registro.
ru: В этом примере показано создание экземпляра типа записи.
tr: Bu örnekte, bir kayıt türünün örneğinin nasıl oluşturulacağı gösterilmektedir.
zh_hans: 本示例演示如何实例化记录类型。
zh_hant: 此範例示範如何具現化記錄類型。

# RecordInstantiation2
source: You can also do this on the same line with ';' separators.
cs: Můžete to udělat i na stejném řádku se středníky (;) jako oddělovači.
de: Das ist in der gleichen Zeile auch mit dem Trennzeichen ";" möglich.
es: También puede hacer esto en la misma línea usando ";" como separador.
fr: Vous pouvez également effectuer cette opération sur la même ligne avec des séparateurs ';'.
it: È possibile eseguire questa operazione sulla stessa riga usando i separatori ';'.
ja: ';' 区切りを使用して、同じ行でこれを行うこともできます。
ko: 동일한 줄에서 ';' 구분 기호를 사용하여 이 작업을 수행할 수도 있습니다.
pl: Możesz to również zrobić w tym samym wierszu, korzystając z separatorów „;”.
pt_br: Você também pode fazer isso na mesma linha com separadores ';'.
ru: Это также можно сделать в одной строке при помощи разделителя ";",
tr: Bunu ';' ayırıcıları ile aynı satırda da yapabilirsiniz.
zh_hans: 也可使用 ";" 分隔符在同一行上执行此操作。
zh_hant: 您也可以使用 ';' 分隔符號，在同一行執行此作業。

# UpdateRecord-Line1
source: This example shows how to use "copy-and-update" on record values. It creates
cs: Tento příklad ukazuje, jak použít copy-and-update pro hodnoty záznamu. Vytvoří
de: Dieses Beispiel zeigt die Verwendung von "Kopieren und aktualisieren" für Datensatzwerte. Es wird
es: Este ejemplo muestra cómo usar "copy-and-update" en los valores de registro. Crea
fr: Cet exemple montre comment utiliser "copy-and-update" sur des valeurs d'enregistrement. Il crée
it: Questo esempio mostra come usare il metodo di copia e aggiornamento su valori di record. Crea
ja: この例では、レコード値で "copy-and-update" を使用する方法を示します。次を作成します:
ko: 이 예에서는 레코드 값에 "copy-and-update"를 사용하는 방법을 보여 줍니다.
pl: Ten przykład przedstawia sposób użycia operacji „kopiuj i aktualizuj” na wartościach rekordu. Tworzy
pt_br: Este exemplo mostra como usar o "copiar e atualizar" em valores do Registro. Ele cria
ru: В этом примере показано, как использовать функцию "копировать и обновить" применительно к значениям записей. В нем создается
tr: Bu örnek kayıt değerlerinde "kopyalama ve güncelleştirme" kullanımını gösterir. contact1'in
zh_hans: 此示例演示如何对记录值使用 "copy-and-update"。它创建了
zh_hant: 此範例顯示如何在記錄值上使用 "copy-and-update"。其會建立

# UpdateRecord-Line2
source: a new record value that is a copy of contact1, but has different values for
cs: hodnotu nového záznamu, která je kopií záznamu contact1, ale má jiné hodnoty pro
de: ein neuer Datensatz als Kopie von "contact1" erstellt, der jedoch über andere Werte
es: un nuevo valor de registro que es una copia de contact1, pero con valores distintos para
fr: une nouvelle valeur d'enregistrement qui est une copie de contact1, mais qui a différentes valeurs pour
it: un nuovo valore di record che è una copia di contact1, ma contiene valori diversi per
ja: contact1 のコピーであるレコード値。ただし、次の値は異なります:
ko: contact1의 복사본인 새 레코드 값을 만들지만
pl: nową wartość rekordu, która jest kopią elementu contact1, lecz ma inne wartości dla
pt_br: um novo valor de registro é uma cópia de contact1, mas tem valores diferentes para
ru: новое значение записи, которое является копией contact1, но имеет другие значения для
tr: kopyası olan, ama 'Telefon' ve 'Doğrulanmış' alanları için farklı değerleri olan
zh_hans: 新的记录值，该值是 contact1 的副本，但对以下内容具有不同的值
zh_hant: 新記錄值，其為 contact1 的複本，但對於下項有不同的值:

# UpdateRecord-Line3
source: the 'Phone' and 'Verified' fields.
cs: pole Telefon a Ověřeno.
de: für die Felder "Phone" und "Verified" verfügt.
es: los campos "Phone" y "Verified".
fr: les champs 'Phone' et 'Verified'.
it: i campi 'Phone' e 'Verified'.
ja: [電話番号]5D; および [検証済み]5D; フィールド。
ko: 'Phone'과 'Verified' 필드의 값이 다릅니다.
pl: pola „Phone” i „Verified”.
pt_br: os campos 'Telefone' e 'Verificado'.
ru: поля Phone и Verified.
tr: yeni bir kayıt değeri oluşturur.
zh_hans: “电话”和“已验证”字段。
zh_hant: [Phone]5D; 與 [Verified]5D; 欄位。

# UpdateRecord-Line4
source: To learn more, see: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/copy-and-update-record-expressions
cs: Další informace najdete v tématu: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/copy-and-update-record-expressions
es: Para obtener más información, consulte: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/copy-and-update-record-expressions
fr: Pour en savoir plus, consultez : https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/copy-and-update-record-expressions
pl: Aby dowiedzieć się więcej, zobacz: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/copy-and-update-record-expressions
ru: Подробности: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/copy-and-update-record-expressions

# ProcessRecord-Line1
source: This example shows how to write a function that processes a record value.
cs: Tento příklad ukazuje, jak napsat funkci, která zpracuje hodnotu záznamu.
de: Dieses Beispiel veranschaulicht das Schreiben einer Funktion zum Verarbeiten eines Datensatzwerts.
es: Este ejemplo muestra cómo escribir una función que procesa un valor del registro.
fr: Cet exemple montre comment écrire une fonction qui traite une valeur d'enregistrement.
it: Questo esempio mostra come scrivere una funzione che elabora un valore di record.
ja: この例では、レコード値を処理する関数を書き込む方法を示します。
ko: 이 예에서는 레코드 값을 처리하는 함수를 작성하는 방법을 보여 줍니다.
pl: Ten przykład przedstawia, jak napisać funkcję przetwarzającą wartość rekordu.
pt_br: Este exemplo mostra como escrever uma função que processa um valor de Registro.
ru: В этом примере показано, как создать функцию, обрабатывающую значение записи.
tr: Bu örnek kayıt değerini işleyen bir işlev yazmayı gösterir.
zh_hans: 此示例演示如何编写处理记录值的函数。
zh_hant: 此範例示範如何寫入會處理記錄值的函式。

# ProcessRecord-Line2
source: It converts a 'ContactCard' object to a string.
cs: Převádí objekt ContactCard na řetězec.
de: Es konvertiert ein Objekt vom Typ "ContactCard" in eine Zeichenfolge.
es: Convierte un objeto "ContactCard" en una cadena.
fr: Il convertit un objet 'ContactCard' en chaîne.
it: Converte un oggetto 'ContactCard' in una stringa.
ja: 'ContactCard' オブジェクトを文字列に変換します。
ko: 'ContactCard' 개체를 문자열로 변환합니다.
pl: Konwertuje obiekt „ContactCard” na ciąg.
pt_br: Converte um objeto 'ContactCard' em uma cadeia de caracteres.
ru: Он преобразует объект ContactCard в строку.
tr: 'ContactCard' nesnesini dizeye dönüştürür.
zh_hans: 它将 "ContactCard" 对象转换为字符串。
zh_hant: 其會將 'ContactCard' 物件轉換為字串。

# RecordWithMember-Line1
source: This is an example of a Record with a member.
cs: Toto je příklad záznamu se členem.
de: Dies ist ein Beispiel für einen Datensatz mit einem Member.
es: Este es un ejemplo de un registro con un miembro.
fr: Il s'agit d'un exemple d'enregistrement avec un membre.
it: Questo è un esempio di record con un membro.
ja: これは、メンバーを含むレコードの例です。
ko: 멤버가 하나인 레코드의 예제입니다.
pl: Jest to przykład rekordu z elementem członkowskim.
pt_br: Este é um exemplo de um Registro com um membro.
ru: Это — пример записи с элементом.
tr: Bu, üye içeren bir Kayıt örneğidir.
zh_hans: 这是一个具有成员的记录示例。
zh_hant: 這是內含成員之記錄的範例。

# RecordWithMember-Line2
source: Members can implement object-oriented members.
cs: Členové můžou implementovat objektově orientované členy.
de: Member können objektorientierte Member implementieren.
es: Los miembros pueden implementar miembros orientados a objetos.
fr: Les membres peuvent implémenter des membres orientés objet.
it: I membri possono implementare membri orientati a oggetti.
ja: メンバーはオブジェクト指向のメンバーを実装できます。
ko: 멤버는 개체 지향 멤버를 구현할 수 있습니다.
pl: Elementy członkowskie mogą implementować elementy członkowskie zorientowane obiektowo.
pt_br: Os membros podem implementar membros orientados a objeto.
ru: Элементы могут реализовать объектно-ориентированные элементы.
tr: Üyeler, nesne yönelimli üyeleri uygulayabilir.
zh_hans: 成员可实现面向对象的成员。
zh_hant: 成員可以實作物件導向成員。

# RecordAccess
source: Members are accessed via the '.' operator on an instantiated type.
cs: Ke členům se přistupuje prostřednictvím operátoru „.“ u typu tvořícího instanci.
de: Auf Member wird über den Operator "." in einem instanziierten Typ zugegriffen.
es: A los miembros se accede con el operador "." en un tipo del que se ha creado una instancia.
fr: Les membres sont accessibles au moyen de l'opérateur '.' sur un type instancié.
it: In un tipo di cui è stata creata un'istanza l'accesso ai membri avviene tramite l'operatore '.'.
ja: メンバーには、インスタンス化された型に対する '.' 演算子を介してアクセスできます。
ko: 인스턴스화된 형식에서 '.' 연산자를 통해 멤버에 액세스합니다.
pl: Do elementów członkowskich uzyskuje się dostęp za pośrednictwem operatora „.” w typie skonkretyzowanym.
pt_br: Os membros são acessados por meio do operador '.' em um tipo instanciado.
ru: Доступ к элементам осуществляется через оператор "." для экземпляра типа.
tr: Örnekli bir tür üzerinde, üyelere '.' işleci ile erişilir.
zh_hans: 可通过实例化类型上的 "." 运算符访问成员。
zh_hant: 成員透過在具現化類型上的 '.' 運算子加以存取。

# RecordStruct-Line1
source: Records can also be represented as structs via the 'Struct' attribute.
cs: Záznamy můžou být vyjádřeny i jako struktury prostřednictvím atributu Struct.
de: Datensätze können mithilfe des Attributs "Struct" auch als Strukturen dargestellt werden.
es: Los registros se pueden representar también como estructuras con el atributo "Struct".
fr: Les enregistrements peuvent également être représentés sous forme de structs par le biais de l'attribut 'Struct'.
it: I record possono essere rappresentati anche come struct tramite l'attributo 'Struct'.
ja: レコードは 'Struct' 属性を介して構造体として表すこともできます。
ko: 'Struct' 특성을 통해 레코드를 구조체로 나타낼 수도 있습니다.
pl: Rekordy można również reprezentować jako struktury za pośrednictwem atrybutu „Struct”.
pt_br: Registros também podem ser representados como structs por meio do atributo 'Struct'.
ru: Записи также могут быть представлены как структуры при помощи атрибута Struct.
tr: Kayıtlar 'Struct' özniteliği ile yapı olarak da gösterilebilir.
zh_hans: 记录也可通过 "Struct" 属性表示为结构。
zh_hant: 記錄也可透過 'Struct' 屬性以結構形式呈現。

# RecordStruct-Line2
source: This is helpful in situations where the performance of structs outweighs
cs: To je užitečné v situacích, kdy má výkon struktur větší váhu než
de: Dies ist in Situationen hilfreich, in denen die Leistung der Strukturen wichtiger ist als
es: Esto es útil en situaciones donde el rendimiento de las estructuras es superior a
fr: Cela peut s'avérer utile dans les situations où le niveau de performance des structs l'emporte
it: Questo comportamento è utile in situazioni in cui la prestazioni degli struct sono prioritarie rispetto alla
ja: これは、構造体のパフォーマンスが参照型の柔軟性よりも
ko: 구조체 성능이 참조 형식의 유연성보다 중요한 경우에
pl: Jest to przydatne w sytuacjach, w których wydajność struktur przewyższa
pt_br: Isso é útil em situações em que o desempenho de structs é superior
ru: Это удобно в ситуациях, когда производительность структур важнее
tr: Bu, yapıların performansının, başvuru türlerinin esnekliğinden daha önemli
zh_hans: 这在结构性能更重要的情况下很有用
zh_hant: 它在結構效能較優的情況下很有用

# RecordStruct-Line3
source: the flexibility of reference types.
cs: flexibilita odkazových typů.
de: die Flexibilität der Verweistypen.
es: la flexibilidad de los tipos de referencia.
fr: sur la flexibilité des types de référence.
it: flessibilità dei tipi di riferimento.
ja: 重要である場合に役立ちます。
ko: 유용합니다.
pl: elastyczność typów odwołań.
pt_br: a flexibilidade de tipos de referência.
ru: гибкости ссылочных типов.
tr: olduğu durumlarda kullanışlıdır.
zh_hans: 引用类型的灵活性。
zh_hant: 參考類型的彈性。
