Repository: dotnet/fsharp
Catalog: vsintegration/ProjectTemplates/TutorialProject/Template/xlf/Tutorial.fsx.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Computed-Line1
source: This computed a new number by some arithmetic. Numeric types are converted using
cs: Tady se pomocí aritmetiky vypočítalo nové číslo. Číselné typy se převádějí pomocí
de: Hier wird mithilfe einer arithmetischen Operation eine neue Zahl berechnet. Numerische Typen werden unter Verwendung der
es: Se calcula un número nuevo aplicando cierta aritmética. Los tipos numéricos se convierten mediante
fr: Nouveau nombre calculé par une opération arithmétique. Les types numériques sont convertis à l'aide des
it: Questo ha calcolato un nuovo numero in base a una certa aritmetica. I tipi numerici vengono convertiti con
ja: 算術によって新しい数値が算出されました。数値型は以下を使用するよう変換されています
ko: 산술을 사용하여 새 수를 계산했습니다. 숫자 형식은
pl: To obliczyło nową liczbę, wykonując pewne operacje arytmetyczne. Typy liczbowe są konwertowane za pomocą
pt_br: Isso computou um novo número por meio de alguma aritmética. Tipos numéricos são convertidos usando
ru: Это новое число, вычисленное с помощью некоторых арифметических операций. Числовые типы преобразуются с помощью
tr: Bu, aritmetik kullanarak yeni bir sayı hesaplar. Sayısal türler
zh_hans: 这按照某种运算方法计算新的数字。数字类型通过
zh_hant: 這使用了一些算數來計算新數字。使用函式 'int'、'double' 等

# Computed-Line2
source: functions 'int', 'double' and so on.
cs: funkcí int, double atd.
de: Funktionen "int", "double" usw. konvertiert.
es: funciones "int", "double", etc.
fr: fonctions 'int', 'double', etc.
it: funzioni 'int', 'double' e così via.
ja: 関数の 'int'、'double' などです。
ko: 'int', 'double' 등의 함수를 사용하여 변환됩니다.
pl: funkcji „int”, „double” itd.
pt_br: funções 'int', 'double' e assim por diante.
ru: функций "int", "double" и т. п.
tr: 'int', 'double' vb. işlevler kullanılarak dönüştürülür.
zh_hans: "int"、"double" 等函数进行转换。
zh_hant: 來轉換數字類型。

# ListNumbers
source: This is a list of the numbers from 0 to 99.
cs: Toto je seznam čísel od 0 do 99.
de: Dies ist eine Liste der Zahlen von 0 bis 99.
es: Esta es una lista de números del 0 al 99.
fr: Liste des nombres de 0 à 99.
it: Questo è un elenco di numeri compresi tra 0 e 99.
ja: これは 0 ～ 99 の数値のリストです。
ko: 0에서 99까지의 숫자 목록입니다.
pl: To jest lista liczb od 0 do 99.
pt_br: Esta é uma lista de números de 0 a 99.
ru: Это список чисел от 0 до 99.
tr: Bu, 0'dan 99'a kadar olan sayıların listesidir.
zh_hans: 这是从 0 到 99 的数字列表
zh_hant: 此為從 0 到 99 的數字清單。

# ListSquares
source: This is a list of all tuples containing all the numbers from 0 to 99 and their squares.
cs: Toto je seznam všech řazených kolekcí členů obsahujících všechna čísla od 0 do 99 a jejich druhé mocniny.
de: Dies ist eine Liste aller Tupel, die alle Zahlen von 0 bis 99 sowie Ihre Quadratzahlen enthalten.
es: Esta es una lista de todas las tuplas que contienen todos los números de 0 a 99 y sus cuadrados.
fr: Liste de tous les tuples contenant tous les nombres de 0 à 99 et leur carré.
it: Questo è un elenco di tutte le tuple che contengono tutti i numeri compresi tra 0 e 99 e i relativi quadrati.
ja: これは、0 ～ 99 のすべての数値とその二乗を含むすべてのタプルのリストです。
ko: 0에서 99까지의 모든 숫자와 제곱을 포함하는 모든 튜플 목록입니다.
pl: To jest lista wszystkich krotek zawierających wszystkie liczby od 0 do 99 i ich kwadraty.
pt_br: Isso é uma lista de todas as tuplas contendo todos os números de 0 a 99 e seus quadrados.
ru: Это список всех кортежей, содержащих все числа от 0 до 99 и их квадраты.
tr: Bu, 0'dan 99'a kadar olan sayıları ve bunların karelerini içeren bir listedir.
zh_hans: 这是包含从 0 到 99 的所有数字及其平方的所有元组的列表.
zh_hant: 此為所有 Tuple 的清單，內含從 0 到 99 的所有數字及其平方。

# PrintList1
source: The next line prints a list that includes tuples, using '%A' for generic printing.
cs: Další řádek vytiskne seznam, který zahrnuje řazené kolekce členů, s použitím %A pro obecný tisk.
de: Die nächste Zeile gibt eine Liste mit Tupeln aus, wobei "%A" für die generische Ausgabe verwendet wird.
es: La línea siguiente imprime una lista que incluye tuplas, utilizando "%A" para la impresión genérica.
fr: La ligne suivante imprime une liste comprenant des tuples, en utilisant '%A' pour l'impression générique.
it: La riga successiva stampa un elenco che include le tuple, usando '%A' per la stampa generica.
ja: 次の行は、タプルを含むリストを出力します。一般的な出力に '%A' を使用しています。
ko: 다음 줄은 제네릭 출력에 대해 '%A'을(를) 사용하여 튜플을 포함하는 목록을 출력합니다.
pl: Następny wiersz wyświetla listę z krotkami, używając symbolu „%A” do wyświetlania ogólnego.
pt_br: A próxima linha imprime uma lista que inclui tuplas, usando '%A' para impressão genérica.
ru: Следующая строка выводит список, включающий в себя кортежи, используя "%A" для универсальной печати.
tr: Sonraki satır genel yazdırma için '%A' kullanarak demetleri içeren bir liste yazdırır.
zh_hans: 下一行打印包含元组的列表，使用 "%A" 来进行一般打印。
zh_hant: 下一行會使用 '%A' 執行一般列印，來列印包含 Tuple 的清單。

# SampleIntType
source: This is a sample integer with a type annotation
cs: Toto je ukázkové celé číslo s anotací typu.
de: Dies ist ein Beispiel für eine ganze Zahl mit einer Typanmerkung.
es: Este es un entero de ejemplo con una anotación de tipo
fr: Exemple d'entier avec une annotation de type.
it: Questo è un intero di esempio con un'annotazione di tipo
ja: これは、型の注釈付きのサンプルの整数です
ko: 형식 주석이 있는 샘플 정수입니다.
pl: To jest przykładowa liczba całkowita z adnotacją typu
pt_br: Este é um inteiro de exemplo com uma anotação de tipo
ru: Это пример целого числа с аннотацией типа
tr: Bu tür açıklaması olan örnek bir tamsayıdır
zh_hans: 这是一个具有类型注释的示例整数
zh_hant: 此為具有型別註解的範例整數

# ValuesImmutable-Line1
source: Values in F# are immutable by default. They cannot be changed
cs: Hodnoty v F# jsou ve výchozím nastavení neměnné. Nedají se změnit
de: Werte in F# sind standardmäßig unveränderlich. Sie können im Verlauf
es: Los valores de F# son inmutables de manera predeterminada. No se pueden cambiar
fr: Les valeurs en F# sont immuables par défaut. Elles ne peuvent pas être changées
it: Per impostazione predefinita, i valori in F# non sono modificabili e non è possibile cambiarli
ja: 既定では、F# の値は不変です。明示的に変更可能として指定しない限り、
ko: F#의 값은 기본적으로 변경할 수 없습니다. 변경 가능으로
pl: Wartości w języku F# są domyślnie niezmienialne. Nie można ich modyfikować
pt_br: Os valores em F# são imutáveis por padrão. Eles não podem ser alterados
ru: В F# значения по умолчанию неизменяемы. Их невозможно изменить
tr: F# değerleri varsayılan olarak sabittir. Bu değerler
zh_hans: F# 中的值默认为不可变。程序执行过程中
zh_hant: 根據預設，F# 中的值是不可變的。於程式執行過程中，除非明確標示為可變的

# ValuesImmutable-Line2
source: in the course of a program's execution unless explicitly marked as mutable.
cs: během provádění programu, pokud nejsou explicitně označené jako měnitelné.
de: der Ausführung eines Programms nicht geändert werden – es sei denn, sie sind explizit als änderbar gekennzeichnet.
es: en el transcurso de la ejecución de un programa a menos que se marquen explícitamente como mutable.
fr: durant l'exécution d'un programme, sauf si elles sont explicitement marquées comme mutables.
it: durante l'esecuzione di un programma a meno che non siano contrassegnati esplicitamente come modificabili.
ja: プログラムの実行の過程で変更することはできません。
ko: 명시적으로 표시되지 않는 한 프로그램 실행 중 변경할 수 없습니다.
pl: w trakcie wykonywania programu, chyba że zostaną jawnie oznaczone jako zmienialne.
pt_br: no decorrer da execução de um programa a menos que explicitamente marcados como mutáveis.
ru: во время выполнения программы, если только они явно не помечены как изменяемые.
tr: değiştirilebilir olarak açıkça işaretlenmediği sürece bir programın yürütülmesi sırasında değiştirilemez.
zh_hans: 这些值无法更改，除非被显式标记为可变。
zh_hant: 否則無法對其進行變更。

# ValuesImmutable-Line3
source: To learn more, see: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/values/index#why-immutable
cs: Další informace najdete v tématu: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/values/index#why-3immutable
es: Para obtener más información, consulte: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/values/index#why-immutable
fr: Pour en savoir plus, consultez : https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/values/index#why-immutable
pl: Aby dowiedzieć się więcej, zobacz: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/values/index#why-immutable
ru: Подробности: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/values/index#why-immutable

# LetKeyword-Line1
source: Binding a value to a name via 'let' makes it immutable.
cs: Po navázání hodnoty na název pomocí klíčového slova „let“ se hodnota stane neměnnou.
de: Wenn ein Wert mithilfe von "let" an einen Namen gebunden wird, ist er unveränderlich.
es: Al enlazar un valor a un nombre con "let", se convierte en inmutable.
fr: Le fait de lier une valeur à un nom au moyen de 'let' la rend non modifiable.
it: Il binding di un valore in un nome tramite 'let' lo rende non modificabile.
ja: 'let' を介して値を名前にバインドすると、変更できなくなります。
ko: 'let'을 통해 값을 이름에 바인딩하면 값을 변경할 수 없게 됩니다.
pl: Powiązanie wartości z nazwą za pomocą polecenia „let” sprawia, że będzie ona niezmienna.
pt_br: Associar um valor a um nome via 'let' o torna imutável.
ru: Привязка значения к имени через let делает его неизменяемым.
tr: Bir değeri 'let' ile bir ada bağlamak, değeri sabit yapar.
zh_hans: 通过 "let" 将值绑定到名称可使其不可变。
zh_hant: 透過 'let' 將值繫結到名稱，即可將它設為不可變動。

# LetKeyword-Line2
source: The second line of code fails to compile because 'number' is immutable and bound.
cs: Druhý řádek kódu nejde zkompilovat, protože proměnná number je neměnná a vázaná.
de: Die zweite Codezeile kann nicht kompiliert werden, da "number" unveränderlich und gebunden ist.
es: La segunda línea de código no se compila porque "number" es inmutable y está enlazado.
fr: La compilation de la deuxième ligne de code échoue, car 'number' est non modifiable et lié.
it: La seconda riga di codice non viene compilata perché 'number' non è modificabile e ne è stato eseguito il binding.
ja: コードの 2 番目の行は、'number' が変更できず、バインドされているため、コンパイルに失敗します。
ko: 'number'는 변경이 불가능하고 바인딩되어 있으므로 코드의 두 번째 줄이 컴파일되지 않습니다.
pl: Nie można skompilować drugiego wiersza kodu, ponieważ element „number” jest niezmienny i powiązany.
pt_br: A compilação da segunda linha de código falha porque 'number' é imutável e limitado.
ru: Сбой компиляции второй строки кода происходит, так как number неизменяем и привязан.
tr: 'Number' değişmez ve bağlı olduğu için ikinci kod satırı derlenemiyor.
zh_hans: 未能编译第二行代码，因为 "number" 不可变且已绑定。
zh_hant: 因為 'number' 無法變動並已繫結，所以無法編譯第二行程式碼。

# LetKeyword-Line3
source: Re-defining 'number' to be a different value is not allowed in F#.
cs: Předefinování položky number na jinou hodnotu se v jazyce F# nepovoluje.
de: "number" darf in F# nicht als ein anderer Wert neu definiert werden.
es: En F#, no se puede redefinir "number" para darle otro valor.
fr: La redéfinition de 'number' en une valeur différente n'est pas autorisée dans F#.
it: La ridefinizione di 'number' in un valore diverso non è consentita in F#.
ja: F# では、'number' を別の値に再定義することはできません。
ko: F#에서는 'number'를 다른 값으로 다시 정의할 수 없습니다.
pl: Ponowne definiowanie elementu „number” na inną wartość nie jest dozwolone w języku F#.
pt_br: Não é permitido redefinir 'number' para um valor diferente em F#.
ru: Переопределение number в другое значение запрещено в F#.
tr: F# içinde 'number' değerini farklı bir değer olarak yeniden tanımlamaya izin verilmez.
zh_hans: F# 中不允许将 "number" 重定义为其他值。
zh_hant: 在 F# 中，不得將 'number' 重新定義為不同的值。

# MutableKeyword
source: A mutable binding. This is required to be able to mutate the value of 'otherNumber'.
cs: Změnitelná vazba. Je to nutné, aby bylo možné měnit hodnotu otherNumber.
de: Eine veränderliche Bindung. Dies ist erforderlich, damit der Wert von "otherNumber" verändert werden kann.
es: Enlace mutable. Es necesario para poder mutar el valor de "otherNumber".
fr: Liaison mutable. Obligatoire pour muter la valeur de 'otherNumber'.
it: Binding modificabile. È necessario per poter modificare il valore di 'otherNumber'.
ja: 変更可能なバインド。これは 'otherNumber' の値を変更できるようにするために必要です。
ko: 변경할 수 있는 바인딩은 'otherNumber' 값을 변경하기 위해 필요합니다.
pl: Modyfikowalne powiązanie. Jest to wymagane w celu modyfikowania wartości elementu „otherNumber”.
pt_br: Uma associação mutável. Isso é necessário para que se possa modificar o valor de 'otherNumber'.
ru: Изменяемая привязка. Она необходима, чтобы иметь возможность изменять значение otherNumber.
tr: Değiştirilebilir bir bağlama. Bu, 'otherNumber' değerini değiştirmek için gereklidir.
zh_hans: 一个可变绑定。必须提供这种绑定才能改变 "otherNumber" 的值。
zh_hant: 可變動的繫結。需要此項目才可變更 'otherNumber' 的值。

# MutableAssignment-Line1
source: When mutating a value, use '<-' to assign a new value.
cs: Při změnách hodnoty použijte <- pro přiřazení nové hodnoty.
de: Wenn Sie einen Wert verändern, weisen Sie mithilfe von "<-" einen neuen Wert zu.
es: Para la mutación de un valor, use "<-" para asignar un valor nuevo.
fr: En cas de mutation d'une valeur, utilisez '<-' pour assigner une nouvelle valeur.
it: Durante la modifica di un valore, usare '<-' per assegnare un nuovo valore.
ja: 値を変換する場合は、'<-' を使用して新しい値を割り当てます。
ko: 값을 변경할 때는 '<-'를 사용하여 새 값을 할당하세요.
pl: Podczas modyfikowania wartości użyj strzałki „<-”, aby przydzielić nową wartość.
pt_br: Ao converter um valor, use '<-' para atribuir um novo valor.
ru: При изменении значения используйте "<-", чтобы присвоить новое значение.
tr: Bir değeri değiştirirken, yeni bir değer atamak için '<-' kullanın.
zh_hans: 若要改变值，请使用 "<-" 分配新值。
zh_hant: 變動值時，請使用 '<-' 指派新的值。

# MutableAssignment-Line2
source: You could not use '=' here for this purpose since it is used for equality
cs: Znak = tady pro tento účel nemůžete použít, protože se používá pro rovnost
de: Sie können "=" hier nicht verwenden, da es für Gleichheit verwendet wird.
es: No pudo usar "=" con este propósito, porque se usa para la igualdad
fr: Vous ne pouvez pas utiliser '=' ici à cet effet, car il est utilisé pour l'égalité
it: Non è possibile usare '=' in questo punto per questa finalità perché viene usato per l'uguaglianza
ja: この場合、'=' は等価を示すために使用するため、ここで使用することはできません
ko: '='이 같음에 대해 사용되지 않으므로 여기에서 이 용도로 '='을 사용할 수 없습니다.
pl: Nie możesz w tym celu użyć tutaj znaku „=”, ponieważ jest on używany do oznaczania równości
pt_br: Você não pode usar '=' aqui para essa finalidade, já que ele é usado para igualdade
ru: Не удалось использовать "=" здесь и для этой цели, так как знак используется как оператор равенства.
tr: Eşitlik amacıyla kullanıldığından, burada '=' kullanamazsınız
zh_hans: 在这里不能将 "=" 用作此目的，因为该符号用于表示等式
zh_hant: '=' 在此表示等於，所以無法用於此用途

# MutableAssignment-Line3
source: or other contexts such as 'let' or 'module'
cs: nebo jiné kontexty jako let nebo module
de: oder andere Kontexte wie "let" oder "module"
es: u otros contextos, como "let" o "module"
fr: ou autres contextes tels que 'let' ou 'module'
it: o altri contesti come 'let' o 'module'
ja: または、'let' や 'module' などの他のコンテキスト
ko: 또는 'let'이나 'module' 같은 기타 컨텍스트
pl: lub innych kontekstów, np. „let” lub „module”
pt_br: ou outros contextos como 'let' ou 'module'
ru: или другие контексты, такие как "let" или "module"
tr: veya 'let' ya da 'module' gibi diğer bağlamlar
zh_hans: 或者 "let" 或 "module" 等其他上下文
zh_hant: 或其他內容，例如 'let' 或 'module'

# FunctionsModule-Line1
source: Much of F# programming consists of defining functions that transform input data to produce
cs: Velká část programování v F# spočívá v definování funkcí, které transformují vstupní data na
de: Bei der F#-Programmierung werden größtenteils Funktionen definiert, die Eingabedaten in hilfreiche
es: Gran parte de la programación de F# consiste en definir funciones que transforman los datos de entrada para generar
fr: La programmation F# consiste en grande partie à définir des fonctions qui transforment des données d'entrée pour produire des
it: Buona parte della programmazione F# consiste nella definizione di funzioni che trasformano i dati di input per produrre
ja: F# プログラミングの多くは、生成する入力データを変換する定義する関数で構成されています
ko: 대부분의 F# 프로그래밍은 유용한 결과를 생성하기 위해 입력 데이터를 변환하는 함수 정의로
pl: Duża część programowania w języku F# to definiowanie funkcji, które przekształcają dane wejściowe w celu utworzenia
pt_br: Grande parte da programação F# consiste em definir funções que transformam os dados de entrada para produzir
ru: Программирование на языке F# в основном заключается в определении функций, которые преобразуют входные данные и выдают
tr: F# programlama çoğunlukla, giriş verilerini kullanışlı sonuçlara dönüştüren işlevleri
zh_hans: 大部分 F# 编程包括定义函数，该函数转换输入数据以生成
zh_hant: F# 程式設計時常需要定義函式來轉換輸入資料，從而產生

# FunctionsModule-Line2
source: useful results.
cs: užitečné výsledky.
de: Ergebnisse umwandelt.
es: resultados útiles.
fr: résultats utiles.
it: risultati utili.
ja: 有用な結果。
ko: 구성됩니다.
pl: przydatne wyniki.
pt_br: resultados úteis.
ru: полезные результаты.
tr: tanımlamaktan oluşur.
zh_hans: 有用的结果。
zh_hant: 實用的結果。

# FunctionsModule-Line3
source: To learn more, see: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/functions/
cs: Další informace najdete v tématu: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/functions/
es: Para obtener más información, consulte: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/functions/
fr: Pour en savoir plus, consultez : https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/functions/
pl: Aby dowiedzieć się więcej, zobacz: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/functions/
ru: Подробности: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/functions/

# LetFunction-Line1
source: You use 'let' to define a function. This one accepts an integer argument and returns an integer.
cs: Pomocí klíčového slova „let“ můžete definovat funkci. Tato přebírá celočíselný argument a vrací celé číslo.
de: Verwenden Sie "let", um eine Funktion zu definieren. Diese akzeptiert ein Integer-Argument und gibt einen Integer zurück.
es: "let" se utiliza para definir una función. En este caso, acepta un argumento de entero y devuelve un entero.
fr: Utilisez 'let' pour définir une fonction. Celle-ci accepte un argument entier et retourne un entier.
it: Usare 'let' per definire una funzione. Questa accetta un argomento Integer e restituisce un intero.
ja: 関数を定義するには、'let' を使用します。これは整数の引数を受け取り、整数を返します。
ko: 'let'을 사용하여 정수 인수를 받고 정수를 반환하는 함수를 정의합니다.
pl: Polecenia „let” używa się do definiowania funkcji. To polecenie akceptuje argument w postaci liczby całkowitej i zwraca liczbę całkowitą.
pt_br: Use 'let' para definir uma função. Ele aceita um argumento inteiro e retorna um inteiro.
ru: let используется для определения функции. Эта функция принимает целочисленный аргумент и возвращает целое число.
tr: Bir işlevi tanımlamak için 'let' kullanın. Bu, bir tamsayı bağımsız değişkenini kabul ederek bir tamsayı döndürür.
zh_hans: 可使用 "let" 定义函数。它将接受整数参数，然后返回整数。
zh_hant: 您可以使用 'let' 來定義函式。此接受整數引數，並會傳回整數。

# LetFunction-Line2
source: Parentheses are optional for function arguments, except for when you use an explicit type annotation.
cs: Závorky jsou pro argumenty funkce nepovinné – s výjimkou použití anotace explicitního typu.
de: Klammern sind für Funktionsargumente optional, außer wenn Sie eine explizite Typanmerkung verwenden.
es: Los paréntesis son opcionales para argumentos de función, excepto cuando se utiliza una anotación de tipo explícito.
fr: Les parenthèses sont facultatives pour les arguments de fonction, sauf quand vous utilisez une annotation de type explicite.
it: Le parentesi sono facoltative per gli argomenti di funzione, ad eccezione dei casi in cui si usa un'annotazione di tipo esplicita.
ja: 明示的な型の注釈を使用する場合を除いて、かっこは関数引数では省略可能です。
ko: 괄호는 명시적 형식 주석을 사용하는 경우 외에는 함수 인수에 선택적으로 사용할 수 있습니다.
pl: Nawiasy są opcjonalne w przypadku argumentów funkcji, z wyjątkiem użycia jawnego typu adnotacji.
pt_br: Parênteses são opcionais para os argumentos da função, exceto quando você usa uma anotação de tipo explícito.
ru: Круглые скобки необязательны для аргументов функции, если только не используется явная аннотация типа.
tr: İşlev bağımsız değişkenlerinde ayraçlar, açık tür ek açıklaması kullanılan durumlar dışında isteğe bağlıdır.
zh_hans: 括号对函数参数是可选的，但使用显示类型注释时除外。
zh_hant: 對函式引數來說不一定要使用括號，但使用明確的型別註解時例外。

# ApplyFunction-Line1
source: Apply the function, naming the function return result using 'let'.
cs: Použití funkce a pojmenování výsledku vrácení funkce pomocí klíčového slova let
de: Die Funktion anwenden, und das Rückgabeergebnis der Funktion mithilfe von "let" benennen.
es: Aplicar la función, asignando un nombre al resultado devuelto por la función mediante 'let'.
fr: Appliquez la fonction, en nommant le résultat de retour de la fonction à l'aide de 'let'.
it: Applicare la funzione, denominando il risultato restituito della funzione tramite 'let'.
ja: 関数を適用します。'let' を使用し、関数の戻り値の結果に名前を付けます。
ko: 함수를 적용하고, 'let'을 사용하여 함수 반환 결과에 이름을 지정합니다.
pl: Zastosuj funkcję i nadaj jej wynikowi zwrotnemu nazwę, używając instrukcji „let”.
pt_br: Aplique a função, nomeando o resultado de retorno de função usando 'let'.
ru: Применяйте функции, именуя возвращаемый функцией результат с помощью let.
tr: İşlev döndürme sonucunu 'let' ile adlandırarak işlevi uygulayın.
zh_hans: 应用函数，并使用“let”命名函数返回结果。
zh_hant: 套用函式，使用 'let' 命名函數會傳回結果。

# ApplyFunction-Line2
source: The variable type is inferred from the function return type.
cs: Typ proměnné je odvozený z návratového typu funkce.
de: Der Variablentyp wird vom Rückgabetyp der Funktion abgeleitet.
es: El tipo de variable se infiere del tipo de valor devuelto por la función.
fr: Le type de variable est déduit du type de retour de la fonction.
it: Il tipo variabile viene dedotto dal tipo restituito della funzione.
ja: 変数の型は、関数の戻り値の型から推論されます。
ko: 변수 형식은 함수 반환 형식에서 유추됩니다.
pl: Typ zmiennej jest wywnioskowany na podstawie zwracanego typu funkcji.
pt_br: O tipo de variável é deduzido do tipo de retorno de função.
ru: Тип переменной определяется типом возвращаемого значения функции.
tr: Değişken türü, işlev dönüş türü olarak algılanır.
zh_hans: 变量类型是从函数返回类型推导出来的。
zh_hant: 變數型別是從函式傳回型別推斷出來。

# printf-Line1
source: This line uses '%d' to print the result as an integer. This is type-safe.
cs: Tento řádek používá %d k vytištění výsledku jako celého čísla. Je to typově bezpečné.
de: Diese Zeile verwendet "%d", um das Ergebnis als Integer zu drucken. Dies ist typsicher.
es: Esta línea utiliza "%d" para imprimir el resultado de un entero. Cuenta con seguridad de tipos.
fr: Cette ligne utilise '%d' pour imprimer le résultat comme entier. Cette opération est de type sécurisé.
it: Questa riga usa '%d' per stampare il risultato in formato Integer. È indipendente dai tipi.
ja: この行は '%d' を使用して結果を整数として出力します。これはタイプ セーフです。
ko: 이 줄은 '%d'을(를) 사용하여 결과를 integer로 인쇄합니다. 이 코드는 형식이 안전합니다.
pl: Ten wiersz używa elementu „%d”, aby wydrukować wynik jako liczbę całkowitą. Jest to bezpieczne.
pt_br: Esta linha usa '%d' para imprimir o resultado como um inteiro. Isso é fortemente tipado.
ru: В этой строке используется "%d" для вывода результата как целого числа. Это типобезопасно.
tr: Bu satır, sonucu bir tamsayı olarak yazdırmak için '%d' kullanır. Tür kullanımıyla uyumludur.
zh_hans: 该行用 "%d" 将结果作为整数进行打印。这属于类型安全。
zh_hant: 此行使用 '%d' 以整數形式列印結果。這是型別安全。
