Repository: dotnet/fsharp
Catalog: vsintegration/ProjectTemplates/TutorialProject/Template/xlf/Tutorial.fsx.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# SampleHeader
source: This sample will guide you through elements of the F# language.
cs: Tato ukázka vás provede elementy jazyka F#.
de: Dieses Beispiel zeigt Ihnen verschiedene Elemente der F#-Programmiersprache.
es: Este ejemplo le guiará por los elementos del lenguaje F#.
fr: Cet exemple est destiné à vous montrer les différents éléments du langage F#.
it: Questo esempio consente all'utente di familiarizzare con gli elementi del linguaggio F#.
ja: このサンプルは、F# 言語の要素を紹介します。
ko: 이 샘플에서는 F# 언어의 요소에 대해 안내합니다.
pl: Ten przykład zawiera opis elementów języka F#.
pt_br: Esta amostra guiará você pelos elementos da linguagem F#.
ru: Этот пример поможет узнать о различных элементах языка F#.
tr: Bu örnek, size F# dilinin öğelerini gösterir.
zh_hans: 此示例将引导你了解 F# 语言的各个元素。
zh_hant: 此範例將引導您了解 F# 語言的項目。

# Instructions-Line1
source: To execute the code in F# Interactive, highlight a section of code and press Alt-Enter or right-click
cs: Pokud chcete kód provést v nástroji F# Interactive, zvýrazněte oddíl kódu a stiskněte Alt-Enter nebo klikněte pravým tlačítkem myši
de: Markieren Sie zum Ausführen des Codes in F# Interactive einen Codeabschnitt, und drücken Sie dann entweder ALT+EINGABETASTE oder klicken Sie mit der rechten Maustaste
es: Para ejecutar el código en F# interactivo, resalte una sección de código y presione Alt+Entrar, o bien haga clic con el botón secundario
fr: Pour exécuter le code dans F# Interactive, mettez en surbrillance une portion du code, puis appuyez sur Alt+Entrée ou cliquez avec le bouton droit,
it: Per eseguire il codice in F# Interactive, evidenziare una sezione di codice e premere ALT-INVIO oppure fare clic con il pulsante destro del mouse
ja: F# インタラクティブでコードを実行するには、コードの一部を強調表示して、Alt キーを押しながら Enter キーを押すか、右マウス ボタンをクリックし
ko: F# 대화형에서 코드를 실행하려면 코드 섹션을 강조 표시하고 <Alt+Enter>를 누르거나 마우스 오른쪽 단추를 클릭한 다음
pl: Aby wykonać kod w programie F# Interactive, zaznacz sekcję kodu i naciśnij kombinację klawiszy Alt-Enter lub kliknij prawym przyciskiem myszy,
pt_br: Para executar o código no F# Interativo, realce uma seção de código e pressione Alt-Enter ou clique com botão direito do mouse
ru: Чтобы выполнить код в F# Interactive, выделите фрагмент кода и нажмите ALT+ВВОД или щелкните правой кнопкой мыши
tr: Kodu F# Etkileşimli’de yürütmek için kodun bir bölümünü vurgulayın ve Alt-Enter'a basın veya sağ tıklatın
zh_hans: 若要在 F# 交互窗口中执行代码，请突出显示一个代码节并按 Alt-Enter 或右击
zh_hant: 若要執行 F# 互動中的程式碼，請反白顯示某個程式碼區段並按下 Alt-Enter，或者以滑鼠右鍵按一下

# Instructions-Line2
source: and select "Execute in Interactive". You can open the F# Interactive Window from the "View" menu.
cs: a vyberte Provést v Interactive. Okno F# Interactive můžete otevřít z nabídky Zobrazit.
de: und wählen Sie "In Interactive ausführen" aus. Sie können das F# Interactive-Fenster über das Menü "Ansicht" öffnen.
es: y seleccione "Ejecutar en modo interactivo". Puede abrir la ventana de F# interactivo desde el menú "Ver".
fr: puis sélectionnez Exécuter en mode interactif. Pour ouvrir la fenêtre F# Interactive, accédez au menu Affichage.
it: e selezionare "Esegui in Interactive". È possibile aprire la finestra di F# Interactive dal menu "Visualizza".
ja: [対話形式で実行]5D; を選択します。[表示]5D; メニューから F# インタラクティブ ウィンドウを開くことができます。
ko: "대화형으로 실행"을 선택하세요. "보기" 메뉴에서 F# 대화형 창을 열 수 있습니다.
pl: a następnie wybierz opcję „Wykonaj w trybie interaktywnym”. Okno narzędzia F# Interactive można otworzyć z menu „Widok”.
pt_br: e selecione "Executar em Interativo". Você pode abrir a janela F# Interativo no menu "Exibir".
ru: и выберите команду "Выполнение в интерактивном режиме". Интерактивное окно F# можно также открыть из меню "Вид".
tr: ve "Etkileşimlide Yürüt" seçeneğini belirleyin. F# Etkileşimli Penceresini "Görünüm" menüsünden açabilirsiniz.
zh_hans: 并选择“在 Interactive 中执行”。 可从“视图”菜单中打开 F# 交互窗口。
zh_hant: 並選取 [以互動方式執行]。您可以從 [檢視] 功能表開啟 F# 互動式視窗。

# MoreAbout
source: For more about F#, see:
cs: Další informace o F# najdete na:
de: Weitere Informationen zu F# finden Sie unter:
es: Para obtener más información acerca de F#, vea:
fr: Pour en savoir plus sur F#, consultez :
it: Per altre informazioni su F#, vedere:
ja: F# の詳細については、次のページを参照してください:
ko: F#에 대한 자세한 내용은 다음을 참조하세요:
pl: Aby uzyskać więcej informacji o języku F#, zobacz:
pt_br: Para obter mais informações sobre F#, consulte:
ru: Дополнительные сведения о F# см. по адресу:
tr: F# hakkında daha fazla bilgi için bkz:
zh_hans: 有关 F# 的详细信息，请参见:
zh_hant: 如需有關 F# 的詳細資訊，請參閱:

# SeeDocumentaton
source: To see this tutorial in documentation form, see:
cs: Na tomto webu najdete tento kurz v podobě dokumentace:
de: Dieses Tutorial ist auch als Dokumentation verfügbar. Siehe hierzu:
es: Para ver este tutorial en forma de documentación, vea:
it: Per visualizzare questa esercitazione sotto forma di documentazione, vedere:
ja: このチュートリアルをドキュメント形式で表示するには、次を参照してください:
ko: 이 자습서를 설명서 형식으로 보려면 다음을 참조하세요:
pl: Aby wyświetlić ten samouczek w formie dokumentacji, zobacz:
pt_br: Para ver este tutorial em forma de documentação, consulte:
tr: Bu öğreticiyi belge biçiminde görmek için, bkz:
zh_hans: 若要以文档的形式查看此教程，请参阅:
zh_hant: 若要參閱文件表單中的此教學課程，請參閱:

# LearnMoreAbout
source: To learn more about applied F# programming, use
cs: K získání dalších informací o použitém programovém kódu F# použijte
de: Verwenden Sie Folgendes, um weitere Informationen zur praktischen F#-Programmierung zu erhalten
es: Para obtener más información sobre la programación de F# aplicada, use
fr: Pour en savoir plus sur la programmation F# appliquée, utilisez
it: Per altre informazioni sulla programmazione F# applicata, usare
ja: 適用された F# プログラミングの詳細については、次を使用します
ko: 적용된 F# 프로그래밍에 대해 자세히 알아보려면 다음을 사용하세요.
pl: Aby dowiedzieć się więcej o programowaniu w języku F# w praktyce, użyj
pt_br: Para saber mais sobre a programação F# aplicada, use
ru: Чтобы получить дополнительные сведения о прикладном программировании на языке F#, воспользуйтесь
tr: Uygulamalı F# programlama hakkında daha fazla bilgi edinmek için şunu kullanın
zh_hans: 若要了解有关已应用的 F# 编程的详细信息，请使用
zh_hant: 如需深入了解套用的 F# 程式設計，請使用

# ToInstall-Line1
source: To install the Visual F# Power Tools, use
cs: K instalaci Visual F# Power Tools použijte
de: Verwenden Sie Folgendes, um die Visual F# Power Tools zu installieren
es: Para instalar Visual F# Power Tools, use
fr: Pour installer Visual F# Power Tools, utilisez
it: Per installare Visual F# Power Tools, usare
ja: Visual F# Power Tools をインストールするには、次を使用します
ko: Visual F# Power 도구를 설치하려면 다음을 사용하세요.
pl: Aby zainstalować narzędzia Visual F# Power Tools, użyj
pt_br: Para instalar o Visual F# Power Tools, use
ru: Чтобы установить Visual F# Power Tools, используйте
tr: Visual F# Power Tools'u yüklemek için
zh_hans: 若要安装 Visual F# Power Tools，请使用
zh_hant: 若要安裝 Visual F# Power Tools，請使用

# ToInstall-Line2
source: 'Tools' --> 'Extensions and Updates' --> `Online` and search
cs: Nástroje --> Rozšíření a aktualizace --> Online a potom hledejte
de: "Extras" > "Erweiterungen und Updates" > "Online", und suchen Sie nach
es: "Herramientas" --> "Extensiones y actualizaciones" --> "En línea" y busque
fr: 'Outils' --> 'Extensions et mises à jour' --> `En ligne` et rechercher
it: 'Strumenti' --> 'Estensioni e aggiornamenti' --> `Online` e cercare
ja: [ツール]5D; --> [拡張機能と更新プログラム]5D; --> [オンライン]5D; と検索
ko: '도구' --> '확장 및 업데이트' --> `온라인`으로 이동하고 검색합니다.
pl: „Narzędzia” --> „Rozszerzenia i aktualizacje” --> „Online” i wyszukaj
pt_br: 'Ferramentas' --> 'Extensões e Atualizações' --> `Online` e pesquise
ru: "Сервис" --> "Расширения и обновления" --> "В сети" и выполните поиск
tr: 'Araçlar' --> 'Uzantılar ve Güncelleştirmeler' --> `Çevrimiçi` seçeneğini kullanın ve arama yapın
zh_hans: “工具”-->“扩展和更新”-->“联机”和搜索
zh_hant: [工具]5D; --> [延伸模組和更新]5D; --> [連線]5D; 並搜尋

# AdditionalTemplates-Line1
source: For additional templates to use with F#, see the 'Online Templates' in Visual Studio,
cs: Další šablony, které můžete používat s F#, najdete tak, že v sadě Visual Studio vyberete Online šablony,
de: Weitere Vorlagen zum Verwenden mit F# finden Sie in Visual Studio unter "Onlinevorlagen",
es: Para obtener plantillas adicionales para su uso con F#, consulte 'Plantillas en línea' en Visual Studio,
fr: Pour consulter d'autres modèles d'utilisation du langage F#, cliquez sur Modèles en ligne dans Visual Studio,
it: Per altri modelli da usare con F#, vedere 'Modelli online' in Visual Studio,
ja: F# で使用するその他のテンプレートについては、Visual Studio の 'オンライン テンプレート' を参照してください。
ko: F#과 함께 사용할 수 있는 추가 템플릿은 Visual Studio의 다음 위치에서 '온라인 템플릿'을 참조하세요.
pl: Aby uzyskać informacje o dodatkowych szablonach do użycia w języku F#, zobacz sekcję dotyczącą szablonów w trybie online w programie Visual Studio,
pt_br: Para obter modelos adicionais a serem usados com F#, consulte 'Modelos online' no Visual Studio,
ru: Дополнительные шаблоны, которые можно использовать с F#, см. в разделе "Шаблоны в Интернете" в Visual Studio.
tr: F# ile kullanabileceğiniz ek şablonlar için Visual Studio'daki 'Çevrimiçi Şablonlar'a bakın,
zh_hans: 有关要用于 F# 的其他模板，请参见 Visual Studio 中的“联机模板”，
zh_hant: 如需有關搭配 F# 一起使用的其他範本，請參閱 Visual Studio 中的 [線上範本]5D;，

# AdditionalTemplates-Line2
source: 'New Project' --> 'Online Templates'
cs: Nový projekt --> Online šablony.
de: "Neue Projekte" > "Onlinevorlagen".
es: "Nuevo proyecto" --> "Plantillas en línea"
fr: 'Nouveau projet' --> 'Modèles en ligne'
it: 'Nuovo progetto' --> 'Modelli online'
ja: ([新しいプロジェクト]5D; --> [オンライン テンプレート]5D;) を参照してください。
ko: '새 프로젝트' --> '온라인 템플릿'
pl: „Nowy projekt” --> „Szablony w trybie online”
pt_br: 'Novo projeto --> 'Modelos online'
ru: "Создать проект --> Шаблоны в Интернете"
tr: 'Yeni Proje' --> 'Çevrimiçi Şablonlar'
zh_hans: “新建项目”-->“联机模板”
zh_hant: [新增專案]5D; --> [線上範本]5D;

# SupportsComments
source: F# supports three kinds of comments:
cs: F# podporuje tři typy komentářů:
de: F# unterstützt drei Arten von Kommentaren:
es: F# admite tres tipos de comentarios:
fr: F# prend en charge trois genres de commentaires :
it: In F# sono supportati tre tipi di commenti:
ja: F# は、3 種類のコメントをサポートしています:
ko: F#에서는 세 가지 종류의 주석을 지원합니다:
pl: Język F# obsługuje trzy rodzaje komentarzy:
pt_br: F# dá suporte a três tipos de comentários:
ru: F# поддерживает три типа комментариев:
tr: F# üç açıklama türünü destekler:
zh_hans: F# 支持三种注释:
zh_hant: F# 支援三種註解:

# DoubleSlash
source: 1. Double-slash comments. These are used in most situations.
cs: 1. Komentáře se dvěma lomítky. Ty se používají ve většině situací.
de: 1. Kommentare mit doppeltem Schrägstrich. Diese werden in den meisten Situationen verwendet.
es: 1. Comentarios con doble barra diagonal. Se usan en la mayoría de las situaciones.
fr: 1. Commentaires avec double barre oblique (utilisés dans la plupart des cas).
it: 1. Commenti introdotti da una doppia barra. Vengono usati nella maggior parte delle situazioni.
ja: 1. ダブルスラッシュ コメント。これはほとんどの場合に使用されます。
ko: 1. 이중 슬래시 주석은 대부분의 경우에 사용됩니다.
pl: 1. Komentarze z podwójnym ukośnikiem. Są używane w większości sytuacji.
pt_br: 1. Comentários de barra dupla. São usados na maioria das situações.
ru: 1. Комментарии с двойной косой чертой. Они используются в большинстве ситуаций.
tr: 1. Çift eğik çizgili açıklamalar. Çoğu durumda bunlar kullanılır.
zh_hans: 1. 双斜线注释。 此类注释用于大多数情况。
zh_hant: 1. 將註解加上雙斜線。適用於大部分的情況。

# MLStyle
source: 2. ML-style Block comments. These aren't used that often.
cs: 2. Blokové komentáře ve stylu ML. Ty se moc často nepoužívají.
de: 2. Blockkommentare im ML-Stil. Diese werden nicht sehr häufig verwendet.
es: 2. Comentarios de bloque de estilo ML. No se usan con tanta frecuencia.
fr: 2. Commentaires de bloc de style ML (rarement utilisés).
it: 2. Commenti per il blocco in stile ML. Non vengono usati molto spesso.
ja: 2. ML スタイル ブロック コメント。これはそれほど頻繁には使用されません。
ko: 2. ML 스타일 블록 주석은 자주 사용되지 않습니다.
pl: 2. Komentarze blokowe w stylu ML. Nie są używane zbyt często.
pt_br: 2. Comentários de bloco em estilo de ML. Eles não são usados com muita frequência.
ru: 2. Комментарии блоков в стиле ML. Они используются довольно редко.
tr: 2. ML stili Blok açıklamaları. Bunlar sık kullanılmaz.
zh_hans: 2. ML 样式块注释。此类注释不经常使用。
zh_hant: 2. 將註解加上 ML 樣式區塊。較不常使用。

# TripleSlash-Line1
source: 3. Triple-slash comments. These are used for documenting functions, types, and so on.
cs: 3. Komentáře se třemi lomítky. Ty se používají k dokumentaci funkcí, typů a podobně.
de: 3. Kommentare mit drei Schrägstrichen. Diese werden zum Dokumentieren von Funktionen, Typen usw. verwendet.
es: 3. Comentarios de triple barra diagonal. Se utilizan para funciones de documentación, tipos, etc.
fr: 3. Commentaires avec triple barre oblique (utilisés pour documenter les fonctions, les types, etc.).
it: 3. Commenti introdotti da una tripla barra. Vengono usati per la documentazione di funzioni, tipi e così via.
ja: 3. トリプル スラッシュ コメント。これは、関数や型などの文書化に使用されます。
ko: 3. 삼중 슬래시 주석은 함수, 형식 등을 설명하는 경우에 사용됩니다.
pl: 3. Komentarze z potrójnymi ukośnikami. Są używane do dokumentowania funkcji, typów itd.
pt_br: 3. Comentários de barra tripla. São usados para funções de documentação, tipos, etc.
ru: 3. Комментарии с тройной косой чертой. Они используются для документирования функций, типов и т. д.
tr: 3. Üç eğik çizgili açıklamalar. Bunlar işlevleri, türleri vb. belgelemek için kullanılır.
zh_hans: 3. 三斜线注释。此类注释用于记录功能和类型等。
zh_hant: 3. 將註解加上三斜線。適用於記錄函式、類型等。

# TripleSlash-Line2
source: They will appear as text when you hover over something which is decorated with these comments.
cs: Když na elementy s těmito komentáři nastavíte ukazatel myši, zobrazí se komentáře jako text.
de: Sie erscheinen als Text, wenn Sie den Mauszeiger über einem Element positionieren, das mit diesen Kommentaren versehen ist.
es: Aparecerán como texto al mantener el puntero por encima de algo decorado con estos comentarios.
fr: Ils apparaissent sous forme de texte quand vous pointez sur un élément décoré avec ces commentaires.
it: Verranno visualizzati come testo quando si passa con il puntatore su un elemento decorato con questi commenti.
ja: このコメントで修飾されているものをポイントすると、これがテキストとして表示されます。
ko: 이러한 주석으로 데코레이트된 항목 위에 마우스를 올리면 텍스트로 표시됩니다.
pl: Będą wyświetlane jako tekst po zatrzymaniu wskaźnika myszy nad tym, do czego zostały dodane.
pt_br: Eles aparecerão como texto quando você passar o mouse sobre algo decorado com esses comentários.
ru: При наведении указателя мыши на код, задекорированный этими комментариями, они отображаются в виде текста.
tr: Bu açıklamalarla belirlenmiş bir öğenin üzerine geldiğinizde, açıklamalar metin olarak görüntülenir.
zh_hans: 光标悬停在附带有注释的位置时，这些注释会以文本形式显示。
zh_hant: 當您暫留在以這些註解為裝飾的項目上時，這些註解會顯示為文字。

# XmlComments-Line1
source: They also support .NET-style XML comments, which allow you to generate reference documentation,
cs: Podporují se také komentáře XML ve stylu .NET, které umožňují generovat referenční dokumentaci.
de: Sie bieten außerdem Unterstützung für XML-Kommentare im .NET-Stil zum Generieren von Referenzdokumentation,
es: También admiten comentarios XML de estilo .NET, que le permite generar documentación de referencia,
fr: Ils prennent également en charge les commentaires XML de style .NET, ce qui vous permet de générer une documentation de référence.
it: Supportano anche commenti XML in stile .NET, che consentono di generare documentazione di riferimento.
ja: これは .NET スタイルの XML コメントもサポートしています。このコメントを使用すると、リファレンス ドキュメントを生成できます。
ko: 참조 문서를 생성할 수 있는 .NET 스타일 XML 주석도 지원하며,
pl: Obsługują także komentarze XML w stylu programu .NET, które pozwalają na generowanie dokumentacji referencyjnej,
pt_br: Eles também dão suporte a comentários XML em estilo .NET, que permitem que você gere documentação de referência,
ru: Кроме того, они поддерживают XML-комментарии в стиле .NET, делая возможным формирование справочной документации,
tr: Ayrıca başvuru belgeleri oluşturmanıza olanak sağlayan .NET stili XML açıklamalarını destekler,
zh_hans: 它们还支持 .NET 样式的 XML 注释，这些注释可生成参考文档，
zh_hant: 這些註解也支援 .NET 樣式的 XML 註解，讓您可以產生參考文件，

# XmlComments-Line2
source: and they also allow editors (such as Visual Studio) to extract information from them.
cs: Umožňují také, aby z nich editory (jako například Visual Studio) extrahovaly informace.
de: und sie ermöglichen das Extrahieren von Informationen über Editoren (z.B. Visual Studio).
es: y también permite a los editores (como Visual Studio) extraer información de ellos.
fr: Les éditeurs tels que Visual Studio peuvent également extraire des informations à partir de ces commentaires.
it: Consentono anche agli editor, come Visual Studio, di estrarre informazioni.
ja: また、(Visual Studio などの) エディターでそこから情報を抽出することもできます。
ko: 또한 편집기(예: Visual Studio)에서 정보를 추출할 수 있도록 합니다.
pl: a także umożliwiają edytorom (takim jak program Visual Studio) na wydobywanie z nich informacji.
pt_br: além de permitirem que editores (como o Visual Studio) extraiam informações deles.
ru: а также позволяют редакторам (таким как Visual Studio) извлекать из них информацию.
tr: bilgi ayıklamak için düzenleyicilerin (örneğin Visual Studio) kullanılmasına da olanak sağlar.
zh_hans: 还可允许编辑器(例如 Visual Studio)从其中提取信息。
zh_hant: 也讓編輯者 (像是 Visual Studio) 可以從註解中擷取資訊。

# XmlComments-Line3
source: To learn more, see: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/xml-documentation
cs: Další informace najdete tady: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/xml-documentation
es: Para obtener más información, consulte: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/xml-documentation
fr: Pour en savoir plus, consultez : https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/xml-documentation
pl: Aby dowiedzieć się więcej, zobacz: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/xml-documentation
ru: Подробности: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/xml-documentation

# OpenNamespaces
source: Open namespaces using the 'open' keyword.
cs: Otevírejte obory názvů pomocí klíčového slova open.
de: Öffnen Sie Namespaces mit dem Schlüsselwort "open".
es: Abra los espacios de nombres con la palabra clave "open".
fr: Ouvrir des espaces de noms à l'aide du mot clé 'open'.
it: Aprire gli spazi dei nomi con la parola chiave 'open'.
ja: 'open' キーワードを使用して名前空間を開きます。
ko: 'open' 키워드를 사용하여 네임스페이스를 엽니다.
pl: Otwieraj przestrzenie nazw, używając słowa kluczowego „open”.
pt_br: Abra os namespaces usando a palavra-chave 'open'.
ru: Открывайте пространства имен с помощью ключевого слова "open".
tr: 'Open' anahtar sözcüğünü kullanarak ad alanlarını açın.
zh_hans: 使用 "open" 关键字打开命名空间。
zh_hant: 使用 'open' 關鍵字開啟命名空間。

# LearnMore
source: To learn more, see: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/import-declarations-the-open-keyword
cs: Další informace najdete tady: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/import-declarations-the-open-keyword
es: Para obtener más información, consulte: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/import-declarations-the-open-keyword
fr: Pour en savoir plus, consultez : https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/import-declarations-the-open-keyword
pl: Aby dowiedzieć się więcej, zobacz: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/import-declarations-the-open-keyword
ru: Подробности: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/import-declarations-the-open-keyword

# Module-Line1
source: A module is a grouping of F# code, such as values, types, and function values.
cs: Modul je seskupení kódu F#, například hodnot, typů a hodnot funkcí.
de: Ein Modul ist eine Gruppierung von F#-Code, z.B. Werte, Typen und Funktionswerte.
es: Un módulo es una agrupación de código de F#, como valores, tipos y valores de función.
fr: Un module est un regroupement d’éléments de code F#, comme des valeurs, des types et des valeurs de fonction.
it: Un modulo è un raggruppamento di codice F#, ad esempio valori, tipi e valori di funzione.
ja: モジュールは、値、型、関数値などの、F# コードのグループ化です。
ko: 모듈은 값, 형식, 함수 값 같은 F# 코드의 그룹화입니다.
pl: Moduł to zbiór kodu w języku F#, takiego jak wartości, typy i wartości funkcji.
pt_br: Um módulo é um agrupamento de código F#, assim como valores, valores de função e tipos.
ru: Модуль представляет собой группирование кода F#, например значений, типов и значений функций.
tr: Modül; değer, tür ve işlev değeri gibi bir F# kodu gruplandırmasıdır.
zh_hans: 模块是值、类型和函数值等 F# 代码的分组。
zh_hant: 模組是 F# 程式碼的分組，例如值、類型及函式值。

# Module-Line2
source: Grouping code in modules helps keep related code together and helps avoid name conflicts in your program.
cs: Seskupování kódu do modulů pomáhá zachovat související kód pohromadě a vyhnout se v programu konfliktům názvů.
de: Die Codegruppierung in Modulen ermöglicht das Zusammenfassen von zueinander in Beziehung stehendem Code sowie das Vermeiden von Namenskonflikten in Ihrem Programm.
es: El código de agrupación de los módulos ayuda a mantener el código relacionado en conjunto y ayuda a evitar los conflictos de nombres en su programa.
fr: Le regroupement du code dans les modules permet de conserver le code associé ensemble et d'éviter les conflits de noms dans votre programme.
it: Il raggruppamento del codice nei moduli consente di riunire il codice correlato e contribuisce a evitare conflitti di nome nel programma.
ja: コードをモジュールにグループ化することで、関連コードを 1 つにまとめて、プログラムでの名前の競合を回避することができます。
ko: 모듈로 코드를 그룹화하면 관련 코드를 함께 유지하고 프로그램에서 이름 충돌을 방지하는 데 도움이 됩니다.
pl: Grupowanie kodu w modułach pomaga trzymać razem powiązany kod i unikać konfliktów nazw w programie.
pt_br: Agrupar código em módulos ajuda a manter o código relacionado junto e ajuda a evitar conflitos de nome em seu programa.
ru: Группирование кода в модулях помогает держать связанный код в одном месте и предотвратить конфликты имен в программе.
tr: Kodu modüller içinde gruplandırmak ilgili kodların bir arada bulunmasını sağlar ve programınızda ad çakışmalarını önlemeye yardımcı olur.
zh_hans: 用模块分组代码有助于汇集相关代码和避免程序中出现名称冲突。
zh_hant: 將程式碼分組為模組有助於將相關的程式碼整合在一塊，且能避免程式發生名稱衝突。

# Module-Line3
source: To learn more, see: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/modules
cs: Další informace najdete v tématu: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/modules
es: Para obtener más información, consulte: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/modules
fr: Pour en savoir plus, consultez : https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/modules
pl: Aby dowiedzieć się więcej, zobacz: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/modules
ru: Подробности: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/modules

# SampleInt
source: This is a sample integer.
cs: Toto je ukázkové celé číslo.
de: Dies ist ein Beispiel für eine Ganzzahl.
es: Este es un entero de ejemplo.
fr: Exemple d'entier.
it: Questo è un valore integer di esempio.
ja: これは、サンプルの整数値です。
ko: 샘플 정수입니다.
pl: To jest przykładowa liczba całkowita.
pt_br: Este é um inteiro de exemplo.
ru: Это пример целого числа.
tr: Bu, örnek bir tamsayıdır.
zh_hans: 此为示例整数。
zh_hant: 此為範例整數。

# SampleFloat
source: This is a sample floating point number.
cs: Toto je ukázkové číslo s plovoucí desetinnou čárkou.
de: Dies ist ein Beispiel für eine Gleitkommazahl.
es: Este es un número de punto flotante de ejemplo.
fr: Exemple de nombre à virgule flottante.
it: Questo è un numero a virgola mobile di esempio.
ja: これは、サンプルの浮動小数点数です。
ko: 샘플 부동 소수점 숫자입니다.
pl: To jest przykładowa liczba zmiennoprzecinkowa.
pt_br: Esta é uma amostra de número de ponto flutuante.
ru: Это пример числа с плавающей запятой.
tr: Bu, örnek bir kayan noktalı sayıdır.
zh_hans: 此为示例浮点数。
zh_hant: 此為範例浮點數。
