Repository: dotnet/fsharp
Catalog: vsintegration/ProjectTemplates/TutorialProject/Template/xlf/Tutorial.fsx.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ArrayComputationConstruction
source: This is an array containing only the words "hello" and "world".
cs: Toto je pole obsahující pouze slova hello a world.
de: Dieses Array enthält nur die Wörter "hello" und "world".
es: Esta es una matriz que solo contiene las palabras "hola" y "todos".
fr: Il s'agit d'un tableau contenant uniquement les mots "hello" et "world".
it: Questa è una matrice contenente solo le parole "hello" e "world".
ja: これは "hello" と "world" のみを含む配列です。
ko: "hello"와 "world"라는 단어만 포함된 배열입니다.
pl: To jest tablica zawierająca tylko słowa „hello” i „world”.
pt_br: Esta é uma matriz que contém apenas as palavras "olá" e "mundo".
ru: Это — массив, содержащий только слова "hello" и "world".
tr: Bu, yalnızca "hello" ve "world" sözcüklerini içeren bir dizidir.
zh_hans: 这是只包含单词 "hello" 和 "world" 的数组。
zh_hant: 這是僅包含 "hello" 與 "world" 字詞的陣列。

# ArrayInit
source: This is an array initialized by index and containing the even numbers from 0 to 2000.
cs: Toto je pole inicializované indexem, které obsahuje sudá čísla od 0 do 2000.
de: Dieses Array wurde per Index initialisiert und enthält gerade Zahlen von 0 bis 2000.
es: Esta es una matriz inicializada con un índice que contiene los números pares del 0 al 2000.
fr: Il s'agit d'un tableau lancé par index, qui contient les nombres pairs de 0 à 2 000.
it: Questa è una matrice inizializzata dall'indice e contenente i numeri pari compresi tra 0 e 2000.
ja: これはインデックスによって初期化され、0 ～ 2000 の間の偶数を含む配列です。
ko: 0에서 2000까지의 짝수가 포함되고 인덱스로 초기화된 배열입니다.
pl: To jest tablica zainicjowana za pomocą indeksu i zawierająca liczby parzyste z zakresu od 0 do 2000.
pt_br: Esta é uma matriz inicializada pelo índice e que contém os números pares de 0 a 2.000.
ru: Это — массив, инициализируемый по индексу и содержащий четные числа от 0 до 2000.
tr: Bu, dizin tarafından başlatılan ve 0'dan 2000'e kadar olan çift sayıları içeren bir dizidir.
zh_hans: 这是由索引初始化的数组，包含从 0 到 2000 之间的偶数。
zh_hant: 這是由索引初始化的陣列，內含從 0 到 2000 之間的偶數。

# ArraySlicing
source: Sub-arrays are extracted using slicing notation.
cs: Dílčí pole se extrahují pomocí slicingové notace.
de: Teilarrays werden mithilfe der Segmentnotation extrahiert.
es: Las submatrices se extraen mediante la notación divisoria.
fr: Les sous-tableaux sont extraits à l'aide de la notation de découpage.
it: Le sottomatrici vengono estratte mediante una notazione di sezionamento.
ja: サブ配列はスライス表記法を使用して抽出されます。
ko: 하위 배열은 조각화 표기법을 사용하여 추출됩니다.
pl: Tablice podrzędne wyodrębnia się za pomocą notacji wycinania.
pt_br: Submatrizes são extraídas usando a notação de divisão.
ru: Подмассивы извлекаются с помощью нотации выделения фрагмента.
tr: Alt diziler dilimleme gösterimi aracılığıyla ayıklanır.
zh_hans: 使用切片表示法提取子数组。
zh_hant: 使用了切割標記法來擷取子陣列。

# ArrayLooping
source: You can loop over arrays and lists using 'for' loops.
cs: Přes pole a seznamy se můžete přesunovat pomocí smyček for.
de: Mit For-Schleifen können Sie bei Arrays und Listen Schleifen ausführen.
es: Puede ejecutar un bucle en matrices y listas usando bucles "for".
fr: Vous pouvez effectuer une boucle sur des tableaux et des listes à l'aide de boucles 'for'.
it: Per eseguire il ciclo su matrici ed elenchi, si possono usare i cicli 'for'.
ja: 'for' ループを使用して、配列とリストに渡ってループできます。
ko: 'for' 루프를 사용하여 배열 및 목록을 반복할 수 있습니다.
pl: Możesz zapętlić tablice i listy przy użyciu pętli „for”.
pt_br: Você pode executar um loop através de matrizes e listas usando loops 'for'.
ru: Можно выполнять перебор массивов и списков при помощи циклов for.
tr: Diziler ve listeler üzerinden döngü oluşturmak için 'for' döngülerini kullanabilirsiniz.
zh_hans: 可使用 "for" 循环循环数组和列表。
zh_hant: 您可以使用 'for' 迴圈逐一反覆執行陣列與清單。

# ArrayAssignment-Line1
source: You can modify the contents of an an array element by using the left arrow assignment operator.
cs: Můžete upravit obsah elementu pole pomocí operátoru přiřazení s šipkou doleva.
de: Sie können die Inhalte eines Arrayelements mithilfe des Zuweisungsoperators "Pfeil nach links" ändern.
es: Puede modificar el contenido de un elemento de matriz mediante el operador de asignación de flecha izquierda.
it: È possibile modificare il contenuto di un elemento di matrice usando l'operatore di assegnazione freccia sinistra.
ja: 左矢印代入演算子を使用して、配列要素の内容を変更できます。
ko: 왼쪽 화살표 대입 연산자를 사용하여 배열 요소의 내용을 수정할 수 있습니다.
pl: Możesz zmodyfikować zawartość elementu tablicy za pomocą operatora przypisania „strzałka w lewo”.
pt_br: Você pode modificar o conteúdo de um elemento de matriz usando o operador de atribuição de seta para a esquerda.
tr: Bir dizi öğesinin içeriğini sol ok atama işlecini kullanarak değiştirebilirsiniz.
zh_hans: 可使用左箭头赋值运算符来修改数组元素的内容。
zh_hant: 您可以使用向左鍵指派運算子來修改陣列元素的內容。

# ArrayAssignment-Line2
source: To learn more about this operator, see: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/values/index#mutable-variables
cs: Další informace o tomto operátoru najdete tady: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/values/index#mutable-variables
es: Para obtener más información sobre este operador, consulte: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/values/index#mutable-variables
fr: Pour en savoir plus sur cet opérateur, voir : https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/values/index#mutable-variables
pl: Aby dowiedzieć się więcej o tym operatorze, zobacz: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/values/index#mutable-variables
ru: Подробности об этом операторе: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/values/index#mutable-variables

# ArrayMap-Line1
source: You can transform arrays using 'Array.map' and other functional programming operations.
cs: Pole můžete transformovat pomocí Array.map a dalších funkčních programových operací.
de: Sie können Arrays mithilfe von "Array.map" und anderen funktionalen Programmiervorgängen umwandeln.
es: Para transformar matrices, use "Array.map" y otras operaciones de programación funcionales.
fr: Vous pouvez transformer des tableaux à l'aide de 'Array.map' et d'autres opérations de programmation fonctionnelle.
it: Per trasformare le matrici, è possibile usare 'Array.map' e altre operazioni di programmazione funzionale.
ja: 'Array.map' と他の関数型プログラミング操作を使用して、配列を変換できます。
ko: 'Array'map' 및 기타 함수 프로그래밍 연산을 사용하여 배열을 변환할 수 있습니다.
pl: Możesz przekształcić tablice za pomocą operacji „Array.map” i innych operacji programowania funkcjonalnego.
pt_br: Você pode transformar as matrizes usando 'Array.map' e outras operações de programação funcional.
ru: Вы можете преобразовывать массивы при помощи Array.map и других операций функционального программирования.
tr: 'Array.map' ve diğer işlevsel programlama işlemlerini kullanarak dizileri dönüştürebilirsiniz.
zh_hans: 可使用 "Array.map" 和其他功能性编程运算来转换数组。
zh_hant: 您可以使用 'Array.map' 及其他功能程式設計作業來轉換陣列。

# ArrayMap-Line2
source: The following calculates the sum of the lengths of the words that start with 'h'.
cs: Následující kód vypočítá součet délek slov, která začínají na „h“.
de: Mit Folgendem wird die Summe der Längen von Wörtern berechnet, die mit "h" beginnen.
es: La operación siguiente calcula la suma de las longitudes de las palabras que empiezan por "h".
fr: L'opération suivante calcule la somme des longueurs des mots qui commencent par 'h'.
it: Il codice seguente consente di calcolare la somma delle lunghezze delle parole che iniziano con 'h'.
ja: 以下は、'h' で始まる単語の長さの合計を計算します。
ko: 다음은 'h'로 시작하는 단어 길이의 합을 계산합니다.
pl: Następujący kod oblicza sumę długości słów zaczynających się od litery „h”.
pt_br: O exemplo a seguir calcula a soma dos tamanhos de palavras que começam com 'h'.
ru: Следующий фрагмент вычисляет сумму длин слов, которые начинаются с буквы "h".
tr: Aşağıdaki, 'h' ile başlayan sözcüklerin uzunluklarının toplamını hesaplar.
zh_hans: 下面的函数计算以 "h" 开头的单词的总长度。
zh_hant: 以下會計算 'h' 開頭的字組之長度總和。

# Sequences-Line1
source: Sequences are a logical series of elements, all of the same type. These are a more general type than Lists and Arrays.
cs: Sekvence jsou logické řady elementů, které jsou všechny stejného typu. Jedná se o obecnější typ než seznamy a pole.
de: Sequenzen sind logische Serien von Elementen, die alle vom gleichen Typ sind. Ihr Typ ist allgemeiner als Listen und Arrays.
es: Las secuencias son una serie lógica de elementos del mismo tipo. Son de un tipo más general que las listas o las matrices.
fr: Les séquences sont des séries logiques d'éléments du même type. Elles sont plus générales que les listes et les tableaux.
it: Le sequenze sono costituite da una serie logica di elementi, tutti dello stesso tipo. Sono di un tipo più generale rispetto ad elenchi e matrici.
ja: シーケンスは論理的な一連の要素であり、すべてが同じ型です。これらはリストや配列よりも一般的な型です。
ko: 시퀀스는 모두 형식이 같은 요소가 논리적으로 연속되는 것입니다. 목록 및 배열보다 일반적인 형식입니다.
pl: Sekwencje są logicznymi seriami elementów tego samego typu. Jest to typ bardziej ogólny niż listy i tablice.
pt_br: Sequências são uma série lógica de elementos, todos do mesmo tipo. Eles são um tipo mais geral que Listas e Matrizes.
ru: Последовательности — это логические серии элементов одного типа. Это — более общий тип, чем списки и массивы.
tr: Sıralar, aynı türdeki öğelerden oluşan mantıksal öğe serileridir. Bunlar, Lists ve Arrays'e kıyasla daha genel türlerdir.
zh_hans: 序列是类型相同的所有元素的逻辑系列。序列是比列表和数组更常规的类型。
zh_hant: 序列是一系列的邏輯項目，全部皆為相同的類型。它是比清單及陣列更常見的類型。

# Sequences-Line2
source: Sequences are evaluated on-demand and are re-evaluated each time they are iterated.
cs: Sekvence se vyhodnocují na vyžádání a při každé iteraci se vyhodnocují znovu.
de: Sequenzen werden bei Bedarf ausgewertet und bei jeder Iteration erneut ausgewertet.
es: Las secuencias se evalúan previa petición y se vuelven a evaluar cada vez que se recorren en iteración.
fr: Les séquences sont évaluées sur demande et sont réévaluées à chacune de leur itération.
it: Le sequenze vengono valutate su richiesta e rivalutate ogni volta che vengono iterate.
ja: シーケンスはオンデマンドで評価され、繰り返されるたびに再評価されます。
ko: 시퀀스는 요청 시 계산되며 반복될 때마다 다시 계산됩니다.
pl: Sekwencje są sprawdzane na żądanie, a ich ponowne sprawdzenie następuje za każdym razem, gdy są one iterowane.
pt_br: As sequências são avaliada sob demanda e reavaliadas sempre que são repetidas.
ru: Последовательности вычисляются по требованию и заново вычисляются при каждом их переборе.
tr: Sıralar isteğe bağlı olarak değerlendirilir ve her yinelendiklerinde yeniden değerlendirilir.
zh_hans: 将根据需要计算序列，并在每次循环访问它们时重新进行计算。
zh_hant: 序列是視需要評估，並在每次反覆執行時重新評估。

# Sequences-Line3
source: An F# sequence is an alias for a .NET System.Collections.Generic.IEnumerable<'T>.
cs: Sekvence F# je alias pro .NET System.Collections.Generic.IEnumerable<'T>.
de: Eine F#-Sequenz ist ein Alias für .NET System.Collections.Generic.IEnumerable<'T>.
es: Una secuencia de F# es un alias para un elemento System.Collections.Generic.IEnumerable<'T> de .NET.
fr: Une séquence F# est un alias pour un System.Collections.Generic.IEnumerable .NET<'T>.
it: Una sequenza F# è un alias dell'elemento System.Collections.Generic.IEnumerable<'T> di .NET.
ja: F# シーケンスは .NET System.Collections.Generic.IEnumerable<'T> のエイリアスです。
ko: F# 시퀀스는 .NET System.Collections.Generic.IEnumerable<'T>의 별칭입니다.
pl: Sekwencja języka F# jest aliasem dla elementu .NET System.Collections.Generic.IEnumerable<'T>.
pt_br: Uma sequência de F# é um alias para um System.Collections.Generic.IEnumerable .NET<' t>.
ru: Последовательность F# является псевдонимом для .NET System.Collections.Generic.IEnumerable<'T>.
tr: F# sırası, .NET System.Collections.Generic.IEnumerable<'T> için diğer addır.
zh_hans: F# 序列是 .NET System.Collections.Generic.IEnumerable<'T> 的别名。
zh_hant: F# 序列是 .NET System.Collections.Generic.IEnumerable<'T> 的別名。

# Sequences-Line4
source: Sequence processing functions can be applied to Lists and Arrays as well.
cs: Funkce na zpracování sekvencí je možné použít také na seznamy a pole.
de: Funktionen mit Sequenzverarbeitung können auch auf Listen und Arrays angewendet werden.
es: Las funciones de procesamiento de secuencias también pueden aplicarse a las listas y a las matrices.
fr: Les fonctions de traitement de séquence peuvent être appliquées aux listes et aux tableaux également.
it: Le funzioni di elaborazione della sequenza possono essere applicate anche a elenchi e matrici.
ja: シーケンス処理関数はリストと配列にも適用できます。
ko: 시퀀스 처리 함수는 리스트와 배열 모두에 적용할 수 있습니다.
pl: Funkcje przetwarzania sekwencji można także zastosować dla list i tablic.
pt_br: Funções de processamento de sequência também podem ser aplicadas a matrizes e listas.
ru: Функции обработки последовательностей можно также применять к спискам и массивам.
tr: Seri işleme işlevleri, Listeler ve Dizilere de uygulanabilir.
zh_hans: 序列处理函数也可以应用于列表和数组。
zh_hant: 序列處理函式也可以套用到清單和陣列。

# Sequences-Line5
source: To learn more, see: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/sequences
cs: Další informace najdete tady: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/sequences
es: Para obtener más información, consulte: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/sequences
fr: Pour en savoir plus, consultez : https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/sequences
pl: Aby dowiedzieć się więcej, zobacz: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/sequences
ru: Подробности: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/sequences

# EmptySequence
source: This is the empty sequence.
cs: Toto je prázdná sekvence.
de: Dies ist die leere Sequenz.
es: Esta es una secuencia vacía.
fr: Il s'agit de la séquence vide.
it: Questa è la sequenza vuota.
ja: これは空のシーケンスです。
ko: 빈 시퀀스입니다.
pl: To jest pusta sekwencja.
pt_br: Esta é a sequência vazia.
ru: Это пустая последовательность.
tr: Bu, boş bir seridir.
zh_hans: 这是空序列。
zh_hant: 此為空白序列。

# SequenceOfValues
source: This a sequence of values.
cs: Toto je sekvence hodnot.
de: Dies ist eine Sequenz mit Werten.
es: Esta es una secuencia de valores.
fr: Il s'agit d'une séquence de valeurs.
it: Questa è una sequenza di valori.
ja: これは一連の値です。
ko: 시퀀스 값입니다.
pl: To jest sekwencja wartości.
pt_br: Esta é uma sequência de valores.
ru: Это последовательность значений.
tr: Bu bir değerler serisidir.
zh_hans: 这是一个值的序列。
zh_hant: 這是值的序列。

# OnDemandSequence
source: This is an on-demand sequence from 1 to 1000.
cs: Toto je sekvence na vyžádání od 1 do 1000.
de: Dies ist eine bedarfsbasierte Sequenz von 1 bis 1000.
es: Esta es una secuencia a petición del 1 al 1000.
fr: Séquence à la demande de 1 à 1000.
it: Questa è una sequenza su richiesta compresa tra 1 e 1000.
ja: これは 1 ～ 1000 のオンデマンドのシーケンスです。
ko: 1에서 1000까지의 요청 시 시퀀스입니다.
pl: To jest sekwencja na żądanie zawierająca liczby od 1 do 1000.
pt_br: Esta é uma sequência sob demanda de 1 a 1000.
ru: Это последовательность по требованию от 1 до 1000.
tr: Bu, 1'den 1000'e kadar olan isteğe bağlı bir seridir.
zh_hans: 这是从 1 到 1000 的按需序列。
zh_hant: 此為從 1 到 1000 的隨選序列。

# SequenceComposition
source: This is a sequence producing the words "hello" and "world"
cs: Toto je sekvence, která vrátí slova hello a world
de: Diese Sequenz generiert die Wörter "hello" und "world".
es: Esta es una secuencia que genera las palabras "hola" y "todos"
fr: Il s'agit d'une séquence produisant les mots "hello" et "world"
it: Questa è una sequenza che produce le parole "hello" e "world"
ja: これは 単語 "hello" と "world" を生成するシーケンスです
ko: "hello"와 "world"라는 단어를 생성하는 시퀀스입니다.
pl: To jest sekwencja generująca słowa „hello” i „world”
pt_br: Esta é uma sequência produzindo as palavras "olá" e "mundo"
ru: Это последовательность, создающая слова hello и world.
tr: Bu, "hello" ve "world" sözcüklerini üreten bir seridir
zh_hans: 这是生成单词 "hello" 和 "world" 的序列
zh_hant: 此為產生 "hello" 及 "world" 的序列

# SequenceInit
source: This sequence producing the even numbers up to 2000.
cs: Tato sekvence vrátí sudá čísla až do 2000.
de: Diese Sequenz erzeugt gerade Zahlen bis 2000.
es: Esta secuencia genera los números pares hasta el 2000.
fr: Cette séquence produit les nombres pairs jusqu'à 2 000.
it: Questa è la sequenza che produce i numeri pari fino a 2000.
ja: このシーケンスは、2000 までの偶数を生成します。
ko: 2000까지의 짝수를 생성하는 시퀀스입니다.
pl: Ta sekwencja generuje numery parzyste nie większe niż 2000.
pt_br: Esta sequência produzindo os números pares até 2.000.
ru: Эта последовательность выдает целые числа до 2000.
tr: Bu, 2000'e kadar olan çift sayıları üreten bir seridir.
zh_hans: 此序列生成最大为 2000 的偶数。
zh_hant: 此序列產生 2000 以下的偶數。

# InfiniteSequence-Line1
source: This is an infinite sequence which is a random walk.
cs: Toto je nekonečná sekvence, která je náhodnou funkcí walk.
de: Dies ist eine unendliche Sequenz und ermöglicht Zufallsdurchläufe.
es: Esta es una secuencia infinita que constituye un recorrido aleatorio.
fr: Il s'agit d'une séquence infinie correspondant à une marche aléatoire.
it: Questa è una sequenza infinita, ovvero un percorso casuale.
ja: これはランダム ウォークである無限シーケンスです。
ko: 임의 행로인 무한 시퀀스입니다.
pl: To jest nieskończona sekwencja stanowiąca losowe przechodzenie.
pt_br: Esta é uma sequência infinita, que é um exame aleatório.
ru: Это бесконечная последовательность, представляющая случайное блуждание.
tr: Bu, rastgele olan sonsuz bir seridir.
zh_hans: 这是可随机访问的无限序列。
zh_hant: 這是屬於隨機漫步的無限序列。

# InfiniteSequence-Line2
source: This example uses yield! to return each element of a subsequence.
cs: Tento příklad vrací pomocí příkazu yield! jednotlivé elementy dílčí sekvence.
de: In diesem Beispiel werden mithilfe von "yield!" die einzelnen Elemente einer Untersequenz zurückgegeben.
es: Este ejemplo usa yield! para devolver cada uno de los elementos de una subsecuencia.
fr: Cet exemple utilise yield! pour retourner chaque élément d'une sous-séquence.
it: In questo esempio si usa yield! per restituire ogni elemento di una sottosequenza.
ja: この例では、yield! を使用して、サブシーケンスの各要素を返します。
ko: 이 예에서는 yield!를 사용하여 하위 시퀀스의 각 요소를 반환합니다.
pl: W tym przykładzie użyto instrukcji yield! do zwrócenia każdego elementu sekwencji podrzędnej.
pt_br: Este exemplo usa yield! para retornar cada elemento de uma subsequência.
ru: В этом примере используется оператор yield! для получения каждого элемента подпоследовательности.
tr: Bu örnek, alt serinin her öğesini döndürmek için yield! kullanır.
zh_hans: 此示例使用 yield! 返回子序列的每个元素。
zh_hant: 此範例使用 yield! 傳回序列的每個元素。

# Sequence100Elements
source: This example shows the first 100 elements of the random walk.
cs: Tento příklad ukazuje prvních 100 elementů náhodné funkce walk.
de: Dieses Beispiel zeigt die ersten 100 Elemente des Zufallsdurchlaufs.
es: Este ejemplo muestra los 100 primeros elementos del recorrido aleatorio.
fr: Cet exemple montre les 100 premiers éléments de la marche aléatoire.
it: Questo esempio mostra i primi 100 elementi del percorso casuale.
ja: この例では、ランダム ウォークの最初の 100 要素を示します。
ko: 이 예에서는 임의 행로의 처음 100개 요소를 보여 줍니다.
pl: Ten przykład przedstawia pierwszych 100 elementów losowego przechodzenia.
pt_br: Este exemplo mostra os primeiros 100 elementos do exame aleatório.
ru: В этом примере показаны первые 100 элементов случайного блуждания.
tr: Bu örnek rastgele serinin ilk 100 öğesini gösterir.
zh_hans: 此示例演示随机访问的前 100 个元素。
zh_hant: 此範例顯示了隨機漫步的前 100 個項目。

# RecursiveFunctions-Line1
source: Recursive functions can call themselves. In F#, functions are only recursive
cs: Rekurzivní funkce můžou volat samy sebe. V F# jsou všechny funkce rekurzivní
de: Rekursive Funktionen können sich selbst aufrufen. In F# sind Funktionen nur rekursiv,
es: Las funciones recursivas pueden llamarse a sí mismas. En F#, las funciones solo son recursivas
fr: Les fonctions récursives peuvent s'appeler elles-mêmes. En F#, les fonctions sont uniquement récursives
it: Le funzioni ricorsive possono chiamarsi da sole. In F# le funzioni sono ricorsive solo
ja: 再帰関数は自身を呼び出すことができます。F# では、関数は単に再帰的です
ko: 재귀 함수는 자신을 호출할 수 있습니다. F#에서 함수는
pl: Funkcje rekursywne mogą wywoływać same siebie. W języku F# funkcje to jedyne rekursywne
pt_br: Funções recursivas podem chamar a si mesmas. Em F#, funções são recursivas somente
ru: Рекурсивные функции могут вызывать сами себя. В F# функции являются рекурсивными только
tr: Özyinelemeli işlevler kendilerini çağırabilir. F# içinde, işlevler yalnızca
zh_hans: 递归函数可调用其自身。在 F# 中，函数只递归
zh_hant: 遞迴函式可以呼叫其本身。在 F# 中，函式均為遞迴

# RecursiveFunctions-Line2
source: when declared using 'let rec'.
cs: při deklarování pomocí let rec.
de: für die Deklaration mithilfe von "let rec".
es: cuando se declara con "let rec".
fr: en cas de déclaration avec 'let rec'.
it: quando per la dichiarazione si usa 'let rec'.
ja: 'let rec' を使用して宣言される場合。
ko: 'let rec'을 사용하여 선언할 때에만 반복됩니다.
pl: w przypadku deklarowania przy użyciu wyrażenia „let rec”.
pt_br: quando declarada usando 'let rec'.
ru: при объявлении с помощью let rec.
tr: 'let rec' kullanılarak bildirildiğinde özyinelemeli olur.
zh_hans: 使用 "let rec" 声明时。
zh_hant: (於使用 'let rec' 宣告時)。

# RecursiveFunctions-Line3
source: Recursion is the preferred way to process sequences or collections in F#.
cs: Rekurze je preferovaný způsob zpracování sekvencí nebo kolekcí v jazyce F#.
de: Rekursion ist die bevorzugte Möglichkeit zum Verarbeiten von Sequenzen oder Sammlungen in F#.
es: La recursión es la forma recomendada de procesar secuencias o colecciones en F#.
fr: Il est recommandé d'utiliser la récursivité pour traiter des séquences ou des collections en F#.
it: La ricorsione è il modo preferito per elaborare sequenze o raccolte in F#.
ja: 再帰は、F# でシーケンスまたはコレクションを処理するための推奨される方法です。
ko: 재귀는 F#에서 시퀀스 또는 컬렉션을 처리하는 기본 방법입니다.
pl: Rekursja jest preferowanym sposobem przetwarzania sekwencji lub kolekcji w języku F#.
pt_br: Recursão é a maneira preferencial de processar sequências ou coleções em F#.
ru: Рекурсия — это предпочтительный способ обработки последовательностей или коллекций в F#.
tr: Özyineleme, F# içinde sıraları veya koleksiyonları işlemek için tercih edilen yöntemdir.
zh_hans: 递归是 F# 中处理序列或集合的首选方式。
zh_hant: 遞迴是處理 F# 中序列或集合的慣用方法。

# RecursiveFunctions-Line4
source: To learn more, see: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/functions/index#recursive-functions
cs: Další informace najdete v tématu: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/functions/index#recursive-functions
es: Para obtener más información, consulte: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/functions/index#recursive-functions
fr: Pour en savoir plus, consultez : https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/functions/index#recursive-functions
pl: Aby dowiedzieć się więcej, zobacz: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/functions/index#recursive-functions
ru: Подробности: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/functions/index#recursive-functions

# RecFunDef-Line1
source: This example shows a recursive function that computes the factorial of an
cs: Tento příklad ukazuje rekurzivní funkci, která vypočítá faktoriál
de: Dieses Beispiel zeigt eine rekursive Funktion, die die Fakultät einer ganzen
es: Este ejemplo muestra una función recursiva que calcula el factorial de un
fr: Cet exemple montre une fonction récursive qui calcule la factorielle d'un
it: Questo esempio mostra una funzione ricorsiva che calcola il fattoriale di un
ja: この例では、次の階乗をコンピューティングする再帰関数を示します
ko: 이 예에서는 정수의 계승을 계산하는 재귀 함수를 보여 줍니다.
pl: Ten przykład przedstawia funkcję rekursywną, która oblicza silnię
pt_br: Este exemplo mostra uma função recursiva que computa o fatorial de um
ru: В этом примере показана рекурсивная функция, вычисляющая факториал
tr: Bu örnek, bir tamsayının faktöriyelini hesaplayan özyinelemeli bir işlevi
zh_hans: 此示例演示递归函数，计算以下内容的阶乘
zh_hant: 此範例顯示遞迴函式，其可計算下項的階乘:
