Repository: dotnet/fsharp
Catalog: vsintegration/ProjectTemplates/TutorialProject/Template/xlf/Tutorial.fsx.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DiscriminatedUnions-Line1
source: Discriminated Unions (DU for short) are values which could be a number of named forms or cases.
cs: Rozlišovaná sjednocení (zkratka: DU) jsou hodnoty, které můžou představovat celou řadu pojmenovaných forem nebo případů.
de: Diskriminierte Unions (DUs) sind Werte, die eine Anzahl benannter Formen oder Fälle sein können.
es: Las uniones discriminadas (DU) son valores que podrían ser un gran número de formas o casos con nombre.
fr: Les unions discriminées sont des valeurs qui peuvent correspondre à un certain nombre de formulaires ou de cas nommés.
it: Le unioni discriminate sono valori che potrebbero corrispondere a un certo numero di case o form denominati.
ja: 判別共用体 (略して DU) は、多数の名前付きのフォームまたはケースである可能性のある値です。
ko: 구분된 공용 구조체(줄여서 DU)는 여러 명명된 폼 또는 케이스일 수 있는 값입니다.
pl: Unie rozłączne (DU, Discriminated Union) są wartościami, które mogą być liczbą nazwanych formularzy lub przypadków.
pt_br: Uniões Discriminadas (UD) são valores que podem ser vários formulários nomeados ou casos.
ru: Размеченные объединения (DU) — это значения, которые могут состоять из нескольких именованных форм или ветвей.
tr: Ayırt Edici Birleşimler (kısaca DU), bir dizi adlandırılmış form veya durum olabilen değerleri ifade eder.
zh_hans: 可区分联合(简称 DU)的值可以是一系列已命名窗体或用例。
zh_hant: 差異聯集 (簡寫為 DU) 是可能為數個具名表單或案例的值。

# DiscriminatedUnions-Line2
source: Data stored in DUs can be one of several distinct values.
cs: Data uložená v DU můžou představovat jednu z několika různých hodnot.
de: In DUs gespeicherte Daten können einer von verschiedenen eindeutigen Werten sein.
es: Los datos almacenados en uniones discriminadas pueden ser uno de varios valores diferentes.
fr: Les données stockées dans les unions discriminées peuvent prendre une valeur parmi plusieurs valeurs distinctes.
it: I dati archiviati nelle unioni discriminate possono essere uno di diversi valori distinti.
ja: DU の格納データは、複数の個別の値のいずれかになります。
ko: DU에 저장된 데이터는 여러 고유한 값 중 하나일 수 있습니다.
pl: Dane przechowywane w uniach rozłącznych mogą mieć jedną z kilku różnych wartości.
pt_br: Dados armazenados em DUs podem ser um dos vários valores distintos.
ru: Данные, хранимые в размеченных объединениях, могут являться одними из нескольких различных значений.
tr: DU'larda depolanan veriler birkaç farklı değerden biri olabilir.
zh_hans: DU 中存储的数据可以为多个不同值之一。
zh_hant: DU 中所儲存的資料可以是數個相異值中的一個。

# DiscriminatedUnions-Line3
source: To learn more, see: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/discriminated-unions
cs: Další informace najdete v tématu: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/discriminated-unions
es: Para obtener más información, consulte: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/discriminated-unions
fr: Pour en savoir plus, consultez : https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/discriminated-unions
pl: Aby dowiedzieć się więcej, zobacz: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/discriminated-unions
ru: Подробности: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/discriminated-unions

# CardSuit
source: The following represents the suit of a playing card.
cs: Následující příklad představuje barvu hrací karty.
de: Folgendes stellt die Farbe einer Spielkarte dar.
es: El siguiente código representa el palo de una carta.
fr: Ce qui suit représente la couleur d'une carte à jouer.
it: L'istruzione seguente rappresenta il seme di una carta da gioco.
ja: たとえば、次は一揃いのトランプを表します。
ko: 다음은 플레인 카드의 짝패를 나타냅니다.
pl: Następująca wartość reprezentuje kolor karty do gry.
pt_br: O exemplo a seguir representa o naipe de uma carta de baralho.
ru: Следующий код представляет масть игральной карты.
tr: Aşağıdaki, bir iskambil kartının cinsini gösterir.
zh_hans: 下面代表一套扑克牌。
zh_hant: 以下代表一副撲克牌。

# CardRank
source: A Disciminated Union can also be used to represent the rank of a playing card.
cs: Rozlišované sjednocení může také představovat hodnotu hrací karty.
de: Eine diskriminierte Union kann auch verwendet werden, um den Rang einer Spielkarte darzustellen.
es: También se puede usar una unión discriminada para representar el rango de una carta.
it: È possibile usare un'unione discriminata anche per rappresentare il valore di una carta da gioco.
ja: 判別共用体はトランプのランクを表すためにも使用できます。
ko: 구분된 공용 구조체를 사용하여 플레잉 카드의 순위를 나타낼 수도 있습니다.
pl: Unii rozłącznej można również użyć do reprezentowania wartości karty do gry.
pt_br: Uma União Discriminada também pode ser usada para representar a classificação de uma carta de baralho.
tr: Bir iskambil kartının sırasını göstermek için bir Ayırt Edici Birleşim de kullanılabilir.
zh_hans: 可区分联合还可用来表示纸牌的设置级别。
zh_hant: 差異聯集也可用以代表一張撲克牌的順位。

# CardRankValue
source: Represents the rank of cards 2 .. 10
cs: Představuje hodnotu karet 2 .. 10.
de: Stellt den Rang der Karten 2 bis 10 dar 10
es: Representa el rango de cartas 2 .. 10
fr: Représente le rang des cartes 2 .. 10
it: Rappresenta il valore delle carte da 2 a 10
ja: 2 ～ 10 の札のランクを表します
ko: 카드 2부터 10까지의 순위를 나타냅니다.
pl: Reprezentuje wartości kart 2 .. 10
pt_br: Representa posição das cartas 2 .. 10
ru: Представляет достоинство карт 2 .. 10
tr: 2 .. 10 arasındaki kartları temsil eder
zh_hans: 表示扑克牌点数 2 .. 10
zh_hant: 代表 2 .. 10 這幾張牌的順位

# CardMember
source: Discriminated Unions can also implement object-oriented members.
cs: Rozlišovaná sjednocení můžou také implementovat objektově orientované členy.
de: Diskriminierte Unions können objektorientierte Member implementieren.
es: Las uniones discriminadas pueden implementar también miembros orientados a objetos.
fr: Les unions discriminées peuvent également implémenter des membres orientés objet.
it: Le unioni discriminate possono inoltre implementare membri orientati a oggetti.
ja: 判別共用体はオブジェクト指向のメンバーを実装することもできます。
ko: 구분된 공용 구조체는 개체 지향 멤버도 구현할 수 있습니다.
pl: Unie rozłączne mogą również implementować elementy członkowskie zorientowane obiektowo.
pt_br: Uniões Discriminadas também podem implementar membros orientados a objeto.
ru: Кроме того, размеченные объединения могут реализовать объектно-ориентированные элементы.
tr: Ayırt Edici Birleşimler ayrıca nesne yönelimli üyeleri uygulayabilir.
zh_hans: 可区分联合还可实现面向对象的成员。
zh_hant: 差異聯集也可以實作物件導向成員。

# CardType-Line1
source: This is a record type that combines a Suit and a Rank.
cs: Toto je typ záznamu, který kombinuje barvu a hodnotu hrací karty.
de: Dieser Datensatztyp kombiniert eine Farbe und einen Rang.
es: Este es un tipo de registro que combina un palo y un rango.
fr: Il s'agit d'un type d'enregistrement qui combine une couleur et un rang.
it: Questo è un tipo di record che combina un seme e un valore.
ja: これは Suit と Rank を組み合わせたレコード型です。
ko: 짝패와 순위를 조합하는 레코드 형식입니다.
pl: To jest typ rekordu łączący kolor i wysokość.
pt_br: Este é um tipo de registro que combina um Naipe e uma Classificação.
ru: Это тип записи, объединяющий масть и достоинство.
tr: Bu, Cins ve Sırayı birleştiren bir kayıt türüdür.
zh_hans: 这是结合花色和牌面大小的记录类型。
zh_hant: 這是合併了 Suit 和 Rank 的記錄類型。

# CardType-Line2
source: It's common to use both Records and Disciminated Unions when representing data.
cs: Při vyjadřování dat se běžně používají záznamy i rozlišovaná sjednocení.
de: Beim Darstellen von Daten werden häufig sowohl Datensätze als auch diskriminierte Unions verwendet.
es: Es habitual utilizar tanto registros como uniones discriminadas cuando se representan datos.
it: Per la rappresentazione dei dati si usano in genere record e unioni discriminate.
ja: データを表すときには、レコードと判別共用体の両方を使用するのが一般的です。
ko: 일반적으로 레코드와 구분된 공용 구조체를 모두 사용하여 데이터를 나타냅니다.
pl: Często używa się rekordów i unii rozłącznych w przypadku reprezentowania danych.
pt_br: É comum usar Registros e Uniões Discriminadas ao representar dados.
tr: Verileri temsil ederken Kayıtları ve Ayırt Edici Birleşimleri birlikte kullanmak yaygındır.
zh_hans: 表示数据时同时使用记录和可区分联合是很常见的。
zh_hant: 代表資料時，通常會使用記錄與差異聯集。

# ComputeFullDeck
source: This computes a list representing all the cards in the deck.
cs: Tady se vypočítá seznam představující všechny karty z balíčku.
de: Dies berechnet eine Liste mit allen Karten im Stapel.
es: Este código calcula una lista que representa todas las cartas de la baraja.
fr: Ceci calcule une liste représentant toutes les cartes du paquet.
it: Calcola un elenco che rappresenta tutte le carte del mazzo.
ja: これは、一組のトランプのすべてのカードを表すリストをコンピューティングします。
ko: 데크에 있는 모든 카드를 나타내는 목록을 계산합니다.
pl: Operacja oblicza listę reprezentującą wszystkie karty w talii.
pt_br: Isto calcula uma lista que representa todas as cartas do baralho.
ru: Вычисляется список, представляющий все карты в колоде.
tr: Bu, destedeki tüm kartları gösteren bir liste hesaplar.
zh_hans: 它将计算代表牌组中所有扑克牌的列表。
zh_hant: 這會計算代表一疊牌中所有牌的清單。

# CardToString
source: This example converts a 'Card' object to a string.
cs: Tento příklad převede objekt Card na řetězec.
de: Dieses Beispiel konvertiert ein Objekt vom Typ "Card" in eine Zeichenfolge.
es: Este ejemplo convierte un objeto "Card" en una cadena.
fr: Cet exemple convertit un objet 'Card' en chaîne.
it: Questo esempio consente di convertire un oggetto 'Card' in una stringa.
ja: この例では 'Card' オブジェクトを文字列に変換します。
ko: 이 예에서는 'Card' 개체를 문자열로 변환합니다.
pl: Ten przykład umożliwia przekonwertowanie elementu „Card” na ciąg.
pt_br: Este exemplo converte um objeto 'Carta' em uma cadeia de caracteres.
ru: В этом примере объект Card преобразуется в строку.
tr: Bu örnek, bir 'Card' nesnesini dizeye dönüştürür.
zh_hans: 此示例将“纸牌”对象转换为字符串。
zh_hant: 此範例將 'Card' 物件轉換為字串。

# PrintAllCards
source: This example prints all the cards in a playing deck.
cs: Tento příklad vytiskne všechny karty v hracím balíčku.
de: Dieses Beispiel gibt alle Karten in einem Kartenstapel aus.
es: Este ejemplo imprime todas las cartas de una baraja.
fr: Cet exemple imprime toutes les cartes d'un jeu de cartes.
it: Questo esempio consente di stampare tutte le carte di un mazzo.
ja: この例では、一組のトランプのカードすべてを印刷します。
ko: 이 예에서는 플레잉 데크의 모든 카드를 인쇄합니다.
pl: Ten przykład umożliwia wyświetlenie wszystkich kart w talii.
pt_br: Este exemplo imprime todas as cartas de um baralho de jogo.
ru: В этом примере печатаются все карты колоды.
tr: Bu örnek bir iskambil destesindeki tüm kartları yazdırır.
zh_hans: 此示例打印扑克牌中的所有牌。
zh_hant: 此範例會列印牌局的所有紙牌。

# SingleCaseDu-Line1
source: Single-case DUs are often used for domain modeling. This can buy you extra type safety
cs: Rozlišovaná sjednocení s jedním případem se často používají pro modelování domén. Tím můžete získat dodatečnou bezpečnost typů
de: Einzelfall-DUs werden häufig für die Domänenmodellierung verwendet. Dadurch erhalten Sie zusätzliche Typsicherheit
es: Las uniones discriminadas de un solo caso se usan con frecuencia en el modelado de dominios. Esto puede aportar mayor seguridad de tipos
fr: Les unions discriminées à cas unique sont souvent utilisées pour la modélisation de domaines. Il peut en résulter une meilleure cohérence des types
it: Le unioni discriminate a case singolo vengono spesso usate per la modellazione dei domini. In questo modo è possibile garantire una maggiore sicurezza dei tipi
ja: 単一ケースの DU は、ドメイン モデリングで多く使用されます。これにより、文字列や整数などの
ko: 단일 케이스 DU를 도메인 모델링에 사용하는 경우가 많습니다. 그러면 문자열 및 정수와 같은
pl: Unie rozłączne o pojedynczych przypadkach są często używane podczas modelowania domeny. Może to zapewnić większe bezpieczeństwo typów
pt_br: UDs de caso único são frequentemente usadas para modelagem de domínio. Isso pode significar um tipo extra de segurança para você
ru: Размеченные объединения с одной ветвью часто используются для моделирования доменов. Это более типобезопасно, чем использование
tr: Tek Olaylı DU'lar genellikle etki alanı modelleme için kullanılır. Bu, dizeler ve tamsayılar gibi temel türlere göre
zh_hans: 单用例 DU 常用于域建模。这可确保额外类型的安全
zh_hant: 單一案例 DU 通常用於網域模型。這讓使用類型變得更加安全

# SingleCaseDu-Line2
source: over primitive types such as strings and ints.
cs: oproti primitivním typům, jako jsou řetězce a celá čísla.
de: für primitive Typen wie Zeichenfolgen und Integer.
es: en tipos primitivos, como cadenas y enteros.
fr: sur des types primitifs tels que les chaînes et les entiers.
it: rispetto a tipi primitivi come stringhe e valori int.
ja: プリミティブ型に加えて、さらにタイプ セーフが追加されます。
ko: 기본 형식보다 형식 안전성을 추가로 얻을 수 있습니다.
pl: niż typy pierwotne, np. ciągi i liczby całkowite.
pt_br: sobre tipos primitivos como cadeias de caracteres e inteiros.
ru: примитивных типов, таких как строки и целые числа.
tr: ek tür güvenliği sağlamanıza yardımcı olabilir.
zh_hans: 字符串和整数等基元类型。
zh_hant: 針對基本類型，例如 strings 和 ints。

# SingleCaseDu-Line3
source: Single-case DUs cannot be implicitly converted to or from the type they wrap.
cs: Rozlišovaná sjednocení s jedním případem nejde implicitně převést na typ nebo z typu, který obalují.
de: Eine implizite Konvertierung von Einzelfall-DUs in den umschlossenen Typ oder aus diesem Typ ist nicht möglich.
es: Las uniones discriminadas de un solo caso no se pueden convertir de forma implícita en el tipo que encapsulan, ni viceversa.
fr: Les unions discriminées à cas unique ne peuvent pas être converties implicitement vers ou à partir du type qu'elles incluent dans un wrapper.
it: Le unioni discriminate a case singolo non possono essere convertite in modo implicito nel o dal tipo di cui eseguono il wrapping.
ja: 単一ケースの DU は、ラップする型との間で暗黙的に変換することはできません。
ko: 단일 케이스 DU를 래핑하는 형식으로 암시적으로 변환하거나 반대로 변환할 수 없습니다.
pl: Unie rozłączne o pojedynczych przypadkach nie mogą być niejawnie konwertowane do lub z typu przez nich opakowywanego.
pt_br: UDs de caso único não podem ser convertidas implicitamente de ou para o tipo que elas encapsulam.
ru: Размеченные объединения с одной ветвью нельзя неявно преобразовать в тип или из типа, оболочкой которого они служат.
tr: Tek durumlu DU'lar, sarmaladıkları türe veya bu türden örtük olarak dönüştürülemez.
zh_hans: 单用例 DU 无法隐式转换为其包装的类型或从其包装的类型进行转换。
zh_hant: 單一案例 DU 無法隱含地轉換成它們所包裝的類型，反之亦然。

# SingleCaseDu-Line4
source: For example, a function which takes in an Address cannot accept a string as that input,
cs: Například funkce, která přebírá adresu, nemůže jako vstup převzít řetězec
de: Beispielsweise eine Funktion, die eine Adresse akzeptiert, kann keine Zeichenfolge als Eingabe akzeptieren
es: Por ejemplo, una función que toma una dirección no puede aceptar una cadena como esa entrada,
fr: Par exemple, une fonction qui accepte une adresse ne peut pas accepter une chaîne comme entrée
it: Ad esempio, una funzione che accetta un indirizzo non può accettare come input una stringa,
ja: たとえば、アドレスを受け取る関数は文字列をその入力として受け入れることはできません
ko: 예를 들어 주소에서 사용하는 함수는 문자열을 입력으로 사용할 수 없으며,
pl: Przykładowo funkcja przyjmująca adres nie może zaakceptować ciągu jako danych wejściowych
pt_br: Por exemplo, uma função que compreende um Endereço não pode aceitar uma sequência de caracteres como essa entrada,
ru: Например, функция, которая принимает адрес, не может принять в качестве входных данных строку
tr: Örneğin, Adres alan bir işlev bu giriş için dize kabul edemez
zh_hans: 例如，地址中采用的函数无法接受字符串作为输入，
zh_hant: 例如，接受位址的函式無法接受字串作為輸入，

# SingleCaseDu-Line5
source: or vive/versa.
cs: a naopak.
de: (oder umgekehrt).
es: o viceversa.
fr: ou vice versa.
it: o viceversa.
ja: (その逆もできません)。
ko: 그 반대도 마찬가지입니다.
pl: i na odwrót.
pt_br: ou vice-versa.
ru: или наоборот.
tr: veya bu durumun tersi olamaz.
zh_hans: 反之亦然。
zh_hant: 反之亦然。

# InstantiateSingleCaseDu
source: You can easily instantiate a single-case DU as follows.
cs: Instanci rozlišovaného sjednocení s jedním případem můžete snadno vytvořit následujícím způsobem.
de: Sie können Einzelfall-DUs folgendermaßen instanziieren.
es: Puede crear fácilmente una instancia de una unión discriminada de un solo caso del siguiente modo.
fr: Vous pouvez facilement instancier une union discriminée à cas unique comme suit.
it: È possibile creare facilmente un'istanza di una unione discriminata a case singolo come descritto di seguito.
ja: 次のように、単一ケースの DU のインスタンスを簡単に作成できます。
ko: 다음과 같이 단일 케이스 DU를 쉽게 인스턴스화할 수 있습니다.
pl: Możesz z łatwością utworzyć wystąpienie dla unii rozłącznej o pojedynczym przypadku w następujący sposób.
pt_br: Você pode facilmente criar uma instância em uma UD de único caso conforme mostrado a seguir.
ru: Можно легко создать экземпляр размеченного объединения с одной ветвью следующим образом.
tr: Tek Olaylı DU'ları aşağıdaki gibi kolayca örnekleyebilirsiniz.
zh_hans: 可轻松实例化单用例 DU，如下所示。
zh_hant: 您可以輕鬆地具現化單一案例 DU，如下所示。

# UnwrapSingleCaseDu
source: When you need the value, you can unwrap the underlying value with a simple function.
cs: Pokud danou hodnotu potřebujete, můžete základní hodnotu rozbalit pomocí jednoduché funkce.
de: Wenn Sie den Wert benötigen, können Sie den zugrunde liegenden Wert mit einer einfachen Funktion entpacken.
es: Cuando necesite el valor, puede desencapsular el valor subyacente con una función sencilla.
fr: Quand vous avez besoin de la valeur, vous pouvez exclure la valeur sous-jacente du wrapper à l'aide d'une fonction simple.
it: Quando è necessario il valore, è possibile annullare il wrapping del valore sottostante con una funzione semplice.
ja: 値が必要な場合は、簡単な関数を使用して基になる値のラップを解除できます。
ko: 값이 필요하면 간단한 함수로 내부 값을 래핑 해제할 수 있습니다.
pl: Jeśli potrzebujesz wartości, możesz cofnąć opakowywanie wartości bazowej za pomocą prostej funkcji.
pt_br: Quando precisar do valor, você pode decodificar o valor subjacente com uma função simples.
ru: Если вам требуется значение, вы можете распаковать базовое значение при помощи простой функции.
tr: Değere ihtiyacınız olduğunda, basit bir işlev ile temel değerin sarmalamasını açabilirsiniz.
zh_hans: 需要值时，可使用单个函数解包基础值。
zh_hant: 當您需要值時，可以使用簡單的函式來展開基礎值。

# PrintSingleCaseDu
source: Printing single-case DUs is simple with unwrapping functions.
cs: Tisk rozlišovaných sjednocení s jedním případem je jednoduchý s použitím rozbalovacích funkcí.
de: Mit entpackten Funktionen lassen sich Einzelfall-DUs einfach drucken.
es: Imprimir uniones discriminadas de un solo caso es muy sencillo con funciones de desencapsulamiento.
fr: Les fonctions d'exclusion d'un wrapper facilitent l'impression d'unions discriminées à cas unique.
it: Le funzioni di unwrapping semplificano la stampa di unioni discriminate a case singolo.
ja: 単一ケースの DU は、関数のラップを解除するだけで出力できます。
ko: 래핑 해제 함수로 단일 케이스 DU를 간단히 인쇄할 수 있습니다.
pl: Drukowanie unii rozłącznych o pojedynczych przypadkach jest proste z funkcjami cofającymi opakowywanie.
pt_br: Imprimir UDs de caso único é simples com funções não encapsuladas.
ru: Вывод размеченных объединений с одной ветвью не представляет сложности при использовании функций распаковки.
tr: Sarmalama açma işlevleri ile tek olayı DU'ları yazdırmak kolaydır.
zh_hans: 打印单用例 DU 与解包函数一样简单。
zh_hant: 使用展開 (unwrap) 函式來列印單一案例的 DU 十分簡單。

# DuRecursiveDef-Line1
source: Disciminated Unions also support recursive definitions.
cs: Rozlišovaná sjednocení podporují i rekurzivní definice.
de: Diskriminierte Unions unterstützen auch rekursive Definitionen.
es: Las uniones discriminadas admiten también definiciones recursivas.
it: Le unioni discriminate supportano anche definizioni ricorsive.
ja: 判別共用体は再帰的な定義もサポートしています。
ko: 구분된 공용 구조체는 재귀 정의도 지원합니다.
pl: Unie rozłączne obsługują również definicje rekursywne.
pt_br: Uniões Discriminadas também dão suporte a definições recursivas.
tr: Ayırt Edici Birleşimler ayrıca özyinelemeli tanımları da destekler.
zh_hans: 可区分联合还支持递归定义。
zh_hant: 差異聯集也支援遞迴定義。

# DuRecursiveDef-Line2
source: This represents a Binary Search Tree, with one case being the Empty tree,
cs: Toto představuje binární vyhledávací strom, přičemž jeden případ je prázdný strom
de: Dies stellt eine Struktur für die Binärsuche dar, wobei ein Fall eine leere Struktur ist
es: Esto representa un árbol de búsqueda binaria, donde un caso es el árbol vacío
fr: Ceci représente un arbre de recherche binaire, l'un des cas étant l'arbre vide
it: Rappresenta un albero di ricerca binaria, in cui un caso è l'albero vuoto,
ja: これはバイナリ検索ツリーを表します。片方のケースは空のツリーであり、
ko: 이진 검색 트리를 나타냅니다. 여기서 한 케이스는 빈 트리이고
pl: Reprezentuje to binarne drzewo wyszukiwania, gdzie jeden przypadek jest pustym drzewem,
pt_br: Isso representa uma Árvore de Pesquisa Binária, com um caso sendo a árvore Vazia,
ru: Это представляет двоичное дерево поиска, в котором одна ветвь является пустым деревом,
tr: Bu, bir olayı Boş ağacı ve diğeri bir değer ile iki alt ağaç içeren bir Düğüme sahip
zh_hans: 这代表一个二进制文件搜索树，且有一个用例为空树，
zh_hant: 這代表二進位搜尋樹狀結構，其中有一個案例是空的樹狀結構，

# DuRecursiveDef-Line3
source: and the other being a Node with a value and two subtrees.
cs: a druhý je uzel s hodnotou a dvěma podstromy.
de: und der andere Fall einen Knoten mit einem Wert und zwei Unterstrukturen darstellt.
es: y el otro es un nodo con un valor y dos subárboles.
fr: et l'autre étant un nœud avec une valeur et deux sous-arbres.
it: e l'altro è un nodo con un valore e due sottoalberi.
ja: もう片方は値と 2 つのサブツリーを含む Node です。
ko: 다른 케이스는 값과 두 개의 하위 트리를 포함하는 노드입니다.
pl: a drugi węzłem z wartością i dwoma poddrzewami.
pt_br: e o outro sendo um Nó com um valor e duas subárvores.
ru: а другая — узлом со значением и двумя поддеревьями.
tr: İkili Arama Ağacı'nı gösterir.
zh_hans: 而另一个用例为具有一个值和两个子树的节点。
zh_hant: 而另一個是具有一個值和兩個子樹狀結構的節點。

# SearchBinaryTree-Line1
source: Check if an item exists in the binary search tree.
cs: Zkontroluje, jestli položka existuje v binárním vyhledávacím stromu.
de: Prüfen Sie, ob die Struktur für die Binärsuche ein Element enthält.
es: Comprueba si existe un elemento en el árbol de búsqueda binaria.
fr: Vérifiez si un élément existe dans l'arbre de recherche binaire.
it: Verifica l'esistenza di un elemento nell'albero della ricerca binaria.
ja: バイナリ検索ツリーにアイテムが存在するかどうかを確認します。
ko: 이진 검색 트리에 항목이 있는지 확인합니다.
pl: Sprawdź, czy element istnieje w binarnym drzewie wyszukiwania.
pt_br: Verifique se um item existe na árvore de pesquisa binária.
ru: Проверка наличия элемента в двоичном дереве поиска.
tr: İkili arama ağacında bir öğe olup olmadığını denetleyin.
zh_hans: 检查项是否存在于二进制文件搜索树中。
zh_hant: 請確認二進位搜尋樹狀結構中是否已有項目存在。

# SearchBinaryTree-Line2
source: Searches recursively using Pattern Matching. Returns true if it exists; otherwise, false.
cs: Rekurzivně vyhledává porovnáváním vzorů. Vrátí hodnotu true, pokud existuje; v opačném případě false.
de: Sucht rekursiv mithilfe des Musterabgleichs. Gibt bei vorhandenem Element "true" aus, andernfalls "false".
es: Hace búsquedas de forma recursiva usando coincidencia de patrones. Devuelve true si existe; de lo contrario, false.
fr: Effectue une recherche récursive à l'aide de critères spéciaux. Retourne true si l'élément existe ; sinon, false.
it: Esegue la ricerca in modo ricorsivo usando i criteri di ricerca. Restituisce true se esiste; in caso contrario, false.
ja: パターン マッチングを使用して再帰的に検索します。存在する場合は true を返し、そうでない場合は false を返します。
ko: 패턴 일치를 사용하여 재귀적으로 검색합니다. 있으면 true를 반환하고 그렇지 않은 경우 false를 반환합니다.
pl: Wyszukuje rekursywnie przy użyciu dopasowywania wzorca. Zwraca wartość true, jeśli element istnieje; w przeciwnym wypadku zwraca wartość false.
pt_br: Pesquisa recursivamente usando Correspondência de Padrões. Retorna verdadeiro se existir; caso contrário, falso.
ru: Рекурсивный поиск при помощи сопоставления шаблонов. Возвращает значение True, если существует; в противном случае — значение False.
tr: Desen Eşleştirme kullanarak özyinelemeli olarak arar. Varsa true, aksi takdirde false döndürür.
zh_hans: 使用模式匹配进行递归搜索。如果存在，则返回 true，否则返回 false。
zh_hant: 使用模式比對進行遞迴搜尋。若存在即傳回 true; 否則傳回 false。

# CheckLeftSubtree
source: Check the left subtree.
cs: Zkontroluje levý podstrom.
de: Prüfen Sie die linke Unterstruktur.
es: Comprueba el subárbol de la izquierda.
fr: Vérifiez le sous-arbre gauche.
it: Verifica il sottoalbero di sinistra.
ja: 左側のサブツリーを確認します。
ko: 왼쪽 하위 트리를 확인합니다.
pl: Sprawdź lewe poddrzewo.
pt_br: Verifique a subárvore à esquerda.
ru: Проверка левого поддерева.
tr: Sol alt ağacı denetleyin.
zh_hans: 检查左子树。
zh_hant: 請檢查左樹狀子結構。
