Repository: dotnet/fsharp
Catalog: vsintegration/ProjectTemplates/TutorialProject/Template/xlf/Tutorial.fsx.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Pipes-Line5
source: To learn more about Partial Application, see: https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/functions/#partial-application-of-arguments
ko: 부분 애플리케이션에 대해 자세히 알아보려면 다음을 참조하세요. https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/functions/#partial-application-of-arguments

# Lists-Line4
source: To learn more, see: https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/lists
ko: 자세히 알아보려면 다음을 참조하세요. https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/lists

# Arrays-Line4
source: To learn more, see: https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/arrays
ko: 자세히 알아보려면 다음을 참조하세요. https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/arrays

# ArrayAssignment-Line2
source: To learn more about this operator, see: https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/values/index#mutable-variables
ko: 이 연산자에 대해 자세히 알아보려면 다음을 참조하세요. https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/values/index#mutable-variables

# Sequences-Line5
source: To learn more, see: https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/sequences
ko: 자세히 알아보려면 다음을 참조하세요. https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/sequences

# RecursiveFunctions-Line4
source: To learn more, see: https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/functions/index#recursive-functions
ko: 자세히 알아보려면 https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/functions/index#recursive-functions를 참조하세요.

# Records-Line3
source: To learn more, see: https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/records
ko: 자세히 알아보려면 다음을 참조하세요. https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/records

# UpdateRecord-Line4
source: To learn more, see: https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/copy-and-update-record-expressions
ko: 자세히 알아보려면 다음을 참조하세요. https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/copy-and-update-record-expressions

# DiscriminatedUnions-Line3
source: To learn more, see: https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/discriminated-unions
ko: 자세히 알아보려면 다음을 참조하세요. https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/discriminated-unions

# PatternMatching-Line5
source: To learn more, see: https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/pattern-matching
ko: 자세히 알아보려면 다음을 참조하세요. https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/pattern-matching

# ActivePatterns-Line3
source: To learn more, see: https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/active-patterns
ko: 자세히 알아보려면 다음을 참조하세요. https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/active-patterns

# Option-Line4
source: To learn more, see: https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/options
ko: 자세히 알아보려면 다음을 참조하세요. https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/options

# UnitsOfMeasure-Line3
source: To learn more, see: https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/units-of-measure
ko: 자세히 알아보려면 다음을 참조하세요. https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/units-of-measure

# Classes-Line3
source: To learn more about Classes, see: https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/classes
ko: 클래스에 대해 자세히 알아보려면 다음을 참조하세요. https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/classes

# Classes-Line4
source: To learn more about Members, see: https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/members
ko: 멤버에 대해 자세히 알아보려면 다음을 참조하세요. https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/members

# GenericClasses-Line3
source: To learn more, see: https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/generics/
ko: 자세히 알아보려면 다음을 참조하세요. https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/generics/

# Interfaces-Line3
source: To learn more, see: https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/interfaces
ko: 자세히 알아보려면 다음을 참조하세요. https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/interfaces

# Events-Line2
source: To learn more, see: https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/members/events
ko: 자세히 알아보려면 다음을 참조하세요. https://learn.microsoft.com/en-us/dotnet/articles/fsharp/language-reference/members/events

# ArrayAssignment-Line1
source: You can modify the contents of an array element by using the left arrow assignment operator.
fr: Vous pouvez modifier le contenu d'un élément de tableau à l'aide de l'opérateur d'assignation flèche gauche.

# CardRank
source: A Discriminated Union can also be used to represent the rank of a playing card.
fr: Une union discriminée peut également servir à représenter le rang d'une carte à jouer.

# CardType-Line2
source: It's common to use both Records and Discriminated Unions when representing data.
fr: Il est fréquent d'utiliser à la fois des enregistrements et des unions discriminées pour représenter des données.

# DuRecursiveDef-Line1
source: Discriminated Unions also support recursive definitions.
fr: Les unions discriminées prennent également en charge les définitions récursives.
