Repository: dotnet/fsharp
Catalog: vsintegration/ProjectTemplates/TutorialProject/Template/xlf/Tutorial.fsx.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Lists-Line2
source: This module shows various ways to generate lists and process lists with some functions
cs: Tento modul zobrazuje různé způsoby, jak generovat seznamy a jak je zpracovat pomocí některých funkcí
de: Dieses Modul zeigt verschiedene Möglichkeiten zum Erstellen von Listen und Prozesslisten mit einigen Funktionen
es: Este módulo muestra varias formas de generar listas y procesarlas con algunas funciones
fr: Ce module montre différentes façons de générer et de traiter des listes à l'aide de fonctions
it: Questo modulo mostra diversi modi per generare elenchi ed elenchi i processi con alcune funzioni
ja: このモジュールは、リストを生成し、F# コア ライブラリ内の 'List' モジュールに含まれる
ko: 이 모듈에서는 F# 주요 라이브러리의 'List' 모듈에 있는 일부 함수를 사용하여 목록을 생성하고
pl: Ten moduł pokazuje różne sposoby generowania list i ich przetwarzania przy użyciu niektórych funkcji
pt_br: Este módulo mostra várias formas de gerar listas e listas de processo com algumas funções
ru: Этот модуль демонстрирует различные способы создания и обработки списков при помощи некоторых функций
tr: Bu modül, liste oluşturmanın çeşitli yollarını gösterir ve listeleri F# Core Kitaplığı'ndaki
zh_hans: 本模块介绍使用某些函数生成列表和处理列表的各种方法
zh_hant: 此模組示範產生清單及利用某些函式處理清單的各種方法

# Lists-Line3
source: in the 'List' module in the F# Core Library.
cs: v modulu List v knihovně F# Core.
de: im Modul "List" in der F#-Kernbibliothek.
es: en el módulo "List" de la biblioteca principal de F#.
fr: du module 'List' de la bibliothèque principale F#.
it: nel modulo 'List' della libreria di base di F#.
ja: いくつかの関数を使用してリストを処理するためのさまざまな方法を示しています。
ko: 목록을 처리하는 다양한 방법을 보여 줍니다.
pl: w module „Lista” w bibliotece podstawowej języka F#.
pt_br: no módulo 'Lista' na Biblioteca Principal de F#.
ru: в модуле List основной библиотеки F#.
tr: 'List' modülünde yer alan işlevlerle işler.
zh_hans: 在 F# 核心库的 "List" 模块中。
zh_hant: 在 F# 核心程式庫的 'List' 模組中。

# Lists-Line4
source: To learn more, see: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/lists
cs: Další informace najdete tady: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/lists
es: Para obtener más información, consulte: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/lists
fr: Pour en savoir plus, consultez : https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/lists
pl: Aby dowiedzieć się więcej, zobacz: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/lists
ru: Подробности: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/lists

# ListEmptyDefinition
source: Lists are defined using [ ... ]. This is an empty list.
cs: Seznamy se definují pomocí syntaxe [ ... ]. Toto je prázdný seznam.
de: Listen werden mithilfe von "[ ... ]" definiert. Dies ist eine leere Liste.
es: Las listas se definen mediante [ ... ]. Esta es una lista vacía.
fr: Les listes sont définies à l'aide de [ ... ]. Il s'agit d'une liste vide.
it: Per definire gli elenchi si usa [ ... ]. Questo è un elenco vuoto.
ja: リストは [ ... ] を使用して定義されます。これは空のリストです。
ko: 목록은 [ ... ]을 사용하여 정의됩니다. 이것은 빈 목록입니다.
pl: Listy definiuje się za pomocą zapisu [ ... ]. To jest pusta lista.
pt_br: As listas são definidas usando [ ... ]. Esta é uma lista vazia.
ru: Списки определяются с помощью [ ... ]. Это пустой список.
tr: Listeler [ ... ] kullanılarak tanımlanır. Bu boş bir listedir.
zh_hans: 使用 [ ... ] 定义列表。这是空列表。
zh_hant: 清單使用 [ ... ] 定義。這是空白清單。

# ListElementDefinition
source: This is a list with 3 elements. ';' is used to separate elements on the same line.
cs: Toto je seznam se 3 elementy. K oddělení prvků na stejném řádku se používá středník (;).
de: Dies ist eine Liste mit drei Elementen. ";" dient dazu, Elemente in der gleichen Zeile zu trennen.
es: Esta es una lista de 3 elementos. Se utiliza ";" para separar los elementos que están en la misma línea.
fr: Il s'agit d'une liste avec 3 éléments. ';' permet de séparer des éléments sur la même ligne.
it: Questo è un elenco con tre elementi. Per delimitare gli elementi sulla stessa riga, viene usato il punto e virgola (';').
ja: これは 3 つの要素を含むリストです。';' は同じ行にある要素を区切るために使用されます。
ko: 3개 요소가 포함된 목록입니다. 동일한 줄에서 ';'을 사용하여 요소를 구분합니다.
pl: Jest to lista z 3 elementami. Znak „;” oddziela elementy w tym samym wierszu.
pt_br: Esta é uma lista com 3 elementos. ';' é usado para separar elementos na mesma linha.
ru: Это — список с тремя элементами. Символ ";" используется для разделения элементов в одной строке.
tr: Bu, 3 öğeden oluşan bir listedir. ';' aynı satırdaki öğeleri ayırmak için kullanılır.
zh_hans: 这是一个包含 3 个元素的列表。";" 用于分隔同一行的元素。
zh_hant: 這是內含 3 個項目的清單。使用 ';' 分隔同一行的項目。

# ListNewlineElements
source: You can also separate elements by placing them on their own lines.
cs: Elementy můžete oddělit i jejich umístěním na samostatné řádky.
de: Sie können Elemente auch trennen, indem Sie sie in separaten Zeilen einfügen.
es: También puede separar los elementos poniendo cada uno en su propia línea.
fr: Vous pouvez également séparer des éléments en les plaçant chacun sur une ligne.
it: È anche possibile delimitare gli elementi posizionandoli su righe distinte.
ja: 要素は、それぞれの行に配置することで分割することもできます。
ko: 요소를 다른 줄에 배치하여 요소를 구분할 수도 있습니다.
pl: Możesz również oddzielić elementy przez umieszczenie ich w osobnych wierszach.
pt_br: Você também pode separar elementos colocando-os em suas próprias linhas.
ru: Элементы можно также разделить, поместив их в отдельные строки.
tr: Öğeleri, ayrı satırlara yerleştirerek de ayırabilirsiniz.
zh_hans: 也可通过将各元素放在其自身行来分隔。
zh_hant: 您也可以將項目放在各自的行上加以分隔。

# NumberList2
source: This is a list of integers from 1 to 1000
cs: Toto je seznam celých čísel od 1 do 1000
de: Dies ist eine Liste mit ganzen Zahlen von 1 bis 1000.
es: Esta es una lista de enteros del 1 al 1000
fr: Il s'agit de la liste des entiers de 1 à 1 000
it: Questo è un elenco di numeri interi tra 1 e 1000
ja: これは 1 ～ 1000 の整数のリストです
ko: 이것은 1에서 1000까지의 정수 리스트입니다.
pl: To jest lista liczb całkowitych z zakresu od 1 do 1000
pt_br: Esta é uma lista de inteiros de 1 a 1.000
ru: Это список целых чисел от 1 до 1000.
tr: Bu, 1'den 1000'e kadar olan tamsayıların listesidir
zh_hans: 这是从 1 到 1000 的整数列表
zh_hant: 此為從 1 到 1000 的整數清單

# ListComputation-Line1
source: Lists can also be generated by computations. This is a list containing
cs: Seznamy je možné generovat pomocí výpočtů. Toto je seznam obsahující
de: Listen können auch mithilfe von Berechnungen generiert werden. Dies ist eine Liste mit
es: Las listas también pueden generarse mediante cálculos. Esta es una lista que contiene
fr: Les listes peuvent également être générées par calculs. Il s'agit d'une liste contenant
it: Gli elenchi possono anche essere generati da calcoli. Questo è un elenco contenente
ja: リストは計算によっても生成できます。これは、次を含むリストです:
ko: 리스트는 계산에 의해서도 생성될 수 있습니다. 다음은
pl: Listy można także generować za pomocą obliczeń. To jest lista zawierająca
pt_br: Listas também podem ser geradas pelos cálculos. Esta é uma lista contendo
ru: Списки также могут создаваться в результате вычислений. Это список, содержащий
tr: Listeler ayrıca hesaplamalar aracılığıyla da üretilebilir. Bu, yılın tüm
zh_hans: 也可通过计算来生成列表。此列表包含
zh_hant: 計算也可產生清單。此清單內含

# ListComputation-Line2
source: all the days of the year.
cs: všechny dny v roce.
de: allen Tagen des Jahres.
es: todos los días del año.
fr: tous les jours de l'année.
it: tutti i giorni dell'anno.
ja: 1 年のすべての日。
ko: 연중 모든 날짜를 포함하는 리스트입니다.
pl: wszystkie dni roku.
pt_br: todos os dias do ano.
ru: все дни года.
tr: günlerini içeren bir listedir.
zh_hans: 一年的所有天。
zh_hant: 當年每一天。

# PrintList2
source: Print the first 5 elements of 'daysList' using 'List.take'.
cs: Vytiskněte prvních 5 elementů daysList pomocí List.take.
de: Drucken Sie mithilfe von "List.take" die ersten fünf Elemente in "daysList".
es: Imprime los 5 primeros elementos de "daysList" usando "List.take".
fr: Imprimez les 5 premiers éléments de 'daysList' en utilisant 'List.take'.
it: Stampa i primi cinque elementi di 'daysList' usando 'List.take'.
ja: 'List.take' を使用して 'daysList' の最初の 5 つの要素を出力します。
ko: 'daysList'의 처음 5개 요소를 'List.take'를 사용하여 인쇄합니다.
pl: Wydrukuj 5 pierwszych elementów listy „daysList” przy użyciu wyrażenia „List.take”.
pt_br: Imprima os primeiros cinco elementos de 'daysList' usando 'List.take'.
ru: Вывод первых пяти элементов daysList при помощи List.take.
tr: 'List.take' kullanarak 'daysList'in ilk 5 öğesini yazdırın.
zh_hans: 使用 "List.take" 打印 "daysList" 的前 5 个元素。
zh_hant: 使用 'List.take' 列印 'daysList' 的前 5 個項目。

# ListComputationConditional-Line1
source: Computations can include conditionals. This is a list containing the tuples
cs: Výpočty můžou obsahovat podmíněné výrazy. Toto je seznam obsahující řazené kolekce členů
de: Berechnungen können Bedingungen enthalten. Dies ist eine Liste mit den Tupeln,
es: Los cálculos pueden incluir condicionales. Esta es una lista que contiene las tuplas
fr: Les calculs peuvent inclure des conditions. Il s'agit d'une liste contenant les tuples
it: I calcoli possono contenere istruzioni condizionali. Questo è un elenco contenente le tuple
ja: 計算には条件を含めることができます。これはタプルを含むリストです
ko: 계산은 조건을 포함할 수 있습니다. 다음은
pl: Obliczenia mogą obejmować wyrażenia warunkowe. To jest lista zawierająca krotki
pt_br: Cálculos podem incluir condicionais. Esta é uma lista contendo as tuplas
ru: Вычисления могут включать условные выражения. Это список, содержащий кортежи
tr: Hesaplamalar, koşullu deyimler içerebilir. Bu, bir satranç tahtasındaki siyah karelerin
zh_hans: 计算可以包括条件。这是包含元组的列表
zh_hant: 計算可包含條件。此為內含元組的清單

# ListComputationConditional-Line2
source: which are the coordinates of the black squares on a chess board.
cs: což jsou souřadnice černých polí na šachovnici.
de: bei denen es sich um die Koordinaten der schwarzen Felder auf einem Schachbrett handelt.
es: que son las coordenadas de los cuadrados negros de un tablero de ajedrez.
fr: qui sont les coordonnées des cases noires d'un échiquier.
it: che rappresentano le coordinate dei quadrati neri su una scacchiera.
ja: チェス盤の黒いマス目の座標のタプルを含むリストです。
ko: 체스 보드에서 검은색 칸의 좌표를 가리키는 튜플이 포함된 리스트입니다.
pl: które są współrzędnymi czarnych kwadratów na szachownicy.
pt_br: que são as coordenadas dos quadrados pretos em um tabuleiro de xadrez.
ru: являющиеся координатами черных квадратов на шахматной доске.
tr: koordinatları olan demetleri içeren bir listedir.
zh_hans: 这是棋盘上黑色方格的坐标。
zh_hant: 其為棋盤上黑方格的座標。

# ListMap-Line1
source: Lists can be transformed using 'List.map' and other functional programming combinators.
cs: Seznamy se dají transformovat pomocí souboru List.map a dalších funkčních programových kombinátorů.
de: Listen können mithilfe von "List.map" und anderen funktionalen Programmierkombinatoren umgewandelt werden.
es: Las listas se pueden transformas mediante "List.map" y otros combinadores de programación funcionales.
fr: Les listes peuvent être transformées à l'aide de 'List.map' et d'autres combinateurs de programmation fonctionnelle.
it: Per trasformare gli elenchi, è possibile usare 'List.map' e altri combinatori di programmazione funzionale.
ja: リストは 'List.map' と他の関数型プログラミング連結子を使用して変換することができます。
ko: 리스트는 'List.map' 및 기타 함수 프로그래밍 조합기를 사용하여 변환될 수 있습니다.
pl: Listy można przekształcać za pomocą elementu „List.map” i innych kombinatorów programowania funkcjonalnego.
pt_br: Listas podem ser transformadas usando 'List. map' e outros combinadores de programação funcional.
ru: Списки можно преобразовывать с помощью List.map и других методов объединения, применяемых в функциональном программировании.
tr: Listeler, 'List.map' ve diğer işlevsel programlama birleştiricileri kullanılarak dönüştürülebilir.
zh_hans: 列表可使用 "List.map" 和其他函数编程连结符进行转换。
zh_hant: 可以使用 'List.map' 及其他函式程式設計結合器轉換清單。

# ListMap-Line2
source: This definition produces a new list by squaring the numbers in numberList, using the pipeline
cs: Tato definice vytvoří nový seznam vypočítáním druhých mocnin hodnot v seznamu numberList pomocí kanálu
de: Diese Definition erzeugt eine neue Liste, indem die Zahlen in "numberList" quadriert werden. Dabei wird der Pipeline
es: Esta definición genera una nueva lista al elevar al cuadrado los números incluidos en numberList y usa el operador
fr: Cette définition produit une nouvelle liste en mettant au carré les nombres de numberList à l'aide de
it: Questa definizione consente di produrre un nuovo elenco mediante la quadratura dei numeri in numberList, usando l'operatore pipeline
ja: この定義は、パイプラインを使用して numberList 内の数値を 2 乗することによって新しいリストを生成します
ko: 이 정의는 인수를 List.map으로 전달하기 위해 파이프라인 연산자를 사용하여 numberList의 숫자를
pl: Ta definicja umożliwia utworzenie nowej listy przez podniesienie do kwadratu elementów na liście numberList za pomocą potoku
pt_br: Essa definição produz uma nova lista ao elevar ao quadrado os números em numberList, usando o pipeline
ru: Это определение создает новый список путем возведения в квадрат чисел из numberList с помощью конвейера.
tr: Bu tanım, numberList içindeki sayıların karelerini alıp, List.map'e bir bağımsız değişken geçirmek üzere
zh_hans: 此定义通过使用管道将 numberList 中的数字进行平方运算来生成新列表
zh_hant: 此定義會產生新的清單，方法是使用管線使 numberList 中的數字成平方

# ListMap-Line3
source: operator to pass an argument to List.map.
cs: operátor pro předání argumentu do souboru List.map.
de: Operator verwendet, um ein Argument an "List.map" zu übergeben.
es: de canalización para pasar un argumento a List.map.
fr: l'opérateur du pipeline pour passer un argument à List.map.
it: per passare un argomento a List.map.
ja: 引数を List.map に渡す演算子です。
ko: 제곱하여 새 리스트를 생성합니다.
pl: operatora, aby przekazać argument do elementu List.map.
pt_br: operador para passar um argumento para List.map.
ru: оператор для передачи аргумента в List.map.
tr: komut zinciri işlecini kullanarak yeni bir liste oluşturur.
zh_hans: 将参数传递给 List.map 的运算符。
zh_hant: 運算子以將引數傳遞到 List.map。

# ListFilter-Line1
source: There are many other list combinations. The following computes the sum of the squares of the
cs: Existuje mnoho dalších kombinací seznamů. Následující kód vypočítá součet druhých mocnin
de: Es stehen noch viele andere Listenkombinationen zur Verfügung. Mit dem Folgenden wird die Summe der Quadrate der
es: Hay otras muchas combinaciones de listas. La siguiente, calcula la suma de los cuadrados de los
fr: Il existe de nombreuses autres combinaisons de listes. La combinaison suivante calcule la somme des carrés des
it: Esistono molte altre combinazioni di elenco. L'istruzione seguente calcola la somma dei quadrati dei
ja: 他に多くのリストの組み合わせがあります。次の二乗和をコンピューティングします:
ko: 다른 리스트 조합이 많이 있습니다. 다음은
pl: Istnieje wiele innych kombinacji listy. Następujący kod oblicza sumę kwadratów
pt_br: Há muitas outras combinações de lista. O exemplo a seguir computa a soma dos quadrados dos
ru: Существует множество других сочетаний списков. Приведенный ниже код вычисляет сумму квадратов.
tr: Başka birçok liste bileşimi daha vardır. Aşağıda, 3'e bölünebilen sayıların karelerinin
zh_hans: 还有许多其他列表组合。下面计算以下内容的平方和
zh_hant: 還有許多其他清單組合。以下會計算下項的平方總和:

# ListFilter-Line2
source: numbers divisible by 3.
cs: čísel dělitelných 3.
de: durch 3 teilbaren Zahlen berechnet.
es: números divisibles por 3.
fr: nombres divisibles par 3.
it: numeri divisibili per 3.
ja: 3 で割り切れる数。
ko: 3으로 나눠지는 수의 제곱의 합을 계산합니다.
pl: liczby podzielne przez 3.
pt_br: números divisíveis por 3.
ru: числа, кратные 3.
tr: toplamı hesaplanır.
zh_hans: 数字可被 3 整除。
zh_hant: 可由 3 整除的數字。

# Arrays-Line1
source: Arrays are fixed-size, mutable collections of elements of the same type.
cs: Pole jsou měnitelné kolekce s pevně stanovenou velikostí, které obsahují elementy stejného typu.
de: Arrays sind veränderliche Sammlungen fester Größe, die Elemente des gleichen Typs enthalten.
es: Las matrices son colecciones mutables de tamaño fijo de elementos del mismo tipo.
fr: Les tableaux sont des collections de taille fixe et mutables d'éléments du même type.
it: Le matrici sono raccolte modificabili di dimensioni fisse di elementi dello stesso tipo.
ja: 配列は、型が同じ要素の固定サイズの変更可能なコレクションです。
ko: 배열은 고정 크기이며 같은 형식의 요소로 구성된 변경 가능한 컬렉션입니다.
pl: Tablice to zmienialne kolekcje o stałym rozmiarze, w których zawierają się elementy tego samego typu.
pt_br: Matrizes são coleções de tamanho fixo, mutáveis de elementos do mesmo tipo.
ru: Массивы — это изменяемые коллекции фиксированного размера, содержащие элементы одного типа.
tr: Diziler, aynı türdeki sabit boyutlu, değiştirilebilir öğe koleksiyonlarıdır.
zh_hans: 数组是固定大小，同类型元素的可变集合。
zh_hant: 陣列是固定大小且類型相同的可變動項目集合。

# Arrays-Line2
source: Although they are similar to Lists (they support enumeration and have similar combinators for data processing),
cs: I když se podobají seznamům (podporují výčet a mají podobné kombinátory pro zpracování dat),
de: Sie ähneln Listen (sie unterstützen Enumeration und haben ähnliche Combinators für die Datenverarbeitung),
es: Aunque son parecidas a las listas (admiten enumeración y tienen combinadores parecidos para el procesamiento de datos),
fr: Bien qu'ils soient semblables aux listes (prise en charge de l'énumération et combinateurs similaires pour le traitement des données),
it: Anche se sono simili agli elenchi (supportano l'enumerazione e contengono combinatori simili per l'elaborazione dati),
ja: これらはリストと似ています (列挙型をサポートし、データ処理のための同様の連結子を備えています) が、
ko: 배열은 목록과 마찬가지로 열거형을 지원하고 데이터 처리를 위한 유사한 조합기를 사용하지만,
pl: Chociaż są podobne do list (obsługują wyliczenia i mają podobne kombinatory przetwarzania danych),
pt_br: Embora elas sejam semelhantes às Listas (eles dão suporte à enumeração e têm combinadores semelhantes para processamento de dados),
ru: Хотя они и похожи на списки (поддерживают перечисление и включают схожие методы объединения для обработки данных),
tr: Lists'e benzer olsalar da (numaralandırmayı desteklerler ve bilgi işlem için benzer birleştiricilere sahiptirler)
zh_hans: 尽管它们与列表相同(支持枚举，且具有用于数据处理的类似连接符)，
zh_hant: 陣列雖與清單 (支援列舉，並具有類似的結合器可用於資料處理) 相似，但

# Arrays-Line3
source: they are generally faster and support fast random access. This comes at the cost of being less safe by being mutable.
cs: jsou obecně rychlejší a podporují rychlý náhodný přístup. Nevýhodou je nižší zabezpečení, protože je možné je měnit.
de: sind im Allgemeinen jedoch schneller und unterstützen einen schnellen wahlfreien Zugriff. Dafür sind sie jedoch weniger sicher, da sie veränderlich sind.
es: suelen ser más rápidas y admitir acceso aleatorio rápido. A cambio, tiene el inconveniente de que es menos seguro porque es mutable.
fr: ils offrent généralement une vitesse accrue et prennent en charge l'accès aléatoire rapide. Ils sont toutefois moins sécurisés du fait de leur mutabilité.
it: sono in genere più veloci e supportano l'accesso casuale rapido. La maggiore velocità implica però una minore sicurezza perché questi elementi sono modificabili.
ja: 一般的により高速であり、高速ランダム アクセスをサポートしています。その代わり、変更可能であるため安全性が低下します。
ko: 배열은 일반적으로 더 빠르고 빠른 임의 액세스를 지원합니다. 변경이 가능하므로 덜 안전하다는 단점은 있습니다.
pl: ogólnie są szybsze i obsługują szybki dostęp losowy. Niemniej oznacza to mniejsze bezpieczeństwo związane z możliwością ich modyfikacji.
pt_br: elas geralmente são mais rápidas e dão suporte ao acesso aleatório rápido. Isso vem com o custo de ser menos seguro por ser mutável.
ru: они, как правило, быстрее и поддерживают быстрый случайный доступ. С другой стороны, они менее безопасны, так как изменяемы.
tr: genellikle daha hızlıdırlar ve hızlı rastgele erişimi desteklerler. Buna karşılık, değişken oldukları için daha az güvenlidirler.
zh_hans: 它们通常速度更快，且支持快速随机访问。代价是因为可变而不太安全。
zh_hant: 陣列通常比較快，而且支援快速隨機存取。但可變動的代價是安全性變低。

# Arrays-Line4
source: To learn more, see: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/arrays
cs: Další informace najdete v tématu: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/arrays
es: Para obtener más información, consulte: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/arrays
fr: Pour en savoir plus, consultez : https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/arrays
pl: Aby dowiedzieć się więcej, zobacz: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/arrays
ru: Подробности: https://learn.microsoft.com/dotnet/articles/fsharp/language-reference/arrays

# EmptyArray
source: This is The empty array. Note that the syntax is similar to that of Lists, but uses `[| ... |]` instead.
cs: Toto je prázdné pole. Všimněte si, že syntaxe je podobná seznamům, ale používá se [| ... |].
de: Dies ist das leere Array. Die Syntax ähnelt der von Listen, verwendet jedoch stattdessen "[| ... |]".
es: Esta es una matriz vacía. Observe que la sintaxis es parecida a la de las listas, pero utiliza "[| ... |]" en su lugar.
fr: Tableau vide. Notez que la syntaxe est semblable à celle des listes, mais '[| ... |]' est utilisé à la place.
it: Questa è la matrice vuota. Si noti che la sintassi è simile a quella degli elenchi, ma viene usato `[| ... |]`.
ja: これは空の配列です。構文はリストの構文と似ていますが、代わりに `[| ... |]` を使用することにご注意ください。
ko: 빈 배열입니다. 목록의 구문과 유사하지만 `[| ... |]`을 대신 사용합니다.
pl: To jest pusta tablica. Należy zauważyć, że składnia jest podobna do składni list, ale tutaj używa się zapisu „[| ... |]”.
pt_br: Esta é a matriz vazia. Observe que a sintaxe é semelhante à de Listas, mas usa '[| ... |]' em vez disso.
ru: Это — пустой массив. Обратите внимание, что синтаксис похож на синтаксис списков, но используются квадратные скобки "[| ... |]".
tr: Bu, boş dizidir. Söz diziminin Lists'e benzediğine ancak `[| ... |]` kullandığına dikkat edin.
zh_hans: 这是空数组。注意，语法与列表类似，但改用 `[| ... |]`。
zh_hant: 此為空白的陣列。請注意與清單前置詞相似的前置詞，請改用 `[| ... |]`。

# ArrayConstructionList
source: Arrays are specified using the same range of constructs as lists.
cs: Pole jsou definovaná pomocí stejného rozsahu konstruktorů jako seznamy.
de: Arrays werden mithilfe der gleichen Konstrukte angegeben wie Listen.
es: Las matrices se especifican con el mismo intervalo de construcciones que las listas.
fr: Les tableaux sont spécifiés à l'aide de la même plage de constructions que les listes.
it: Per specificare le matrici viene usato lo stesso intervallo di costrutti degli elenchi.
ja: 配列は、リストと同じコンストラクトの範囲を使用して指定されます。
ko: 배열은 리스트와 같은 범위의 구문을 사용하여 지정됩니다.
pl: Tablice określa się za pomocą tego samego zestawu konstrukcji co listy.
pt_br: Matrizes são especificadas usando o mesmo intervalo de construções usado em listas.
ru: Массивы задаются с помощью того же диапазона конструкций в виде списков.
tr: Diziler, listeler ile aynı yapı aralıkları kullanılarak belirtilir.
zh_hans: 使用与列表相同的构造范围来指定数组。
zh_hant: 使用與所列相同的建構範圍指定陣列。

# ArrayConstructionRange
source: This is an array of numbers from 1 to 1000.
cs: Toto je pole čísel od 1 do 1000.
de: Dies ist ein Array mit Zahlen von 1 bis 1000.
es: Esta es una matriz de números del 1 al 1000.
fr: Il s'agit d'un tableau de nombres de 1 à 1 000.
it: Questo è una matrice di numeri compresi tra 1 e 1000.
ja: これは 1 ～ 1000 の数値の配列です。
ko: 1에서 1000까지의 숫자 배열입니다.
pl: To jest tablica liczb z zakresu od 1 do 1000.
pt_br: Esta é uma matriz de números de 1 a 1.000.
ru: Это массив чисел от 1 до 1000.
tr: Bu, 1'den 1000'e kadar olan sayıların dizisidir.
zh_hans: 这是从 1 到 1000 的数字数组。
zh_hant: 這是從 1 到 1000 的數字陣列。
