Repository: dotnet/fsharp
Catalog: src/FSharp.DependencyManager.Nuget/xlf/FSDependencyManager.txt.*.xlf
Languages: cs, es, fr, ko, pt_br, tr

# cantReferenceSystemPackage
source: PackageManager can not reference the System Package '{0}'
cs: PackageManager se nemůže odkazovat na systémový balíček {0}.
es: PackageManager no puede hacer referencia al paquete del sistema "{0}".
fr: PackageManager ne peut pas référencer le package système '{0}'
ko: PackageManager에서 시스템 패키지 '{0}'을(를) 참조할 수 없습니다.
pt_br: PackageManager não pode referenciar o pacote do sistema '{0}'
tr: PackageManager, '{0}' Sistem Paketine başvuramıyor

# highestVersion
source: with the highest version
cs: s nejvyšší verzí
es: con la última versión
fr: avec la version la plus récente
ko: 최상위 버전으로
pt_br: com a versão mais recente
tr: en yüksek sürümle

# invalidTimeoutValue
source: Invalid value for timeout '{0}', valid values: none, -1 and integer milliseconds to wait
cs: Neplatná hodnota pro časový limit {0}. Platné hodnoty: none, -1 a celočíselný počet milisekund, po které se má počkat
es: Valor de tiempo de espera "{0}" no válido. Valores válidos: ninguno, -1 y un número entero de milisegundos de espera
fr: Valeur non valide pour le délai d'expiration : '{0}'. Valeurs valides : aucune valeur, -1 ou un nombre entier pour le délai d'attente en millisecondes
ko: 시간 제한 '{0}'의 값이 잘못되었습니다. 유효한 값: 없음, -1 및 정수 대기 시간(밀리초)
pt_br: Valor inválido para o tempo limite '{0}'. Valores válidos: none,-1 e milissegundos inteiros de espera
tr: Zaman aşımı için '{0}' değeri geçersiz, geçerli değerler: none, -1 ve tamsayı milisaniye cinsinden bekleme süresi

source: Load Nuget Package
cs: Načíst balíček NuGet
es: Cargar paquete NuGet
fr: Charger le package NuGet
ko: NuGet 패키지 로드
pt_br: Carregar Pacote NuGet
tr: NuGet Paketini Yükle

# missingTimeoutValue
source: Missing value for timeout
cs: Chybí hodnota pro časový limit
es: Falta un valor para el tiempo de espera
fr: Valeur manquante pour le délai d'expiration
ko: 시간 제한 값 누락
pt_br: Valor ausente para o tempo limite
tr: Zaman aşımı için değer eksik

source: Not used
cs: Nepoužito
es: No se usa
fr: Non utilisé
ko: 사용 안 함
pt_br: Não usado
tr: Kullanılmıyor

# requiresAValue
source: {0} requires a value
cs: {0} vyžaduje hodnotu.
es: {0} requiere un valor
fr: {0} nécessite une valeur
ko: {0}에는 값이 있어야 합니다.
pt_br: {0} requer um valor
tr: {0}, bir değer gerektiriyor

# sourceDirectoryDoesntExist
source: The source directory '{0}' not found
cs: Zdrojový adresář {0} se nenašel.
es: No se encuentra el directorio de origen "{0}".
fr: Le répertoire source '{0}' est introuvable
ko: 소스 디렉터리 '{0}'을(를) 찾을 수 없음
pt_br: O diretório de origem '{0}' não foi localizado
tr: '{0}' kaynak dizini bulunamadı

# timedoutResolvingPackages
source: Timed out resolving packages, process: '{0}' '{1}'
cs: Při řešení balíčků vypršel časový limit. Proces: {0} {1}
es: Se agotó el tiempo de espera en la resolución de paquetes, proceso: "{0}" "{1}"
fr: Expiration du délai de résolution des packages. Processus : '{0}' '{1}'
ko: 패키지를 확인하는 동안 시간이 초과되었습니다. 프로세스: '{0}' '{1}'
pt_br: Tempo limite atingido ao resolver os pacotes. Processo: '{0}' '{1}'
tr: Paketler çözümlenirken zaman aşımı gerçekleşti, işlem: '{0}' '{1}'

# unableToApplyImplicitArgument
source: Unable to apply implicit argument number {0}
cs: Nepovedlo se použít implicitní počet argumentů {0}.
es: No se puede aplicar el número de argumento implícito {0}.
fr: Impossible d'appliquer le numéro d'argument implicite {0}
ko: 암시적 인수 번호 {0}을(를) 적용할 수 없습니다.
pt_br: Não é possível aplicar o número do argumento implícito {0}
tr: Örtük bağımsız değişken sayısı ({0}) uygulanamıyor

source: version
cs: verze
es: versión
ko: 버전
pt_br: versão
tr: sürüm
