Repository: dotnet/fsharp
Catalog: src/Compiler/Interactive/xlf/FSIstrings.txt.*.xlf
Languages: cs, de, es, fr, it, ko, pl, pt_br, zh_hans

# fsiInternalAccess
source: Accessing the internal type, method or field '{0}' from a previous evaluation in F# Interactive is deprecated and may cause subsequent access errors. To enable the legacy generation of a single dynamic assembly that can access internals, use the '--multiemit-' option.
cs: Přístup k internímu typu, metodě nebo poli {0} z předchozího vyhodnocení ve F# Interactive je zastaralý a může způsobit následné chyby přístupu. Pokud chcete povolit starší generaci jednoho dynamického sestavení, které má přístup k interním sestavením, použijte možnost --multiemit-.
de: Der Zugriff auf den internen Typ, die Methode oder das Feld “{0}” aus einer vorherigen Auswertung in F# Interactive ist veraltet und kann zu nachfolgenden Zugriffsfehlern führen. Verwenden Sie die Option “--multiemit-”, um die Legacygenerierung einer einzelnen dynamischen Assembly zu aktivieren, die auf Interne zugreifen kann.
es: El acceso al tipo, método o campo interno “{0}” de una evaluación anterior en F# interactivo está en desuso y puede provocar errores de acceso posteriores. Para habilitar la generación heredada de un único ensamblado dinámico que pueda acceder a elementos internos, use la opción “--multiemit-”.
fr: L’accès au type interne, à la méthode ou au champ «{0}» d’une évaluation précédente dans F# Interactive est déconseillé et peut entraîner des erreurs d’accès ultérieures. Pour activer la génération héritée d’un assemblée dynamique unique qui peut accéder aux éléments internes, utilisez l’option « --multiemit- ».
it: L'accesso al tipo, al metodo o al campo interno '{0}' da una valutazione precedente in F# Interactive è deprecato e potrebbe causare errori di accesso successivi. Per abilitare la generazione legacy di un singolo assembly dinamico che può accedere agli elementi interni, usare l'opzione '--multiemit-'.
ko: F# 대화형의 이전 평가에서 내부 형식, 메서드 또는 필드 '{0}'에 액세스하는 것은 더 이상 사용되지 않으며 후속 액세스 오류가 발생할 수 있습니다. 내부에 액세스할 수 있는 단일 동적 어셈블리의 레거시 생성을 사용하도록 설정하려면 '--multiemit-' 옵션을 사용합니다.
pl: Uzyskiwanie dostępu do typu wewnętrznego, metody lub pola „{0}“ z poprzedniej oceny w programie F# Interactive jest przestarzałe i może powodować kolejne błędy dostępu. Aby włączyć starszą generację pojedynczego zestawu dynamicznego, który może uzyskiwać dostęp wewnętrzny, użyj opcji „--multiemit-“.
pt_br: O acesso ao tipo, método ou campo interno '{0}' de uma avaliação anterior em F# Interativo é preterido e pode causar erros de acesso subsequentes. Para habilitar a geração herdada de uma única assembly dinâmica que possa acessar os elementos internos, use a opção '--multiemit-'.
zh_hans: 已弃用从 F# 交互窗口的上一个评估中访问内部类型、方法或字段“{0}”，并可能导致后续访问错误。如果要启用可以访问内部的单个动态程序集的旧的生成，请使用 “--multiemit-” 选项。

# fsiIntroPackageSourceUriInfo
source: Include package source uri when searching for packages
cs: Při vyhledávání balíčků zahrnout identifikátor zdroje balíčku
de: URI der Paketquelle bei Suche nach Paketen einschließen
es: Incluir el URI de origen del paquete al buscar paquetes
fr: Inclure l'URI de source de package au moment de la recherche des packages
it: Includi l'URI di origine pacchetti durante la ricerca di pacchetti
ko: 패키지를 검색할 때 패키지 원본 URI 포함
pl: Uwzględnij identyfikator URI źródła pakietów podczas wyszukiwania pakietów
pt_br: Incluir o URI de origem do pacote ao pesquisar pacotes
zh_hans: 搜索包时包含包源 uri

# fsiMultiAssemblyEmitOptionOffByDefault
source: Emit multiple assemblies (off by default for .NET Framework)
cs: Vygenerovat více sestavení (pro .NET Framework je to ve výchozím nastavení vypnuto)
de: Ausgeben mehrerer Assemblys (standardmäßig deaktiviert für .NET Framework)
es: Emitir varios ensamblados (desactivado de forma predeterminada para .NET Framework)
fr: Émettre plusieurs assemblées (désactivé par défaut pour .NET Framework)
it: Creare più assembly (disattivato per impostazione predefinita per .NET Framework)
ko: 여러 어셈블리 내보내기(기본적으로 .NET Framework 해제)
pl: Emituj wiele zestawów (domyślnie wyłączone dla programu .NET Framework)
pt_br: Emitir várias montagens (desligadas por padrão para .NET Framework)
zh_hans: 发出多个程序集(默认情况下为 .NET Framework 关闭)

# fsiOperationCouldNotBeCompleted
source: Operation could not be completed due to earlier error
cs: Operaci nešlo dokončit z důvodu dřívější chyby.
de: Der Vorgang konnte aufgrund eines vorherigen Fehlers nicht abgeschlossen werden.
es: La operación no se pudo completar debido a un error anterior
fr: Impossible d'exécuter l'opération en raison d'une erreur antérieure
it: Non è stato possibile completare l'operazione a causa di un errore precedente
ko: 이전 오류로 인해 작업을 완료할 수 없습니다.
pl: Nie udało się ukończyć operacji z powodu wcześniejszego błędu
pt_br: Não foi possível concluir a operação devido a um erro anterior
zh_hans: 由于早期错误，无法完成操作

# fsiOperationFailed
source: Operation failed. The error text has been printed in the error stream. To return the corresponding FSharpDiagnostic use the EvalInteractionNonThrowing, EvalScriptNonThrowing or EvalExpressionNonThrowing
cs: Operace nebyla úspěšná. Text chyby se vytiskl do streamu chyb. Pokud chcete vrátit odpovídající FSharpDiagnostic, použijte EvalInteractionNonThrowing, EvalScriptNonThrowing nebo EvalExpressionNonThrowing.
de: Fehler beim Vorgang. Der Fehlertext wurde im Fehlerstream ausgegeben. Verwenden Sie "EvalInteractionNonThrowing", "EvalScriptNonThrowing" oder "EvalExpressionNonThrowing", um die entsprechende FSharpDiagnostic zurückzugeben.
es: Error en la operación. El texto del error se ha impreso en la secuencia de errores. Para devolver el valor FSharpDiagnostic correspondiente, use EvalInteractionNonThrowing, EvalScriptNonThrowing o EvalExpressionNonThrowing
fr: Échec de l'opération. Le texte d'erreur est affiché dans le flux d'erreur. Pour retourner le FSharpDiagnostic correspondant, utilisez EvalInteractionNonThrowing, EvalScriptNonThrowing ou EvalExpressionNonThrowing
it: L'operazione non è riuscita. Il testo dell'errore è stato stampato nel flusso degli errori. Per restituire l'elemento FSharpDiagnostic corrispondente, usare EvalInteractionNonThrowing, EvalScriptNonThrowing o EvalExpressionNonThrowing
ko: 작업이 실패했습니다. 오류 텍스트가 오류 스트림에 출력되었습니다. 해당 FSharpDiagnostic을 반환하려면 EvalInteractionNonThrowing, EvalScriptNonThrowing 또는 EvalExpressionNonThrowing을 사용하세요.
pl: Operacja nie powiodła się. Tekst błędu został umieszczony w strumieniu błędów. Aby zwrócić odpowiedni element FSharpDiagnostic, użyj elementu EvalInteractionNonThrowing, eEvalScriptNonThrowing lub EvalExpressionNonThrowing
pt_br: Falha na operação. O texto do erro foi impresso no fluxo de erros. Para retornar o FSharpDiagnostic correspondente, use EvalInteractionNonThrowing, EvalScriptNonThrowing ou EvalExpressionNonThrowing
zh_hans: 操作失败。错误文本已在错误流中打印。若要返回相应的 FSharpDiagnostic，请使用 EvalInteractionNonThrowing、EvalScriptNonThrowing 或 EvalExpressionNonThrowing

# fsiMultiAssemblyEmitOption
source: Emit multiple assemblies (on by default)
cs: Vygenerovat více sestavení (ve výchozím nastavení zapnuto)
de: Ausgeben mehrerer Assemblys (standardmäßig aktiviert)
es: Emitir varios ensamblados (activado de forma predeterminada)
fr: Émettre plusieurs assemblées (activés par défaut)
it: Creare più assembly (attivato per impostazione predefinita)
ko: 여러 어셈블리 내보내기(기본적으로 켜져 있음)
pl: Emituj wiele zestawów (domyślnie włączone)
pt_br: Emitir várias montagens (ativadas por padrão)
zh_hans: 发出多个程序集(默认打开)

# stoppedDueToError
source: Stopped due to error\n
cs: Zastavilo se kvůli chybě.\n
de: Aufgrund eines Fehlers beendet\n
es: Detenido debido a un error.\n
fr: Arrêt en raison d'une erreur\n
it: Interruzione a causa di un errore\n
ko: 오류 때문에 중지되었습니다.\n
pl: Zatrzymano ze względu na błąd\n
pt_br: Interrompido devido a erro\n
zh_hans: 已因出错而停止\n

# fsiUsage
source: Usage: {0} <options> [script.fsx [<arguments>]]
cs: Použití: {0} <možnosti> [script.fsx [<argumenty>]]
de: Verwendung: {0} <Optionen> [script.fsx [<arguments>]]
es: Uso: {0} <opciones> [script.fsx [<argumentos>]]
fr: Utilisation : {0} <options> [script.fsx [<arguments>]]
it: Utilizzo: {0} <opzioni> [script.fsx [<argomenti>]]
ko: 사용법: {0} <옵션> [script.fsx [<인수>]]
pl: Użycie: {0} <opcje> [script.fsx [<argumenty>]]
pt_br: Uso: {0} <options> [script.fsx [<arguments>]]
zh_hans: 用法: {0} <options> [script.fsx [<arguments>]]

# fsiInputFiles
source: - INPUT FILES -
cs: - VSTUPNÍ SOUBORY -
de: - EINGABEDATEIEN -
es: - ARCHIVOS DE ENTRADA -
fr: - FICHIERS D'ENTRÉE -
it: - FILE DI INPUT -
ko: - 입력 파일 -
pl: - PLIKI WEJŚCIOWE -
pt_br: - ARQUIVOS DE ENTRADA -
zh_hans: - 输入文件 -

# fsiCodeGeneration
source: - CODE GENERATION -
cs: - GENEROVÁNÍ KÓDU -
de: - CODEGENERIERUNG -
es: - GENERACIÓN DE CÓDIGO -
fr: - GÉNÉRATION DE CODE -
it: - GENERAZIONE CODICE -
ko: - 코드 생성 -
pl: - GENEROWANIE KODU -
pt_br: - GERAÇÃO DE CÓDIGO -
zh_hans: - 代码生成 -

# fsiErrorsAndWarnings
source: - ERRORS AND WARNINGS -
cs: - CHYBY A UPOZORNĚNÍ -
de: - FEHLER UND WARNUNGEN -
es: - ERRORES Y ADVERTENCIAS -
fr: - ERREURS ET AVERTISSEMENTS -
it: - ERRORI E AVVISI -
ko: - 오류 및 경고 -
pl: - BŁĘDY I OSTRZEŻENIA -
pt_br: - ERROS E AVISOS -
zh_hans: - 错误和警告 -

# fsiLanguage
source: - LANGUAGE -
cs: - JAZYK -
de: - SPRACHE -
es: - LENGUAJE -
fr: - LANGAGE -
it: - LINGUAGGIO -
ko: - 언어 -
pl: - JĘZYK -
pt_br: - LINGUAGEM -
zh_hans: - 语言 -

# fsiMiscellaneous
source: - MISCELLANEOUS -
cs: - RŮZNÉ -
de: - VERSCHIEDENES -
es: - VARIOS -
fr: - DIVERS -
it: - VARIE -
ko: - 기타 -
pl: - RÓŻNE -
pt_br: - DIVERSOS -
zh_hans: - 杂项 -

# fsiAdvanced
source: - ADVANCED -
cs: - UPŘESNIT -
de: - ERWEITERT -
es: - AVANZADAS -
fr: - AVANCÉ -
it: - AVANZATE -
ko: - 고급 -
pl: - ZAAWANSOWANE -
pt_br: - AVANÇADO -
zh_hans: - 高级 -

# fsiExceptionRaisedStartingServer
source: Exception raised when starting remoting server.\n{0}
cs: Při spouštění serveru vzdálené komunikace se vyvolala výjimka.\n{0}
de: Ausnahme beim Starten des Remoteservers.\n{0}
es: Se generó una excepción al iniciar el servidor remoto.\n{0}
fr: Exception déclenchée lors du démarrage du serveur de communication à distance.\n{0}
it: Eccezione all'avvio del server remoto.\n{0}
ko: 원격 서버를 시작하는 동안 예외가 발생했습니다.\n{0}
pl: Wystąpił wyjątek podczas uruchamiania serwera usług zdalnych.\n{0}
pt_br: Exceção levantadas ao iniciar o servidor remoto.\n{0}
zh_hans: 启动远程处理服务器时发生异常。\n{0}

# fsiUse
source: Use the given file on startup as initial input
cs: Použít při spuštění zadaný soubor jako počáteční vstup
de: Die angegebene Datei beim Start als ursprüngliche Eingabe verwenden
es: Usar el archivo proporcionado al inicio como entrada inicial
fr: Utilise le fichier spécifié au démarrage en tant qu'entrée initiale
it: Usa il file specificato all'avvio come input iniziale
ko: 시작 시 지정된 파일을 초기 입력으로 사용합니다.
pl: Użyj danego pliku przy uruchamianiu jako początkowych danych wejściowych
pt_br: Use o arquivo fornecido na inicialização como entrada inicial
zh_hans: 在启动时使用给定文件作为初始输入

# fsiLoad
source: #load the given file on startup
cs: #load zadaného souboru při spuštění
de: #load der angegebenen Datei beim Start
es: #load Cargar el archivo proporcionado al inicio
fr: #load le fichier spécifié au démarrage
it: #load file specificato all'avvio
ko: #load: 시작할 때 지정된 파일을 로드합니다.
pl: #load załaduj dany plik przy uruchamianiu
pt_br: #load o arquivo dado na inicialização
zh_hans: #load 在启动时给定的文件

# fsiRemaining
source: Treat remaining arguments as command line arguments, accessed using fsi.CommandLineArgs
cs: Zpracovat zbývající argumenty jako argumenty příkazového řádku, ke kterým se přistupuje pomocí fsi.CommandLineArgs
de: Verbleibende Argumente als Befehlszeilenargumente (Zugriff mithilfe von fsi.CommandLineArgs) behandeln
es: Tratar los demás argumentos como argumentos de la línea de comandos, a los que se obtiene acceso con fsi.CommandLineArgs
fr: Traite les arguments restants en tant qu'arguments de ligne de commande, accessibles via fsi.CommandLineArgs
it: Tratta gli argomenti rimanenti come argomenti della riga di comando accessibili mediante fsi.CommandLineArgs
ko: 나머지 인수를 fsi.CommandLineArgs를 사용하여 액세스하는 명령줄 인수로 처리합니다.
pl: Traktuj pozostałe argumenty jak argumenty wiersza polecenia, do których uzyskano dostęp przy użyciu elementu fsi.CommandLineArgs
pt_br: Tratar argumentos restantes como argumentos de linha de comando acessados através de fsi.CommandLineArgs
zh_hans: 将剩余参数视为可使用 fsi.CommandLineArgs 访问的命令行参数

# fsiHelp
source: Display this usage message (Short form: -?)
cs: Zobrazí tuto zprávu o použití (krátký tvar: -?).
de: Diesen Hilfetext anzeigen (Kurzform: -?)
es: Muestra este mensaje de uso (forma corta: -?)
fr: Affiche ce message d'utilisation (forme abrégée : -?)
it: Visualizza questo messaggio relativo all'uso (forma breve: -?)
ko: 이 사용법 메시지를 표시합니다(약식: -?).
pl: Wyświetl ten komunikat dotyczący składni (krótka wersja: -?)
pt_br: Exibir esta mensagem de uso (Forma abreviada: -?)
zh_hans: 显示此用法消息(缩写为: -?)

# fsiExec
source: Exit fsi after loading the files or running the .fsx script given on the command line
cs: Ukončit soubor fsi po načtení souborů nebo spuštění skriptu .fsx zadaného na příkazovém řádku
de: FSI nach Laden der Dateien oder Ausführen des in der Befehlszeile angegebenen .fsx-Skripts beenden
es: Salir de fsi después de cargar los archivos o ejecutar el script .fsx proporcionado en la línea de comandos
fr: Sortie de fsi après le chargement des fichiers ou l'exécution du script .fsx spécifié dans la ligne de commande
it: Uscita da fsi dopo il caricamento dei file o l'esecuzione dello script .fsx specificato nella riga di comando
ko: 파일을 로드한 후 또는 명령줄에 지정된 .fsx 스크립트를 실행한 후 fsi를 종료하세요.
pl: Po załadowaniu plików lub uruchomieniu skryptu .fsx podanego w wierszu polecenia zakończ działanie programu fsi
pt_br: Feche fsi após o carregamento dos arquivos ou execução do script .fsx fornecido na linha de comando
zh_hans: 在加载文件或在命令行上运行给定的 .fsx 脚本之后退出 fsi

# fsiGui
source: Execute interactions on a Windows Forms event loop (on by default)
cs: Provést interakce u smyčky událostí modelu Windows Forms (ve výchozím nastavení zapnuté)
de: Interaktionen in einer Windows Forms-Ereignisschleife ausführen (standardmäßig aktiviert)
es: Ejecutar interacciones en un bucle de evento de Windows Forms (activado de forma predeterminada)
fr: Exécute des interactions dans une boucle d'événements Windows Forms (activé par default)
it: Esegue interazioni in un ciclo di eventi di Windows Forms (abilitata per impostazione predefinita)
ko: Windows Forms 이벤트 루프에서 상호 작용을 실행합니다(기본값: 설정).
pl: Wykonaj interakcje w pętli zdarzenia Windows Forms (domyślnie włączone)
pt_br: Execute interações em um loop de eventos do Windows Forms (por padrão)
zh_hans: 在 Windows 窗体事件循环中执行交互(默认情况下启用)

# fsiQuiet
source: Suppress fsi writing to stdout
cs: Potlačit zapisování fsi do stdout
de: Schreiben von FSI in stdout unterdrücken
es: Suprimir escritura fsi en stdout
fr: Supprime l'écriture de fsi dans stdout
it: Impedisci scrittura fsi su stdout
ko: fsi에서 stdout에 쓰지 않습니다.
pl: Pomiń zapisywanie przez program fsi w stdout
pt_br: Suprimir fsi gravando ao stdout
zh_hans: 禁止 fsi 写入到 stdout

# fsiReadline
source: Support TAB completion in console (on by default)
cs: Podpora dokončování pomocí tabulátorů v konzole (ve výchozím nastavení zapnuté)
de: Vervollständigung mit der TAB-TASTE in der Konsole unterstützen (standardmäßig aktiviert)
es: Admitir finalización con TAB en la consola (activada de forma predeterminada)
fr: Prend en charge la saisie semi-automatique via la touche Tab dans la console (activée par défaut)
it: Supporta completamento con tasto TAB in console (abilitata per impostazione predefinita)
ko: 콘솔에서 Tab 키 완성 기능을 지원합니다(기본값: 설정).
pl: Obsługa uzupełniania po naciśnięciu klawisza TAB w konsoli (domyślnie włączona)
pt_br: Suportar a conclusão TAB no console (por padrão)
zh_hans: 支持控制台中的 Tab 完成操作(默认情况下启用)

# fsiEmitDebugInfoInQuotations
source: Emit debug information in quotations
cs: Generovat ladicí informace v uvozovkách
de: Debugginginformationen in Anführungszeichen ausgeben
es: Emitir información de depuración en expresiones de código delimitadas
fr: Émettre les informations de débogage entre quotations
it: Crea informazioni di debug in quotation
ko: 인용구의 디버그 정보를 내보냅니다.
pl: Emituj informacje debugowania w cudzysłowach
pt_br: Emitir informações de depuração entre aspas
zh_hans: 发出用引号引起来的调试信息

# fsiBanner3
source: For help type #help;;
cs: Nápovědu zobrazíte zadáním #help;;
de: Um Hilfe zu erhalten, geben Sie "#help;;" ein.
es: Para obtener ayuda, escriba #help;;
fr: Pour obtenir de l'aide, tapez #help;;
it: Per informazioni, digitare #help;;
ko: 도움말을 보려면 #help;;를 입력하세요.
pl: Aby uzyskać pomoc, wpisz #help;;
pt_br: Para ajuda digite #help;;
zh_hans: 若要获得帮助，请键入 #help;;

# fsiConsoleProblem
source: A problem occurred starting the F# Interactive process. This may be due to a known problem with background process console support for Unicode-enabled applications on some Windows systems. Try selecting Tools->Options->F# Interactive for Visual Studio and enter '--fsi-server-no-unicode'.
cs: Při spouštění procesu F# Interactive došlo k potížím. Může to být způsobené známým problémem s podporou procesů na pozadí v konzole pro aplikace podporující Unicode v některých systémech Windows. Zkuste vybrat Nástroje -> Možnosti -> F# Interactive pro Visual Studio a zadat --fsi-server-no-unicode.
de: Beim Starten des F# Interactive-Prozesses ist ein Fehler aufgetreten. Ursache hierfür kann ein bekanntes Problem mit der Hintergrundprozess-Konsolenunterstützung für Unicode-aktivierte Anwendungen unter manchen Windows-Systemen sein. Navigieren Sie zu "Tools > Optionen > F# Interactive für Visual Studio", und geben Sie --fsi-server-no-unicode ein.
es: Se ha producido un problema al iniciar el proceso interactivo de F. Esto puede deberse a un problema conocido con la compatibilidad con la consola de proceso en segundo plano para aplicaciones habilitadas para Unicode en algunos sistemas Windows. Pruebe a seleccionar Herramientas->Opciones->F# interactivo para Visual Studio y escriba "--fsi-server-no-unicode".
fr: Un problème s'est produit au démarrage du processus F# Interactive. Il s'agit peut-être d'un problème connu avec la prise en charge de la console de processus d'arrière-plan pour les applications Unicode sur certains systèmes Windows. Essayez de sélectionner Outils->Options->F# Interactive pour Visual Studio et d'entrer '--fsi-server-no-unicode'.
it: Si è verificato un problema durante l'avvio del processo F# Interactive. Può trattarsi di un problema noto del supporto della console dei processi in background per le applicazioni abilitate per Unicode in alcuni sistemi Windows. Provare a scegliere Strumenti->Opzioni->F# Interactive per Visual Studio e immettere '--fsi-server-no-unicode'.
ko: F# Interactive 프로세스를 시작하는 동안 문제가 발생했습니다. 일부 Windows 시스템의 유니코드 기반 애플리케이션에 대한 백그라운드 프로세스 콘솔 지원과 관련된 알려진 문제가 원인일 수 있습니다. [도구]>[옵션]->[F# Interactive for Visual Studio]를 선택하고 '--fsi-server-no-unicode'를 입력해 보세요.
pl: Wystąpił problem podczas uruchamiania procesu narzędzia F# Interactive. Może to być spowodowane znanym problemem z obsługą konsoli procesu w tle dla aplikacji obsługujących standard Unicode w niektórych systemach Windows. Spróbuj wybrać pozycje Narzędzia->Opcje->F# Interactive dla programu Visual Studio i wprowadź ciąg „--fsi-server-no-unicode”.
pt_br: Ocorreu um problema ao iniciar o processo do F# Interativo. O motivo pode ser um problema conhecido com o suporte do console do processo em segundo plano para aplicativos habilitados para Unicode em alguns sistemas Windows. Tente selecionar Ferramentas->Opções->F# Interativo para Visual Studio e digite '--fsi-server-no-unicode'.
zh_hans: 启动 F# 交互进程时出现问题。这可能是由于某些 Windows 系统上启用 Unicode 的应用程序的后台进程控制台支持存在已知问题。请尝试选择“工具”->“选项”-> "F# Interactive for Visual Studio"，然后输入 "--fsi-server-no-unicode"。

# fsiInvalidAssembly
source: '{0}' is not a valid assembly name
cs: {0} není platný název sestavení.
de: {0} ist kein gültiger Assemblyname.
es: '{0}' no es un nombre de ensamblado válido.
fr: '{0}' n'est pas un nom d'assembly valide
it: '{0}' non è un nome di assembly valido
ko: '{0}'은(는) 올바른 어셈블리 이름이 아닙니다.
pl: Nazwa „{0}” nie jest prawidłową nazwą zestawu
pt_br: '{0}' não é um nome de assembly válido
zh_hans: “{0}”不是有效的程序集名称

# fsiDirectoryDoesNotExist
source: Directory '{0}' doesn't exist
cs: Adresář {0} neexistuje.
de: Das Verzeichnis "{0}" ist nicht vorhanden.
es: El directorio '{0}' no existe.
fr: Le répertoire '{0}' n'existe pas
it: La directory '{0}' non esiste
ko: '{0}' 디렉터리가 없습니다.
pl: Katalog „{0}” nie istnieje
pt_br: O diretório '{0}' não existe
zh_hans: 目录“{0}”不存在

# fsiLineTooLong
source: Warning: line too long, ignoring some characters\n
cs: Upozornění: řádek je příliš dlouhý, některé znaky se ignorují.\n
de: Warnung: Die Zeile ist zu lang, einige Zeichen werden ignoriert.\n
es: Advertencia: línea demasiado larga, omitiendo algunos caracteres.\n
fr: Avertissement : ligne trop longue, certains caractères sont ignorés\n
it: Avviso: riga troppo lunga; alcuni caratteri verranno ignorati\n
ko: 경고: 줄이 너무 길어 일부 문자가 무시됩니다.\n
pl: Ostrzeżenie: wiersz jest zbyt długi, niektóre znaki zostaną zignorowane\n
pt_br: Aviso: linha muito longa, ignore alguns caracteres\n
zh_hans: 警告: 由于行太长，将忽略某些字符\n

# fsiTimeInfoMainString
source: Real: {0}, CPU: {1}, GC {2}
fr: Réel : {0}, Processeur : {1}, GC {2}
it: Reale: {0}, CPU: {1}, GC {2}
ko: 실제: {0}, CPU: {1}, GC {2}
pl: Czas rzeczywisty: {0}, czas procesora: {1}, operacje odzyskiwania pamięci: {2}

# fsiTimeInfoGCGenerationLabelSomeShorthandForTheWordGeneration
source: gen
cs: obec
fr: gén
pl: generacja

# fsiExceptionDuringPrettyPrinting
source: \n\nException raised during pretty printing.\nPlease report this so it can be fixed.\nTrace: {0}\n
cs: \n\nFunkce přehledného výpisu vyvolala výjimku.\nNahlaste prosím tento problém, abychom ho mohli opravit.\nTrasování: {0}\n
de: \n\nAusnahme bei der automatischen Strukturierung und Einrückung.\nMelden Sie dies, damit das Problem behoben werden kann.\nAblaufverfolgung: {0}\n
es: \n\nSe generó una excepción durante la impresión con sangría.\nComuníquelo para poder corregirlo.\nSeguimiento: {0}\n
fr: \n\nException déclenchée pendant le listing en mode Pretty. \nSignalez ce problème afin qu'il soit corrigé.\nTrace : {0}\n
it: \n\nEccezione durante la riformattazione.\nSegnalare il problema affinché possa essere risolto.\nTraccia: {0}\n
ko: \n\n자동 서식 지정 중 예외가 발생했습니다.\n문제를 해결할 수 있도록 보고하세요.\n추적: {0}\n
pl: \n\nWystąpił wyjątek podczas formatowania kodu.\nZgłoś go, aby można było rozwiązać ten problem.\nŚlad: {0}\n
pt_br: \n\nExceção levantada durante a reformatação automática.\nReporte esta exceção para ela que possa ser corrigida.\nRastrear: {0}\n
zh_hans: \n\n在整齐打印期间发生异常。\n请报告此异常，以便能够将其修复。\n跟踪: {0}\n

# fsiIntroTextHeader1directives
source: F# Interactive directives:
cs: Direktivy F# Interactive:
de: F# Interactive-Direktiven:
es: Directivas de F# interactivo:
fr: Directives F# Interactive :
it: Direttive F# Interactive:
ko: F# 대화형 지시문:
pl: Dyrektywy narzędzia F# Interactive:
pt_br: Diretrizes F# Interativo:
zh_hans: F# 交互窗口指令:

# fsiIntroTextHashrInfo
source: Reference (dynamically load) the given DLL
cs: Odkazovat (dynamicky načíst) zadanou knihovnu DLL
de: Auf die angegebene DLL verweisen (dynamisch laden)
es: Hacer referencia (cargada dinámicamente) al archivo DLL proporcionado
fr: Référence (charger dynamiquement) la DLL spécifiée
it: Aggiunge riferimento alla DLL specificata (caricamento dinamico)
ko: 지정된 DLL을 참조(동적 로드)합니다.
pl: Przywołaj (załaduj dynamicznie) daną bibliotekę DLL
pt_br: Referenciar (carregar dinamicamente) o DLL dado
zh_hans: 引用(动态加载)给定的 DLL
