Repository: dotnet/fsharp
Catalog: src/Compiler/Interactive/xlf/FSIstrings.txt.*.xlf
Languages: cs, de, es, fr, it, ko, pl, pt_br, zh_hans

# fsiIntroTextHashIInfo
source: Add the given search path for referenced DLLs
cs: Přidat zadanou cestu hledání pro odkazované knihovny DLL
de: Angegebenen Suchpfad für DLLs, auf die verwiesen wird, hinzufügen
es: Agregar la ruta de acceso de búsqueda proporcionada para archivos DLL a los que se hace referencia
fr: Ajoute le chemin de recherche spécifié pour les DLL référencées
it: Aggiunge il percorso di ricerca specificato per le DLL a cui viene fatto riferimento
ko: 참조된 DLL에 대해 지정된 검색 경로를 추가합니다.
pl: Dodaj daną ścieżkę wyszukiwania dla przywoływanych bibliotek DLL
pt_br: Adicionar o caminho pesquisado dado aos DLLs referenciados
zh_hans: 为被引用的 DLL 添加给定搜索路径

# fsiIntroTextHashloadInfo
source: Load the given file(s) as if compiled and referenced
cs: Načíst zadané soubory, jako by byly zkompilované a odkazované
de: Angegebene Datei(en) laden, als wären sie kompiliert und würden Verweise aufweisen
es: Cargar los archivos proporcionados como si estuvieran compilados y referenciados
fr: Charge le ou les fichiers spécifiés comme s'ils étaient compilés et référencés
it: Carica il file (o i file) specificati come se compilati ed aggiunti come riferimento
ko: 지정된 파일이 컴파일되고 참조된 것으로 간주하여 해당 파일을 로드합니다.
pl: Załaduj dane pliki tak, jakby były skompilowane i przywoływane
pt_br: Carregar os arquivo(s) como se compilados e referenciados
zh_hans: 像已编译和被引用的文件一样加载给定的文件

# fsiIntroTextHashtimeInfo
source: Toggle timing on/off
cs: Přepnout časování do polohy zapnuto nebo vypnuto
de: Zeitliche Steuerung ein/aus
es: Activar o desactivar el control de tiempo
fr: Minutage activé/désactivé
it: Attiva/disattiva la temporizzazione
ko: 타이밍을 설정/해제합니다.
pl: Włącz/wyłącz funkcję chronometrażu
pt_br: Liga/desliga medição de tempo
zh_hans: 启用/停止计时

# fsiIntroTextHashhelpInfo
source: Display help
cs: Zobrazí nápovědu.
de: Hilfe anzeigen
es: Mostrar ayuda
fr: Afficher l'aide
it: Visualizza la guida
ko: 도움말을 표시합니다.
pl: Wyświetl pomoc
pt_br: Exibir ajuda
zh_hans: 显示帮助

# fsiIntroTextHashquitInfo
source: Exit
cs: Ukončit
de: Beenden
es: Salir
fr: Quitter
it: Esci
ko: 끝내기
pl: Zakończ
pt_br: Sair
zh_hans: 退出

# fsiIntroTextHeader2commandLine
source: F# Interactive command line options:
cs: Možnosti příkazového řádku F# Interactive:
de: F# Interactive-Befehlszeilenoptionen:
es: Opciones de la línea de comandos de F# interactivo:
fr: Options de ligne de commande F# Interactive :
it: Opzioni della riga di comando F# Interactive:
ko: F# Interactive 명령줄 옵션:
pl: Opcje wiersza polecenia narzędzia F# Interactive:
pt_br: Opções de linha de comando F# Interativo:
zh_hans: F# 交互窗口命令行选项:

# fsiIntroTextHeader3
source: See '{0}' for options
cs: Možnosti viz {0}
de: Optionen finden Sie unter "{0}".
es: Vea '{0}' para conocer las opciones
fr: Consulter '{0}' pour les options
it: Vedere '{0}' per le opzioni
ko: 옵션에 대해서는 '{0}'을(를) 참조하세요.
pl: Aby uzyskać informacje o opcjach, zobacz „{0}”
pt_br: Consulte '{0}' para obter opções
zh_hans: 请参阅“{0}”以了解各个选项

# fsiLoadingFilesPrefixText
source: Loading
cs: Načítání
de: Laden
es: Cargando
fr: Chargement
it: Caricamento
ko: 로드
pl: Ładowanie
pt_br: Carregando
zh_hans: 正在加载

# fsiInterrupt
source: \n- Interrupt\n
cs: \n- Přerušit\n
de: \n- Unterbrechen\n
es: \n- Interrumpir\n
fr: \n- Interrompre\n
ko: \n- 중단\n
pl: \n- Przerwanie\n
pt_br: \n- Interrupção\n
zh_hans: \n- 中断\n

# fsiExit
source: \n- Exit...\n
cs: \n- Ukončit...\n
de: \n- Beenden...\n
es: \n- Salir...\n
fr: \n- Quitter...\n
it: \n- Esci...\n
ko: \n- 끝내기...\n
pl: \n- Trwa kończenie działania...\n
pt_br: \n- Sair...\n
zh_hans: \n- 退出...\n

# fsiAbortingMainThread
source: - Aborting main thread...
cs: – Ukončuje se hlavní vlákno...
de: – Hauptthread wird abgebrochen...
es: - Anulando el subproceso principal...
fr: - Abandon du thread principal...
it: - Interruzione del thread principale...
ko: - 주 스레드를 중단하는 중...
pl: - Trwa przerywanie głównego wątku...
pt_br: – Anulando o thread principal...
zh_hans: - 正在中止主线程...

# fsiCouldNotInstallCtrlCHandler
source: Failed to install ctrl-c handler - Ctrl-C handling will not be available. Error was:\n\t{0}
cs: Nepovedlo se nainstalovat obslužnou rutinu ctrl-c. Obslužná rutina Ctrl-C nebude dostupná. Vyskytla se tato chyba:\n\t{0}
de: Fehler beim Installieren des STRG-C-Handlers. STRG-C-Behandlung ist nicht verfügbar. Fehler:\n\t{0}
es: No se pudo instalar el controlador ctrl-c. No estará disponible, por tanto, el control mediante Ctrl-C. El error es:\n\t{0}
fr: Impossible d'installer le gestionnaire ctrl-c - La gestion Ctrl-C n'est pas disponible. L'erreur était :\n\t{0}
it: Non è stato possibile installare il gestore di CTRL+C. La gestione di CTRL+C non sarà disponibile. Errore:\n\t{0}
ko: Ctrl-C 처리기를 설치하지 못했습니다. Ctrl-C 처리를 사용할 수 없습니다. 오류는 다음과 같습니다.\n\t{0}
pl: Nie powiodło się zainstalowanie procedury obsługi ctrl-c. Obsługa Ctrl-C będzie niedostępna. Błąd:\n\t{0}
pt_br: Falha ao instalar o manipulador ctrl-c - As manipulações Ctrl-C não estarão disponíveis. O erro foi:\n\t{0}
zh_hans: 未能安装 ctrl-c 处理程序，Ctrl-C 处理将不可用。错误为:\n\t{0}

# fsiDidAHashr
source: --> Referenced '{0}'
cs: --> Odkazovalo se na: {0}
de: --> Auf {0} wurde verwiesen
es: --> "{0}" referenciado
fr: --> '{0}' référencé
it: --> Riferimento già presente a '{0}'
ko: --> '{0}'을(를) 참조함
pl: --> Przywołano element „{0}”
pt_br: --> '{0}' referenciado
zh_hans: -> 引用的“{0}”

# fsiDidAHashrWithLockWarning
source: --> Referenced '{0}' (file may be locked by F# Interactive process)
cs: --> Odkazovalo se na: {0} (soubor může být zamknutý procesem F# Interactive)
de: --> Auf {0} wurde verwiesen (die Datei wird möglicherweise vom F# Interactive-Prozess gesperrt).
es: --> "{0}" referenciado (el archivo puede estar bloqueado por un proceso interactivo de F#)
fr: --> '{0}' référencé (le fichier est peut-être verrouillé par le processus F# Interactive)
it: --> Riferimento già presente a '{0}' (il file potrebbe essere bloccato dal processo di F# Interactive)
ko: --> 참조된 '{0}'(파일이 F# Interactive 프로세스에 의해 잠겼을 수 있음)
pl: --> Przywołano element „{0}” (plik może być zablokowany przez proces narzędzia F# Interactive)
pt_br: --> '{0}' referenciado (o arquivo pode estar bloqueado pelo processo do F# Interativo)
zh_hans: --> 引用的“{0}”(F# 交互进程可能已锁定文件)

# fsiDidAHashrWithStaleWarning
source: --> Referenced '{0}' (an assembly with a different timestamp has already been referenced from this location, reset fsi to load the updated assembly)
cs: --> Odkazovalo se na: {0} (Z tohoto umístění se už odkazovalo na sestavení s jiným časovým razítkem. Je třeba resetovat fsi, aby se načetlo aktualizované sestavení.)
de: --> Auf {0} wurde verwiesen (eine Assembly mit einem anderen Zeitstempel wurde bereits von diesem Ort verwiesen; setzen Sie fsi zurück, um die aktualisierte Assembly zu laden).
es: --> "{0}" referenciado (ya se ha hecho referencia a un ensamblado con una marca de tiempo diferente desde esta ubicación, restablezca fsi para cargar el ensamblado actualizado)
fr: --> '{0}' référencé (un assembly avec un horodatage différent a déjà été référencé à cet emplacement, réinitialiser fsi pour charger l'assembly mis à jour)
it: --> Riferimento già presente a '{0}' (un assembly con timestamp diverso è già presente come riferimento in questa posizione. Reimpostare fsi per caricare l'assembly aggiornato)
ko: --> '{0}'을(를) 참조함(다른 타임스탬프가 있는 어셈블리가 이미 이 위치에서 참조되었습니다. fsi를 다시 설정하여 업데이트된 어셈블리를 로드하세요.)
pl: --> Przywołano element „{0}” (z tej lokalizacji przywołano już zestaw z inną sygnaturą czasową, zresetuj narzędzie fsi, aby załadować zaktualizowany zestaw)
pt_br: --> '{0}' referenciado (um assembly com um carimbo de data/hora diferente já foi referenciado deste local. Redefina o FSI para carregar o assembly atualizado)
zh_hans: --> 引用的“{0}”(已从此位置引用具有不同时间戳的程序集，请重置 fsi 以加载更新后的程序集)

# fsiDidAHashI
source: --> Added '{0}' to library include path
cs: --> Přidali jsme {0} do cesty pro zahrnutí do knihovny
de: --> {0} wurde zum Bibliotheksincludepfad hinzugefügt.
es: -> Se agregó "{0}" a la ruta de acceso de inclusión de biblioteca
fr: --> '{0}' ajouté au chemin d'inclusion de bibliothèque
it: --> Aggiunto '{0}' al percorso di inclusione della libreria
ko: --> 라이브러리 포함 경로에 '{0}'을(를) 추가함
pl: --> Dodano element „{0}” do ścieżki dołączania biblioteki
pt_br: --> Foi adicionado '{0}' ao caminho de inclusão da biblioteca
zh_hans: --> 已将“{0}”添加到库包括路径

# fsiTurnedTimingOn
source: --> Timing now on
cs: --> Časování je teď zapnuté.
de: --> Zeitliche Steuerung jetzt ein
es: --> Control de tiempo activado
fr: --> Minutage activé
it: --> Temporizzazione attivata
ko: --> 지금 타이밍 켜기
pl: --> Chronometraż jest teraz włączony
pt_br: --> Sincronização ativada agora
zh_hans: -> 计时现在打开

# fsiTurnedTimingOff
source: --> Timing now off
cs: --> Časování je teď vypnuté.
de: --> Zeitliche Steuerung jetzt aus
es: --> Control de tiempo desactivado
fr: --> Minutage désactivé
it: --> Temporizzazione disattivata
ko: --> 지금 타이밍 끄기
pl: --> Chronometraż jest teraz wyłączony
pt_br: --> Sincronização desativada agora
zh_hans: -> 计时现已关闭

# fsiUnexpectedThreadAbortException
source: - Unexpected ThreadAbortException (Ctrl-C) during event handling: Trying to restart...
cs: - Při zpracování události se vyvolala neočekávaná výjimka ThreadAbortException (Ctrl-C): Pokus o restartování...
de: - Unerwartete ThreadAbortException (Ctrl-C) während der Ereignisbehandlung: Es wird versucht, neu zu starten...
es: - ThreadAbortException inesperado (Ctrl-C) durante el control de eventos: intentando reiniciar...
fr: - ThreadAbortException inattendu (Ctrl-C) durant la gestion des événements : tentative de redémarrage...
it: - Eccezione ThreadAbortException (Ctrl-C) imprevista durante la gestione dell'evento. Verrà effettuato un tentativo di riavvio...
ko: - 이벤트를 처리하는 동안 예기치 않은 ThreadAbortException(Ctrl-C)이 발생했습니다. 다시 시작합니다...
pl: - Nieoczekiwany element ThreadAbortException (Ctrl-C) podczas obsługi zdarzenia: trwa próba ponownego uruchomienia...
pt_br: - Inesperada ThreadAbortException (Ctrl-C) durante o manuseio do evento: Tentando reiniciar...
zh_hans: - 在事件处理过程中出现意外 ThreadAbortException (Ctrl-C): 正在尝试重新启动...

# fsiFailedToResolveAssembly
source: Failed to resolve assembly '{0}'
cs: Nepovedlo se přeložit sestavení {0}.
de: Fehler beim Auflösen der Assembly "{0}"
es: No se pudo resolver el ensamblado '{0}'.
fr: Échec de la résolution de l'assembly '{0}'
it: Non è stato possibile risolvere l'assembly '{0}'
ko: 어셈블리 '{0}'을(를) 확인하지 못했습니다.
pl: Nie powiodło się rozpoznanie zestawu „{0}”
pt_br: Falha ao resolver assembly '{0}'
zh_hans: 未能解析程序集“{0}”

# fsiBindingSessionTo
source: Binding session to '{0}'...
cs: Relace se váže na {0}...
de: Sitzung wird an "{0}" gebunden...
es: Enlazando sesión con '{0}'...
fr: Liaison de la session à '{0}'...
it: Binding della sessione a '{0}'...
ko: 세션을 '{0}'에 바인딩하는 중...
pl: Trwa tworzenie powiązania sesji z „{0}”...
pt_br: Associando sessão a '{0}'...
zh_hans: 正在将会话绑定到“{0}”...

# fsiProductName
source: Microsoft (R) F# Interactive version {0}
cs: Microsoft (R) F# Interactive verze {0}
es: Microsoft (R) F# interactivo, versión {0}
it: Microsoft (R) F# Interactive versione {0}
ko: Microsoft (R) F# Interactive 버전 {0}
pl: Microsoft (R) F# Interactive, wersja {0}
pt_br: Microsoft (R) F# Interativo versão {0}
zh_hans: Microsoft(R) F# 交互窗口版本 {0}

# fsiProductNameCommunity
source: F# Interactive for F# {0}
cs: F# Interactive pro F# {0}
de: F# Interactive für F# {0}
es: F# interactivo para F# {0}
fr: F# Interactive pour F# {0}
it: F# Interactive per F# {0}
ko: F# {0}에 대한 F# 대화형
pl: F# Interactive dla języka F# {0}
pt_br: F# Interativo para F# {0}
zh_hans: 适用于 F# {0} 的 F# 交互窗口

# shadowCopyReferences
source: Prevents references from being locked by the F# Interactive process
cs: Znemožňuje zamknutí referencí procesem F# Interactive.
de: Verhindert, dass Verweise vom F# Interactive-Prozess gesperrt werden.
es: Impide que el proceso de F# interactivo bloquee las referencias
fr: Empêche le blocage des références par le processus de F# Interactive
it: Impedisce che i riferimenti vengano bloccati dal processo F# Interactive
ko: 참조가 F# 대화형 프로세스에 의해 잠기지 않도록 합니다.
pl: Uniemożliwia blokowanie odwołań przez proces narzędzia F# Interactive
pt_br: Impede que as referências sejam bloqueadas pelo processo de F# interativo
zh_hans: 防止引用被 F# 交互窗口进程锁定

# fsiEntryPointWontBeInvoked
source: Functions with [<EntryPoint>] are not invoked in FSI. '{0}' was not invoked. Execute '{1} <args>' in order to invoke '{2}' with the appropriate string array of command line arguments.
pt_br: As funções com [<EntryPoint>] não são invocadas no FSI. '{0}' não foi invocado. Execute '{1} <args>' para invocar '{2}' com a matriz de cadeia de caracteres apropriada dos argumentos da linha de comando.

# fsiIntroTextHashclearInfo
source: Clear screen
de: Bildschirm löschen
it: Pulisci terminale
pt_br: Limpar tela
zh_hans: 清除屏幕
