// #Globalization 
#light

module بةتثجحخدذر
    type Foo =
        | Bar of int
        | Baz of int
        | Zoo of int
        | Yap of string
        
    type E = | ﺬﺭﺮﺯﺰﺱﺲﺳﺴﺵ = 1
             | ﻲﻳﻴﻵﻶﻷﻸﻹﻺﻻ = 2
             
    let زسشصضطظع = Foo.Bar(1)

    let نهوىيًٌٍَُ = Foo.Baz(1)

    let  ﺬﺭﺮﺯﺰﺱﺲﺳﺴﺵ = Foo.Zoo(3)

    let ﺑﺒﺓﺔﺕ = Foo.Yap("٤٥٦٧٨٩٪٫٬")

    /// ﻲﻳﻴﻵﻶﻷﻸﻹﻺﻻ
    let e = (* ﻲﻳﻴﻵﻶﻷﻸﻹﻺﻻ *) E.ﻲﻳﻴﻵﻶﻷﻸﻹﻺﻻ

    type ٮٯٰٱٲٳٴٵٶٷ(ٹٺٻټٽپٿڀځ : Foo) =
        let ڂڃڄڅچڇڈډڊڋ = ٹٺٻټٽپٿڀځ
        
        member ڌڍڎڏڐڑڒړڔڕ.ڠڡڢڣڤڥڦڧڨک(ږڗژڙښڛڜڝڞڟ : Foo) =
            ڂڃڄڅچڇڈډڊڋ |> ignore
            match ږڗژڙښڛڜڝڞڟ with
            | Foo.Bar(_) -> "ڪګڬڭڮگڰڱڲڳ"
            | Foo.Baz(_) -> "ڴڵڶڷڸڹںڻڼڽ"
            | Foo.Zoo(_) -> "ڿۀہۂۃۄۅۆۇ"
            | Foo.Yap(_) -> "ۈۉۊۋیۍێۏېۑ"
        
    let ﮏﮐﮑﮒ = ٮٯٰٱٲٳٴٵٶٷ(زسشصضطظع)
    let ﭙﭚﭛﭜﭝﭞﭟﭠ = ٮٯٰٱٲٳٴٵٶٷ(نهوىيًٌٍَُ)
    let ﭤﭥﭦﭧﭨﭩﭪ = ٮٯٰٱٲٳٴٵٶٷ(  ﺬﺭﺮﺯﺰﺱﺲﺳﺴﺵ)
    let ﭲﭳ = ٮٯٰٱٲٳٴٵٶٷ(ﺑﺒﺓﺔﺕ)

    let ﭹﭺﭻ() =
        ﮏﮐﮑﮒ.ڠڡڢڣڤڥڦڧڨک(زسشصضطظع) |> ignore
        ﭙﭚﭛﭜﭝﭞﭟﭠ.ڠڡڢڣڤڥڦڧڨک(نهوىيًٌٍَُ) |> ignore
        ﭤﭥﭦﭧﭨﭩﭪ.ڠڡڢڣڤڥڦڧڨک( ﺬﺭﺮﺯﺰﺱﺲﺳﺴﺵ) |> ignore
        ﭲﭳ.ڠڡڢڣڤڥڦڧڨک(ﺑﺒﺓﺔﺕ) |> ignore
        
        "ﮁﮂﮃﮄﮅﮆﮇﮈ" |> ignore
        """ﮁﮂﮃﮄﮅﮆﮇﮈ"""

