Repository: dotnet/fsharp
Catalog: vsintegration/src/FSharp.VS.FSI/xlf/Properties.*.xlf
Languages: cs, de, es, fr, it, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# FSharpInteractiveAnyCpuDescr
source: If set to true, 'fsiAnyCpu.exe' is run as a platform neutral process. Otherwise, F# Interactive is a 32-bit process on X86/X64 or a native 64 bit process on Arm64 based systems.
es: Si se establece en true, "fsiAnyCpu.exe" se ejecuta como un proceso neutro de la plataforma. De lo contrario, F# interactivo es un proceso de 32 bits en X86/X64 o un proceso nativo de 64 bits en sistemas basados en Arm64.

# FSharpInteractiveMisc
source: Misc
es: Varios
it: Varie
ko: 기타

# FSharpInteractiveOptions
source: F# Interactive options
cs: Možnost F# Interactive
de: F# Interactive-Optionen
es: Opciones de F# interactivo
fr: Options de F# Interactive
it: Opzioni di F# Interactive
ko: F# 대화형 옵션
pl: Opcje narzędzia F# Interactive
pt_br: Opções do F# Interativo
ru: Параметры F# Interactive
tr: F# Etkileşimli seçenekleri
zh_hans: F# 交互窗口选项
zh_hant: F# 互動選項

# FSharpInteractiveOptionsDescr
source: Additional command line arguments passed to the F# Interactive executable by Visual Studio. (optimization and debug flags are ignored if script debugging is enabled)
cs: Další argumenty příkazového řádku předané F# Interactive a spustitelné v sadě Visual Studio. (Pokud se povolí ladění skriptů, ignorují se příznaky optimalizace a ladění.)
de: Die an die ausführbare F# Interactive-Datei von Visual Studio übergebenen zusätzlichen Befehlszeilenargumente. (Optimierungs- und Debugflags werden bei aktiviertem Skriptdebuggen ignoriert.)
es: Argumentos de la línea de comandos adicional pasados al archivo ejecutable de F# interactivo por Visual Studio. (se prescinde de las marcas de optimización y depuración si la depuración de scripts está habilitada)
fr: Arguments supplémentaires de la ligne de commande passés à l'exécutable F# Interactive par Visual Studio. (les indicateurs d'optimisation et de débogage sont ignorés si le débogage de script est activé)
it: Argomenti aggiuntivi della riga di comando passati all'eseguibile F# Interactive da Visual Studio. Se è abilitato il debug di script, i flag di ottimizzazione e debug vengono ignorati.
ko: Visual Studio에서 F# 대화형 실행 파일로 전달되는 추가 명령줄 인수입니다. 스크립트 디버깅을 사용하도록 설정한 경우 최적화 및 디버그 플래그는 무시됩니다.
pl: Argumenty wiersza polecenia przekazywane do pliku wykonywalnego narzędzia F# Interactive przez program Visual Studio. (Flagi optymalizacji i debugowania są ignorowane, jeśli włączone jest debugowanie skryptów).
pt_br: Argumentos da linha de comando adicionais passados para o executável do F# Interativo pelo Visual Studio (sinalizadores de depuração e otimização são ignorados se a depuração do script estiver habilitada)
ru: Дополнительные аргументы командной строки, передаваемые исполняемому файлу F# Interactive из Visual Studio. Оптимизация и флаги отладки игнорируются, если включена отладка скриптов.
tr: Visual Studio tarafından çalıştırılabilen F# Etkileşimli'ye geçirilmiş ek komut satırı bağımsız değişkenleri. (Betik hata ayıklaması etkinleştirilmişse en iyi duruma getirme ve hata ayıklama bayrakları yok sayılır.)
zh_hans: 其他命令行参数传递到 Visual Studio 执行的 F# 交互窗口可执行文件。(若已启动脚本调试，则忽略优化和调试标志)
zh_hant: 由 Visual Studio 額外傳遞給 F# 互動可執行檔的命令列引數。(若啟用指令碼偵錯，則會忽略最佳化及偵錯旗標)

# FSharpInteractivePreview
source: FSI Preview
de: FSI-Vorschau
es: Versión preliminar de FSI
fr: Préversion FSI
it: Anteprima FSI
ko: FSI 미리 보기
pl: FSI (wersja zapoznawcza)
pt_br: Versão prévia do FSI
ru: Предварительная версия FSI
tr: FSI Önizleme
zh_hans: FSI 预览
zh_hant: FSI 預覽

# FSharpInteractivePreviewMode
source: Enable preview language features
cs: Povolit funkce jazyka ve verzi Preview
de: Vorschausprachfeatures aktivieren
es: Habilitar las características del lenguaje de versión preliminar
fr: Activer la préversion des fonctionnalités de langage
it: Abilita le funzionalità del linguaggio in anteprima
ko: 미리 보기 언어 기능 사용
pl: Włącz funkcje języka w wersji zapoznawczej
pt_br: Habilitar versões prévias dos recursos de linguagem
ru: Включить предварительные версии функций языка
tr: Önizlemedeki dil özelliklerini etkinleştir
zh_hans: 启用预览语言功能
zh_hant: 啟用預覽語言功能

# FSharpInteractivePreviewModeDescr
source: Enable preview of in-development language features in F# Interactive
cs: Povolit vyvíjené funkce jazyka ve verzi Preview v jazyce F# Interactive
de: Vorschau der in Entwicklung befindlichen Sprachfeatures in F# Interactive aktivieren
es: Habilita la versión preliminar de las características del lenguaje en desarrollo de F# interactivo.
fr: Activer la préversion des fonctionnalités de langage en développement dans F# Interactive
it: Abilita l'anteprima delle funzionalità del linguaggio in fase di sviluppo in F# Interactive
ko: F# Interactive에서 개발 중인 언어 기능의 미리 보기를 사용하도록 설정합니다.
pl: Włącz wersje zapoznawcze funkcji języka w trakcie opracowywania w oknie F# Interactive
pt_br: Habilitar as versões prévias de recursos de linguagem em desenvolvimento no F# Interativo
ru: Включить предварительный просмотр функций языка, находящихся в разработке, в F# Interactive
tr: F# Interactive'deki geliştirme aşamasında olan dil özelliklerinin önizlemesini etkinleştir
zh_hans: 在 F# 交互中启用开发中语言功能的预览
zh_hant: 在 F# Interactive 中啟用開發中語言功能的預覽

# FSharpInteractiveShadowCopy
source: Shadow copy assemblies
cs: Sestavení stínových kopií
de: Schattenkopie-Assemblys
es: Ensamblados de instantánea
fr: Assemblys de cliché instantané
it: Assembly copie shadow
ko: 섀도 복사본 어셈블리
pl: Zestawy kopii w tle
pt_br: Assemblies de cópia de sombra
ru: Теневое копирование сборок
tr: Gölge kopya bütünleştirilmiş kodları
zh_hans: 卷影副本程序集
zh_hant: 陰影複製組件

# FSharpInteractiveShadowCopyDescr
source: Prevents referenced assemblies from being locked by the F# Interactive process.
es: Impide que el proceso de F# interactivo bloquee los ensamblados a los que se hace referencia.
it: Impedisce che assembly di riferimento vengano bloccati dal processo F# Interactive.
ko: 참조된 어셈블리가 F# 대화형 프로세스에 의해 잠기지 않도록 합니다.

# FSharpInteractiveDebugMode
source: Enable script debugging
cs: Povolit ladění skriptů
de: Skriptdebuggen aktivieren
es: Habilitar depuración de scripts
fr: Activer le débogage de script
it: Abilita debug di script
ko: 스크립트 디버깅 사용
pl: Włącz debugowanie skryptów
pt_br: Habilitar depuração de script
ru: Включить отладку скриптов
tr: Betik hata ayıklamayı etkinleştir
zh_hans: 启用脚本调试
zh_hant: 啟用指令碼偵錯

# FSharpInteractiveDebugModeDescr
source: Enable debugging of F# scripts (may impact script performance, requires reset of F# Interactive)
es: Habilitar depuración de scripts F# (puede afectar al rendimiento de los scripts y requiere restablecer F# interactivo)
it: Abilita il debug di script F#. Può influire sulle prestazioni degli script e richiede la reimpostazione di F# Interactive.
ko: F# 스크립트 디버깅 사용(스크립트 성능에 영향을 주고, F# 대화형을 다시 설정해야 할 수 있음)

# FSharpInteractiveDebugging
source: Debugging
cs: Ladění
de: Debuggen
es: Depuración
fr: Débogage
it: Debug
ko: 디버깅
pl: Debugowanie
pt_br: Depurando
ru: Отладка
tr: Hata Ayıklama
zh_hans: 正在调试
zh_hant: 偵錯

# FSharpInteractiveUseNetCore
source: Use .NET Core Scripting
es: Usar scripting de .NET Core
it: Usa script di .NET Core
ko: .NET Core 스크립팅 사용

# FSharpInteractiveUseNetCoreDescr
source: Enable .NET Core script editing and execution for all F# scripts and the F# Interactive window
es: Habilita la ejecución y la edición de scripts de .NET Core para todos los scripts de F # y la ventana de F# interactivo.
it: Abilita la modifica e l'esecuzione di script .NET Core per tutti gli script F# e la finestra F# Interactive
ko: 모든 F# 스크립트 및 F# 대화형 창에 대해 .NET Core 스크립트 편집 및 실행을 사용하도록 설정합니다.

# FSharpInteractive64Bit
source: 64-bit for .NET Framework
cs: 64bitový F# Interactive
de: 64-Bit-Version von F# Interactive
fr: F# Interactive 64 bits
pl: 64-bitowe narzędzie F# Interactive
pt_br: F# Interativo de 64 bits
ru: F# Interactive, 64-разрядная версия
tr: 64 bit F# Etkileşimli
zh_hans: 64 位 F# 交互窗口
zh_hant: 64 位元 F# 互動

# FSharpInteractive64BitDescr
source: If set to true, then run F# Interactive as a 64-bit process when using .NET Framework scripting on a 64-bit machine, otherwise, use a 32-bit process. If .NET Core scripting is enabled, F# Interactive is always a 64-bit process.
cs: V případě nastavení na true a za předpokladu, že aktuální počítač je 64bitový, se F# Interactive spustí jako 64bitový proces. (V opačném případě je F# Interactive 32bitový proces.)
de: Wenn diese Einstellung auf "True" gesetzt ist und der aktuelle Computer eine 64-Bit-Version ist, müssen Sie F# Interactive als einen 64-Bit-Prozess ausführen (Andernfalls ist F# Interactive ein 32-Bit-Prozess).
fr: Si la valeur est true et que l'ordinateur actuel est de type 64 bits, exécutez F# Interactive en tant que processus 64 bits. (Sinon, F# Interactive est un processus 32 bits.)
pl: Jeśli ustawiono wartość true i obecnie jest używany komputer 64-bitowy, należy uruchomić narzędzie F# Interactive jako proces 64-bitowy. W przeciwnym razie narzędzie F# Interactive zostanie uruchomione jako proces 32-bitowy.
pt_br: Se estiver definido como true, e o computador atual for 64 bits, execute o F# Interativo como um processo de 64 bits. (Caso contrário, o F# Interactive será um processo de 32 bits.)
ru: Если задано значение true и текущий компьютер является 64-разрядным, F# Interactive запускается как 64-разрядный процесс. (В остальных случая F# Interactive является 32-разрядным процессом.)
tr: True olarak ayarlanırsa ve geçerli makine 64 bit ise F# Etkileşimli'yi 64 bit işlem olarak çalıştırın. (Aksi takdirde F# Etkileşimli 32 bit işlemdir.)
zh_hans: 如果设为 true，且当前计算机是 64 位的，则将 F# 交互窗口作为 64 位进程运行。(否则，F# 交互为 32 位进程。)
zh_hant: 如果設為 true，並且目前電腦為 64 位元，則 F# 互動會當做 64 位元處理序來執行 (反之，F# 互動則為 32 位元處理序)。

# FSharpInteractiveShadowCopyDescr
source: Prevents referenced assemblies from being locked by the F# Interactive process (.NET Framework only).
cs: Znemožňuje zamknutí odkazovaných sestavení procesem F# Interactive.
de: Verhindert, dass referenzierte Assemblys vom F# Interactive-Prozess gesperrt werden.
fr: Empêche le blocage des assemblys référencés par le processus de F# Interactive.
pl: Uniemożliwia blokowanie zestawów występujących w odwołaniach przez proces narzędzia F# Interactive.
pt_br: Impede que os assemblies referenciados sejam bloqueados pelo processo do F# Interativo.
ru: Предотвращает блокировку сборок, на которые указаны ссылки, интерактивным процессом F#.
tr: Başvurulan bütünleştirilmiş kodların F# Etkileşimli işlemi tarafından kilitlenmesini engeller.
zh_hans: 防止被引用的程序集被 F# 交互窗口进程锁定。
zh_hant: 避免參考的組件遭 F# 互動處理序封鎖。

# FSharpInteractiveDebugModeDescr
source: Enable debugging of F# scripts (.NET Framework only, may impact script performance, requires reset of F# Interactive)
cs: Povolit ladění skriptů F# (může ovlivnit výkon skriptů, vyžaduje restartování F# Interactive)
de: Debuggen von F#-Skripts aktivieren (kann die Skriptleistung beeinträchtigen, erfordert das Zurücksetzen von F# Interactive)
fr: Activer le débogage des scripts F# (peut avoir un impact sur la performance des scripts, requiert une réinitialisation de F# Interactive)
pl: Włącz debugowanie skryptów w języku F# (może to mieć wpływ na wydajność skryptów, wymaga zresetowania narzędzia F# Interactive)
pt_br: Habilitar depuração de scripts do F# (pode impactar o desempenho do script; requer reinicialização do F# Interativo)
ru: Включение отладки скриптов F# (может повлиять на их производительность, необходим сброс F# Interactive).
tr: F# betiklerinde hata ayıklamayı etkinleştir (betik performansını etkileyebilir, F# Etkileşimli'nin sıfırlanmasını gerektirir)
zh_hans: 启用 F# 脚本的调试(可能会影响脚本性能，需要重置 F# 交互窗口)
zh_hant: 啟用 F# 指令碼偵錯 (可能會影響指令碼效能，必須重設 F# 互動)
