Repository: dotnet/fsharp
Catalog: vsintegration/src/FSharp.VS.FSI/xlf/VFSIstrings.txt.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# cannotCreateToolWindow
source: Cannot create window F# Interactive ToolWindow
cs: Nedá se vytvořit Okno nástrojů F# Interactive.
de: Das F# Interactive-Toolfenster kann nicht erstellt werden.
es: No se puede crear la ventana ToolWindow de F# interactivo.
fr: Impossible de créer la fenêtre F# Interactive ToolWindow
it: Non è possibile creare la finestra ToolWindow di F# Interactive
ja: F# インタラクティブ ToolWindow ウィンドウを作成できません
ko: F# 대화형 ToolWindow 창을 만들 수 없습니다.
pl: Nie można utworzyć okna ToolWindow narzędzia F# Interactive
pt_br: Não é possível criar a Janela F# Interativo ToolWindow
ru: Не удается создать окно инструментов F# Interactive
tr: F# Etkileşimli ToolWindow penceresi oluşturulamıyor
zh_hans: 无法创建“F# 交互窗口”工具窗口
zh_hant: 無法建立視窗 F# 互動工具視窗

# exceptionRaisedWhenCreatingRemotingClient
source: Exception raised when creating remoting client for launched fsi.exe\n{0}
cs: Při vytváření klienta vzdálené komunikace pro spuštěný soubor fsi.exe se vyvolala výjimka:\n{0}
de: Ausnahme beim Erstellen eines Remoteclients für die gestartete "fsi.exe".\n{0}
es: Se generó una excepción al crear el cliente remoto para el archivo fsi.exe iniciado.\n{0}
fr: Exception déclenchée lors de la création du client de communication à distance pour le fichier fsi.exe lancé\n{0}
it: Eccezione durante la creazione del client remoto per il file fsi.exe avviato\n{0}
ja: 起動した fsi.exe のリモート処理クライアントの作成中に例外が発生しました\n{0}
ko: 시작된 fsi.exe에 대한 원격 클라이언트를 만들 때 예외가 발생했습니다.\n{0}
pl: Wywołano wyjątek podczas tworzenia klienta zdalnego dla uruchomionego pliku fsi.exe\n{0}
pt_br: Exceção gerada durante a criação de cliente remoto pelo fsi.exe inicializado\n{0}
ru: Возникло исключение при создании удаленного клиента для запущенного файла fsi.exe\n{0}
tr: Başlatılmış fsi.exe için uzaktan iletişim istemcisi oluşturulurken özel durum tetiklendi\n{0}
zh_hans: 在为启动的 fsi.exe 创建远程处理客户端时发生异常\n{0}
zh_hant: 建立已啟動之 fsi.exe 的遠端處理用戶端時發生例外狀況\n{0}

# exceptionRaisedWhenRequestingToolWindow
source: Exception raised when requesting FSI ToolWindow.\n{0}
cs: Při požadování Okna nástrojů FSI se vyvolala výjimka.\n{0}
de: Ausnahme beim Anfordern von FSI ToolWindow.\n{0}
es: Se generó una excepción al solicitar ToolWindow de FSI.\n{0}
fr: Exception déclenchée lors de la demande de ToolWindow FSI.\n{0}
it: Eccezione durante la richiesta di FSI ToolWindow.\n{0}
ja: FSI ToolWindow の要求中に例外が発生しました。\n{0}
ko: FSI ToolWindow를 요청하는 동안 예외가 발생했습니다.\n{0}
pl: Wywołano wyjątek podczas żądania elementu ToolWindow narzędzia FSI.\n{0}
pt_br: Exceção gerada na solicitação de ToolWindow FSI.\n{0}
ru: Возникло исключение при запросе окна инструментов FSI.\n{0}
tr: FSI ToolWindow istenirken özel durum tetiklendi.\n{0}
zh_hans: 在请求 FSI ToolWindow 时发生异常。\n{0}
zh_hant: 要求 FSI 工具視窗時發生例外狀況。\n{0}

# couldNotObtainFSharpLS
source: Could not load F# language service
cs: Nepovedlo se načíst službu jazyka F#.
de: Der F#-Sprachendienst konnte nicht geladen werden.
es: No se pudo cargar el servicio del lenguaje F#.
fr: Impossible de charger le service de langage F#
it: Non è stato possibile caricare il servizio di linguaggio F#
ja: F# 言語サービスを読み込めませんでした
ko: F# 언어 서비스를 로드할 수 없습니다.
pl: Nie można załadować usługi języka F#
pt_br: Não foi possível carregar o serviço de linguagem F#
ru: Не удалось загрузить службу языка F#
tr: F# dil hizmeti yüklenemedi
zh_hans: 未能加载 F# 语言服务
zh_hant: 無法載入 F# 語言服務

# sessionInitialMessageNetCore
source: Welcome to F# Interactive for .NET Core in Visual Studio. To execute code, either\n 1. Use 'Send to Interactive' (Alt-Enter or right-click) from an F# script. The F# Interactive process will\n use any global.json settings associated with that script.\n 2. Press 'Enter' to start. The F# Interactive process will use default settings.
cs: Vítá vás F# Interactive pro .NET Core v sadě Visual Studio. Kód spustíte těmito způsoby:\n 1. Ve skriptu F # použijte možnost Odeslat do interaktivního okna (Alt-Enter nebo kliknutí pravým tlačítkem).\n Proces F# Interactive použije případné nastavení global.js přidružené k tomuto skriptu.\n 2. Začněte tím, že stisknete Enter. Proces F# Interactive použije výchozí nastavení.
de: Willkommen bei F# Interactive für .NET Core in Visual Studio. Führen Sie einen der folgenden Schritte durch, um Code auszuführen:\n 1. Verwenden Sie in einem F#-Skript "An Interactive senden" (ALT-EINGABETASTE oder Klick mit der rechten Maustaste). Der F# Interactive-Prozess\n verwendet keine global.json-Einstellungen, die diesem Skript zugeordnet sind.\n 2. Drücken Sie zum Starten die EINGABETASTE. Der F# Interactive-Prozess verwendet Standardeinstellungen.
es: Esto es F# interactivo para .NET Core en Visual Studio. Para ejecutar el código, puede realizar una de las acciones siguientes:\n 1. Use "Enviar a interactivo" (Alt-Entrar o hacer clic con el botón derecho) desde un script de F #. El proceso de F# interactivo\n usará cualquier configuración de global.json asociada a ese script.\n 2. Presione "Entrar" para empezar. El proceso de F# interactivo usará la configuración predeterminada.
fr: Bienvenue dans F# Interactive pour .NET Core dans Visual Studio. Pour exécuter du code, vous disposez de plusieurs possibilités\n 1. Utilisez 'Envoyer vers Interactive' (Alt-Entrée ou clic droit) à partir d'un script F#. Le processus F# Interactive va\n utiliser les paramètres global.json associés au script.\n 2. Appuyez sur 'Entrée' pour démarrer. Le processus F# Interactive va utiliser les paramètres par défaut.
it: Benvenuti in F# Interactive per .NET Core in Visual Studio. Per eseguire il codice:\n 1. Usare 'Invia a Interactive' (ALT-INVIO o clic con il pulsante destro del mouse) da uno script F#. Il processo di F# Interactive\n userà le eventuali impostazioni di global.json associate allo script.\n 2. Premere 'INVIO' per iniziare. Il processo di F# Interactive userà le impostazioni predefinite.
ja: Visual Studio の .NET Core の F# インタラクティブへようこそ。コードを実行するには、\n 1. F# スクリプトから [Interactive に送信] (Alt+Enter または右クリック) を使用します。F# インタラクティブ プロセスでは、\n そのスクリプトに関連付けられている任意の global.json 設定が使用されます。\n 2. 開始するには、Enter キーを押します。F# インタラクティブ プロセスでは、既定の設定が使用されます。
ko: Visual Studio의 .NET Core용 F# 대화형을 시작합니다. 코드를 실행하려면 다음 중 한 가지를 수행합니다.\n 1. F# 스크립트에서 '대화형으로 보내기'(Alt-Enter 또는 마우스 오른쪽 단추 클릭)를 사용합니다. F# 대화형 프로세스에서\n 해당 스크립트와 연결된 모든 global.json 설정을 사용합니다.\n 2. 'Enter' 키를 눌러 시작합니다. F# 대화형 프로세스에서 기본 설정을 사용합니다.
pl: F# Interactive dla platformy .NET Core w programie Visual Studio — Zapraszamy! Aby wykonać kod, wykonaj jedną z następujących akcji:\n 1. Użyj polecenia „Wyślij do interaktywnego” (Alt+Enter lub kliknij prawym przyciskiem myszy) z poziomu skryptu języka F#. Proces narzędzia F# Interactive\n użyje dowolnych ustawień global.json skojarzonych z tym skryptem.\n 2. Naciśnij klawisz „Enter”, aby rozpocząć. Proces narzędzia F# Interactive użyje ustawień domyślnych.
pt_br: Bem-vindo(a) ao F# Interativo para .NET Core no Visual Studio. Para executar o código, ou\n 1. Use 'Enviar para Interativo' (Alt-Enter ou clique com o botão direito do mouse) de um script F#. O processo de F# Interativo\n usará quaisquer configurações global.json associadas a esse script.\n 2. Pressione 'Enter' para começar. O processo de F# Interativo usará as configurações padrão.
ru: Добро пожаловать в F# Interactive для .NET Core в Visual Studio. Для выполнения кода используйте любой из двух следующих вариантов: \n 1. Используйте команду "Отправить в Interactive" для сценария F# (чтобы получить доступ к этой команде, нажмите ALT+ВВОД или правую кнопку мыши). Процесс F# Interactive \n будет использовать все параметры global.json, связанные с этим сценарием.\n 2. Нажмите клавишу ВВОД для запуска сценария. Процесс F# Interactive будет использовать параметры по умолчанию.
tr: Visual Studio'daki .NET Core için F# Etkileşimli'ye hoş geldiniz. Kodu yürütmek için şunlardan birini yapın:\n 1. Bir F# betiğinden 'Etkileşimliye Gönder' (Alt+Enter veya sağ tıklama) seçeneğini kullanın. F# Etkileşimli işlemi\n bu betikle ilişkili tüm global.json ayarlarını kullanır.\n 2. Başlatmak için 'Enter' tuşuna basın. F# Etkileşimli işlemi varsayılan ayarları kullanır.
zh_hans: 欢迎使用 Visual Studio 中 .NET Core 的 F# 交互窗口。若要执行代码，请\n 1. 从 F# 脚本中使用“发送到交互”(Alt-Enter 或右键单击)。F# 交互进程将\n 使用与该脚本关联的任何 global.json 设置。\n 2. 按 "Enter" 开始。F# 交互进程将使用默认设置。
zh_hant: 歡迎使用 Visual Studio 中 .NET Core 的 F# 互動。若要執行程式碼，請選用其中一種方式:\n 1. 從 F# 指令碼使用 [傳送到互動] (按 Alt-Enter 鍵或滑鼠右鍵)。F# 互動處理序將會\n 使用任何與該指令碼相關的 global.json 設定。\n 2. 按下 'Enter' 鍵即可開始。F# 互動處理序將使用預設設定。

source: Session termination detected.
cs: Zjistilo se ukončení relace.
de: Es wurde eine Beendigung der Sitzung erkannt.
es: Se detectó una terminación de sesión.
fr: Arrêt de session détectée.
it: È stata rilevata la terminazione della sessione.
ja: セッションの終了が検出されました。
ko: 세션 종료가 감지되었습니다.
pl: Wykryto zakończenie sesji.
pt_br: Encerramento da sessão detectado.
ru: Обнаружено прекращение сеанса.
tr: Oturumun sonlandırıldığı algılandı.
zh_hans: 检测到会话已终止。
zh_hant: 偵測到工作階段終止。

# fsharpInteractive
source: F# Interactive
es: F# interactivo
ja: F# インタラクティブ
ko: F# 대화형
pt_br: F# Interativo
tr: F# Etkileşimli
zh_hans: F# 交互窗口
zh_hant: F# 互動

# couldNotFindFsiExe
source: Could not find fsi.exe, the F# Interactive executable.\nThis file does not exist:\n\n{0}\n
cs: Nepovedlo se najít soubor fsi.exe, spustitelný soubor F# Interactive.\nTento soubor neexistuje:\n\n{0}\n
de: Fsi.exe, die ausführbare F# Interactive-Datei, wurde nicht gefunden.\nDiese Datei ist nicht vorhanden:\n\n{0}\n
es: No se encontró el archivo fsi.exe, ejecutable de F# interactivo.\nEste archivo no existe:\n\n{0}\n
fr: Impossible de trouver fsi.exe, l'exécutable F# Interactive.\nCe fichier n'existe pas :\n\n{0}\n
it: L'eseguibile di F# Interactive fsi.exe non è stato trovato.\nQuesto file non esiste:\n\n{0}\n
ja: F# インタラクティブ実行可能ファイルである fsi.exe が見つかりませんでした。\nこのファイルは存在しません:\n\n{0}\n
ko: F# Interactive 실행 파일 fsi.exe를 찾을 수 없습니다.\n이 파일이 없습니다.\n\n{0}\n
pl: Nie można odnaleźć pliku wykonywalnego narzędzia F# Interactive (fsi.exe).\nTen plik nie istnieje:\n\n{0}\n
pt_br: Não foi possível encontrar fsi.exe, o executável do F# Interativo.\nEste arquivo não existe:\n\n{0}\n
ru: Не удалось найти fsi.exe, исполняемый файл F# Interactive.\nЭтот файл не существует:\n\n{0}\n
tr: F# Etkileşimli çalıştırılabilir dosyası olan fsi.exe bulunamıyor.\nBu dosya yok:\n\n{0}\n
zh_hans: 未能找到 F# 交互窗口可执行文件 fsi.exe。\n此文件不存在:\n\n{0}\n
zh_hant: 找不到 F# 互動可執行檔 fsi.exe。\n這個檔案不存在:\n\n{0}\n

# killingProcessRaisedException
source: Killing process raised exception:\n{0}
cs: Proces rušení vyvolal výjimku:\n{0}
de: Ausnahme beim Entfernen:\n{0}
es: El proceso de eliminación generó una excepción:\n{0}
fr: La suppression du processus a déclenché une exception :\n{0}
it: La chiusura del processo ha generato un'eccezione:\n{0}
ja: プロセスの中止中に例外が発生しました:\n{0}
ko: 프로세스를 종료할 때 예외가 발생했습니다.\n{0}
pl: Zamknięcie procesu wywołało wyjątek:\n{0}
pt_br: Processo fatal abriu exceção:\n{0}
ru: Прерывание процесса вызвало исключение:\n{0}
tr: Sonlandırma işlemi özel durum tetikledi:\n{0}
zh_hans: 取消进程引发了异常:\n{0}
zh_hant: 正在刪除引發例外狀況的處理序:\n{0}

# sessionIsNotDebugFriendly
source: The current F# Interactive session is not configured for debugging. For the best experience, enable debugging in F# Interactive settings, then reset the session.\n\nAttempt debugging with current settings?
cs: Aktuální relace F# Interactive není nakonfigurovaná pro ladění. Ladění bude fungovat nejlíp, když ho povolíte v nastavení F# Interactive a resetujete relaci.\n\nChcete zkusit ladit s aktuálním nastavením?
de: Die aktuelle F# Interactive-Sitzung ist nicht für Debuggen konfiguriert. Um ein optimales Ergebnis zu erzielen, aktivieren Sie das Debuggen in den F# Interactive-Einstellungen, und setzen Sie anschließend die Sitzung zurück.\n\nDebuggen mit den aktuellen Einstellungen versuchen?
es: La sesión actual de F# interactivo no está configurada para la depuración. Para obtener el mejor rendimiento, habilite la depuración en la configuración de F# interactivo y, a continuación, restablezca la sesión.\n\n¿Desea intentar la depuración con la configuración actual?
fr: La session F# Interactive actuelle n'est pas configurée pour le débogage. Pour une meilleure expérience, activez le débogage dans les paramètres de F# Interactive, puis réinitialisez la session.\n\nEssayer de déboguer avec les paramètres actuels ?
it: La sessione corrente di F# Interactive non è configurata per il debug. Per un'esperienza ottimale, abilitare il debug nelle impostazioni di F# Interactive, quindi reimpostare la sessione.\n\nProvare a eseguire il debug con le impostazioni correnti?
ja: 現在の F# インタラクティブ セッションは、デバッグのために構成されていません。最適にご利用いただくには、F# インタラクティブ設定でデバッグを有効にし、セッションをリセットしてください。\n\n現在の設定でデバッグを試みますか?
ko: 현재 F# Interactive 세션이 디버깅용으로 구성되지 않았습니다. 최상의 환경을 유지하려면 F# Interactive 설정에서 디버깅을 사용하도록 설정한 다음 세션을 다시 설정하세요.\n\n현재 설정으로 디버깅을 시도할까요?
pl: Bieżąca sesja narzędzia F# Interactive nie jest skonfigurowana do debugowania. Aby uzyskać najlepszy efekt, włącz debugowanie w ustawieniach narzędzia F# Interactive, a następnie zresetuj sesję.\n\nPodjąć próbę debugowania z bieżącymi ustawieniami?
pt_br: A sessão do F# Interativo atual não está configurada para depuração. Para uma melhor experiência, habilite a depuração nas configurações do F# Interativo e, em seguida, redefina a sessão de depuração.\n\nDeseja tentar a depuração com as configurações atuais?
ru: Текущий сеанс F# Interactive не настроен для отладки. Для достижения наилучших результатов включите отладку в настройках F# Interactive, затем выполните сброс сеанса.\n\nПопробовать выполнить отладку с текущими настройками?
tr: Geçerli F# Etkileşimli oturumu hata ayıklama için yapılandırılmamış. En iyi deneyim için, F# Etkileşimli ayarlarında hata ayıklamayı etkinleştirin ve ardından oturumu sıfırlayın.\n\nGeçerli ayarlarla hata ayıklama denensin mi?
zh_hans: 当前 F# 交互窗口会话未进行调试配置。为实现最佳体验，请启用 F# 交互窗口设置中的调试，然后重置会话。\n\n是否尝试用当前设置进行调试?
zh_hant: 目前的 F# 互動工作階段並未設定偵錯功能。最佳做法是啟用 F# 互動設定中的偵錯設定，然後重設此工作階段。\n\n要嘗試使用目前的設定進行偵錯嗎?

# doNotShowWarningInFuture
source: Don't show this warning again
cs: Toto upozornění příště nezobrazovat
de: Diese Warnung nicht mehr anzeigen.
es: No volver a mostrar esta advertencia
fr: Ne plus afficher cet avertissement
it: Non visualizzare più questo avviso
ja: この警告を今後表示しない
ko: 이 경고 메시지를 다시 표시 안 함
pl: Nie pokazuj tego ostrzeżenia ponownie
pt_br: Não mostrar este aviso novamente
ru: Больше не показывать это предупреждение
tr: Bu uyarıyı bir daha gösterme
zh_hans: 不要再次显示此警告
zh_hant: 不再顯示這項警告
