Repository: dotnet/fsharp
Catalog: vsintegration/src/FSharp.UIResources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AdditionalTelemetry
source: Additional performance telemetry (experimental)
cs: Další telemetrie výkonu (experimentální)
de: Zusätzliche Leistungstelemetriedaten (experimentell)
es: Telemetría de rendimiento adicional (experimental)
fr: Télémétrie de performance supplémentaire (expérimentale)
it: Dati di telemetria aggiuntivi per le prestazioni (sperimentale)
ja: 追加のパフォーマンス テレメトリ (試験段階)
ko: 추가 성능 원격 분석(실험적)
pl: Dodatkowa telemetria wydajności (eksperymentalna)
pt_br: Telemetria de desempenho adicional (experimental)
ru: Дополнительные диагностические данные о производительности (экспериментальная функция)
tr: Ek performans telemetrisi (deneysel)
zh_hans: 其他性能遥测(实验性)
zh_hant: 其他效能遙測 (實驗性)

# Always_place_opens_at_top_level
source: Always place open statements at the top level
cs: Vždy umístit otevřené příkazy na nejvyšší úroveň
de: open-Anweisungen immer an oberster Ebene platzieren
es: Colocar siempre las instrucciones open en el nivel superior
fr: Placer toujours les instructions open au niveau supérieur
it: Inserisci sempre le istruzioni OPEN al primo livello
ja: Open ステートメントを常に最上位に配置する
ko: 항상 최상위에 open 문 배치
pl: Zawsze umieszczaj otwarte instrukcje na najwyższym poziomie
pt_br: Sempre coloque as instruções abertas no nível superior
ru: Всегда располагайте открытые операторы на верхнем уровне
tr: Açık deyimleri her zaman en üst düzeye yerleştir
zh_hans: 始终在顶层放置 open 语句
zh_hant: 一律將 open 陳述式放在最上層

# Analyze_full_solution_on_background
source: Keep analyzing the entire solution for diagnostics as a low priority background task (requires restart)
cs: Nadále analyzovat celé řešení pro diagnostiku jako úlohu na pozadí s nízkou prioritou (vyžaduje restartování)
de: Analyse der gesamten Projektmappe zur Diagnose als Hintergrundaufgabe mit niedriger Priorität fortsetzen (Neustart erforderlich)
es: Siga analizando toda la solución para los diagnósticos como una tarea en segundo plano de prioridad baja (requiere un reinicio)
fr: Continuez à analyser l'intégralité de la solution pour les diagnostics en tant que tâche en arrière-plan de basse priorité (nécessite un redémarrage)
it: Continua ad analizzare l'intera soluzione per la diagnostica come attività in background a priorità bassa (richiede il riavvio)
ja: 診断のソリューション全体を低優先度のバックグラウンド タスクとして分析し続ける (再起動が必要)
ko: 진단에 대한 전체 솔루션을 낮은 우선 순위 백그라운드 작업으로 계속 분석(다시 시작해야 함)
pl: Analizuj całe rozwiązanie pod kątem diagnostyki jako zadanie w tle o niskim priorytecie (wymaga ponownego uruchomienia)
pt_br: Continuar analisando toda a solução para diagnóstico como uma tarefa em segundo plano de baixa prioridade (requer reinicialização)
ru: Продолжать анализ всего решения для диагностики в качестве низкоприоритетной фоновой задачи (требуется перезагрузка)
tr: Düşük öncelikli arka plan görevi olarak tanılama için çözümün tamamını analiz etmeye devam et (yeniden başlatma gerekir)
zh_hans: 继续分析整个解决方案以将诊断作为低优先级后台任务(需要重启)
zh_hant: 將分析整個解決方案以進行診斷保持為低優先順序背景工作 (需要重新開機)

source: Background analysis
cs: Analýza na pozadí
de: Hintergrundanalyse
es: Análisis en segundo plano
fr: Analyse de fond
it: Analisi in background
ja: バックグラウンド分析
ko: 백그라운드 분석
pl: Analiza w tle
pt_br: Análise em segundo plano
ru: Фоновый анализ
tr: Arka plan analizi
zh_hans: 后台分析
zh_hant: 背景分析

# Enable_Background_ItemKeyStore_And_Semantic_Classification
source: Keep background symbol keys
cs: Zachovat klávesy symbolů pozadí
de: Hintergrundsymbolschlüssel beibehalten
es: Mantener las teclas de símbolos en segundo plano
fr: Conserver les clés des symboles d'arrière-plan
it: Mantieni le chiavi dei simboli in background
ja: 背景シンボル キーを保持する
ko: 배경 기호 키 유지
pl: Zachowaj klawisze symboli tła
pt_br: Manter as teclas de símbolo em segundo plano
ru: Сохранить фоновые символьные клавиши
tr: Arka plan sembol tuşlarını tut
zh_hans: 保留背景符号键
zh_hant: 保留背景符號鍵

# Enable_Fast_Find_References
source: Enable fast find references & rename (experimental)
cs: Povolit odkazy rychlého hledání a přejmenování (experimentální)
de: Schnellsuche und Umbenennen von Verweisen aktivieren (experimentell)
es: Habilitar referencias de búsqueda rápida y cambio de nombre (experimental)
fr: Activer les références de recherche rapide et renommer (expérimental)
it: Abilitare la ricerca rapida dei riferimenti e la ridenominazione (sperimentale)
ja: 高速検索参照の有効化と名前の変更 (試験段階)
ko: 빠른 찾기 참조 및 이름 바꾸기 사용(실험적)
pl: Włącz szybkie znajdowanie odwołań i zmień nazwę (eksperymentalne)
pt_br: Habilitar localizar referências rapidamente e renomear (experimental)
ru: Включить быстрый поиск ссылок и переименование (экспериментальная версия)
tr: Başvuruları hızlı bulma ve yeniden adlandırmayı etkinleştir (deneysel)
zh_hans: 启用快速查找引用和重命名(实验性)
zh_hant: 啟用快速尋找參考和重新命名 (實驗性)

# Enable_Live_Buffers
source: Use live (unsaved) buffers for analysis (restart required)
cs: Pro analýzu používat živé (neuložené) vyrovnávací paměti (vyžaduje se restartování)
de: Livepuffer (nicht gespeichert) zur Analyse verwenden (Neustart erforderlich)
es: Utilizar buffers activos (no guardados) para el análisis (es necesario reiniciar)
fr: Utiliser des tampons en direct (non enregistrés) pour l’analysye (redémarrage requis)
it: Usa buffer in tempo reale (non salvati) per l’analisi (riavvio necessario)
ja: ライブ (未保存) バッファーをチェックに使用する (再起動が必要)
ko: 분석에 라이브(저장되지 않은) 버퍼 사용(다시 시작 필요)
pl: Użyj bieżących (niezapisanych) buforów do analizy (wymagane ponowne uruchomienie)
pt_br: Usar buffers dinâmicos (não salvos) para verificação (reinicialização necessária)
ru: Используйте для анализа живые (несохраненные) буферы (требуется перезагрузка)
tr: Analiz için canlı (kaydedilmemiş) arabellekleri kullan (yeniden başlatma gerekir)
zh_hans: 使用实时(未保存)缓冲区进行分析(需要重新启动)
zh_hant: 使用即時 (未儲存) 緩衝區進行分析 (需要重新啟動)

source: Enable partial type checking
cs: Povolit částečnou kontrolu typu
de: Aktivieren der partiellen Typüberprüfung
es: Habilitar la comprobación parcial de tipos
fr: Activer la vérification de type partielle
it: Abilita il controllo parziale dei tipi
ja: 部分型チェックを有効にする
ko: 부분 형식 검사 사용
pl: Włącz kontrolę typu częściowego
pt_br: Habilitar verificação parcial de tipo
ru: Включить частичную проверку типов
tr: Kısmi tür denetlemeyi etkinleştir
zh_hans: 启用分部类型检查
zh_hant: 啟用部分型別檢查

# Find_References_Performance
source: Find References Performance Options
cs: Najít možnosti výkonu odkazů
de: Leistungsoptionen für Verweise suchen
es: Buscar opciones de rendimiento de referencias
fr: Options de performances de recherche de références
it: Trovare opzioni prestazioni riferimenti
ja: 参照の検索のパフォーマンス オプション
ko: 참조 성능 옵션 찾기
pl: Opcje wydajności znajdowania odwołań
pt_br: Opções de Localizar Referências de Desempenho
ru: Параметры производительности поиска ссылок
tr: Başvuruları Bul Performans Seçenekleri
zh_hans: 查找引用性能选项
zh_hant: 尋找參考效能選項

source: Formatting
cs: Formátování
de: Formatierung
es: Formato
fr: Mise en forme
it: Formattazione
ja: 書式設定
ko: 서식
pl: Formatowanie
pt_br: Formatação
ru: Форматирование
tr: Biçimlendirme
zh_hans: 格式设置
zh_hant: 格式化

source: Inline Hints
cs: Vložené nápovědy
de: Inlinehinweise
es: Sugerencias insertadas
fr: Indicateurs inline
it: Suggerimenti inline
ja: インラインのヒント
ko: 인라인 힌트
pl: Wskazówki w tekście
pt_br: Dicas Embutidas
ru: Встроенные подсказки
tr: Satır İçi İpuçları
zh_hans: 内联提示
zh_hant: 內嵌提示

source: Code Fixes
cs: Opravy kódu
de: Codefehlerbehebungen
es: Correcciones de código
fr: Correctifs du code
it: Correzioni del codice
ja: コード修正
ko: 코드 수정 사항
pl: Poprawki kodu
pt_br: Correções de Código
ru: Исправления кода
tr: Kod Düzeltmeleri
zh_hans: 代码修补程序
zh_hant: 程式碼修正

source: Completion Lists
cs: Seznamy dokončení
de: Vervollständigungslisten
es: Listas de finalización
fr: Listes de saisie semi-automatique
it: Elenchi di completamento
ja: 入力候補一覧
ko: 완성 목록
pl: Listy uzupełniania
pt_br: Listas de Conclusão
ru: Списки завершения
tr: Tamamlama Listeleri
zh_hans: 完成列表
zh_hant: 完成清單

source: Diagnostics
cs: Diagnostika
de: Diagnose
es: Diagnóstico
it: Diagnostica
ja: 診断
ko: 진단
pl: Diagnostyka
pt_br: Diagnóstico
ru: Диагностика
tr: Tanılama
zh_hans: 诊断
zh_hant: 診斷

source: Enable parallel reference resolution
cs: Povolit paralelní referenční rozlišení
de: Parallele Verweisauflösung aktivieren
es: Habilitar resolución de referencias paralelas
fr: Activer la résolution de référence parallèle
it: Abilitare risoluzione riferimenti paralleli
ja: 並列参照解決を有効にする
ko: 병렬 참조 해상도 사용
pl: Włącz równoległe rozpoznawanie odwołań
pt_br: Habilitar a resolução de referência paralela
ru: Включить параллельное разрешение ссылок
tr: Paralel başvuru çözümlemeyi etkinleştir
zh_hans: 启用并行引用解析
zh_hant: 啟用平行參考解析

# Keep_All_Background_Resolutions
source: Keep all background intermediate resolutions (increases memory usage)
cs: Zachovat všechna přechodná řešení na pozadí (zvyšuje využití paměti)
de: Alle Zwischenauflösungen im Hintergrund beibehalten (erhöht die Arbeitsspeicherauslastung)
es: Mantener todas las resoluciones intermedias en segundo plano (aumenta el uso de memoria)
fr: Conserver toutes les résolutions intermédiaires en arrière-plan (augmente l'utilisation de la mémoire)
it: Mantieni tutte le risoluzioni intermedie in background (aumenta l'utilizzo della memoria)
ja: すべてのバックグラウンド中間解像度を保持する (メモリ使用量が増加する)
ko: 모든 백그라운드 중간 해상도 유지(메모리 사용량 증가)
pl: Zachowaj wszystkie rozdzielczości pośrednie tła (zwiększa użycie pamięci)
pt_br: Manter todas as resoluções intermediárias em segundo plano (aumenta o uso de memória)
ru: Сохранить все промежуточные разрешения фона (увеличивает использование памяти)
tr: Tüm arka plan ara çözünürlüklerini tut (bellek kullanımını artırır)
zh_hans: 保留所有后台中间分辨率(增加内存使用率)
zh_hant: 保留所有背景中繼解析度 (增加記憶體使用量)

# Keep_All_Background_Symbol_Uses
source: Keep all background symbol uses (increases memory usage)
cs: Zachovat všechna použití symbolů pozadí (zvyšuje využití paměti)
de: Alle Hintergrundsymbolverwendungen beibehalten (erhöht die Speicherauslastung)
es: Mantener todos los usos de símbolos en segundo plano (aumenta el uso de memoria)
fr: Conserver toutes les utilisations des symboles d'arrière-plan (augmente l'utilisation de la mémoire)
it: Mantieni tutti gli utilizzi dei simboli in background (aumenta l'utilizzo della memoria)
ja: すべてのバックグラウンド シンボルの使用を維持する (メモリ使用量が増加する)
ko: 모든 배경 기호 사용 유지(메모리 사용량 증가)
pl: Zachowaj wszystkie zastosowania symboli tła (zwiększa użycie pamięci)
pt_br: Manter todos os usos de símbolos em segundo plano (aumenta o uso de memória)
ru: Сохранить все используемые фоновые символы (увеличивает использование памяти)
tr: Tüm arka plan sembol kullanımlarını tut (bellek kullanımını artırır)
zh_hans: 保留所有后台符号使用(增加内存使用率)
zh_hant: 保留所有背景符號使用 (增加記憶體使用量)

# Language_Service_Performance
source: Performance
cs: Výkon
de: Leistung
es: Rendimiento
fr: Performances
it: Prestazioni
ja: パフォーマンス
ko: 성능
pl: Wydajność
pt_br: Desempenho
ru: Производительность
tr: Performans
zh_hans: 性能
zh_hant: 效能

source: D_ash underline
cs: Čá_rkované podtržení
de: Ge_strichelte Unterstreichung
es: _Subrayado guion
fr: So_ulignement avec des tirets
it: Sottolineatura _tratteggiata
ja: 破線の下線(_A)
ko: 대시 밑줄(_A)
pl: Po_dkreślenie z kresek
pt_br: Sublinhado t_racejado
ru: Ш_триховое подчеркивание
tr: T_ire alt çizgi
zh_hans: 短线下划线(_A)
zh_hant: 虛點底線(_A)

source: D_ot underline
cs: _Tečkované podtržení
de: Ge_punktete Unterstreichung
es: S_ubrayado punto
fr: S_oulignement avec des points
it: Sottolineatura _punteggiata
ja: 点線の下線(_O)
ko: 점 밑줄(_O)
pl: P_odkreślenie z kropek
pt_br: Sublinhado p_ontilhado
ru: Пу_нктирное подчеркивание
tr: N_okta alt çizgi
zh_hans: 点下划线(_O)
zh_hant: 點線底線(_O)

# Language_Service_Settings
source: Language service settings (advanced)
cs: Nastavení jazykové služby (pokročilé)
de: Sprachdiensteinstellungen (erweitert)
es: Valor de configuración del servicio de lenguaje (avanzado)
fr: Paramètres du service linguistique (avancés)
it: Impostazioni del servizio di linguaggio (avanzate)
ja: 言語サービスの設定 (詳細)
ko: 언어 서비스 설정(고급)
pl: Ustawienia usługi językowej (zaawansowane)
pt_br: Configurações do serviço de linguagem (avançado)
ru: Параметры языковой службы (дополнительно)
tr: Dil hizmeti ayarları (gelişmiş)
zh_hans: 语言服务设置(高级)
zh_hant: 語言服務設定 (進階)

source: Live Buffers
cs: Živé vyrovnávací paměti
de: Livepuffer
es: Búferes activos
fr: Tampons en direct
it: Buffer in tempo reale
ja: ライブ バッファー
ko: 라이브 버퍼
pl: Bufory bieżące
pt_br: Buffers Dinâmicos
ru: Живые буферы
tr: Canlı Arabellekler
zh_hans: 实时缓冲区
zh_hant: 即時緩衝區

source: Navigation links
cs: Navigační odkazy
de: Navigationslinks
es: Vínculos de navegación
fr: Liens de navigation
it: Collegamenti di navigazione
ja: ナビゲーション リンク
ko: 탐색 링크
pl: Linki nawigacyjne
pt_br: Links de navegação
ru: Ссылки навигации
tr: Gezinti bağlantıları
zh_hans: 导航链接
zh_hant: 導覽連結

# Parallelization
source: Parallelization (requires restart)
cs: Paralelizace (vyžaduje restartování)
de: Parallelisierung (Neustart erforderlich)
es: Paralelización (requiere reiniciar)
fr: Parallélisation (Nécessite un redémarrage)
it: Parallelizzazione (richiede il riavvio)
ja: 並列化 (再起動が必要)
ko: 병렬화(다시 시작 필요)
pl: Równoległość (wymaga ponownego uruchomienia)
pt_br: Paralelização (requer reinicialização)
ru: Параллелизация (требуется перезапуск)
tr: Paralelleştirme (yeniden başlatma gerektirir)
zh_hans: 并行化(需要重启)
zh_hant: 平行處理 (需要重新開機)

source: Preferred description width in characters
cs: Upřednostňovaná šířka popisu ve znacích
de: Bevorzugte Beschreibungsbreite in Zeichen
es: Anchura preferida de la descripción en caracteres
fr: Largeur de description préférée en caractères
it: Larghezza descrizione preferita in caratteri
ja: 優先する説明の文字幅
ko: 기본 설정 설명 너비(문자)
pl: Preferowana szerokość opisu w znakach
pt_br: Largura de descrição preferencial em caracteres
ru: Предпочитаемая ширина описания в символах
tr: Karakter olarak tercih edilen açıklama genişliği
zh_hans: 以字符为单位的首选说明宽度
zh_hant: 慣用説明寬度 (以字元為單位)

# Remove_parens_code_fix
source: Remove unnecessary parentheses (experimental, might affect typing performance)
cs: Odebrání nepotřebných závorek (experimentální, může mít vliv na výkon při psaní)
de: Entfernen unnötiger Klammern (experimentell, kann sich auf die Eingabeleistung auswirken)
es: Quitar paréntesis innecesarios (experimental, puede afectar al rendimiento de escritura)
fr: Supprimer les parenthèses inutiles (expérimental, peut affecter les performances de saisie)
it: Rimuovi le parentesi non necessarie (sperimentale, potrebbe influire sulle prestazioni di digitazione)
ja: 不要なかっこを削除します (試験段階であり、入力のパフォーマンスに影響する可能性があります)
ko: 불필요한 괄호 제거(실험적, 입력 성능에 영향을 줄 수 있음)
pl: Usuń niepotrzebne nawiasy (eksperymentalne, może to wpłynąć na wydajność pisania)
pt_br: Remover parênteses desnecessários (experimental, pode afetar o desempenho da digitação)
ru: Удалите ненужные круглые скобки (экспериментально, может повлиять на производительность набора текста)
tr: Gereksiz parantezleri kaldır (deneysel, yazma performansını etkileyebilir)
zh_hans: 删除不必要的括号(实验性，可能会影响键入性能)
zh_hant: 移除實驗性 (不必要的括弧，可能會影響輸入效能)

# Send_Additional_Telemetry
source: Send additional performance telemetry
cs: Odeslat další telemetrii výkonu
de: Zusätzliche Leistungstelemetriedaten senden
es: Enviar telemetría de rendimiento adicional
fr: Envoyer une télémétrie de performances supplémentaire
it: Invia dati di telemetria aggiuntivi per le prestazioni
ja: 追加のパフォーマンス テレメトリを送信する
ko: 추가 성능 원격 분석 보내기
pl: Wysyłanie dodatkowych danych telemetrycznych dotyczących wydajności
pt_br: Enviar telemetria de desempenho adicional
ru: Отправить дополнительные диагностические данные о производительности
tr: Ek performans telemetrisi gönder
zh_hans: 发送其他性能遥测
zh_hant: 傳送其他效能遙測

# Show_Inline_Parameter_Name_Hints
source: Display inline parameter name hints (preview)
cs: Zobrazit nápovědy k názvům vložených parametrů (preview)
de: Hinweise zu Inlineparameternamen anzeigen (Vorschau)
es: Mostrar sugerencias de nombres de parámetros en línea (vista previa)
fr: Afficher les conseils de nom de paramètre en ligne (préversion)
it: Visualizza suggerimenti per i nomi di parametro inline (anteprima)
ja: インライン パラメーター名のヒントを表示する (プレビュー)
ko: 인라인 매개 변수 이름 힌트 표시(미리 보기)
pl: Wyświetl wskazówki w tekście dotyczące nazw parametrów (wersja zapoznawcza)
pt_br: Exibir dicas de nome de parâmetro embutido (versão prévia)
ru: Отображение подсказок для имен встроенных параметров (предварительная версия)
tr: Satır içi parametre adı ipuçlarını görüntüle (önizleme)
zh_hans: 显示内联参数名称提示(预览版)
zh_hant: 顯示內嵌參數名稱提示 (預覽)

# Show_Inline_Type_Hints
source: Display inline type hints (preview)
cs: Zobrazovat vložené nápovědy k typům (preview)
de: Inlinetyphinweise anzeigen (Vorschau)
es: Mostrar sugerencias de tipo en línea (vista previa)
fr: Afficher les conseils de type en ligne (aperçu)
it: Visualizza suggerimenti di tipo inline (anteprima)
ja: インライン型のヒントを表示する (プレビュー)
ko: 인라인 형식 힌트 표시(미리 보기)
pl: Wyświetl wskazówki w tekście dla typów (wersja zapoznawcza)
pt_br: Exibir dicas de tipo embutido (versão prévia)
ru: Отображение подсказок для встроенных типов (предварительная версия)
tr: Satır içi tür ipuçlarını görüntüle (önizleme)
zh_hans: 显示内联类型提示(预览)
zh_hant: 顯示內嵌類型提示 (預覽)

# Show_Return_Type_Hints
source: Display return type hints (preview)
cs: Zobrazení tipů pro návratový typ (Preview)
de: Hinweise zum Rückgabetyp anzeigen (Vorschau)
es: Mostrar sugerencias de tipo retorno (vista previa)
fr: Afficher les conseils de type de retour en ligne (préversion)
it: Visualizza suggerimenti di tipo restituito (anteprima)
ja: 戻り値型のヒントを表示する (プレビュー)
ko: 반환 형식 힌트 표시(미리 보기)
pl: Wyświetlaj wskazówki dotyczące typu zwrotu (wersja zapoznawcza)
pt_br: Exibir dicas de tipo de retorno (versão prévia)
ru: Отображение подсказок типа возвращаемого значения (предварительная версия)
tr: Dönüş türü ipuçlarını görüntüle (önizleme)
zh_hans: 显示返回类型提示(预览)
zh_hant: 顯示傳回類型提示 (預覽)

# Show_all_symbols
source: Show s_ymbols in unopened namespaces
cs: Zobrazit s_ymboly v neotevřených oborech názvů
de: S_ymbole in nicht geöffneten Namespaces anzeigen
es: Mostrar sím_bolos en espacios de nombres sin abrir
fr: Afficher les sym_boles dans les espaces de noms non ouverts
it: Mostra si_mboli in spazi dei nomi non aperti
ja: 開かれていない名前空間の記号を表示する(_Y)
ko: 열려 있지 않은 네임스페이스에 기호 표시(_Y)
pl: Pokaż s_ymbole w nieotwartych przestrzeniach nazw
pt_br: Mostrar s_ímbolos em namespaces não abertos
ru: По_казать символы в неоткрытых пространствах имен
tr: Açılmamış ad alanlarında s_embolleri göster
zh_hans: 显示未打开的命名空间中的符号(_Y)
zh_hant: 顯示未開啟之命名空間中的符號(_Y)

source: Show completion list after a character is _deleted
cs: _Zobrazit seznam dokončení po odstranění znaku
de: Vervollstän_digungsliste nach Löschen eines Zeichens anzeigen
es: Mostrar lista de finalización después de _eliminar un carácter
fr: Afficher la liste de saisie semi-automatique après la suppression d'un _caractère
it: Mostra _elenco di completamento dopo l'eliminazione di un carattere
ja: 文字が削除された後に入力候補一覧を表示する(_D)
ko: 문자를 삭제하면 완성 목록 표시(_D)
pl: Pokaż listę _uzupełniania po usunięciu znaku
pt_br: Mostrar lista de conclusão após um caractere ser _excluído
ru: Показывать список завершения после удалени_я знака
tr: Bir karakter _silindikten sonra tamamlanma listesini göster
zh_hans: 删除字符后显示完成列表(_D)
zh_hant: 刪除一個字元後顯示完成清單(_D)

source: _Show completion list after a character is typed
cs: _Zobrazovat seznam dokončení po zadání znaku
de: _Vervoll­ständigungsliste nach Eingabe eines Zeichens anzeigen
es: _Mostrar lista de finalización después de escribir un carácter
fr: _Afficher la liste de saisie semi-automatique après la saisie d'un caractère
it: Mo_stra elenco di completamento dopo la digitazione di un carattere
ja: 文字が入力された後に入力候補一覧を表示する(_S)
ko: 문자를 입력하면 완성 목록 표시(_S)
pl: _Pokaż listę uzupełniania po wpisaniu znaku
pt_br: _Mostrar lista de conclusão depois que um caractere é digitado
ru: _Показывать список завершения после ввода знака
tr: Bir karakter yazıldıktan sonra tamamlanma listesini _göster
zh_hans: 键入字符后显示完成列表(_S)
zh_hant: 輸入一個字元後顯示完成清單(_S)

source: _Enable in-memory cross project references
cs: _Povolit odkazy mezi projekty v paměti
de: Proj_ektübergreifende Verweise im Arbeitsspeicher aktivieren
es: _Habilitar referencias entre proyectos en memoria
fr: _Activer les références de projet croisé en mémoire
it: _Abilita i riferimenti tra progetti in memoria
ja: メモリ内のプロジェクト間参照を有効にする(_E)
ko: 메모리 내 크로스 프로젝트 참조 사용(_E)
pl: _Włącz odwołania między projektami w pamięci
pt_br: _Habilitar referências de projeto cruzado na memória
ru: _Включить перекрестные ссылки между проектами в памяти
tr: _Bellek içi çapraz proje başvurularını etkinleştir
zh_hans: 启用内存中跨项目引用(_E)
zh_hant: 允許記憶體內跨專案參考(_E)

source: S_how navigation links as
cs: Zo_brazit navigační odkazy jako
de: Navigationslink_s anzeigen als
es: M_ostrar vínculos de navegación como
fr: Affic_her les liens de navigation en tant que
it: M_ostra collegamenti di navigazione come
ja: 次としてナビゲーション リンクを表示する(_H)
ko: 탐색 링크를 다음으로 표시(_H)
pl: P_okaż linki nawigacyjne jako
pt_br: E_xibir link de navegação como
ru: П_оказать ссылки навигации как
tr: Gezinti bağlantılarını farklı _göster
zh_hans: 导航链接显示方式(_H)
zh_hant: 顯示導覽連結為(_H)

source: Show remarks in Quick Info
cs: Zobrazit poznámky v Rychlých informacích
de: Hinweise in QuickInfo anzeigen
es: Mostrar comentarios en Información rápida
fr: Afficher les notes dans Info express
it: Mostra i commenti in Informazioni rapide
ja: クイック ヒントに注釈を表示する
ko: 요약 정보에 설명 표시
pl: Pokaż uwagi w szybkich podpowiedziach
pt_br: Mostrar os comentários nas Informações Rápidas
ru: Показать заметки в кратких сведениях
tr: Hızlı Bilgi notlarını göster
zh_hans: 在快速信息中显示备注
zh_hant: 在快速諮詢中顯示備註

# Simplify_name_code_fix
source: Simplify names (remove unnecessary qualifiers)
cs: Zjednodušit názvy (odebrat nepotřebné kvalifikátory)
de: Namen vereinfachen (unnötige Qualifizierer entfernen)
es: Simplificar nombres (quitar calificadores innecesarios)
fr: Simplifier les noms (supprimer les qualificateurs inutiles)
it: Semplifica nomi (rimuovi qualificatori non necessari)
ja: 名前の簡略化する (不要な修飾子の削除)
ko: 이름 단순화(불필요한 한정자 제거)
pl: Uprość nazwy (usuń niepotrzebne kwalifikatory)
pt_br: Simplificar nomes (remover qualificadores desnecessários)
ru: Упростить имена (удалить ненужные квалификаторы)
tr: Adları basitleştir (gereksiz niteleyicileri kaldır)
zh_hans: 简化名称(删除不必要的限定符)
zh_hant: 簡化名稱 (移除不必要的限定詞)

source: _Solid underline
cs: _Plné podtržení
de: _Durchgezogene Unterstreichung
es: Su_brayado sólido
fr: Soulig_nement avec un trait uni
it: Sottolineatura _continua
ja: 実線の下線(_S)
ko: 실선 밑줄(_S)
pl: Podkreślenie _ciągłe
pt_br: Sublinhado _sólido
ru: _Сплошнное подчеркивание
tr: _Kesintisiz alt çizgi
zh_hans: 实线下划线(_S)
zh_hant: 實線底線(_S)

source: Text hover
cs: Přechod myší nad textem
es: Texto al pasar el puntero
fr: Survol du texte
it: Passaggio del puntatore sul testo
ja: テキスト ホバー
ko: 텍스트 호버
pl: Najechanie kursorem na tekst
pt_br: Foco do texto
ru: Текст, отображаемый при наведении
tr: Metni vurgulama
zh_hans: 文本悬停
zh_hant: 文字暫留
