Repository: dotnet/fsharp
Catalog: vsintegration/src/FSharp.UIResources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Tooltip_preferred_description_width_in_characters
source: Format signature to the given width by adding line breaks conforming with F# syntax rules.
cs: Umožňuje formátovat podpis na danou šířku přidáním konců řádků odpovídajících pravidlům syntaxe F#.
de: Formatieren Sie die Signatur in der angegebenen Breite, indem Sie Zeilenumbrüche hinzufügen, die F#-Syntaxregeln entsprechen.
es: Da formato a la firma al ancho dado agregando saltos de línea conforme a las reglas de sintaxis de F#.
fr: Formatez la signature à la largeur donnée en ajoutant des sauts de ligne conformes aux règles de syntaxe F#.
it: Consente di formattare la firma in base alla larghezza specificata aggiungendo interruzioni di riga conformi alle regole di sintassi F#.
ja: F# 構文規則に準拠した改行を追加して、署名を指定された幅に書式設定します。
ko: F# 구문 규칙에 맞는 줄 바꿈을 추가하여 지정된 너비에 시그니처의 서식을 지정합니다.
pl: Sformatuj sygnaturę na daną szerokość, dodając podziały wierszy zgodne z regułami składni języka F#.
pt_br: Formate a assinatura para a largura fornecida adicionando quebras de linha em conformidade com as regras de sintaxe F#.
ru: Форматирование подписи до заданной ширины путем добавления разрывов строк, соответствующих правилам синтаксиса F#.
tr: F# söz dizimi kurallarına uyan satır sonları ekleyerek imzayı belirtilen genişliğe biçimlendirin.
zh_hans: 通过添加符合 F# 语法规则的换行符，将签名设置为给定宽度的格式。
zh_hant: 透過新增符合 F# 語法規則的分行符號，將簽章格式設定為指定寬度。

# TransparentCompiler
source: Transparent Compiler (experimental)
cs: Transparentní kompilátor (experimentální)
de: Transparenter Compiler (experimentell)
es: Compilador transparente (experimental)
fr: Transparent Compiler (expérience)
it: Compilatore Transparent (sperimentale)
ja: Transparent Compiler (試験段階)
ko: 투명한 컴파일러(실험적)
pl: Kompilator przezroczysty (eksperymentalny)
pt_br: Compilador Transparente (experimental)
ru: Прозрачный компилятор (экспериментальная функция)
tr: Saydam Derleyiciyi kullan (deneysel)
zh_hans: 透明编译器(实验性)
zh_hant: 透明編譯器 (實驗性)

# TransparentCompiler_Discalimer1
source: WARNING! Transparent Compiler does not yet support all features and can cause crashes or give incorrect results.
it: AVVISO Il compilatore Transparent non supporta ancora tutte le funzionalità e può causare arresti anomali o fornire risultati non corretti.
ja: 警告Transparent Compiler は、現時点ですべての機能に対応しておらず、クラッシュを引き起こしたり、正しくない結果を出力したりする可能性があります。
ko: 경고! 투명 컴파일러는 아직 모든 기능을 지원하지 않으며 충돌을 발생시키거나 잘못된 결과를 제공할 수 있습니다.
zh_hans: 警告!透明编译器尚不支持所有功能，可能会导致崩溃或提供错误结果。

# TransparentCompiler_Discalimer2
source: Use at your own risk!
it: Usalo a tuo rischio e pericolo.
ja: ご使用は自己責任でお願いいたします。
ko: 본인 책임하에 사용하세요!
zh_hans: 自行承担风险!

# TransparentCompiler_Discalimer3
source: By checking this you also opt-in for additional performance telemetry
it: Selezionando questa opzione si acconsente esplicitamente anche alla telemetria aggiuntiva delle prestazioni
ja: これを確認すると、追加のパフォーマンス テレメトリもオプトインします
ko: 이를 확인하여 추가 성능 원격 분석을 옵트인합니다.
zh_hans: 选中此项即表示你也选择加入其他性能遥测

source: Transparent Compiler Cache Factor
cs: Faktor mezipaměti transparentního kompilátoru
de: Cache-Faktor es transparenten Compilers
es: Factor de caché del compilador transparente
fr: Facteur de cache du Transparent Compiler
it: Fattore cache del compilatore Trasparent
ko: 투명한 컴파일러 캐시 팩터
pl: Współczynnik pamięci podręcznej kompilatora przezroczystego
pt_br: Fator de cache do Compilador Transparente
ru: Коэффициент кэша прозрачного компилятора
tr: Saydam Derleyici Önbellek Faktörü
zh_hans: 透明编译器缓存因数
zh_hant: 透明編譯程式快取因數

# Transparent_Compiler_Cache_Factor_Tooltip
source: Higher number means more memory will be used for caching. Changing the value wipes cache.
cs: Vyšší počet znamená, že pro ukládání do mezipaměti se bude používat více paměti. Změna hodnoty vymaže mezipaměť.
de: Eine höhere Zahl bedeutet, dass mehr Arbeitsspeicher zum Zwischenspeichern verwendet wird. Beim Ändern des Werts wird der Cache geleert.
es: Un número mayor significa que se usará más memoria para el almacenamiento en caché. Al cambiar el valor, se borra la memoria caché.
fr: Un nombre plus élevé signifie que davantage de mémoire va être utilisée pour la mise en cache. Modification du cache des effacements de valeur.
it: Un numero maggiore indica che per la memorizzazione nella cache verrà utilizzata una quantità maggiore di memoria. Modifica della cache delle cancellazioni dei valori.
ja: 数値が大きいほど、キャッシュに使用されるメモリが多くなります。値を変更するとキャッシュがワイプされます。
ko: 숫자가 높을수록 캐싱에 더 많은 메모리가 사용됩니다. 값을 변경하면 캐시가 초기화됩니다.
pl: Większa liczba oznacza, że na potrzeby buforowania będzie używana większa ilość pamięci. Zmiana wartości powoduje wyczyszczenie pamięci podręcznej.
pt_br: Um número maior significa que mais memória será usada para o cache. A alteração do valor apaga o cache.
ru: Чем больше число, тем больше памяти будет использоваться для кэширования. Изменение значения очищает кэш.
tr: Sayının yüksek olması, önbelleğe alma için daha fazla bellek kullanılacağı anlamına gelir. Değerin değiştirilmesi önbelleğini siler.
zh_hans: 数字越大，表示将使用更多内存进行缓存。更改值擦除缓存。
zh_hant: 較高的數目表示將使用更多的記憶體來快取。變更值抹除快取。

# Transparent_Compiler_Snapshot_Reuse
source: Create new project snapshots from existing ones
cs: Vytvořit nové snímky projektu z existujících
de: Neue Projektmomentaufnahmen aus vorhandenen erstellen
es: Crear nuevas instantáneas de proyecto a partir de las existentes
fr: Créer des instantanés de projet à partir de ceux existants
it: Crea nuovi snapshot del progetto da quelli esistenti
ja: 既存のプロジェクト スナップショットから新しいプロジェクト スナップショットを作成する
ko: 기존 스냅샷에서 새 프로젝트 스냅샷 만들기
pl: Utwórz nowe migawki projektu na podstawie istniejących
pt_br: Criar novos instantâneos de projeto a partir dos existentes
ru: Создавать новые моментальные снимки проекта из существующих
tr: Mevcut proje anlık görüntülerinden yenilerini oluşturma
zh_hans: 从现有项目快照中新建
zh_hant: 從現有的專案建立新的專案快照集

# Unused_opens_code_fix
source: Remove unused open statements
cs: Odebrat nepoužívané otevřené výkazy
de: Nicht verwendete "open"-Anweisungen entfernen
es: Quitar instrucciones open no usadas
fr: Supprimer les instructions open inutilisées
it: Rimuovi istruzioni OPEN inutilizzate
ja: 未使用の Open ステートメントを削除する
ko: 사용되지 않는 open 문 제거
pl: Usuń nieużywane otwarte instrukcje
pt_br: Remover instruções abertas não usadas
ru: Удалить неиспользуемые открытые операторы
tr: Kullanılmayan açık deyimleri kaldır
zh_hans: 删除未使用的 open 语句
zh_hant: 移除未使用的 open 陳述式

# Unused_declaration_code_fix
source: Analyze and suggest fixes for unused values
cs: Analyzovat a navrhnout opravy pro nepoužité hodnoty
de: Korrekturen für nicht verwendete Werte analysieren und vorschlagen
es: Analizar y sugerir correcciones para valores no utilizados
fr: Analyser et proposer des solutions pour les valeurs inutilisées
it: Analizza e suggerisci correzioni per valori inutilizzati
ja: 未使用の値を分析して修正を提案する
ko: 사용되지 않는 값에 대해 수정 사항 분석 및 제안
pl: Analizuj nieużywane wartości i sugeruj dla nich poprawki
pt_br: Analisar e sugerir correções de valores não usados
ru: Проанализировать и предложить исправления для неиспользуемых значений
tr: Kullanılmayan değerlere yönelik düzeltmeleri çözümle
zh_hans: 分析未使用的值并建议相应的修补程序
zh_hant: 分析未使用的值並建議修正

# Block_Structure
source: Block Structure Guides
cs: Vodítka pro strukturu bloku
de: Führungslinien für Blockstruktur
es: Guías de estructura de bloque
fr: Repères de structure de bloc
it: Guide per strutture a blocchi
ja: ブロック構造のガイド
ko: 블록 구조 가이드
pl: Prowadnice struktury blokowej
pt_br: Guias de Estrutura de Bloco
ru: Направляющие для структуры блоков
tr: Blok Yapısı Kılavuzları
zh_hans: 块结构指南
zh_hant: 區塊結構輔助線

# Show_guides
source: Show structure guidelines for F# code
cs: Zobrazí pokyny pro strukturu kódu F#.
de: Strukturführungslinien für F#-Code anzeigen
es: Mostrar las guías de la estructura del código F#
fr: Afficher les directives de structure pour le code F#
it: Mostra le linee guida della struttura per il codice F#
ja: F# コードの構造のガイドラインを表示する
ko: F# 코드에 대한 구조체 지침 표시
pl: Pokaż wskazówki dotyczące struktury dla kodu języka F#
pt_br: Mostrar as diretrizes de estrutura para o código F#
ru: Показать рекомендации по структуре для кода F#
tr: F# kodu için yapı yönergelerini göster
zh_hans: 显示 F# 代码的结构指南
zh_hant: 顯示 F# 程式碼的結構方針

source: Outlining
cs: Sbalení
de: Gliederung
es: Esquematización
fr: Mode plan
it: Struttura
ja: アウトライン
ko: 개요
pl: Konspekt
pt_br: Estrutura de Tópicos
ru: Структура
tr: Ana Hat
zh_hans: 大纲
zh_hant: 大綱

# Show_Outlining
source: Show outlining and collapsible nodes for F# code
cs: Zobrazí osnovu a sbalitelné uzly kódu F#.
de: Gliederung und ausblendbare Knoten für F#-Code anzeigen
es: Mostrar los nodos de esquematización y contraíbles del código de F#
fr: Afficher les nœuds de plan ou réductibles pour le code F#
it: Mostra i nodi struttura e comprimibili per il codice F#
ja: F# コードのアウトラインおよび折りたたみ可能なノードを表示する
ko: F# 코드에 대한 개요 및 축소 가능한 노드 표시
pl: Pokaż konspekt i węzły z możliwością zwijania dla kodu języka F#
pt_br: Mostrar os nós de estrutura de tópicos e recolhíveis para o código F#
ru: Показать структурирование и свертываемые узлы для кода F#
tr: F# kodu için ana hattı ve daraltılabilir düğümleri göster
zh_hans: 显示 F# 代码的大纲显示节点和可折叠节点
zh_hant: 顯示 F# 程式碼的大綱與可折疊的節點

# Time_until_stale_completion
source: Time until stale results are used (in milliseconds)
cs: Doba, do kdy se budou používat zastaralé výsledky (v milisekundách)
de: Zeit bis zur Verwendung veralteter Ergebnisse (in Millisekunden)
es: Tiempo hasta que se utilizan los resultados obsoletos (en milisegundos)
fr: Délai avant l'utilisation des résultats périmés (en millisecondes)
it: Intervallo di utilizzo dei risultati non aggiornati (in millisecondi)
ja: 古い結果が使用されるまでの時間 (ミリ秒)
ko: 부실 결과가 사용될 때까지 시간(밀리초)
pl: Czas do użycia nieodświeżonych wyników (w milisekundach)
pt_br: Tempo até que os resultados obsoletos sejam utilizados (em milissegundos)
ru: Используются результаты времени до устаревания (в мс)
tr: Eski sonuçların kullanılması için geçecek süre (milisaniye cinsinden)
zh_hans: 使用过时结果前等待的时间(以毫秒计)
zh_hant: 使用過時結果前等待的時間 (毫秒)

# IntelliSense_Performance
source: IntelliSense Performance Options
cs: Možnosti výkonu pro IntelliSense
de: Optionen zur IntelliSense-Leistung
es: Opciones de rendimiento de IntelliSense
fr: Options relatives aux performances d'IntelliSense
it: Opzioni per le prestazioni IntelliSense
ja: IntelliSense のパフォーマンス オプション
ko: IntelliSense 성능 옵션
pl: Opcje wydajności IntelliSense
pt_br: Opções de desempenho do IntelliSense
ru: Параметры производительности IntelliSense
tr: IntelliSense Performans Seçenekleri
zh_hans: IntelliSense 性能选项
zh_hant: IntelliSense 效能選項

# Project_Performance
source: F# Project and Caching Performance Options
cs: Možnosti výkonu pro ukládání do mezipaměti a projekt F#
de: Optionen zur F#-Projekt- und Cacheleistung
es: Opciones de rendimiento de almacenamiento en caché y proyectos de F#
fr: Options relatives aux performances de la mise en cache et des projets F#
it: Opzioni per le prestazioni di memorizzazione nella cache e progetti F#
ja: F# プロジェクトとキャッシュのパフォーマンス オプション
ko: F# 프로젝트 및 캐싱 성능 옵션
pl: Opcje wydajności buforowania i projektów F#
pt_br: Projeto em F# e opções de desempenho em cache
ru: Проект F# и параметры производительности кэширования
tr: F# Proje ve Önbelleğe Alma Performansı Seçenekleri
zh_hans: F# 项目和缓存性能选项
zh_hant: F# 專案與快取效能選項

# Enable_Stale_IntelliSense_Results
source: Enable stale data for IntelliSense features
cs: Povolit zastaralá data pro funkce IntelliSense
de: Veraltete Daten für IntelliSense-Features aktivieren
es: Habilitar datos obsoletos para características de IntelliSense
fr: Activer les données périmées pour les fonctionnalités IntelliSense
it: Abilita dati non aggiornati per le funzionalità IntelliSense
ja: IntelliSense 機能に対して古いデータを有効にする
ko: IntelliSense 기능에 대해 부실 데이터 사용
pl: Włącz dane nieodświeżone na potrzeby funkcji IntelliSense
pt_br: Habilitar dados obsoletos para os recursos do IntelliSense
ru: Включение устаревших данных для функций IntelliSense
tr: IntelliSense özellikleri için eski verileri etkinleştir
zh_hans: 针对 IntelliSense 功能启用过时数据
zh_hant: 為 IntelliSense 功能啟用過時資料

# Tooltip_in_memory_cross_project_references
source: In-memory cross-project references store project-level data in memory to allow IDE features to work across projects.
cs: V odkazech v paměti pro různé projekty jsou uložená data na úrovni projektů, aby mohly mezi projekty fungovat funkce IDE.
de: Bei projektübergreifenden In-Memory-Verweisen werden Daten auf Projektebene im Arbeitsspeicher abgelegt, damit IDE-Features projektübergreifend verwendet werden können.
es: Las referencias en memoria entre proyectos almacenan los datos de nivel de proyecto en memoria para permitir que las características del IDE funcionen de unos proyectos a otros.
fr: Les références inter-projets en mémoire stockent les données de niveau projet dans la mémoire pour permettre aux fonctionnalités de l'IDE de fonctionner sur plusieurs projets.
it: I riferimenti tra progetti in memoria consentono di archiviare in memoria i dati a livello di progetto per consentire l'uso di funzionalità IDE tra progetti.
ja: メモリ内のプロジェクト間参照に、プロジェクトをまたいで IDE 機能を動作可能にするプロジェクト レベルのデータが格納されます。
ko: 메모리 내 크로스 프로젝트 참조가 메모리에 프로젝트 수준 데이터를 저장하여 IDE 기능이 프로젝트에서 작동하도록 합니다.
pl: Odwołania między projektami w pamięci przechowują dane na poziomie projektu w pamięci, aby umożliwić funkcjom środowiska IDE działanie w wielu projektach.
pt_br: As referências entre projetos na memória armazenam os dados de nível de projeto na memória para permitir que os recursos do IDE funcionem nos projetos.
ru: Перекрестные ссылки между проектами в памяти хранят данные уровня проекта в памяти, поэтому функции и компоненты IDE могут работать в разных проектах.
tr: Bellek içi projeler arası başvurular, IDE özelliklerinin farklı projelerde çalışmasına imkan tanımak için bellekte proje düzeyi veriler depolar.
zh_hans: 内存中跨项目引用将项目级数据存储在内存中，让 IDE 功能能够跨项目工作。
zh_hant: 記憶體內跨專案參考，會在記憶體中儲存專案等級的資料，以允許 IDE 功能在各專案中皆可運作。

# Enter_key_always
source: Always add new line on enter
cs: Při stisku Enter vždy přidat nový řádek
de: Nach Drücken der EINGABETASTE immer neue Zeile hinzufügen
es: Siempre agregar una nueva línea al pulsar Intro
fr: Toujours ajouter une nouvelle ligne en appuyant sur Entrée
it: Aggiungi sempre una nuova riga dopo INVIO
ja: Enter を押すと常に新しい行を追加します
ko: 입력 시 새 줄 항상 추가
pl: Zawsze dodawaj nowy wiersz po naciśnięciu klawisza Enter
pt_br: Sempre adicionar uma nova linha ao pressionar enter
ru: Всегда добавлять новую строку при нажатии клавиши ВВОД
tr: Enter'a basıldığında her zaman yeni satır ekle
zh_hans: 始终在按下 Enter 时添加新行
zh_hant: 一律在按 ENTER 時新增新行

# Enter_key_never
source: Never add new line on enter
cs: Při stisku Enter nikdy nepřidávat nový řádek
de: Nach Drücken der EINGABETASTE niemals neue Zeile hinzufügen
es: Nunca agregar una nueva línea al pulsar Intro
fr: Ne jamais ajouter de nouvelle ligne en appuyant sur Entrée
it: Non aggiungere mai una nuova riga dopo INVIO
ja: Enter 時に新しい行を追加しません
ko: 입력 시 새 줄 추가 안 함
pl: Nigdy nie dodawaj nowego wiersza po naciśnięciu klawisza Enter
pt_br: Nunca adicionar uma nova linha ao entrar
ru: Никогда не добавлять новую строку при нажатии клавиши ВВОД
tr: Enter'a basıldığında hiçbir zaman yeni satır ekleme
zh_hans: 永远不要在点击回车后添加新行
zh_hant: 一律不在按 ENTER 時新增新行

# Enter_key_only
source: Only add new line on enter after end of fully typed word
cs: Při stisku Enter přidat nový řádek jenom po dopsání celého slova
de: Nach Drücken der EINGABETASTE nur nach dem Ende eines vollständigen Worts neue Zeile hinzufügen
es: Solo agregar una nueva línea al pulsar Intro cuando se haya terminado de escribir completamente una palabra
fr: Ajouter une nouvelle ligne en appuyant sur Entrée seulement après la fin d'un mot entièrement tapé
it: Aggiungi una nuova riga dopo INVIO solo alla fine della parola digitata
ja: 単語を完全に入力した後 Enter キーで新しい行のみを追加する
ko: 단어를 모두 입력하고 <Enter> 키를 누르면 새 줄 추가
pl: Dodaj nowy wiersz tylko po naciśnięciu klawisza Enter na końcu w pełni wpisanego wyrazu
pt_br: Somente adiciona uma nova linha após digitar toda palavra
ru: Добавлять только новую строку при нажатии клавиши ВВОД после полностью введенного слова
tr: Yalnızca tam olarak yazılmış bir kelimeden sonra Enter'a basıldığında yeni satır ekle
zh_hans: 只在键入完整的单词后点击回车后才添加新行
zh_hant: 只在完整鍵入字的結尾處按 ENTER 來新增新行

# Enter_Key_Rule
source: Enter key behavior
cs: Chování klávesy Enter
de: Eingabetastenverhalten
es: Comportamiento de la tecla Intro
fr: Entrer le comportement de la touche
it: Comportamento del tasto INVIO
ja: Enter キー入力時動作
ko: 키 동작 입력
pl: Zachowanie klawisza Enter
pt_br: Inserir comportamento da tecla
ru: Действие при нажатии клавиши ВВОД
tr: Enter tuşu davranışı
zh_hans: 回车键的行为
zh_hant: ENTER 鍵行為

# Format_on_paste
source: Re-format indentation on paste (Experimental)
cs: Znovu naformátovat odsazení při vložení (experimentální)
de: Einzug beim Einfügen erneut formatieren (experimentell)
es: Volver a aplicar formato a la sangría al pegar (experimental)
fr: Formater de nouveau la mise en retrait lors du collage (expérimental)
it: Riformattar il rientro dopo operazione incolla (sperimentale)
ja: 貼り付け時にインデントを再フォーマットする (試験段階)
ko: 붙여넣을 때 들여쓰기 서식 다시 지정(실험적)
pl: Ponowne formatowanie wcięcia przy wklejeniu (eksperymentalne)
pt_br: Reformatar o recuo na pasta (Experimental)
ru: Повторно форматировать отступы при вставке (экспериментальная функция)
tr: Yapıştırırken girintiyi yeniden biçimlendir (Deneysel)
zh_hans: 粘贴时重新设置缩进格式(实验)
zh_hant: 在貼上時重新格式化縮排 (實驗性)

# Suggest_names_for_errors_code_fix
source: Suggest names for unresolved identifiers
cs: Navrhovat názvy pro nerozpoznané identifikátory
de: Namen für nicht aufgelöste Bezeichner vorschlagen
es: Sugerir nombres para los identificadores no resueltos
fr: Suggérer des noms pour les identificateurs non résolus
it: Suggerisci nomi per gli identificatori non risolti
ja: 未解決の識別子の名前を提案します
ko: 확인되지 않은 식별자의 이름 제안
pl: Sugeruj nazwy w przypadku nierozpoznanych identyfikatorów
pt_br: Sugerir nomes para identificadores não resolvidos
ru: Предлагать имена для неразрешенных идентификаторов
tr: Çözümlenmemiş tanımlayıcılar için ad öner
zh_hans: 为未解析标识符建议名称
zh_hant: 為未解析的識別碼建議名稱

# Use_Transparent_Compiler
source: Use Transparent Compiler (restart required)
cs: Použít transparentní kompilátor (vyžaduje se restart)
de: Transparenten Compiler verwenden (Neustart erforderlich)
es: Uso del compilador transparente (es necesario reiniciar)
fr: Utiliser Transparent Compiler (redémarrage requis)
it: Usa il compilatore Transparent (riavvio necessario)
ja: Transparent Compiler を使用する (再起動が必要)
ko: 투명한 컴파일러 사용(다시 시작해야 함)
pl: Użyj kompilatora przezroczystego (wymagane ponowne uruchomienie)
pt_br: Use o Compilador Transparente (é necessário reiniciar)
ru: Использовать прозрачный компилятор (требуется перезагрузка)
tr: Saydam Derleyiciyi kullan (yeniden başlatma gereklidir)
zh_hans: 使用透明编译器(需要重启)
zh_hant: 使用透明編譯器 (需要重新啟動)

# Use_syntax_tree_cache
source: Cache parsing results (experimental)
de: Cacheanalyseergebnisse (experimentell)
fr: Résultats de l'analyse du cache (expérimental)
it: Risultati dell'analisi della cache (sperimentale)
ja: キャッシュ解析の結果 (試験段階)
ko: 캐시 구문 분석 결과(실험적)
pl: Wyniki analizy pamięci podręcznej (eksperymentalne)
zh_hans: 缓存分析结果(实验性)
