Repository: dotnet/fsharp
Catalog: vsintegration/src/FSharp.ProjectSystem.FSharp/xlf/VSPackage.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ProjectReferenceError2
source: You must build the target project before it can be referenced.
cs: Než bude moci být projekt odkazován, musí být cílový projekt nejprve sestaven.
de: Sie müssen das Zielprojekt erstellen, bevor darauf verwiesen werden kann.
es: Debe compilar el proyecto de destino para poder hacer referencia a él.
fr: Vous devez générer le projet cible pour qu'il puisse être référencé.
it: Per poter fare riferimento al progetto di destinazione è prima necessario compilarlo.
ja: ターゲット プロジェクトを参照するには、その前に構築する必要があります。
ko: 대상 프로젝트를 빌드해야 참조할 수 있습니다.
pl: Zanim będzie można odwołać się do projektu docelowego, musisz go skompilować.
pt_br: Você precisa compilar o projeto de destino antes dele ser referenciado.
ru: Для ссылки на конечный проект необходимо сначала выполнить его сборку.
tr: Hedef projeye başvurulabilmesi için önce onu oluşturmanız gerekiyor.
zh_hans: 必须先生成目标项目，然后才能对其进行引用。
zh_hant: 您必須先建置目標專案，然後才能參考它。

source: Application
cs: Aplikace
de: Anwendung
es: Aplicación
it: Applicazione
ja: アプリケーション
ko: 애플리케이션
pl: Aplikacja
pt_br: Aplicativo
ru: Приложение
tr: Uygulama
zh_hans: 应用程序
zh_hant: 應用程式

source: Assembly Name
cs: Název sestavení
es: Nombre del ensamblado
fr: Nom de l'assembly
it: Nome dell'assembly
ja: アセンブリ名
ko: 어셈블리 이름
pl: Nazwa zestawu
pt_br: Nome do Assembly
ru: Имя сборки
tr: Bütünleştirilmiş Kod Adı
zh_hans: 程序集名称
zh_hant: 組件名稱

# AssemblyNameDescription
source: The name of the output file that will hold assembly metadata.
cs: Název výstupního souboru, ve kterém se uloží metadata sestavení
de: Der Name der Ausgabedatei, in der die Assemblymetadaten gespeichert werden.
es: Nombre del archivo de salida que incluirá los metadatos del ensamblado.
fr: Nom du fichier de sortie contenant les métadonnées de l'assembly.
it: Nome del file di output che conterrà i metadati dell'assembly.
ja: アセンブリ メタデータを保持する出力ファイルの名前です。
ko: 어셈블리 메타데이터를 저장할 출력 파일의 이름입니다.
pl: Nazwa pliku wyjściowego, w którym będą przechowywane metadane zestawu.
pt_br: O nome do arquivo de saída que manterá os metadados do assembly.
ru: Имя выходного файла, который будет содержать метаданные сборки.
tr: Bütünleştirilmiş kod meta verilerini tutacak çıkış dosyasını adı.
zh_hans: 将用来保存程序集元数据的输出文件的名称。
zh_hant: 用來存放組件中繼資料的輸出檔案名稱。

source: Output Type
cs: Typ výstupu
de: Ausgabetyp
es: Tipo de resultado
fr: Type de sortie
it: Tipo di output
ja: 出力の種類
ko: 출력 형식
pl: Typ wyjściowy
pt_br: Tipo de Saída
ru: Тип выходных данных
tr: Çıkış Türü
zh_hans: 输出类型
zh_hant: 輸出類型

# OutputTypeDescription
source: The type of application to build.
cs: Typ aplikace, která má být vytvořena
de: Typ der zu erstellenden Anwendung.
es: Tipo de aplicación que se va a compilar.
fr: Type d'application à générer.
it: Tipo di applicazione da compilare.
ja: ビルドするアプリケーションの種類です。
ko: 빌드할 애플리케이션의 유형입니다.
pl: Typ aplikacji do skompilowania.
pt_br: Tipo de aplicativo para compilação.
ru: Тип собираемого приложения.
tr: Oluşturulacak uygulamanın türü.
zh_hans: 要生成的应用程序的类型。
zh_hant: 要建置的應用程式類型。

source: Default Namespace
cs: Výchozí obor názvů
de: Standardnamespace
es: Espacio de nombres predeterminado
fr: Espace de noms par défaut
it: Spazio dei nomi predefinito
ja: 既定の名前空間
ko: 기본 네임스페이스
pl: Domyślna przestrzeń nazw
pt_br: Namespace Padrão
ru: Пространство имен по умолчанию
tr: Varsayılan Ad Alanı
zh_hans: 默认命名空间
zh_hant: 預設命名空間

# DefaultNamespaceDescription
source: Specifies the default namespace for added items, such as classes, that are added via the Add New Item Dialog Box.
cs: Určuje výchozí obor názvů pro přidané položky, například třídy, které budou přidány prostřednictvím dialogového okna Přidat novou položku.
de: Gibt den Standardnamespace für hinzugefügte Elemente, wie Klassen, an, die über das Dialogfeld "Neue Elemente hinzufügen" hinzugefügt werden.
es: Especifica el espacio de nombres predeterminado para los elementos agregados, como las clases, que se agregan mediante el cuadro de diálogo Agregar nuevo elemento.
fr: Spécifie l'espace de noms par défaut pour les éléments ajoutés, tels que les classes, qui sont ajoutés via la boîte de dialogue Ajouter un nouvel élément.
it: Specifica lo spazio dei nomi predefinito per gli elementi, quali le classi, aggiunti tramite la finestra di dialogo Aggiungi nuovo elemento.
ja: [新しい項目の追加]5D; ダイアログ ボックスで追加されるクラスのような、追加項目に対する既定の名前空間を指定します。
ko: 클래스처럼 [새 항목 추가]5D; 대화 상자를 통해 추가한 항목에 대해 기본 네임스페이스를 지정합니다.
pl: Określa domyślną przestrzeń nazw dla dodawanych elementów, takich jak klasy, które są dodawane w oknie dialogowym Dodawanie nowego elementu.
pt_br: Especifica o namespace padrão para itens adicionados, como classes, que são adicionados por meio da Caixa de Diálogo Adicionar Novo Item.
ru: Определяет пространство имен, используемое по умолчанию для добавляемых элементов, например, для классов, добавляемых через диалоговое окно "Добавить новый элемент".
tr: Eklenen öğeler (Yeni Öğe Ekle iletişim kutusundan eklenen sınıflar gibi) için kullanılacak varsayılan ad alanını belirtir.
zh_hans: 为通过“添加新项”对话框添加的项(如类)指定默认命名空间。
zh_hant: 為已經加入的項目指定預設命名空間，例如經由 [加入新項目]5D; 對話方塊加入的類別。

source: Startup Object
cs: Spouštěcí objekt
de: Startobjekt
es: Objeto de inicio
fr: Objet de démarrage
it: Oggetto di avvio
ja: スタートアップ オブジェクト
ko: 시작 개체
pl: Obiekt startowy
pt_br: Objeto de Inicialização
ru: Автоматически запускаемый объект
tr: Başlangıç Nesnesi
zh_hans: 启动对象
zh_hant: 啟始物件

# StartupObjectDescription
source: The name of the class that contains the static Main method that you want called when you launch your application.
cs: Název třídy obsahující statickou metodu Main, která se má volat při spuštění aplikace
de: Der Name der Klasse, die die statische Hauptmethode enthält, die beim Start der Anwendung aufgerufen werden soll.
es: Nombre de la clase que contiene el método Main estático al que desea llamar cuando se inicia la aplicación.
fr: Nom de la classe qui contient la méthode Main statique à appeler lors du lancement de votre application.
it: Nome della classe che contiene il metodo Main statico da chiamare all'avvio dell'applicazione.
ja: アプリケーションの起動時に呼び出す静的な Main メソッドを含むクラスの名前です。
ko: 애플리케이션을 시작할 때 호출할 정적 Main 메서드를 포함하는 클래스의 이름입니다.
pl: Nazwa klasy zawierającej statyczną metodę Main, która ma być wywoływana podczas uruchamiania aplikacji.
pt_br: O nome da classe que contém o método estático Main que você deseja chamar ao iniciar o seu aplicativo.
ru: Имя класса, содержащего статический метод Main, который нужно вызвать при запуске приложения.
tr: Uygulamanızı başlatacağınız zaman çağrılmasını istediğiniz statik Main metodunu içeren sınıfın adı.
zh_hans: 包含要在应用程序启动时调用的静态 Main 方法的类的名称。
zh_hant: 包含啟動應用程式時要呼叫之靜態 Main 方法的類別名稱。

source: Application Icon
cs: Ikona aplikace
de: Anwendungssymbol
es: Icono de aplicación
fr: Icône d'application
it: Icona dell'applicazione
ja: アプリケーション アイコン
ko: 애플리케이션 아이콘
pl: Ikona aplikacji
pt_br: Ícone do Aplicativo
ru: Значок приложения
tr: Uygulama Simgesi
zh_hans: 应用程序图标
zh_hant: 應用程式圖示

# ApplicationIconDescription
source: Sets the .ico file to use as your application icon.
cs: Nastaví soubor ICO, který se má použít jako ikona vaší aplikace.
de: Legt die ICO-Datei fest, die als Anwendungssymbol verwendet werden soll.
es: Define el archivo .ico que se usará como icono de la aplicación.
fr: Définit le fichier .ico à utiliser comme icône d'application.
it: Imposta il file ico da utilizzare come icona dell'applicazione.
ja: アプリケーションのアイコン用に使用する .ico ファイルを設定します。
ko: 애플리케이션 아이콘으로 사용할 .ico 파일을 설정합니다.
pl: Ustawia plik ico jako ikonę aplikacji.
pt_br: Define o arquivo .ico como o ícone de seu aplicativo.
ru: Устанавливает ICO-файл в качестве значка приложения.
tr: .ico dosyasını uygulamanızın simgesi olarak kullanmak üzere ayarlar.
zh_hans: 设置用作应用程序图标的 .ico 文件。
zh_hant: 設定用來當作應用程式圖示的 .ico 檔案。

source: Project
cs: Projekt
de: Projekt
es: Proyecto
fr: Projet
it: PROGETTO
ja: プロジェクト
ko: 프로젝트
pl: Projekt
pt_br: Projeto
ru: Проект
tr: PROJE
zh_hant: 專案

source: Project File
cs: Soubor projektu
de: Projektdatei
es: Archivo de proyecto
fr: Fichier projet
it: File di progetto
ja: プロジェクト ファイル
ko: 프로젝트 파일
pl: Plik projektu
pt_br: Arquivo de Projeto
ru: Файл проекта
tr: Proje dosyası
zh_hans: 项目文件
zh_hant: 專案檔

# ProjectFileDescription
source: The name of the file containing build, configuration, and other information about the project.
cs: Název souboru, který obsahuje sestavení, konfiguraci a informace o projektu
de: Der Name der Datei mit den Build-, Konfigurations- und anderen Informationen zum Projekt.
es: Nombre del archivo que contiene la información de compilación, configuración y otros datos sobre el proyecto.
fr: Nom du fichier contenant la build, la configuration et d'autres informations sur le projet.
it: Nome del file contenente le informazioni sul progetto relative alla compilazione, alla configurazione e altro.
ja: プロジェクトのビルド、構成、およびその他の情報を含むファイルの名前です。
ko: 빌드, 구성 및 기타 프로젝트 정보가 들어 있는 파일의 이름입니다.
pl: Nazwa pliku zawierającego kompilację, konfigurację i informacje o projekcie.
pt_br: O nome do arquivo que contém a compilação, a configuração e outras informações sobre o projeto.
ru: Имя файла, содержащего сведения о сборке и конфигурации, а также другую информацию о проекте.
tr: Derleme, yapılandırma ve proje ile ilgili diğer bilgileri içeren dosyanın adı.
zh_hans: 包含有关项目的生成、配置和其他信息的文件的名称。
zh_hant: 包含組建、組態以及其他專案相關資訊之檔案的名稱。

source: Project Folder
cs: Složka projektu
de: Projektordner
es: Carpeta del proyecto
fr: Dossier du projet
it: Cartella di progetto
ja: プロジェクト フォルダー
ko: 프로젝트 폴더
pl: Folder projektu
pt_br: Pasta do Projeto
ru: Папка проекта
tr: Proje Klasörü
zh_hans: 项目文件夹
zh_hant: 專案資料夾

# ProjectFolderDescription
source: The absolute location of the project.
cs: Absolutní umístění projektu
de: Der absolute Speicherort des Projekts.
es: Ubicación absoluta del proyecto.
fr: Emplacement absolu du projet.
it: Percorso assoluto del progetto.
ja: プロジェクトの保存場所です。絶対パスで指定されます。
ko: 프로젝트의 절대 위치입니다.
pl: Lokalizacja bezwzględna projektu.
pt_br: Localização absoluta do projeto.
ru: Абсолютный путь к расположению проекта.
tr: Projenin mutlak konumu.
zh_hans: 项目的绝对位置。
zh_hant: 專案的絕對位置。

source: Output File
cs: Výstupní soubor
de: Ausgabedatei
es: Archivo de salida
fr: Fichier de sortie
it: File di output
ja: 出力ファイル
ko: 출력 파일
pl: Plik wyjściowy
pt_br: Arquivo de Saída
ru: Выходной файл
tr: Çıkış Dosyası
zh_hans: 输出文件
zh_hant: 輸出檔案

# OutputFileDescription
source: The name of the project's primary output file.
cs: Název hlavního výstupního souboru projektu
de: Der Name der primären Ausgabedatei des Projekts.
es: Nombre del archivo de salida principal del proyecto.
fr: Nom du fichier de sortie principale du projet.
it: Nome del file di output primario del progetto.
ja: プロジェクトのプライマリ出力ファイルの名前です。
ko: 프로젝트의 기본 출력 파일 이름입니다.
pl: Nazwa podstawowego pliku wyjściowego projektu.
pt_br: O nome do arquivo de saída principal do projeto.
ru: Имя основного выходного файла проекта.
tr: Projenin birincil çıkış dosyasının adı.
zh_hans: 项目的主输出文件的名称。
zh_hant: 專案主要輸出檔案的名稱。

source: Target Platform
cs: Cílová platforma
de: Zielplattform
es: Plataforma de destino
fr: Plateforme cible
it: Piattaforma di destinazione
ja: ターゲット プラットフォーム
ko: 대상 플랫폼
pl: Platforma docelowa
pt_br: Plataforma de Destino
ru: Целевая платформа
tr: Hedef Platform
zh_hans: 目标平台
zh_hant: 目標平台

# TargetPlatformDescription
source: The version of the Common Language Runtime to use for output assembly
cs: Verze modulu CLR (Common Language Runtime), která má být použita pro výstupní sestavení
de: Für die Ausgabeassembly verwendete Version von Common Language Runtime.
es: Versión de Common Language Runtime que se usará en el ensamblado de salida.
fr: Version du Common Language Runtime à utiliser pour l'assembly de sortie
it: Versione di Common Language Runtime da usare per l'assembly di output
ja: 出力アセンブリ用に使用する共通言語ランタイムのバージョンです。
ko: 출력 어셈블리에 사용할 공용 언어 런타임의 버전입니다.
pl: Wersja środowiska CLR do użycia dla zestawu wyjściowego
pt_br: A versão do Common Language Runtime a ser usada para o assembly de saída
ru: Версия общеязыковой среды выполнения (CLR) для выходной сборки
tr: Bütünleştirilmiş kod çıkışı için kullanılacak Ortak Dil Çalışma Zamanı modülünün sürümü
zh_hans: 用于输出程序集的公共语言运行时的版本
zh_hant: 用於輸出組件的 Common Language Runtime 版本

source: Target Platform Location
cs: Umístění cílové platformy
de: Zielplattform-Speicherort
es: Ubicación de la plataforma de destino
fr: Emplacement de la plateforme cible
it: Percorso piattaforma di destinazione
ja: ターゲット プラットフォームの場所
ko: 대상 플랫폼 위치
pl: Lokalizacja platformy docelowej
pt_br: Local da Plataforma de Destino
ru: Расположение целевой платформы
tr: Hedef Platform Konumu
zh_hans: 目标平台位置
zh_hant: 目標平台位置

# TargetPlatformLocationDescription
source: The location of the target platform
cs: Umístění cílové platformy
de: Der Speicherort der Zielplattform
es: Ubicación de la plataforma de destino.
fr: Emplacement de la plateforme cible
it: Percorso della piattaforma di destinazione
ja: ターゲット プラットフォームの場所です
ko: 대상 플랫폼의 위치입니다.
pl: Lokalizacja platformy docelowej
pt_br: A localização da Plataforma de Destino
ru: Расположение конечной платформы
tr: Hedef platformun konumu
zh_hans: 目标平台的位置
zh_hant: 目標平台位置

# ProjectFileExtensionFilter
source: F# Project File (*.fsproj)
cs: Soubor projektu F# (*.fsproj)
de: F#-Projektdatei (*.fsproj)
es: Archivo de proyecto de F# (*.fsproj)
fr: Fichier projet F# (*.fsproj)
it: File di progetto F# (*.fsproj)
ja: F# プロジェクト ファイル (*.fsproj)
ko: F# 프로젝트 파일 (*.fsproj)
pl: Plik projektu języka F# (*.fsproj)
pt_br: Arquivo de projeto F# (*.fsproj)
ru: Файл проекта F# (*.fsproj)
tr: F# Proje Dosyası (*.fsproj)
zh_hans: F# 项目文件(*.fsproj)
zh_hant: F# 專案檔 (*.fsproj)

# ComponentFileExtensionFilter
source: Component File (*.dll;*.exe)
cs: Soubor součásti (*.dll;*.exe)
de: Komponentendatei (*.dll;*.exe)
es: Archivo de componente (*.dll;*.exe)
fr: Fichier composant (*.dll;*.exe)
it: File di componente (*.dll;*.exe)
ja: コンポーネント ファイル (*.dll;*.exe)
ko: 구성 요소 파일 (*.dll;*.exe)
pl: Plik składnika (*.dll;*.exe)
pt_br: Arquivo de Componente (*.dll;*.exe)
ru: Файл компонента (*.dll;*.exe)
tr: Bileşen Dosyası (*.dll;*.exe)
zh_hans: 组件文件(*.dll;*.exe)
zh_hant: 元件檔案 (*.dll;*.exe)

source: Other Flags
cs: Další příznaky
de: Andere Flags
es: Otras marcas
fr: Autres indicateurs
it: Altri flag
ja: その他のフラグ
ko: 다른 플래그
pl: Inne flagi
pt_br: Outros Sinalizadores
ru: Другие флаги
tr: Diğer Bayraklar
zh_hans: 其他标志
zh_hant: 其他旗標

# OtherFlagsDescription
source: Other compiler flags
cs: Další příznaky kompilátoru
de: Andere Compilerflags
es: Otras marcas de compilador.
fr: Autres indicateurs du compilateur
it: Altri flag del compilatore
ja: その他のコンパイラ フラグです。
ko: 다른 컴파일러 플래그
pl: Inne flagi kompilatora
pt_br: Outros Sinalizadores de compiladores
ru: Другие флаги компилятора
tr: Diğer derleyici bayrakları
zh_hans: 其他编译器标志
zh_hant: 其他編譯器旗標

source: Build
cs: Sestavení
es: Compilación
it: Compilazione
ja: ビルド
ko: 빌드
pl: Kompilacja
pt_br: Compilar
ru: Сборка
tr: Oluştur
zh_hans: 生成
zh_hant: 建置

source: F# Script File
cs: Soubor skriptu F#
de: F#-Skriptdatei
es: Archivo de script de F#
fr: Fichier de script F#
it: File di script F#
ja: F# スクリプト ファイル
ko: F# 스크립트 파일
pl: Plik skryptu języka F#
pt_br: Arquivo de Script F#
ru: Файл скрипта F#
tr: F# Betik Dosyası
zh_hans: F# 脚本文件
zh_hant: F# 指令碼檔案

source: A blank F# script file (.fsx)
cs: Prázdný soubor skriptu F# (.fsx)
de: Eine leere F#-Skriptdatei (.fsx)
es: Archivo de script de F# en blanco (.fsx)
fr: Fichier de script F# vide (.fsx)
it: File di script F# vuoto (.fsx)
ja: 空の F# スクリプト ファイル (.fsx)
ko: 빈 F# 스크립트 파일(.fsx)
pl: Pusty plik skryptu języka F# (.fsx)
pt_br: Um arquivo de script F# em branco (.fsx)
ru: Пустой файл скрипта F# (.fsx)
tr: Boş F# Betik Dosyası (.fsx)
zh_hans: 空白 F# 脚本文件(.fsx)
zh_hant: 空白 F# 指令碼檔案 (.fsx)

source: FSharp Text Editor
cs: Textový editor FSharp
es: Editor de texto de FSharp
fr: Éditeur de texte FSharp
it: Editor di testo FSharp
ja: FSharp テキスト エディター
ko: FSharp 텍스트 편집기
pl: Edytor tekstu języka F#
pt_br: Editor de Texto FSharp
ru: Текстовый редактор FSharp
tr: FSharp Metin Düzenleyici
zh_hans: FSharp 文本编辑器
zh_hant: FSharp 文字編輯器

source: Code
cs: Kód
es: Código
it: Codice
ja: コード
ko: 코드
pl: Kod
pt_br: Código
ru: Код
tr: Kod
zh_hans: 代码
zh_hant: 程式碼

source: F# Source File
cs: Zdrojový soubor F#
de: F#-Quelldatei
es: Archivo de código fuente de F#
fr: Fichier source F#
it: File di codice sorgente F#
ja: F# ソース ファイル
ko: F# 소스 파일
pl: Plik źródłowy języka F#
pt_br: Arquivo Fonte F#
ru: Исходный файл F#
tr: F# Kaynak Dosyası
zh_hans: F# 源文件
zh_hant: F# 原始程式檔

source: A blank F# source file (.fs)
cs: Prázdný zdrojový soubor F# (.fs)
de: Eine leere F#-Quelldatei (.fs)
es: Archivo de código fuente de F# en blanco (.fs)
fr: Fichier source F# vide (.fs)
it: File di codice sorgente F# vuoto (.fs)
ja: 空の F# ソース ファイル (.fs)
ko: 빈 F# 소스 파일(.fs)
pl: Pusty plik źródłowy języka F# (.fs)
pt_br: Um arquivo de origem F# em branco (.fs)
ru: Пустой исходный файл F# (.fs)
tr: Boş F# kaynak dosyası (.fs)
zh_hans: 空白 F# 源文件(.fs)
zh_hant: 空白 F# 原始程式檔 (.fs)

source: Console Application (.NET Framework)
cs: Konzolová aplikace (.NET Framework)
de: Konsolenanwendung (.NET Framework)
es: Aplicación de consola (.NET Framework)
fr: Application console (.NET Framework)
it: Applicazione console (.NET Framework)
ja: コンソール アプリケーション (.NET Framework)
ko: 콘솔 애플리케이션(.NET Framework)
pl: Aplikacja konsolowa (.NET Framework)
pt_br: Aplicativo do Console (.NET Framework)
ru: Консольное приложение (.NET Framework)
tr: Konsol Uygulaması (.NET Framework)
zh_hans: 控制台应用程序(.NET Framework)
zh_hant: 主控台應用程式 (.NET Framework)

source: A project for creating a command-line application
cs: Projekt pro vytvoření aplikace příkazového řádku
de: Ein Projekt zum Erstellen einer Befehlszeilenanwendung
es: Proyecto para crear una aplicación de línea de comandos.
fr: Projet de création d'une application en ligne de commande
it: Progetto per la creazione di un'applicazione da riga di comando
ja: コマンドライン アプリケーションを作成するためのプロジェクトです
ko: 명령줄 애플리케이션을 만드는 프로젝트입니다
pl: Projekt służący do tworzenia aplikacji wiersza polecenia
pt_br: Um projeto para criar um aplicativo de linha de comando
ru: Проект приложения для командной строки
tr: Komut satırı uygulaması oluşturma projesi
zh_hans: 用于创建命令行应用程序的项目
zh_hant: 建立命令列應用程式專案

source: Library (.NET Framework)
cs: Knihovna (.NET Framework)
de: Bibliothek (.NET Framework)
es: Biblioteca (.NET Framework)
fr: Bibliothèque (.NET Framework)
it: Libreria (.NET Framework)
ja: ライブラリ (.NET Framework)
ko: 라이브러리(.NET Framework)
pl: Biblioteka (.NET Framework)
pt_br: Biblioteca (.NET Framework)
ru: Библиотека (.NET Framework)
tr: Kitaplık (.NET Framework)
zh_hans: 库(.NET Framework)
zh_hant: 程式庫 (.NET Framework)

source: A project for creating an F# library
cs: Projekt pro vytvoření knihovny F#
de: Ein Projekt zum Erstellen einer F#-Bibliothek
es: Proyecto para crear una biblioteca de F#.
fr: Projet de création d'une bibliothèque F#
it: Progetto per la creazione di una libreria F#
ja: F# ライブラリを作成するためのプロジェクトです。
ko: F# 라이브러리를 만드는 프로젝트
pl: Projekt służący do tworzenia biblioteki języka F#
pt_br: Um projeto para criar uma biblioteca F#
ru: Проект для создания библиотеки F#
tr: F# kitaplığı oluşturma projesi
zh_hans: 用于创建 F# 库的项目
zh_hant: 用於建立 F# 程式庫的專案

source: A tutorial project providing a walkthrough of the F# language
cs: Výukový projekt, který poskytuje návod pro jazyk F#
de: Ein Tutorialprojekt, das erste Schritte mit der F#-Programmiersprache aufzeigt
es: Proyecto de tutorial que proporciona una visita guiada por el lenguaje F#.
fr: Projet de didacticiel fournissant une procédure pas à pas relative au langage F#
it: Progetto di esercitazione che offre una panoramica del linguaggio F#
ja: F# 言語のチュートリアルが用意されたチュートリアル プロジェクトです。
ko: F# 언어를 연습할 수 있는 자습서 프로젝트
pl: Projekt samouczka zawierający omówienie języka F#
pt_br: Um projeto de um tutorial passo a passo da linguagem F#
ru: Обучающий проект, предоставляющий обзор языка F#
tr: F# dilinde adım adım kılavuz sağlayan bir öğretici projesi
zh_hans: 提供 F# 语言演练的教程项目
zh_hant: 提供 F# 語言逐步解說的教學課程專案

source: Silverlight Library
cs: Knihovna Silverlight
de: Silverlight-Bibliothek
es: Biblioteca de Silverlight
fr: Bibliothèque Silverlight
it: Libreria Silverlight
ja: Silverlight ライブラリ
ko: Silverlight 라이브러리
pl: Biblioteka programu Silverlight
pt_br: Biblioteca Silverlight
ru: Библиотека Silverlight
tr: Silverlight Kitaplığı
zh_hans: Silverlight 库
zh_hant: Silverlight 程式庫

source: A project for creating an F# Silverlight library
cs: Projekt pro vytvoření Silverlight knihoven F#
de: Ein Projekt zum Erstellen einer F#-Silverlight-Bibliothek
es: Proyecto para crear una biblioteca de F# para Silverlight.
fr: Projet de création d'une bibliothèque Silverlight F#
it: Progetto per la creazione di una libreria Silverlight F#
ja: F# Silverlight ライブラリを作成するためのプロジェクトです。
ko: F# Silverlight 라이브러리를 만드는 프로젝트
pl: Projekt służący do tworzenia biblioteki programu Silverlight w języku F#
pt_br: Um projeto para criar uma biblioteca Silverlight F#
ru: Проект для создания библиотеки F# Silverlight
tr: F# Silverlight kitaplığı oluşturma projesi
zh_hans: 用于创建 F# Silverlight 库的项目
zh_hant: 用於建立 F# Silverlight 程式庫的專案

source: Application Configuration File
cs: Konfigurační soubor aplikace
de: Anwendungskonfigurationsdatei
es: Archivo de configuración de aplicación
fr: Fichier config de l'application
it: File di configurazione dell'applicazione
ja: アプリケーション構成ファイル
ko: 애플리케이션 구성 파일
pl: Plik konfiguracji aplikacji
pt_br: Arquivo de Configuração do Aplicativo
ru: Файл конфигурации приложения
tr: Uygulama Yapılandırma Dosyası
zh_hans: 应用程序配置文件
zh_hant: 應用程式組態檔

source: A file for storing application configuration and settings values
cs: Soubor pro ukládání konfigurace aplikace a hodnot nastavení
de: Eine Datei zum Speichern von Anwendungskonfigurations- und Einstellungswerten
es: Archivo para almacenar los valores de configuración de la aplicación.
fr: Fichier pour stocker la configuration de l'application et les valeurs des paramètres
it: File per archiviare la configurazione dell'applicazione e i valori delle impostazioni
ja: アプリケーション構成および設定の値を格納するためのファイルです
ko: 애플리케이션 구성 및 설정 값을 저장하는 파일입니다
pl: Plik przechowujący konfigurację aplikacji i wartości ustawień
pt_br: Um arquivo para armazenar configuração do aplicativo e valores de configurações
ru: Файл для хранения конфигурации приложения и значений параметров
tr: Uygulama yapılandırma ve ayar değerlerini saklamak için bir dosya
zh_hans: 用于存储应用程序配置和设置值的文件
zh_hant: 用來儲存應用程式組態和設定值的檔案

source: Source File
cs: Zdrojový soubor
de: Quelldatei
es: Archivo de origen
fr: Fichier source
it: File di origine
ja: ソース ファイル
ko: 소스 파일
pl: Plik źródłowy
pt_br: Arquivo de Origem
ru: Исходный файл
tr: Kaynak Dosya
zh_hans: 源文件
zh_hant: 原始程式檔

source: A blank F# source file (.fs)
cs: Prázdný zdrojový soubor F# (.fs)
de: Eine leere F#-Quelldatei (.fs)
es: Archivo de código fuente de F# en blanco (.fs)
fr: Fichier source F# vide (.fs)
it: File di codice sorgente F# vuoto (.fs)
ja: 空の F# ソース ファイル (.fs)
ko: 빈 F# 소스 파일(.fs)
pl: Pusty plik źródłowy języka F# (.fs)
pt_br: Um arquivo de origem F# em branco (.fs)
ru: Пустой исходный файл F# (.fs)
tr: Boş F# kaynak dosyası (.fs)
zh_hans: 空白 F# 源文件(.fs)
zh_hant: 空白 F# 原始程式檔 (.fs)

source: Script File
cs: Soubor skriptu
de: Skriptdatei
es: Archivo de script
fr: Fichier de script
it: File di script
ja: スクリプト ファイル
ko: 스크립트 파일
pl: Plik skryptu
pt_br: Arquivo de Script
ru: Файл скрипта
tr: Betik Dosyası
zh_hans: 脚本文件
zh_hant: 指令碼檔
