Repository: dotnet/fsharp
Catalog: vsintegration/src/FSharp.ProjectSystem.FSharp/xlf/VSPackage.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: A project for creating an F# library (.dll) that can run on .NET Framework 4.5, Windows Store, Windows Phone 8 Silverlight, Xamarin.iOS, Xamarin.Android and Xamarin.iOS(Classic). Profile 78
cs: Projekt pro vytvoření knihovny v jazyce F# (.dll), kterou lze spustit na platformě .NET Framework 4.5, Windows Store, Windows Phone 8 Silverlight, Xamarin.iOS, Xamarin.Android a Xamarin.iOS(Classic). Profil 78
de: Ein Projekt für die Erstellung einer F#-Bibliothek (.dll), die auf .NET Framework 4.5, Windows Store, Windows Phone 8 Silverlight, Xamarin.iOS, Xamarin.Android und Xamarin.iOS(Classic) ausgeführt werden kann. Profil 78
es: Proyecto para crear una biblioteca de F# (.dll) que se puede ejecutar en .NET Framework 4.5, la Tienda Windows, Windows Phone Silverlight 8, Xamarin.iOS, Xamarin.Android y Xamarin.iOS(Classic). Perfil 78
fr: Projet de création d'une bibliothèque F# (.dll) qui peut s'exécuter sur .NET Framework 4.5, le Windows Store, Windows Phone 8 Silverlight, Xamarin.iOS, Xamarin.Android et Xamarin.iOS(Classic). Profile 78
it: Progetto per la creazione di una libreria F# (.dll) che può essere eseguita su .NET Framework 4.5, Windows Store, Windows Phone 8 Silverlight, Xamarin.iOS, Xamarin.Android e Xamarin.iOS(Classic). Profilo 78
ja: .NET Framework 4.5、Windows ストア、Windows Phone 8 Silverlight、Xamarin.iOS、Xamarin.Android、および Xamarin.iOS(Classic) で実行できる F# ライブラリ (.dll) を作成するためのプロジェクト。プロファイル 78
ko: .NET Framework 4.5, Windows 스토어, Windows Phone 8 Silverlight, Xamarin.iOS, Xamarin.Android 및 Xamarin.iOS(클래식)에서 실행할 수 있는 F# 라이브러리(.dll)를 만드는 프로젝트입니다. 프로필 78
pl: Projekt służący do tworzenia bibliotek języka F# (dll), które mogą działać w programie .NET Framework 4.5, w Sklepie Windows i programie Silverlight dla systemu Windows Phone 8 oraz w interfejsach Xamarin.iOS, Xamarin.Android i Xamarin.iOS (klasyczny). Profil 78
pt_br: Um projeto para criar uma biblioteca F# (.dll) que pode ser executada em .NET Framework 4.5, Windows Store, Windows Phone 8 Silverlight, Xamarin.iOS, Xamarin.Android e Xamarin.iOS(Classic). Perfil 78
ru: Проект для создания библиотеки F# (DLL), которая может работать в .NET Framework 4.5, Магазине Windows и Windows Phone 8 Silverlight, Xamarin.iOS, Xamarin.Android и Xamarin.iOS (Classic). Профиль 78
tr: .NET Framework 4.5, Windows Mağazası, Windows Phone 8 Silverlight, Xamarin.iOS, Xamarin.Android ve Xamarin.iOS(Classic)'ta çalışabilen bir F# kitaplığı (.dll) oluşturma projesi. Profil 78
zh_hans: 一个用于创建可在以下对象上运行的 F# 库(.dll) 的项目: .NET Framework 4.5、Windows 应用商店、Windows Phone 8 Silverlight、Xamarin.iOS、Xamarin.Android 和 Xamarin.iOS(Classic)。配置文件 78
zh_hant: 用於建立可執行於 .NET Framework 4.5、Windows 市集、Windows Phone 8 Silverlight、Xamarin.iOS、Xamarin.Android 和 Xamarin.iOS(傳統) 上之 F# 程式庫 (.dll) 的專案。設定檔 78

source: Portable Library (.NET 4.5, Windows Store, Windows Phone 8.1, Windows Phone Silverlight 8, Xamarin)
cs: Přenosná knihovna (.NET 4.5, Windows Store, Windows Phone 8.1, Windows Phone Silverlight 8, Xamarin)
de: Portierbare Bibliothek (.NET 4.5, Windows Store, Windows Phone 8.1, Windows Phone Silverlight 8, Xamarin)
es: Biblioteca portable (.NET 4.5, Tienda Windows, Windows Phone 8.1, Windows Phone Silverlight 8, Xamarin)
fr: Bibliothèque portable (.NET 4.5, le Windows Store, Windows Phone 8.1, Windows Phone Silverlight 8, Xamarin)
it: Libreria portabile (.NET 4.5, Windows Store, Windows Phone 8.1, Windows Phone Silverlight 8, Xamarin)
ja: 移植可能なライブラリ (.NET 4.5、Windows ストア、Windows Phone 8.1、Windows Phone Silverlight 8、Xamarin)
ko: 이식 가능한 라이브러리(.NET 4.5, Windows 스토어, Windows Phone 8.1, Windows Phone Silverlight 8, Xamarin)
pl: Biblioteka przenośna (.NET 4.5, Sklep Windows, Windows Phone 8.1, Silverlight 8 dla systemu Windows Phone, Xamarin)
pt_br: Biblioteca Portátil (.NET 4.5, Windows Store, Windows Phone 8.1, Windows Phone Silverlight 8, Xamarin)
ru: Переносимая библиотека (.NET 4.5, Магазин Windows, Windows Phone 8.1, Windows Phone 8 Silverlight, Xamarin)
tr: Taşınabilir Kitaplık (.NET 4.5, Windows Mağazası, Windows Phone 8.1, Windows Phone 8 Silverlight, Xamarin)
zh_hans: 可移植的库(.NET 4.5、Windows 应用商店、Windows Phone 8.1 Windows Phone Silverlight 8、Xamarin)
zh_hant: 可攜式程式庫 (.NET 4.5、Windows 市集、Windows Phone 8.1、Windows Phone 8 Silverlight、Xamarin)

source: A project for creating an F# library (.dll) that can run on .NET Framework 4.5, Windows Store, Windows Phone 8.1, Windows Phone Silverlight 8, Xamarin.iOS, Xamarin.Android and Xamarin.iOS(Classic). Profile 259
cs: Projekt pro vytvoření knihovny v jazyce F# (.dll), která se dá spustit na platformě .NET Framework 4.5, Windows Store, Windows Phone 8.1, Windows Phone Silverlight 8, Xamarin.iOS, Xamarin.Android a Xamarin.iOS(Classic). Profil 259
de: Ein Projekt für die Erstellung einer F#-Bibliothek (.dll), die auf .NET Framework 4.5, Windows Store, Windows Phone 8.1, Windows Phone Silverlight 8, Xamarin.iOS, Xamarin.Android und Xamarin.iOS(Classic) ausgeführt werden kann. Profil 259
es: Proyecto para crear una biblioteca de F# (.dll) que se puede ejecutar en .NET Framework 4.5, la Tienda Windows, Windows Phone 8.1, Windows Phone Silverlight 8, Xamarin.iOS, Xamarin.Android y Xamarin.iOS(Classic). Perfil 259
fr: Projet de création d'une bibliothèque F# (.dll) qui peut s'exécuter sur .NET Framework 4.5, le Windows Store, Windows Phone 8.1, Windows Phone Silverlight 8, Xamarin.iOS, Xamarin.Android et Xamarin.iOS(Classic). Profile 259
it: Progetto per la creazione di una libreria F# (.dll) che può essere eseguita su .NET Framework 4.5, Windows Store, Windows Phone 8.1, Windows Phone Silverlight 8, Xamarin.iOS, Xamarin.Android e Xamarin.iOS(Classic). Profilo 259
ja: .NET Framework 4.5、Windows ストア、Windows Phone 8.1、Windows Phone Silverlight 8、Xamarin.iOS、Xamarin.Android、および Xamarin.iOS(Classic) で実行できる F# ライブラリ (.dll) を作成するためのプロジェクト。プロファイル 259
ko: .NET Framework 4.5, Windows 스토어, Windows Phone 8.1, Windows Phone 8 Silverlight, Xamarin.iOS, Xamarin.Android 및 Xamarin.iOS(클래식)에서 실행할 수 있는 F# 라이브러리(.dll)를 만드는 프로젝트입니다. 프로필 259
pl: Projekt służący do tworzenia bibliotek języka F# (dll), które mogą działać w programie .NET Framework 4.5, w Sklepie Windows, w systemie Windows Phone 8.1 i programie Silverlight 8 dla systemu Windows Phone oraz w interfejsach Xamarin.iOS, Xamarin.Android i Xamarin.iOS (klasyczny). Profil 259
pt_br: Um projeto para criar uma biblioteca F# (.dll) que pode ser executada em .NET Framework 4.5, Windows Store, Windows Phone 8.1, Windows Phone Silverlight 8, Xamarin.iOS, Xamarin.Android e Xamarin.iOS(Classic). Perfil 259
ru: Проект для создания библиотеки F# (DLL), которая может работать в .NET Framework 4.5, Магазине Windows, Windows Phone 8.1, Windows Phone Silverlight 8, Xamarin.iOS, Xamarin.Android и Xamarin.iOS (Classic). Профиль 259
tr: .NET Framework 4.5, Windows Mağazası, Windows Phone 8.1, Windows Phone 8 Silverlight, Xamarin.iOS, Xamarin.Android ve Xamarin.iOS(Classic)'ta çalışabilen bir F# kitaplığı (.dll) oluşturma projesi. Profil 259
zh_hans: 一个用于创建可在以下对象上运行的 F# 库(.dll) 的项目: .NET Framework 4.5、Windows 应用商店、Windows Phone 8.1、Windows Phone Silverlight 8、Xamarin.iOS、Xamarin.Android 和 Xamarin.iOS(Classic)。配置文件 259
zh_hant: 用於建立可執行於 .NET Framework 4.5、Windows 市集、Windows Phone 8.1、Windows Phone Silverlight 8、Xamarin.iOS、Xamarin.Android 和 Xamarin.iOS(傳統) 上之 F# 程式庫 (.dll) 的專案。設定檔 259

source: Resources File
cs: Soubor prostředků
de: Ressourcendatei
es: Archivo de recursos
fr: Fichier de ressources
it: File di risorse
ja: リソース ファイル
ko: 리소스 파일
pl: Plik zasobów
pt_br: Arquivo de Recursos
ru: Файл ресурсов
tr: Kaynak Dosyası
zh_hans: 资源文件
zh_hant: 資源檔

source: A file for storing resources
cs: Soubor pro uložení prostředků
de: Eine Datei zum Speichern von Ressourcen
es: Archivo para almacenar recursos
fr: Fichier pour stocker les ressources
it: File per l'archiviazione di risorse
ja: リソースを格納するファイル
ko: 리소스를 저장하는 파일입니다.
pl: Plik do przechowywania zasobów
pt_br: Um arquivo para armazenar recursos
ru: Файл для хранения ресурсов
tr: Kaynakları depolamak için dosya
zh_hans: 用于存储资源的文件
zh_hant: 用來儲存資源的檔案

source: F# Tools
cs: Nástroje F#
es: Herramientas de F#
fr: Outils F#
it: Strumenti F#
ja: F# ツール
ko: F# 도구
pl: Narzędzia języka F#
pt_br: Ferramentas F#
ru: Инструменты F#
tr: F# Araçları
zh_hans: F# 工具
zh_hant: F# 工具

source: F# Interactive
es: F# interactivo
ja: F# インタラクティブ
ko: F# 대화형
pt_br: F# Interativo
tr: F# Etkileşimli
zh_hans: F# 交互窗口
zh_hant: F# 互動

source: F# Project Files (*.fsproj);*.fsproj
cs: Soubory projektů F# (*.fsproj);*.fsproj
de: F#-Projektdateien (*.fsproj);*.fsproj
es: Archivos de proyecto de F# (*.fsproj);*.fsproj
fr: Fichiers projet F# (*.fsproj);*.fsproj
it: File di progetto F# (*.fsproj);*.fsproj
ja: F# プロジェクト ファイル (*.fsproj);*.fsproj
ko: F# 프로젝트 파일(*.fsproj);*.fsproj
pl: Pliki projektów języka F# (*.fsproj);*.fsproj
pt_br: F# Arquivo de projeto (*.fsproj);*.fsproj
ru: Файлы проектов F# (*.fsproj);*.fsproj
tr: F# Proje Dosyaları (*.fsproj);*.fsproj
zh_hans: F# 项目文件(*.fsproj);*.fsproj
zh_hant: F# 專案檔 (*.fsproj);*.fsproj

source: Visual F# Files (*.fs,*.fsi,*.fsx,*.fsscript);*.fs,*.fsi,*.fsx,*.fsscript
cs: Soubory Visual F# (*.fs, *.fsi, *.fsx, *.fsscript); *.fs, *.fsi, *.fsx,*.fsscript
de: Visual F#-Dateien (*.fs,*.fsi,*.fsx,*.fsscript);*.fs,*.fsi,*.fsx,*.fsscript
es: Archivos de Visual F# (*.fs,*.fsi,*.fsx,*.fsscript);*.fs,*.fsi,*.fsx,*.fsscript
fr: Fichiers Visual F# (*.fs,*.fsi,*.fsx,*.fsscript);*.fs,*.fsi,*.fsx,*.fsscript
it: File Visual F# (*.fs,*.fsi,*.fsx,*.fsscript);*.fs,*.fsi,*.fsx,*.fsscript
ja: Visual F# ファイル (*.fs,*.fsi,*.fsx,*.fsscript);*.fs,*.fsi,*.fsx,*.fsscript
ko: Visual F# 파일 (*.fs,*.fsi,*.fsx,*.fsscript);*.fs,*.fsi,*.fsx,*.fsscript
pl: Pliki języka Visual F# (*.fs,*.fsi,*.fsx,*.fsscript);*.fs,*.fsi,*.fsx,*.fsscript
pt_br: Arquivos Visual F# (*.fs,*.fsi,*.fsx,*.fsscript);*.fs,*.fsi,*.fsx,*.fsscript
ru: Файлы Visual F# (*.fs,*.fsi,*.fsx,*.fsscript);*.fs,*.fsi,*.fsx,*.fsscript
tr: Visual F# Dosyaları (*.fs,*.fsi,*.fsx,*.fsscript);*.fs,*.fsi,*.fsx,*.fsscript
zh_hans: Visual F# 文件(*.fs,*.fsi,*.fsx,*.fsscript);*.fs,*.fsi,*.fsx,*.fsscript
zh_hant: Visual F# 檔案 (*.fs,*.fsi,*.fsx,*.fsscript);*.fs,*.fsi,*.fsx,*.fsscript

source: Customizes the environment to maximize code editor screen space and improve the visibility of F# commands and tool windows.
cs: Přizpůsobí prostředí pro maximalizaci místa na obrazovce editoru kódu a zlepšení viditelnosti okna příkazů a nástrojů F#.
de: Passt die Umgebung an, um den Bildschirmbereich im Code-Editor zu maximieren und die Anzeige von F#-Befehlen und Toolfenstern zu verbessern.
es: Personaliza el entorno para maximizar el espacio en pantalla del editor de código y mejorar la visibilidad de los comandos y ventanas de herramientas de F#.
fr: Personnalise l'environnement pour optimiser l'espace à l'écran de l'éditeur de code et rendre plus visibles les commandes ainsi que les fenêtres Outil F#.
it: Personalizza l'ambiente in modo da ingrandire lo spazio della schermata dell'editor di codice e migliorare la visibilità dei comandi specifici di F#.
ja: コード エディターのスクリーン空間を最大化し、F# コマンドとツール ウィンドウの表示範囲を改善するように環境をカスタマイズします。
ko: 코드 편집기 화면 공간을 최대화하고 F# 명령과 도구 창이 분명하게 보이도록 환경을 사용자 지정합니다.
pl: Dostosowuje środowisko w celu zmaksymalizowania miejsca na ekranie zajmowanego przez edytor kodu i poprawienia widoczności poleceń i okien narzędzi języka F#.
pt_br: Personaliza o ambiente para maximizar o espaço de tela do editor de código e melhorar a visibilidade dos comandos F# e janelas de ferramentas.
ru: Настраивает среду разработки так, чтобы максимально увеличить размер окна редактора исходного кода и улучшить видимость команд F# и окон инструментов.
tr: Kod düzenleyici ekran alanının ekranı kaplaması ve F# komutları ile araç pencerelerinin görünürlüğünü artırmak için ortamı özelleştirir.
zh_hans: 对环境进行自定义，以使代码编辑器的屏幕空间最大化，并改善 F# 命令和工具窗口的可见性。
zh_hant: 自訂環境，將程式編輯器的螢幕空間最大化，並且改善 F# 命令及工具視窗的可見度。

# ProductDetails
source: Microsoft Visual F# Tools
es: Herramientas de Microsoft Visual F#

source: Microsoft Visual F# Tools
es: Herramientas de Microsoft Visual F#

# ProductName
source: Microsoft Visual F# Tools
es: Herramientas de Microsoft Visual F#

source: Visual F# Tools
es: Herramientas de Visual F#
zh_hant: Visual F# 工具

source: F# Interactive
es: F# interactivo
ja: F# インタラクティブ
ko: F# 대화형
pt_br: F# Interativo
tr: F# Etkileşimli
zh_hans: F# 交互窗口
zh_hant: F# 互動

# InvalidOutputType
source: Invalid OutputType value
cs: Neplatná hodnota atributu OutputType
de: Ungültiger OutputType-Wert
es: Valor de OutputType no válido
fr: Valeur OutputType non valide
it: Valore di OutputType non valido
ja: 無効な OutputType の値
ko: 잘못된 OutputType 값
pl: Nieprawidłowa wartość OutputType
pt_br: Valor de OutputType inválido
ru: Недопустимое значение OutputType
tr: Geçersiz OutputType değeri
zh_hans: OutputType 值无效
zh_hant: 無效的 OutputType 值

# InvalidRunPostBuildEvent
source: Invalid RunPostBuildEvent value
cs: Neplatná hodnota atributu RunPostBuildEvent
de: Ungültiger RunPostBuildEvent-Wert
es: Valor de RunPostBuildEvent no válido
fr: Valeur RunPostBuildEvent non valide
it: Valore di RunPostBuildEvent non valido
ja: 無効な RunPostBuildEvent の値
ko: 잘못된 RunPostBuildEvent 값
pl: Nieprawidłowa wartość RunPostBuildEvent
pt_br: Valor de RunPostBuildEvent inválido
ru: Недопустимое значение RunPostBuildEvent
tr: Geçersiz RunPostBuildEvent değeri
zh_hans: RunPostBuildEvent 值无效
zh_hant: 無效的 RunPostBuildEvent 值

# InvalidTargetFrameworkVersion
source: Invalid TargetFrameworkVersion number
cs: Neplatné číslo atributu TargetFrameworkVersion
de: Ungültige TargetFrameworkVersion-Nummer
es: Número de TargetFrameworkVersion no válido
fr: Numéro TargetFrameworkVersion non valide
it: Numero di TargetFrameworkVersion non valido
ja: 無効な TargetFrameworkVersion の番号
ko: 잘못된 TargetFrameworkVersion 번호
pl: Nieprawidłowy numer TargetFrameworkVersion
pt_br: Número de TargetFrameworkVersion inválido
ru: Недопустимое значение TargetFrameworkVersion
tr: Geçersiz TargetFrameworkVersion numarası
zh_hans: TargetFrameworkVersion 号无效
zh_hant: 無效的 TargetFrameworkVersion 號碼

# ProjectRenderFolderMultiple
source: The project '{0}' could not be opened because opening it would cause a folder to be rendered multiple times in the solution explorer. One such problematic item is '{1}'. To open this project in Visual Studio, first edit the project file and fix the problem.
cs: Projekt '{0}' nelze otevřít, protože otevření by způsobilo vícenásobné vykreslení složky v průzkumníku řešení. Jedna z problematických položek je '{1}'. Chcete-li tento projekt otevřít v aplikaci Visual Studio, upravte nejdřív soubor projektu a problém vyřešte.
de: Das Projekt "{0}" konnte nicht geöffnet werden, da das Öffnen zu einem mehrfachen Rendern eines Ordners im Projektmappen-Explorer führen würde. Ein solch problematisches Element ist "{1}". Bearbeiten Sie zuerst die Projektdatei, und beheben Sie das Problem, um dieses Projekt in Visual Studio zu öffnen.
es: No se pudo abrir el proyecto '{0}' porque, si se abría, daba lugar a que una carpeta se presentara varias veces en el Explorador de soluciones. Un elemento problemático es '{1}'. Para abrir este proyecto en Visual Studio, edite primero el archivo de proyecto y corrija el problema.
fr: Impossible d'ouvrir le projet '{0}', car cela entraînerait l'affichage multiple d'un dossier dans l'Explorateur de solutions. L'élément problématique est '{1}'. Pour ouvrir ce projet dans Visual Studio, modifiez d'abord le fichier projet et corrigez le problème.
it: Non è stato possibile aprire il progetto '{0}' perché in caso contrario il rendering di una cartella in Esplora soluzioni verrebbe eseguito più volte. Un elemento che presenta questo tipo di problema è '{1}'. Per aprire il progetto in Visual Studio, modificare il file di progetto e correggere il problema.
ja: プロジェクト '{0}' を開くと、ソリューション エクスプローラー内でフォルダーが複数回表示されるため、このプロジェクトを開けませんでした。この問題がある項目の 1 つは '{1}' です。このプロジェクトを Visual Studio で開くには、プロジェクト ファイルを編集して問題を解決してください。
ko: {0}' 프로젝트를 열면 솔루션 탐색기에서 폴더가 여러 번 렌더링될 수 있기 때문에 이 프로젝트를 열 수 없습니다. 문제가 있는 항목 중 하나가 '{1}'입니다. Visual Studio에서 이 프로젝트를 열려면 먼저 프로젝트 파일을 편집하여 문제를 해결하세요.
pl: Nie można otworzyć projektu „{0}”, ponieważ spowodowałoby to wielokrotne zrenderowanie folderu w eksploratorze rozwiązań. Jednym z elementów powodujących problemy jest „{1}”. Aby otworzyć ten projekt w programie Visual Studio, najpierw edytuj plik projektu i rozwiąż problem.
pt_br: Não foi possível abrir o projeto '{0}' porque isso faria que uma pasta fosse renderizada várias vezes no gerenciador de soluções. Um item problemático desse tipo é '{1}'. Para abrir este projeto no Visual Studio, edite primeiro o arquivo do projeto e corrija o problema.
ru: Не удалось открыть проект "{0}", поскольку его открытие вызовет многократное отображение папки в обозревателе решений. Одним из таких проблематичных элементов является "{1}". Чтобы открыть этот проект в Visual Studio, сначала измените файл проекта и устраните проблему.
tr: {0}' projesini açmak bir klasörün çözüm gezgininde birçok kez işlenmesine neden olacağı için proje açılamadı. '{1}' öğesi de bunun gibi sorunludur. Bu projeyi Visual Studio'da açmak için önce proje dosyasını düzenleyin ve sorunu düzeltin.
zh_hans: 未能打开项目“{0}”，因为打开此项目会导致在解决方案资源管理器中多次呈现某个文件夹。一个具有此类有问题的项为“{1}”。若要在 Visual Studio 中打开此项目，请先编辑项目文件并修复相应的问题。
zh_hant: 無法開啟專案 '{0}'，因為開啟它會導致資料夾在方案總管中呈現多次。其中一個有這種問題的項目是 '{1}'。若要在 Visual Studio 中開啟此專案，請先編輯專案檔並且修正此問題。

# PropertyDefaultNamespace
source: Default Namespace:\nThe string for the default namespace must be a valid identifier
cs: Výchozí obor názvů:\nŘetězec výchozího oboru názvů musí být platný identifikátor.
de: Standardnamespace:\nDie Zeichenfolge für den Standardnamespace muss ein gültiger Bezeichner sein.
es: Espacio de nombres predeterminado:\nLa cadena del espacio de nombres predeterminado debe ser un identificador válido.
fr: Espace de noms par défaut :\nLa chaîne pour l'espace de noms par défaut doit être un identificateur valide
it: Spazio dei nomi predefinito:\nla stringa dello spazio dei nomi predefinito deve essere un identificatore valido
ja: 既定の名前空間:\n既定の名前空間名の文字列は、有効な識別子である必要があります
ko: 기본 네임스페이스:\n기본 네임스페이스의 문자열은 유효한 식별자여야 합니다.
pl: Domyślna przestrzeń nazw:\nCiąg domyślnej przestrzeni nazw musi być poprawnym identyfikatorem
pt_br: Namespace Padrão:\nA cadeia de caracteres para o namespace padrão deve ser um identificador válido
ru: Пространство имен по умолчанию:\nстрока для пространства имен по умолчанию должна быть допустимым идентификатором
tr: Varsayılan Ad Alanı:\nVarsayılan ad alanının dizesi geçerli bir tanımlayıcı olmalıdır
zh_hans: 默认命名空间:\n默认命名空间的字符串必须是有效的标识符
zh_hant: 預設命名空間:\n預設命名空間的字串必須是有效的識別碼

# TemplateNotFound
source: Template file not found: {0}
cs: Soubor šablony nebyl nalezen: {0}
de: Die Vorlagendatei wurde nicht gefunden: {0}
es: Archivo de plantilla no encontrado: {0}
fr: Fichier modèle introuvable : {0}
it: File modello non trovato: {0}
ja: テンプレート ファイルが見つかりません: {0}
ko: 템플릿 파일 {0}을(를) 찾을 수 없습니다.
pl: Nie znaleziono pliku szablonu: {0}
pt_br: Arquivo modelo não encontrado: {0}
ru: Файл шаблона не найден: {0}
tr: Şablon dosyası bulunamadı: {0}
zh_hans: 未找到模板文件: {0}
zh_hant: 找不到範本檔: {0}

# NeedReloadToChangeTargetFx
source: Changing the Target Framework requires that the current project be closed and then reopened.\nAny unsaved changes within the project will be automatically saved.\n\nChanging Target Framework may require manual modification of project files in order to build.\n\nAre you sure you want to change the Target Framework for this project?
cs: Změna cílové architektury vyžaduje zavření a opětovné otevření aktuálního projektu. \nJakékoliv neuložené změny v rámci projektu budou automaticky uloženy.\n\nZměna cílové architektury může vyžadovat ruční úpravy souborů projektu, aby mohlo být provedeno sestavení.\n\nJste si jisti, že chcete změnit cílovou architekturu tohoto projektu?
de: Zum Ändern des Zielframeworks muss das aktuelle Projekt geschlossen und dann neu geöffnet werden.\nAlle nicht gespeicherten Änderungen innerhalb des Projekts werden automatisch gespeichert.\n\nZum Ändern des Zielframeworks müssen unter Umständen Projektdateien manuell geändert werden, um das Erstellen zu ermöglichen.\n\nMöchten Sie das Zielframework für dieses Projekt wirklich ändern?
es: Para cambiarla plataforma de destino es necesario cerrar y volver a abrir el proyecto actual.\nTodos los cambios del proyecto que no se han guardado se guardarán automáticamente.\n\nPara cambiar la plataforma de destino, puede ser necesario modificar manualmente los archivos del proyecto para la compilación.\n\n¿Está seguro de que desea cambiarla plataforma de destino para este proyecto?
fr: La modification du Framework cible requiert la fermeture et la réouverture du projet actif.\nLes modifications qui n'étaient pas enregistrées dans le projet le seront automatiquement.\n\nLa modification du Framework cible peut nécessiter la modification manuelle des fichiers projet pour la génération.\n\nVoulez-vous vraiment modifier le Framework cible pour ce projet ?
it: Per modificare il framework di destinazione è necessario che il progetto corrente venga chiuso e quindi riaperto.\nEventuali modifiche non salvate nel progetto verranno salvate automaticamente.\n\nPotrebbe inoltre essere necessaria la modifica manuale dei file di progetto per la compilazione.\n\nModificare il framework di destinazione del progetto?
ja: ターゲット フレームワークを変更するには、現在のプロジェクトを閉じてからもう一度開く必要があります。\nプロジェクト内の保存していない変更は自動的に保存されます。\n\nターゲット フレームワークを変更すると、ビルドのためにプロジェクト ファイルを手動で変更する必要が生じることがあります。\n\nこのプロジェクトのターゲット フレームワークを変更しますか?
ko: 대상 프레임워크를 변경하려면 현재 프로젝트를 닫았다가 다시 열어야 합니다.\n프로젝트의 저장되지 않은 변경 사항은 모두 자동으로 저장됩니다.\n\n대상 프레임워크를 변경하려면 프로젝트 파일을 빌드할 수 있도록 수동으로 수정해야 할 수 있습니다.\n\n이 프로젝트의 대상 프레임워크를 변경하시겠습니까?
pl: Aby można było zmienić platformę docelową, musisz zamknąć bieżący projekt i otworzyć go ponownie.\nWszystkie niezapisane zmiany w projekcie zostaną automatycznie zapisane.\n\nPo zmianie platformy docelowej kompilacja może wymagać zmodyfikowania plików projektu.\n\nCzy chcesz zmienić platformę docelową dla tego projektu?
pt_br: Alterar a Estrutura de Destino exige que o projeto atual seja fechado e reaberto em seguida.\nQuaisquer alterações não salvas dentro do projeto serão automaticamente salvas.\n\nAlterar a Estrutura de Destino pode exigir a modificação manual dos arquivos do projeto para fim de compilação.\n\nVocê tem certeza de que pretende mudar a Estrutura de Destino desse projeto?
ru: Для смены целевой рабочей среды необходимо закрыть текущий проект, а затем открыть заново.\nВсе несохраненные изменения будут сохранены автоматически.\n\nПосле смены целевой рабочей среды может потребоваться вручную внести изменения в файлы проектов, чтобы выполнить их сборку.\n\nДействительно изменить целевую рабочую среду данного проекта?
tr: Hedef Framework'ü değiştirmek geçerli projenin kapatılıp yeniden açılmasını gerektiriyor.\nProje içindeki tüm kaydedilmemiş değişiklikler otomatik olarak kaydedilecek.\n\nHedef Framework'ü değiştirmek, yapı için proje dosyalarının el ile değiştirilmesini gerektirebilir.\nHedef Framework'ü bu proje için değiştirmek istediğinizden emin misiniz?
zh_hans: 更改目标框架需要先关闭然后重新打开当前项目。\n将自动保存项目中所有未保存的更改。\n\n更改目标框架可能需要手动修改项目文件才能进行生成。\n\n是否确实要为此项目更改目标框架?
zh_hant: 變更目標 Framework 必須先關閉目前的專案然後再重新開啟。\n專案中未儲存的任何變更將會自動儲存。\n\n變更目標 Framework 可能必須以手動方式修改專案檔才能進行建置。\n\n您確定要變更此專案的相標 Framework 嗎?

# AddReferenceDialogTitle
source: Add Reference
cs: Přidat odkaz
de: Verweis hinzufügen
es: Agregar referencia
fr: Ajouter une référence
it: Aggiungi riferimento
ja: 参照の追加
ko: 참조 추가
pl: Dodawanie odwołania
pt_br: Adicionar Referência
ru: Добавить ссылку
tr: Başvuru Ekle
zh_hans: 添加引用
zh_hant: 加入參考
