Repository: dotnet/fsharp
Catalog: vsintegration/src/FSharp.ProjectSystem.FSharp/xlf/VSPackage.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: A blank F# script file (.fsx)
cs: Prázdný soubor skriptu F# (.fsx)
de: Eine leere F#-Skriptdatei (.fsx)
es: Archivo de script de F# en blanco (.fsx)
fr: Fichier de script F# vide (.fsx)
it: File di script F# vuoto (.fsx)
ja: 空の F# スクリプト ファイル (.fsx)
ko: 빈 F# 스크립트 파일(.fsx)
pl: Pusty plik skryptu języka F# (.fsx)
pt_br: Um arquivo de script F# em branco (.fsx)
ru: Пустой файл скрипта F# (.fsx)
tr: Boş F# Betik Dosyası (.fsx)
zh_hans: 空白 F# 脚本文件(.fsx)
zh_hant: 空白 F# 指令碼檔案 (.fsx)

source: Signature File
cs: Soubor podpisu
de: Signaturdatei
es: Archivo de signatura
fr: Fichier de signature
it: File di firma
ja: シグネチャ ファイル
ko: 서명 파일
pl: Plik sygnatury
pt_br: Arquivo de Assinatura
ru: Файл подписи
tr: İmza Dosyası
zh_hans: 签名文件
zh_hant: 簽章檔案

source: A blank F# signature file (.fsi)
cs: Prázdný podpisový soubor F# (.fsi)
de: Eine leere F#-Signaturdatei (.fsi)
es: Archivo de signatura de F# en blanco (.fsi).
fr: Fichier de signature F# vide (.fsi)
it: File di firma F# vuoto (.fsi)
ja: 空の F# シグネチャ ファイル (.fsi)
ko: 빈 F# 시그니처 파일(.fsi)
pl: Pusty plik sygnatury języka F# (.fsi)
pt_br: Um arquivo de assinatura (.fsi) em branco F#
ru: Пустой файл подписи F# (.fsi)
tr: Boş F# imza dosyası (.fsi)
zh_hans: 空白 F# 签名文件(.fsi)
zh_hant: 空白 F# 簽章檔案 (.fsi)

source: Text File
cs: Textový soubor
de: Textdatei
es: Archivo de texto
fr: Fichier texte
it: File di testo
ja: テキスト ファイル
ko: 텍스트 파일
pl: Plik tekstowy
pt_br: Arquivo de Texto
ru: Текстовый файл
tr: Metin Dosyası
zh_hans: 文本文件
zh_hant: 文字檔

source: An empty text file
cs: Prázdný textový soubor
de: Eine leere Textdatei
es: Archivo de texto vacío
fr: Fichier texte vide
it: File di testo vuoto
ja: 空のテキスト ファイル
ko: 빈 텍스트 파일입니다.
pl: Pusty plik tekstowy
pt_br: Um arquivo de texto vazio
ru: Пустой текстовый файл
tr: Boş metin dosyası
zh_hans: 空文本文件
zh_hant: 空白文字檔

source: XML File
cs: Soubor XML
de: XML-Datei
es: Archivo XML
fr: Fichier XML
it: File XML
ja: XML ファイル
ko: XML 파일
pl: Plik XML
pt_br: Arquivo XML
ru: XML-файл
tr: XML Dosyası
zh_hans: XML 文件
zh_hant: XML 檔

source: A blank XML file
cs: Prázdný XML soubor
de: Eine leere XML-Datei
es: Archivo XML en blanco
fr: Fichier XML vide
it: File XML vuoto
ja: 空の XML ファイルです
ko: 빈 XML 파일입니다.
pl: Pusty plik XML
pt_br: Um arquivo XML em branco
ru: Пустой XML-файл
tr: Boş XML dosyası
zh_hans: 空白 XML 文件
zh_hant: 空的 XML 檔

source: Portable Library (.NET 4.5, Windows Store, Silverlight 5, Xamarin)
cs: Přenosná knihovna (.NET 4.5, Windows Store, Silverlight 5, Xamarin)
de: Portierbare Bibliothek (.NET 4.5, Windows Store, Silverlight 5, Xamarin)
es: Biblioteca portable (.NET 4.5, Tienda Windows, Silverlight 5, Xamarin)
fr: Bibliothèque portable (.NET 4.5, Windows Store, Silverlight 5, Xamarin)
it: Libreria portabile (.NET 4.5, Windows Store, Silverlight 5, Xamarin)
ja: 移植可能なライブラリ (.NET 4.5、Windows ストア、Silverlight 5、Xamarin)
ko: 이식 가능한 라이브러리(.NET 4.5, Windows 스토어, Silverlight 5, Xamarin)
pl: Biblioteka przenośna (.NET 4.5, Sklep Windows, Silverlight 5, Xamarin)
pt_br: Biblioteca Portátil (.NET 4.5, Windows Store, Silverlight 5, Xamarin)
ru: Переносимая библиотека (.NET 4.5, Магазин Windows, Silverlight 5, Xamarin)
tr: Taşınabilir Kitaplık (.NET 4.5, Windows Mağazası, Silverlight 5, Xamarin)
zh_hans: 可移植库(.NET 4.5、Windows Store、Silverlight 5、Xamarin)
zh_hant: 可攜式程式庫 (.NET 4.5、Windows 市集、Silverlight 5、Xamarin)

source: A project for creating an F# library (.dll) that can run on .NET Framework 4.5, Windows Store, Silverlight 5, Xamarin.iOS, Xamarin.Android and Xamarin.iOS(Classic). Profile 47
cs: Projekt pro vytváření knihovny F# (.dll), kterou jde spustit na platformě .NET Framework 4.5, Windows Store, Silverlight 5, Xamarin.iOS, Xamarin.Android a Xamarin.iOS(Classic). Profil 47
de: Ein Projekt zum Erstellen einer F#-Bibliothek (.dll), die unter .NET Framework 4.5, Windows Store, Silverlight 5, Xamarin.iOS, Xamarin.Android und Xamarin.iOS(Classic) ausgeführt werden kann. Profil 47
es: Proyecto para crear una biblioteca de F# (.dll) que se puede ejecutar en .NET Framework 4.5, la Tienda Windows, Silverlight 5, Xamarin.iOS, Xamarin.Android y Xamarin.iOS(Classic). Perfil 47
fr: Projet de création d'une bibliothèque F# (.dll) qui peut s'exécuter sur le .NET Framework 4.5, Windows Store, Silverlight 5, Xamarin.iOS, Xamarin.Android et Xamarin.iOS(Classic). Profil 47
it: Progetto per la creazione di una libreria F# (.dll) che può essere eseguita su .NET Framework 4.5, Windows Store, Silverlight 5, Xamarin.iOS, Xamarin.Android e Xamarin.iOS(Classic). Profilo 47
ja: .NET Framework 4.5、Windows ストア、Silverlight 5、Xamarin.iOS、Xamarin.Android、および Xamarin.iOS(Classic) で実行できる F# ライブラリ (.dll) を作成するためのプロジェクト。プロファイル 47
ko: .NET Framework 4.5, Windows Store, Silverlight 5, Xamarin.iOS, Xamarin.Android 및 Xamarin.iOS(클래식)에서 실행할 수 있는 F# 라이브러리(.dll)를 만드는 프로젝트입니다. 프로필 47
pl: Projekt służący do tworzenia bibliotek języka F# (dll), które mogą działać w programie .NET Framework 4.5, w Sklepie Windows i w programie Silverlight 5 oraz w interfejsach Xamarin.iOS, Xamarin.Android i Xamarin.iOS (klasyczny). Profil 47
pt_br: Um projeto para criar uma biblioteca do F# (.dll) que pode ser executada no .NET Framework 4.5, Windows Store, Silverlight 5, Xamarin.iOS, Xamarin.Android e Xamarin.iOS(Classic). Profile 47
ru: Проект для создания библиотеки F# (DLL), которая может работать в .NET Framework 4.5 и выше, Магазине Windows и Silverlight 5, Xamarin.iOS, Xamarin.Android и Xamarin.iOS (Classic). Профиль 47
tr: .NET Framework 4.5, Windows Mağazası, Silverlight 5, Xamarin.iOS, Xamarin.Android ve Xamarin.iOS (Classic) içinde çalışabilen bir F# kitaplığı (.dll) oluşturma projesi. Profil 47
zh_hans: 一个用于创建可在以下对象上运行的 F# 库(.dll) 的项目: .NET Framework 4.5、Windows 应用商店、Silverlight 5、Xamarin.iOS、Xamarin.Android 和 Xamarin.iOS(Classic)。配置文件 47
zh_hant: 用於建立可在 .NET Framework 4.5、Windows 市集、Silverlight 5、Xamarin.iOS、Xamarin.Android 及 Xamarin.iOS (傳統) 上執行之 F# 程式庫 (.dll) 的專案。設定檔 47

source: Data
de: Daten
es: Datos
fr: Données
it: Dati
ja: データ
ko: 데이터
pl: Dane
pt_br: Dados
ru: Данные
tr: Veri
zh_hans: 数据
zh_hant: 資料

source: OData Service Connection (LINQ, type provider)
cs: Připojení služby OData (LINQ, zprostředkovatel typu)
de: OData-Dienstverbindung (LINQ, Typanbieter)
es: Conexión de servicio OData (LINQ, proveedor de tipos)
fr: Connexion de service OData (LINQ, fournisseur de type)
it: Connessione al servizio OData (LINQ, provider di tipi)
ja: OData Service 接続 (LINQ、型プロバイダー)
ko: OData 서비스 연결(LINQ, 형식 공급자)
pl: Połączenie usługi OData (LINQ, dostawca typów)
pt_br: Conexão de Serviço OData (LINQ, provedor de tipos)
ru: Подключение к службе OData (LINQ, поставщик типов)
tr: OData Hizmet Bağlantısı (LINQ, tür sağlayıcısı)
zh_hans: OData 服务连接(LINQ，类型提供程序)
zh_hant: OData 服務連接 (LINQ、型別提供者)

source: A project item for consuming a Open Data Protocol (OData) web service using ODataService type provider.
cs: Položka projektu určená pro zpracování obsahu webové služby typu Open Data Protocol (OData) pomocí zprostředkovatele typu ODataService.
de: Ein Projektelement zum Verwenden eines Open Data Protocol (OData)-Webdiensts mithilfe eines ODataService-Typanbieters.
es: Elemento del proyecto para usar un servicio Web de Open Data Protocol (OData) con el proveedor de tipos ODataService.
fr: Élément de projet pour utiliser un service web OData (Open Data Protocol) à l'aide du fournisseur de type ODataService.
it: Elemento di progetto per usare un servizio Web Protocollo OData (Open Data) con il provider di tipi ODataService.
ja: ODataService 型プロバイダーを使用して Open Data Protocol (OData) Web サービスを使用するためのプロジェクト アイテムです。
ko: ODataService 형식 공급자를 사용하는 개방형 데이터 프로토콜(OData) 웹 서비스를 소비하는 프로젝트 항목입니다.
pl: Element projektu służący do konsumowania usługi sieci Web OData (Open Data Protocol) przy użyciu dostawcy typów ODataService.
pt_br: Um item de projeto para consumir um serviço Web Open Data Protocol (OData) usando o provedor de tipos ODataService.
ru: Элемент проекта для использования веб-службы OData с помощью поставщика типов ODataService.
tr: ODataService tür sağlayıcısını kullanan bir Açık Veri Protokolü (OData) web hizmetini tüketmeye yönelik proje öğesi.
zh_hans: 通过 ODataService 类型提供程序使用 Open Data Protocol (OData) Web 服务的项目项。
zh_hant: 此專案項目用於利用 ODataService 型別提供者來使用開放式資料通訊協定 (OData) Web 服務。

source: A project item for consuming a .NET Managed Resources File (Resx) using ResxFile type provider.
cs: Položka projektu určená pro zpracování obsahu souboru spravovaných prostředků .NET (Resx) pomocí zprostředkovatele typu ResxFile.
de: Ein Projektelement zum Verwenden einer verwalteten .NET-Ressourcendatei (Resx) mithilfe eines ResxFile-Typanbieters.
es: Elemento del proyecto para usar un archivo de recursos administrados .NET (Resx) con el proveedor de tipos ResxFile.
fr: Élément de projet pour utiliser un fichier de ressources managées .NET (Resx) à l'aide du fournisseur de type ResxFile.
it: Elemento di progetto per l'utilizzo di un file di risorse gestite .NET (Resx) utilizzando il provider di tipi ResxFile.
ja: ResxFile 型プロバイダーを使用して .NET マネージド リソース ファイル (Resx) を使用するためのプロジェクト アイテムです。
ko: ResxFile 형식 공급자를 사용하는 .NET 관리 리소스 파일(Resx)을 소비하기 위한 프로젝트 항목입니다.
pl: Element projektu służący do konsumowania pliku zasobów zarządzanych .NET (Resx) przy użyciu dostawcy typów ResxFile.
pt_br: Um item de projeto para consumir um Arquivo de Recursos Gerenciados .NET (Resx) usando o provedor de tipos ResxFile.
ru: Элемент проекта для использования файла управляемых ресурсов .NET (RESX) с помощью поставщика типов ResxFile.
tr: ResxFile tür sağlayıcısını kullanan bir .NET Yönetilen Kaynaklar Dosyasını (Resx) tüketmeye yönelik proje öğesi.
zh_hans: 通过 ResxFile 类型提供程序使用 .NET 受管理资源文件(Resx)的项目项。
zh_hant: 此專案項目用於利用 ResxFile 型別提供者來使用 .NET 受控資源檔案 (Resx)。

source: SQL Database Connection (LINQ to SQL, type provider)
cs: Připojení k databázi SQL (LINQ to SQL, zprostředkovatel typu)
de: SQL-Datenbankverbindung (LINQ to SQL, Typanbieter)
es: Conexión de SQL Database (LINQ to SQL, proveedor de tipos)
fr: Connexion de base de données SQL (LINQ to SQL, fournisseur de type)
it: Connessione al database SQL (LINQ to SQL, provider di tipi)
ja: SQL データベース接続 (LINQ to SQL、型プロバイダー)
ko: SQL Database 연결(LINQ to SQL, 형식 공급자)
pl: Połączenie bazy danych SQL (LINQ to SQL, dostawca typów)
pt_br: Conexão de Banco de Dados SQL (LINQ to SQL, provedor de tipos)
ru: Подключение к базе данных SQL (LINQ to SQL, поставщик типов)
tr: SQL Veritabanı Bağlantısı (LINQ to SQL, tür sağlayıcısı)
zh_hans: SQL 数据库连接(LINQ to SQL，类型提供程序)
zh_hant: SQL 資料庫連接 (LINQ to SQL、型別提供者)

source: A project item for using the SqlDataConnection (LINQ to SQL) type provider to generate types and consume data in a live SQL database.
cs: Položka projektu určená pro vygenerování typů a zpracování dat v živé databázi SQL pomocí zprostředkovatele typu SqlDataConnection (LINQ to SQL).
de: Ein Projektelement zum Generieren von Typen und Verwenden von Daten in einer Live-SQL-Datenbank mithilfe des SqlDataConnection (LINQ to SQL)-Typanbieters.
es: Elemento del proyecto para usar el proveedor de tipo SqlDataConnection (LINQ to SQL) para generar tipos y consumir datos en una instancia de SQL Database activa.
fr: Élément de projet pour utiliser le fournisseur de type SqlDataConnection (LINQ to SQL) pour générer des types et utiliser des données dans une base de données SQL active.
it: Elemento di progetto per l'utilizzo del provider di tipi SqlDataConnection (LINQ to SQL) per generare i tipi e utilizzare i dati in un database SQL attivo.
ja: SqlDataConnection (LINQ to SQL) 型プロバイダーを使用して型を生成して、ライブ SQL データベースのデータを使用するためのプロジェクト アイテムです。
ko: SqlDataConnection(LINQ to SQL) 형식 공급자를 사용하여 형식을 생성하고 라이브 SQL Database의 데이터를 소비하기 위한 프로젝트 항목입니다.
pl: Element projektu służący do używania dostawcy typów SqlDataConnection (LINQ to SQL) do generowania typów i konsumowania danych z działającej bazy danych SQL.
pt_br: Um item de projeto para usar o provedor de tipos SqlDataConnection (LINQ to SQL) para gerar tipos e consumir dados em um banco de dados SQL dinâmico.
ru: Элемент проекта для использования поставщика типов SqlDataConnection (LINQ to SQL) с целью создания типов и использования данных в активной базе данных SQL.
tr: Türler oluşturmak ve dinamik SQL veritabanındaki verileri tüketmek için SqlDataConnection (LINQ to SQL) tür sağlayıcısını kullanmaya yönelik proje öğesi.
zh_hans: 通过 SqlDataConnection (LINQ to SQL)类型提供程序生成类型并使用实时 SQL 数据库中的数据的项目项。
zh_hant: 此專案項目用於使用 SqlDataConnection (LINQ to SQL) 型別提供者來產生型別並使用即時 SQL 資料庫資料。

source: SQL Database Connection (LINQ to Entities, type provider)
cs: Připojení k databázi SQL (LINQ to Entities zprostředkovatel typu)
de: SQL-Datenbankverbindung (LINQ to Entities, Typanbieter)
es: Conexión de SQL Database (LINQ to Entities, proveedor de tipos)
fr: Connexion de base de données SQL (LINQ to Entities, fournisseur de type)
it: Connessione al database SQL (LINQ to Entities, provider di tipi)
ja: SQL データベース接続 (LINQ to Entities、型プロバイダー)
ko: SQL Database 연결(LINQ to Entities, 형식 공급자)
pl: Połączenie bazy danych SQL (LINQ to Entities, dostawca typów)
pt_br: Conexão de Banco de Dados SQL (LINQ to Entities, provedor de tipos)
ru: Подключение к базе данных SQL (LINQ to Entities, поставщик типов)
tr: SQL Veritabanı Bağlantısı (LINQ to Entities, tür sağlayıcısı)
zh_hans: SQL 数据库连接(LINQ to Entities，类型提供程序)
zh_hant: SQL 資料庫連接 (LINQ to Entities、型別提供者)

source: A project item for using the SqlEntityConnection (Entity Data Model) type provider to generate types and consume data in a live SQL database.
cs: Položka projektu určená pro vygenerování typů a zpracování dat v živé databázi SQL pomocí zprostředkovatele typu SqlEntityConnection (Entity Data Model).
de: Ein Projektelement zum Generieren von Typen und Verwenden von Daten in einer Live-SQL-Datenbank mithilfe des SqlEntityConnection (Entity Data Model)-Typanbieters.
es: Elemento del proyecto para usar el proveedor de tipo SqlEntityConnection (Entity Data Model) para generar tipos y consumir datos en una instancia de SQL Database activa.
fr: Élément de projet pour utiliser le fournisseur de type SqlEntityConnection (Entity Data Model) pour générer des types et utiliser des données dans une base de données SQL active.
it: Elemento di progetto per l'utilizzo del provider di tipi SqlEntityConnection (Entity Data Model) per generare i tipi e utilizzare i dati in un database SQL attivo.
ja: SqlEntityConnection (Entity Data Model) 型プロバイダーを使用して型を生成して、ライブ SQL データベースのデータを使用するためのプロジェクト アイテムです。
ko: SqlEntityConnection(엔터티 데이터 모델) 형식 공급자를 사용하여 형식을 생성하고 라이브 SQL Database의 데이터를 소비하기 위한 프로젝트 항목입니다.
pl: Element projektu służący do używania dostawcy typów SqlEntityConnection (Entity Data Model) do generowania typów i konsumowania danych z działającej bazy danych SQL.
pt_br: Um item de projeto para usar o provedor de tipos SqlEntityConnection (Modelo de Dados de Entidade) para gerar tipos e consumir dados em um banco de dados SQL dinâmico.
ru: Элемент проекта для использования поставщика типов SqlEntityConnection (модель EDM) с целью создания типов и использования данных в активной базе данных SQL.
tr: Türler oluşturmak ve dinamik SQL veritabanındaki verileri tüketmek için SqlEntityConnection (Varlık Veri Modeli) tür sağlayıcısını kullanmaya yönelik proje öğesi.
zh_hans: 通过 SqlEntityConnection (实体数据模型)类型提供程序生成类型并使用实时 SQL 数据库中的数据的项目项。
zh_hant: 此專案項目用於使用 SqlEntityConnection (實體資料模型) 型別提供者來產生型別並使用即時 SQL 資料庫資料。

source: WSDL Service Connection (type provider)
cs: Připojení služby WSDL (zprostředkovatel typu)
de: WSDL-Dienstverbindung (Typanbieter)
es: Conexión de servicio WSDL (proveedor de tipos)
fr: Connexion de service WSDL (fournisseur de type)
it: Connessione al servizio WSDL (provider di tipi)
ja: WSDL サービス接続 (型プロバイダー)
ko: WSDL 서비스 연결(형식 공급자)
pl: Połączenie usługi WSDL (dostawca typów)
pt_br: Conexão de Serviço WSDL (provedor de tipos)
ru: Подключение к службе WSDL (поставщик типов)
tr: WSDL Hizmet Bağlantısı (tür sağlayıcısı)
zh_hans: WSDL 服务连接(类型提供程序)
zh_hant: WSDL 服務連接 (型別提供者)

source: A project item for consuming a Web Service using WsdlService type provider.
cs: Položka projektu určená pro zpracování obsahu webové služby pomocí zprostředkovatele typu WsdlService.
de: Ein Projektelement zum Verwenden eines Webdiensts mithilfe eines WsdlService-Typanbieters.
es: Elemento del proyecto para consumir un servicio Web usando el proveedor de tipos WsdlService.
fr: Élément de projet pour utiliser un service web à l'aide du fournisseur de type WsdlService.
it: Elemento di progetto per l'utilizzo di un servizio Web tramite il provider di tipi WsdlService.
ja: WsdlService 型プロバイダーを使用して Web サービスを使用するためのプロジェクト アイテムです。
ko: WsdlService 형식 공급자를 사용하여 웹 서비스를 소비하는 프로젝트 항목입니다.
pl: Element projektu służący do konsumowania usługi sieci Web przy użyciu dostawcy typów WsdlService.
pt_br: Um item de projeto para consumir um serviço Web usando o provedor de tipos WsdlService.
ru: Элемент проекта для использования веб-службы с помощью поставщика типов WsdlService.
tr: WsdlService tür sağlayıcısını kullanan bir Web Hizmetini tüketmeye yönelik proje öğesi.
zh_hans: 通过 WsdlService 类型提供程序使用 Web 服务的项目项。
zh_hant: 此專案項目用於利用 WsdlService 型別提供者來使用 Web 服務。

source: Portable Library (.NET 4.5, Windows Store, Xamarin)
cs: Přenosná knihovna (.NET 4.5, Windows Store, Xamarin)
de: Portierbare Bibliothek (.NET 4.5, Windows Store, Xamarin)
es: Biblioteca portable (.NET 4.5, Tienda Windows, Xamarin)
fr: Bibliothèque portable (.NET 4.5, Windows Store, Xamarin)
it: Libreria portabile (.NET 4.5, Windows Store, Xamarin)
ja: 移植可能なライブラリ (.NET 4.5、Windows ストア、Xamarin)
ko: 이식 가능한 라이브러리(.NET 4.5, Windows 스토어, Xamarin)
pl: Biblioteka przenośna (.NET 4.5, Sklep Windows, Xamarin)
pt_br: Biblioteca Portátil (.NET 4.5, Windows Store, Xamarin)
ru: Переносимая библиотека (.NET 4.5, Магазин Windows, Xamarin)
tr: Taşınabilir Kitaplık (.NET 4.5, Windows Mağazası, Xamarin)
zh_hans: 可移植的库(.NET 4.5、Windows 应用商店、Xamarin)
zh_hant: 可攜式程式庫 (.NET 4.5、Windows 市集、Xamarin)

source: A project for creating an F# library (.dll) that can run on .NET Framework 4.5, Windows Store, Xamarin.iOS, Xamarin.Android and Xamarin.iOS(Classic). Profile 7
cs: Projekt pro tvorbu knihovny F# (.dll) spustitelný v rozhraní .NET Framework 4.5, Windows Store, Xamarin.iOS, Xamarin.Android a Xamarin.iOS(Classic). Profil 7
de: Ein Projekt zum Erstellen einer F#-Bibliothek (.dll), die unter .NET Framework 4.5, Windows Store, Xamarin.iOS, Xamarin.Android und Xamarin.iOS(Classic) ausgeführt werden kann. Profil 7
es: Proyecto para crear una biblioteca de F# (.dll) que se puede ejecutar en .NET Framework 4.5, la Tienda Windows, Xamarin.iOS, Xamarin.Android y Xamarin.iOS(Classic). Perfil 7
fr: Projet de création d'une bibliothèque F# (.dll) qui peut s'exécuter sur .NET Framework 4.5, le Windows Store, Xamarin.iOS, Xamarin.Android et Xamarin.iOS(Classic). Profil 7
it: Progetto per la creazione di una libreria F# (.dll) che può essere eseguita su .NET Framework 4.5, Windows Store, Xamarin.iOS, Xamarin.Android e Xamarin.iOS(Classic). Profilo 7
ja: .NET Framework 4.5、Windows ストア、Xamarin.iOS、Xamarin.Android、および Xamarin.iOS(Classic) で実行できる F# ライブラリ (.dll) を作成するためのプロジェクト。プロファイル 7
ko: .NET Framework 4.5, Windows 스토어, Xamarin.iOS, Xamarin.Android 및 Xamarin.iOS(클래식)에서 실행할 수 있는 F# 라이브러리(.dll)를 만드는 프로젝트입니다. 프로필 7
pl: Projekt służący do tworzenia bibliotek języka F# (dll), które mogą działać w programie .NET Framework 4.5, w Sklepie Windows oraz w interfejsach Xamarin.iOS, Xamarin.Android i Xamarin.iOS (klasyczny). Profil 7
pt_br: Um projeto para criar uma biblioteca F# (.dll) que pode ser executada no .NET Framework 4.5, Windows Store, Xamarin.iOS, Xamarin.Android e Xamarin.iOS(Classic). Perfil 7
ru: Проект для создания библиотеки F# (DLL), которая может работать в .NET Framework 4.5 и Магазине Windows, Xamarin.iOS, Xamarin.Android и Xamarin.iOS (Classic). Профиль 7
tr: .NET Framework 4.5, Windows Mağazası, Xamarin.iOS, Xamarin.Android ve Xamarin.iOS(Classic)'ta çalışabilen bir F# kitaplığı (.dll) oluşturma projesi. Profil 7
zh_hans: 一个用于创建可在以下对象上运行的 F# 库(.dll) 的项目: .NET Framework 4.5、Windows 应用商店、Xamarin.iOS、Xamarin.Android 和 Xamarin.iOS(Classic)。配置文件7
zh_hant: 用於建立可在 .NET Framework 4.5、Windows 市集、Xamarin.iOS、Xamarin.Android 和 Xamarin.iOS(傳統)上執行之 F# 程式庫 (.dll) 的專案。設定檔 7

source: Portable Library (.NET 4.5, Windows Store, Windows Phone 8 Silverlight, Xamarin)
cs: Přenosná knihovna (.NET 4.5, Windows Store, Windows Phone 8 Silverlight, Xamarin)
de: Portierbare Bibliothek (.NET 4.5, Windows Store, Windows Phone 8 Silverlight, Xamarin)
es: Biblioteca portable (.NET 4.5, Tienda Windows, Windows Phone 8 Silverlight, Xamarin)
fr: Bibliothèque portable (.NET 4.5, le Windows Store, Windows Phone 8 Silverlight, Xamarin)
it: Libreria portabile (.NET 4.5, Windows Store, Windows Phone 8 Silverlight, Xamarin)
ja: 移植可能なライブラリ (.NET 4.5、Windows ストア、Windows Phone 8 Silverlight、Xamarin)
ko: 이식 가능한 라이브러리(.NET 4.5, Windows 스토어, Windows Phone 8 Silverlight, Xamarin)
pl: Biblioteka przenośna (.NET 4.5, Sklep Windows, Silverlight dla systemu Windows Phone 8, Xamarin)
pt_br: Biblioteca Portátil (.NET 4.5, Windows Store, Windows Phone 8 Silverlight, Xamarin)
ru: Переносимая библиотека (.NET 4.5, Магазин Windows, Windows Phone 8 Silverlight, Xamarin)
tr: Taşınabilir Kitaplık (.NET 4.5, Windows Mağazası, Windows Phone 8 Silverlight, Xamarin)
zh_hans: 可移植的库(.NET 4.5、Windows 应用商店、Windows Phone 8 Silverlight、Xamarin)
zh_hant: 可攜式程式庫 (.NET 4.5、Windows 市集、Windows Phone 8 Silverlight、Xamarin)
