Repository: dotnet/fsharp
Catalog: vsintegration/src/FSharp.ProjectSystem.FSharp/xlf/VSPackage.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Change path and command line arguments passed to the F# Interactive
cs: Změnit cestu a argumenty příkazového řádku předané F# Interactive
de: Die Argumente zum Ändern des Pfads und die Befehlszeilenargumente wurden an F# Interactive übergeben.
es: Cambiar la ruta de acceso y los argumentos de la línea de comandos pasados a F# interactivo
fr: Modifier les arguments de chemin d'accès et de ligne de commande passés à F# Interactive
it: Modificare gli argomenti della riga di comando e del percorso passati a F# Interactive
ja: F# インタラクティブに渡されるパスとコマンド ライン引数を変更します
ko: F# Interactive에 전달된 경로 및 명령줄 인수를 변경합니다.
pl: Zmień ścieżkę i argumenty wiersza polecenia przekazywane do programu F# Interactive
pt_br: Alterar caminho e argumentos da linha de comando passados para o F# Interativo
ru: Изменение пути и аргументов командной строки, передаваемых в программу F# Interactive
tr: Yolu ve F# Etkileşimli'ye geçirilen komut satırı bağımsız değişkenlerini değiştir
zh_hans: 更改传递给 F# 交互窗口的路径和命令行参数
zh_hant: 變更傳遞到 F# 互動的路徑和命令列引數

source: Enable or disable Type Providers
cs: Povolit nebo zakázat zprostředkovatele typů
de: Typanbieter aktivieren oder deaktivieren
es: Habilitar o deshabilitar los proveedores de tipo
fr: Activer ou désactiver les fournisseurs de type
it: Abilitare o disabilitare i provider di tipi
ja: 型プロバイダーを有効または無効にします
ko: 형식 공급자의 사용 여부를 설정합니다.
pl: Włącz lub wyłącz dostawców typów
pt_br: Habilitar ou desabilitar Provedores de Tipos
ru: Включение или отключение поставщиков типов
tr: Tür Sağlayıcılarını etkinleştir ve devre dışı bırak
zh_hans: 启用或禁用类型提供程序
zh_hant: 啟用或停用類型提供者

source: Visual F# Items
cs: Položky Visual F#
de: Visual F#-Elemente
es: Elementos de Visual F#
fr: Éléments Visual F#
it: Elementi di Visual F#
ja: Visual F# 項目
ko: Visual F# 항목
pl: Elementy języka Visual F#
pt_br: Itens do Visual F#
ru: Элементы Visual F#
tr: Visual F# Öğeleri
zh_hans: Visual F# 项
zh_hant: Visual F# 項目

# AddReferenceDialogTitle_Dev11
source: Reference Manager - {0}
cs: Správce odkazů - {0}
de: Verweis-Manager – {0}
es: Administrador de referencias - {0}
fr: Gestionnaire de références - {0}
it: Gestione riferimenti - {0}
ja: 参照マネージャー - {0}
ko: 참조 관리자 - {0}
pl: Menedżer odwołań — {0}
pt_br: Gerenciador de Referências - {0}
ru: Диспетчер ссылок - {0}
tr: Başvuru Yöneticisi - {0}
zh_hans: 引用管理器 - {0}
zh_hant: 參考管理員 - {0}

# Dev11SupportsOnlySilverlight5
source: F# projects in the current version of Visual Studio support only Silverlight 5.
cs: F# projekty v aktuální verzi aplikace Visual Studio podporují pouze Silverlight ve verzi 5.
de: F#-Projekte in der aktuellen Version von Visual Studio unterstützen nur Silverlight 5.
es: Los proyectos de F# de la versión actual de Visual Studio solamente admiten Silverlight 5.
fr: Les projets F# dans la version actuelle de Visual Studio prennent uniquement en charge Silverlight 5.
it: I progetti F# nella versione corrente di Visual Studio supportano solo Silverlight 5.
ja: 現在のバージョンの Visual Studio の F# プロジェクトでは、Silverlight 5 のみがサポートされます。
ko: 현재 Visual Studio 버전의 F# 프로젝트는 Silverlight 5만 지원합니다.
pl: Projekty języka F# w bieżącej wersji programu Visual Studio obsługują tylko platformę Silverlight 5.
pt_br: Os projetos F# na versão atual do Visual Studio oferecem suporte somente ao Silverlight 5.
ru: Проекты F# в текущей версии Visual Studio поддерживают только Silverlight 5.
tr: Visual Studio'nun güncel sürümündeki F# projeleri yalnızca Silverlight 5'i destekler.
zh_hans: 当前版本的 Visual Studio 中的 F# 项目仅支持 Silverlight 5。
zh_hant: 目前 Visual Studio 版本中的 F# 專案僅支援 Silverlight 5。

# AddReferenceAssemblyPageDialogRetargetingText
source: The project will be retargeted, and its targeted frameworks will be reduced.
cs: Cíl projektu bude změněn a jeho cílová rozhraní budou zredukována.
de: Das Projekt wird einem anderen Ziel zugeordnet sowie das ihm zugeordnete Framework reduziert.
es: El proyecto se redestinará y sus versiones de .NET Framework de destino se reducirán.
fr: Le projet va être reciblé et les versions cibles de .NET Framework vont être réduites.
it: Il progetto verrà ridestinato e i framework di destinazione verranno ridotti.
ja: プロジェクトが再ターゲットされ、そのターゲットのフレームワークが減少します。
ko: 프로젝트의 대상이 다시 지정되고 해당 대상 프레임워크가 축소됩니다.
pl: Cel projektu zostanie zmieniony. Jego platformy docelowe zostaną ograniczone.
pt_br: O projeto será redirecionado e seus frameworks-alvo serão reduzidos.
ru: Требуемые версии .NET Framework проекта будут изменены и ограничены.
tr: Proje yeniden hedeflenir ve hedeflenmiş çerçeveleri küçültülür.
zh_hans: 项目将重定目标，并且将减少其目标框架。
zh_hant: 專案將重定目標，而且目標 Framework 將減少。

# AddReferenceAssemblyPageDialogNoItemsText
source: All of the Framework assemblies are already referenced. Please use the Object Browser to explore the references in the Framework.
cs: Na všechna sestavení rozhraní je již odkazováno. Pro prozkoumání odkazů rozhraní použijte prohlížeč objektů.
de: Alle der Framework-Assemblys sind bereits referenziert. Verwenden Sie den Objektkatalog, um die Verweise im Framework zu durchsuchen.
es: Ya se hace referencia a todos los ensamblados de .NET Framework. Use el Examinador de objetos para ver las referencias en .NET Framework.
fr: Tous les assemblys .NET Framework sont déjà référencés. Utilisez l'Explorateur d'objets pour explorer les références dans le Framework.
it: Si è già fatto riferimento a tutti gli assembly del framework. Utilizzare Visualizzatore oggetti per esplorare i riferimenti nel framework.
ja: すべての Framework アセンブリが既に参照されています。オブジェクト ブラウザーを使用して Framework 内の参照を調べてください。
ko: 모든 Framework 어셈블리가 이미 참조되었습니다. [개체 브라우저]5D;를 사용하여 Framework에서 참조를 탐색하세요.
pl: Istnieją już odwołania do wszystkich zestawów platformy. Użyj Przeglądarki obiektów do eksplorowania odwołań w platformie.
pt_br: Todos os assemblies do Framework já estão referenciados. Use o Pesquisador de Objetos para explorar as referências no Framework.
ru: Ссылки на все сборки .NET Framework уже заданы. С помощью обозревателя объектов рассмотрите ссылки в .NET Framework.
tr: Tüm Framework bütünleştirilmiş kodlarına zaten başvurulmuş. Lütfen Framework'deki başvuruları araştırmak için Nesne Tarayıcısı'nı kullanın.
zh_hans: 已引用所有框架程序集。请使用对象浏览器浏览框架中的引用。
zh_hant: 所有 Framework 組件都已經被參考了。請使用物件瀏覽器瀏覽 Framework 中的參考。

# FSharpCoreVersionIsNotLegacyCompatible
source: Referencing this version of FSharp.Core will cause your project to be incompatible with older versions of Visual Studio. Do you want to continue?
cs: Odkazování na tuto verzi oboru názvů FSharp.Core zapříčiní nekompatibilitu projektu se staršími verzemi sady Visual Studio. Chcete pokračovat?
de: Das Verweisen auf diese Version von FSharp.Core führt dazu, dass Ihr Projekt nicht mehr mit älteren Versionen von Visual Studio kompatibel ist. Möchten Sie diesen Vorgang fortsetzen?
es: La referencia a esta versión de FSharp.Core hará que el proyecto sea incompatible con versiones anteriores de Visual Studio. ¿Quiere continuar?
fr: Le référencement de cette version de FSharp.Core fera que votre projet ne sera plus compatible avec les versions précédentes de Visual Studio. Voulez-vous continuer ?
it: Il riferimento a questa versione di FSharp.Core renderà il progetto incompatibile con le versioni precedenti di Visual Studio. Continuare?
ja: このバージョンの FSharp.Core を参照すると、プロジェクトと以前のバージョンの Visual Studio との互換性がなくなります。続行しますか?
ko: 이 버전의 FSharp.Core를 참조하면 프로젝트가 이전 버전의 Visual Studio와 호환되지 않습니다. 계속하시겠습니까?
pl: Po utworzeniu odwołania do tej wersji biblioteki FSharp.Core Twój projekt nie będzie zgodny ze starszymi wersjami programu Visual Studio. Czy chcesz kontynuować?
pt_br: A referência a esta versão do FSharp.Core fará com que seu projeto se torne incompatível com versões anteriores do Visual Studio. Deseja continuar?
ru: При задании ссылки на эту версию FSharp.Core проект будет несовместим с предыдущими версиями Visual Studio. Вы хотите продолжить?
tr: FSharp.Core'un bu sürümüne başvurmak projenizin Visual Studio'nun eski sürümleriyle uyumsuz olmasına neden olacak. Devam etmek istiyor musunuz?
zh_hans: 引用此版本的 FSharp.Core 将导致您的项目与旧版 Visual Studio 不兼容。是否要继续?
zh_hant: 參考這個版本的 FSharp.Core，將使您的專案與舊版 Visual Studio 不相容。您要繼續嗎?

# ComputingSourcesAndFlags
source: Updating compilation sources and flags...
cs: Aktualizují se zdroje a příznaky kompilace...
de: Kompilierungsquellen und Flags werden aktualisiert...
es: Actualizando los archivos de código fuente y las marcas de compilación...
fr: Mise à jour des indicateurs et des sources de compilation...
it: Aggiornamento dei flag e dei file del codice sorgente...
ja: コンパイル ソース コード ファイルとフラグを更新しています...
ko: 컴파일 소스 및 플래그를 업데이트하는 중...
pl: Trwa aktualizowanie źródeł i flag kompilacji...
pt_br: Atualizando origens de compilação e sinalizadores...
ru: Обновление источников и флагов компиляции...
tr: Derleme kaynakları ve bayrakları güncelleştiriliyor...
zh_hans: 正在更新编译源和标记...
zh_hant: 正在更新編譯來源與旗標...

source: Updating solution configuration...
cs: Aktualizuje se konfigurace řešení...
de: Lösungskonfiguration wird aktualisiert...
es: Actualizando la configuración de la solución...
fr: Mise à jour de la configuration de la solution...
it: Aggiornamento della configurazione della soluzione...
ja: ソリューション構成を更新しています...
ko: 솔루션 구성을 업데이트하는 중...
pl: Trwa aktualizowanie konfiguracji rozwiązania...
pt_br: Atualizando configuração da solução...
ru: Изменение конфигурации решения...
tr: Çözüm yapılandırması güncelleştiriliyor...
zh_hans: 正在更新解决方案配置...
zh_hant: 正在更新方案組態...

# FileCannotBePlacedBodyAbove
source: The file '{0}' cannot be placed above '{1}' in the Solution Explorer.\n\n{2}.
cs: Soubor {0} nemůže být umístěn nad {1} v Průzkumníkovi řešení.\n\n{2}.
de: Die Datei "{0}" kann im Projektmappen-Explorer nicht über "{1}" platziert werden.\n\n{2}.
es: El archivo "{0}" no se puede colocar encima de "{1}" en el Explorador de soluciones.\n\n{2}.
fr: Impossible de placer le fichier '{0}' au-dessus de '{1}' dans l'Explorateur de solutions.\n\n{2}.
it: Non è possibile inserire il file '{0}' sopra '{1}' in Esplora soluzioni.\n\n{2}.
ja: ファイル '{0}' をソリューション エクスプローラー内の '{1}' の上に配置することはできません。\n\n{2}。
ko: {0}' 파일을 솔루션 탐색기에서 '{1}' 위에 배치할 수 없습니다.\n\n{2}.
pl: Nie można umieścić pliku „{0}” powyżej elementu „{1}” w Eksploratorze rozwiązań.\n\n{2}.
pt_br: O arquivo '{0}' não pode ser colocado acima do '{1}' no Gerenciador de Soluções.\n\n{2}.
ru: Файл "{0}" невозможно расположить выше "{1}" в обозревателе решений.\n\n{2}.
tr: {0}' dosyası Çözüm Gezgini'ndeki '{1}' üzerine yerleştirilemez.\n\n{2}.
zh_hans: 不能将文件“{0}”放置在解决方案资源管理器的“{1}”上方。\n\n{2}。
zh_hant: 檔案 '{0}' 不能放在方案總管中的 '{1}' 之上。\n\n{2}。

# FileCannotBePlacedBodyBelow
source: The file '{0}' cannot be placed below '{1}' in the Solution Explorer.\n\n{2}.
cs: Soubor {0} nemůže být umístěn pod {1} v Průzkumníkovi řešení.\n\n{2}.
de: Die Datei "{0}" kann im Projektmappen-Explorer nicht unter "{1}" platziert werden.\n\n{2}.
es: El archivo "{0}" no se puede colocar debajo de "{1}" en el Explorador de soluciones.\n\n{2}.
fr: Impossible de placer le fichier '{0}' en dessous de '{1}' dans l'Explorateur de solutions.\n\n{2}.
it: Non è possibile inserire il file '{0}' sotto '{1}' in Esplora soluzioni.\n\n{2}.
ja: ファイル '{0}' をソリューション エクスプローラー内の '{1}' の下に配置することはできません。\n\n{2}。
ko: {0}' 파일을 솔루션 탐색기에서 '{1}' 아래에 배치할 수 없습니다.\n\n{2}.
pl: Nie można umieścić pliku „{0}” poniżej elementu „{1}” w Eksploratorze rozwiązań.\n\n{2}.
pt_br: O arquivo '{0}' não pode ser colocado abaixo do '{1}' no Gerenciador de Soluções.\n\n{2}.
ru: Файл "{0}" невозможно расположить ниже "{1}" в обозревателе решений.\n\n{2}.
tr: {0}' dosyası Çözüm Gezgini'ndeki '{1}' altına yerleştirilemez.\n\n{2}.
zh_hans: 不能将文件“{0}”放置在解决方案资源管理器的“{1}”下方。\n\n{2}。
zh_hant: 檔案 '{0}' 不能放在方案總管中的 '{1}' 之下。\n\n{2}。

# FileCannotBePlacedDifferentSubtree
source: The file is in a different subtree
cs: Soubor je v jiném podstromu.
de: Die Datei befindet sich in einem anderen Unterbaum.
es: El archivo está en un subárbol distinto.
fr: Le fichier se trouve dans une autre sous-arborescence
it: Il file si trova in un sottoalbero diverso
ja: ファイルは別のサブツリー内にあります
ko: 파일이 다른 하위 트리에 있습니다.
pl: Ten plik znajduje się w innym poddrzewie
pt_br: O arquivo está em uma subárvore diferente
ru: Этот файл находится в другом поддереве
tr: Dosya farklı bir alt ağaçta
zh_hans: 该文件位于不同的子树中
zh_hant: 檔案位於不同的樹狀子目錄

# FileCannotBePlacedMultipleFiles
source: The '{0}' folder cannot be moved as it already exists in the Solution Explorer in a different location
cs: Složku {0} nejde přesunout, protože už existuje v Průzkumníkovi řešení v jiném umístění.
de: Der Ordner "{0}" kann nicht verschoben werden. Er ist im Projektmappen-Explorer bereits an einer anderen Stelle vorhanden.
es: La carpeta "{0}" no se puede mover porque ya existe en el Explorador de soluciones en una ubicación distinta
fr: Impossible de déplacer le dossier '{0}', car il existe déjà dans l'Explorateur de solutions à un autre emplacement
it: Non è possibile spostare la cartella '{0}' perché esiste già in una posizione diversa in Esplora soluzioni
ja: '{0}' フォルダーは、ソリューション エクスプローラーの別の場所に既に存在しているため移動できません
ko: 솔루션 탐색기의 다른 위치에 이미 존재하므로 '{0}' 폴더를 이동할 수 없습니다.
pl: Nie można przenieść folderu „{0}”, ponieważ istnieje on już w innej lokalizacji w Eksploratorze rozwiązań
pt_br: A pasta '{0}' não pode ser movida pois já existe no Gerenciador de Soluções em um local diferente
ru: Папку "{0}" невозможно переместить, так как она уже существует в обозревателе решений с другим расположением
tr: '{0}' klasörü, Çözüm Gezgini'nde zaten farklı bir konumda mevcut olduğundan taşınamıyor
zh_hans: 无法移动“{0}”文件夹，因为它已存在于解决方案资源管理器的其他位置中
zh_hant: 因為 '{0}' 資料夾已存在於方案總管中的其他位置，所以無法予以移動

# GeneralCaption
source: General
cs: Obecné
de: Allgemein
fr: Général
it: Generale
ja: 全般
ko: 일반
pl: Ogólne
pt_br: Geral
ru: Общее
tr: Genel
zh_hans: 常规
zh_hant: 一般

source: General
cs: Obecné
de: Allgemein
fr: Général
it: Generale
ja: 全般
ko: 일반
pl: Ogólne
pt_br: Geral
ru: Общее
tr: Genel
zh_hans: 常规
zh_hant: 一般

source: Tutorial (.NET Framework)
cs: Kurz (.NET Framework)
fr: Tutoriel (.NET Framework)
it: Esercitazione (.NET Framework)
ja: チュートリアル (.NET Framework)
ko: 자습서(.NET Framework)
pl: Samouczek (.NET Framework)
ru: Учебник (.NET Framework)
tr: Öğretici (.NET Framework)
zh_hans: 教程(.NET Framework)
zh_hant: 教學課程 (.NET Framework)

source: Windows
pl: System Windows
