Repository: dotnet/fsharp
Catalog: vsintegration/src/FSharp.ProjectSystem.PropertyPages/PropertyPages/xlf/BuildEventsPropPage.*.xlf
Languages: cs, es, ja, ko, pt_br, zh_hans, zh_hant

# lblPreBuildEventCommandLine.Text
source: P&re-build event command line:
cs: Příkazový řádek události &před sestavením:
es: Lí&nea de comandos del evento anterior a la compilación:
ja: ビルド前イベントのコマンド ライン(&R):
ko: 빌드 이벤트 명령줄 대화 상자(&R):
pt_br: &Linha de comando do evento de pré-compilação:
zh_hans: 生成前事件命令行(&R):
zh_hant: 建置前事件命令列(&R):

# txtPreBuildEventCommandLine.AccessibleName
source: Pre-build event command line
cs: Příkazový řádek události před sestavením
es: Línea de comandos del evento anterior a la compilación
ja: ビルド前に実行するコマンド ライン
ko: 빌드 전 이벤트 명령줄
pt_br: Linha de comando do evento de pré-compilação
zh_hans: 生成前事件命令行
zh_hant: 建置前事件命令列

# btnPreBuildBuilder.AccessibleName
source: Edit Pre-build ...
cs: Editovat před sestavením ...
es: Edición anterior a la compilación...
ja: ビルド前の編集...
ko: 빌드 전 편집...
pt_br: Editar antes da compilação ...
zh_hans: 编辑预先生成事件...
zh_hant: 建置前進行編輯...

# btnPreBuildBuilder.Text
source: Ed&it Pre-build ...
cs: Ed&itovat před sestavením ...
es: &Edición anterior a la compilación...
ja: ビルド前の編集(&I)...
ko: 빌드 전 편집(&I)...
pt_br: Ed&itar antes da compilação ...
zh_hans: 编辑预先生成事件(&I)...
zh_hant: 建置前進行編輯(&I)...

# lblPostBuildEventCommandLine.Text
source: P&ost-build event command line:
cs: Příkazový řádek události p&o sestavení:
es: &Línea de comandos del evento posterior a la compilación:
ja: ビルド後イベントのコマンド ライン(&O):
ko: 빌드 후 이벤트 명령줄(&O):
pt_br: &Linha de comando do evento de pós-compilação:
zh_hans: 生成后事件命令行(&O):
zh_hant: 建置後事件命令列(&O):

# txtPostBuildEventCommandLine.AccessibleName
source: Post-build event command line
cs: Příkazový řádek události po sestavení
es: Línea de comandos del evento posterior a la compilación
ja: ビルド後に実行するコマンド ライン
ko: 빌드 후 이벤트 명령줄
pt_br: Linha de comando do evento de pós-compilação
zh_hans: 生成后事件命令行
zh_hant: 建置後事件命令列

# btnPostBuildBuilder.AccessibleName
source: Edit Post-build ...
cs: Editovat po sestavení ...
es: Edición posterior a la compilación...
ja: ビルド後の編集...
ko: 빌드 후 편집...
pt_br: Editar pós-compilação ...
zh_hans: 编辑后期生成事件...
zh_hant: 建置後進行編輯...

# btnPostBuildBuilder.Text
source: Edit Post-b&uild ...
cs: Editovat p&o sestavení ...
es: E&dición posterior a la compilación...
ja: ビルド後の編集(&U)...
ko: 빌드 후 편집(&U)...
pt_br: Editar &pós-compilação ...
zh_hans: 编辑后期生成事件(&U)...
zh_hant: 建置後進行編輯(&U)...

# lblRunPostBuildEvent.Text
source: Ru&n the post-build event:
cs: Spustit událost po sestave&ní:
es: Eje&cutar el evento posterior a la compilación:
ja: ビルド後イベントの実行(&N):
ko: 빌드 후 이벤트 실행(&N):
pt_br: Executar o eve&nto pós-build:
zh_hans: 运行生成后事件(&N):
zh_hant: 執行建置後事件(&N):

# cboRunPostBuildEvent.Items
source: Always
cs: Vždy
es: Siempre
ja: 常に行う
ko: 항상
pt_br: Sempre
zh_hans: 始终
zh_hant: 永遠

# cboRunPostBuildEvent.Items1
source: On successful build
cs: Při úspěšném sestavení
es: Si la compilación es correcta
ja: ビルドが成功したとき
ko: 빌드가 성공한 경우
pt_br: Em caso de build bem-sucedido
zh_hans: 成功生成时
zh_hant: 建置成功時

# cboRunPostBuildEvent.Items2
source: When the build updates the project output
cs: Když sestavení aktualizuje výstup projektu
es: Cuando la compilación actualiza los resultados del proyecto
ja: ビルドがプロジェクト出力を更新したとき
ko: 빌드에서 프로젝트 출력을 업데이트한 경우
pt_br: Quando a compilação atualizar a saída do projeto
zh_hans: 生成更新项目输出时
zh_hant: 當組建更新專案輸出時
