Repository: dotnet/fsharp
Catalog: src/fsharp/FSharp.DependencyManager.Nuget/xlf/FSDependencyManager.txt.*.xlf
Languages: ja, pl, ru, zh_hans, zh_hant

# cantReferenceSystemPackage
source: PackageManager can not reference the System Package '{0}'
ja: PackageManager がシステム パッケージ '{0}' を参照できません
pl: Program PacketManager nie może odwoływać się do pakietu systemowego „{0}”
ru: PackageManager не может ссылаться на системный пакет "{0}"
zh_hans: PackageManager 无法引用系统包“{0}”
zh_hant: PackageManager 無法參考系統套件 '{0}'

# highestVersion
source: with the highest version
ja: 最新バージョン
pl: z najwyższą wersją
ru: с наивысшей версией
zh_hans: 具有最高版本
zh_hant: 具有最高版本

# invalidTimeoutValue
source: Invalid value for timeout '{0}', valid values: none, -1 and integer milliseconds to wait
ja: タイムアウト '{0}' の値が無効です。有効な値: なし、-1、および整数 (待機するミリ秒)
pl: Nieprawidłowa wartość limitu czasu „{0}”; prawidłowe wartości: none, -1 i liczba całkowita określająca liczbę milisekund oczekiwania
ru: Недопустимое значение времени ожидания "{0}". Допустимые значения: none, –1 и integer, мс ожидания.
zh_hans: 超时 "{0}" 的值无效，有效值: none、-1 和要等待的毫秒数(整数)
zh_hant: 逾時 '{0}' 值無效，有效的值: 無、-1 和要等候的整數毫秒

source: Load Nuget Package
ja: NuGet パッケージの読み込み
pl: Załaduj pakiet NuGet
ru: Загрузить пакет NuGet
zh_hans: 加载 Nuget 包
zh_hant: 載入 Nuget 套件

# missingTimeoutValue
source: Missing value for timeout
ja: タイムアウトの値がありません
pl: Brak wartości limitu czasu
ru: Отсутствует значение времени ожидания
zh_hans: 缺少超时值
zh_hant: 遺漏逾時值

source: Not used
ja: 未使用
pl: Nieużywane
ru: Не используется
zh_hans: 未使用
zh_hant: 未使用

# requiresAValue
source: {0} requires a value
ja: {0} には値が必要です
pl: Element {0} wymaga wartości.
ru: {0} требует значение.
zh_hans: {0} 需要一个值
zh_hant: {0} 需要值

# sourceDirectoryDoesntExist
source: The source directory '{0}' not found
ja: ソース ディレクトリ '{0}' が見つかりません
pl: Nie znaleziono katalogu źródłowego „{0}”
ru: Исходный каталог "{0}" не найден
zh_hans: 找不到源目录“{0}”
zh_hant: 找不到來源目錄 '{0}'

# timedoutResolvingPackages
source: Timed out resolving packages, process: '{0}' '{1}'
ja: パッケージの解決中にタイムアウトになりました。プロセス: '{0}' '{1}'
pl: Przekroczono limit czasu podczas rozpoznawania pakietów, proces: „{0}” „{1}”
ru: Истекло время ожидания при разрешении пакетов. Процесс: "{0}" "{1}".
zh_hans: 解析包超时，进程: "{0}" "{1}"
zh_hant: 解析套件時發生逾時，處理序: '{0}' '{1}'

# unableToApplyImplicitArgument
source: Unable to apply implicit argument number {0}
ja: 暗黙的な引数番号 {0} を適用できません
pl: Nie można zastosować niejawnego argumentu o numerze {0}
ru: Не удалось применить неявный аргумент с номером {0}
zh_hans: 无法应用隐式参数号 {0}
zh_hant: 無法套用隱含引數號碼 {0}

source: version
ja: バージョン
pl: wersja
ru: версия
zh_hans: 版本
zh_hant: 版本
